pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// bl602_demo_at_text_0004.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

// 23040374: void mod_sub_del_all(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s3, Register word32 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE4, Stack word32 dwArgF8, Stack word32 dwArg0128, Stack word32 dwArg0168)
void mod_sub_del_all(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s3, word32 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgE4, word32 dwArgF8, word32 dwArg0128, word32 dwArg0168)
{
	Eq_2 a1_25;
	word32 a4_315;
	word32 a2_314;
	word32 a5_316;
	Eq_2 a0_24 = net_buf_simple_pull_le16(a5, out a1_25, out a2_314, out a4_315, out a5_316);
	Eq_2 s2_111 = a0;
	byte bLoc21_237 = SLICE(s4, byte, 24);
	word24 nLoc24_257 = (word24) s4;
	Eq_2 s3_112 = a1;
	Eq_2 s0_107 = a2;
	if ((int32) (word16) a0_24 <= 0x00)
	{
		word32 s1_321;
		word32 a0_322;
		word32 a1_323;
		word32 a2_324;
		word32 a3_325;
		word32 a4_326;
		word32 a5_327;
		word32 a7_328;
		word32 s2_329;
		word32 s3_330;
		word32 s4_331;
		word32 s5_332;
		word32 s6_333;
		word32 s7_334;
		word32 s8_335;
		word32 s9_336;
		word32 s10_337;
		word32 s11_338;
		word32 t4_339;
		printf(ra, &g_t230B8560, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_321, out a0_322, out a1_323, out a2_324, out a3_325, out a4_326, out a5_327, out a7_328, out s2_329, out s3_330, out s4_331, out s5_332, out s6_333, out s7_334, out s8_335, out s9_336, out s10_337, out s11_338, out t4_339);
	}
	else
	{
		Eq_2 a2_123;
		Eq_2 s4_113 = *a2;
		Eq_2 s1_108 = a0_24;
		word32 a1_317;
		word32 a3_318;
		word32 a4_319;
		word32 a5_320;
		Eq_2 a0_33 = bt_mesh_elem_find(a0_24, a1_25, out a1_317, out a3_318, out a4_319, out a5_320);
		if (a0_33 == 0x00)
		{
			a2_123.u0 = 0x01;
			bLoc21_237 = (byte) (word32) ((word32) *((word32) a2 + 4) < ~0x04);
		}
		else
		{
			Eq_2 a0_47;
			Eq_2 a3_50;
			Eq_2 a4_51;
			Eq_2 s8_59;
			get_model(a0_33, a2, fp + -33, out s1_108, out a0_47, out a3_50, out a4_51, out s2_111, out s4_113, out s8_59);
			s0_107 = a0_47;
			a2_123.u0 = 0x02;
			if (a0_47 != 0x00)
			{
				Eq_2 a3_71;
				word32 s0_75;
				Eq_2 s5_82;
				Eq_2 s6_83;
				word32 s1_340;
				word32 s2_341;
				word32 s3_342;
				word32 s4_343;
				word32 s7_344;
				word32 s9_345;
				word32 s11_346;
				word32 a3_347;
				word32 s5_348;
				word32 s8_349;
				ra = mod_sub_list_clear(bt_mesh_lpn_group_del(ra, s1_108, (word32) a0_47 + 16, 0x02, a3_50, a4_51, s2_111, s6, s8_59, s9, mstatus, dwLoc2C, dwLoc28, dwLoc18, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArg0168, out s0_75, out s1_340, out a3_71, out s2_341, out s3_342, out s4_343, out s5_82, out s6_83, out s7_344, out s9_345, out s11_346, out mstatus), s0_75, a3_71, s5_82, s6_83, dwArg00, dwArg04, dwArg10, dwArg14, dwArg38, dwArg4C, s3, dwArgF8, out s0_107, out s1_108, out a3_347, out s2_111, out s3_112, out s4_113, out s5_348, out s6, out s7, out s8_349, out s9, out s11);
				a2_123.u0 = 0x00;
			}
		}
		send_mod_sub_status(ra, s0_107, s1_108, s3_112, a2_123, s1_108, (word32) bLoc21_237, s2_111, s4_113, s6, s7, s9, s11, mstatus, dwLoc28, SEQ(bLoc21_237, nLoc24_257), dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg34, dwArg38, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgE4);
	}
	0x00 = dwArg0128;
}

// 23040406: void mod_sub_va_overwrite(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD4, Stack word32 dwArgE8, Stack word32 dwArg0158)
void mod_sub_va_overwrite(Eq_2 ra, word32 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgD4, word32 dwArgE8, word32 dwArg0158)
{
	word32 a5_395;
	word32 a4_394;
	word32 a2_393;
	word32 a1_392;
	Eq_2 a0_27 = net_buf_simple_pull_le16(a5, out a1_392, out a2_393, out a4_394, out a5_395);
	Eq_2 s2_145 = a0;
	byte bLoc23_314 = SLICE(s0, byte, 8);
	Eq_2 s3_146 = a1;
	Eq_2 s0_118 = a2;
	if ((int32) (word16) a0_27 <= 0x00)
	{
		word32 s1_402;
		word32 a0_403;
		word32 a1_404;
		word32 a2_405;
		word32 a3_406;
		word32 a4_407;
		word32 a5_408;
		word32 a7_409;
		word32 s2_410;
		word32 s3_411;
		word32 s4_412;
		word32 s5_413;
		word32 s6_414;
		word32 s7_415;
		word32 s8_416;
		word32 s9_417;
		word32 s10_418;
		word32 s11_419;
		word32 t4_420;
		printf(ra, &g_t230B8560, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_402, out a0_403, out a1_404, out a2_405, out a3_406, out a4_407, out a5_408, out a7_409, out s2_410, out s3_411, out s4_412, out s5_413, out s6_414, out s7_415, out s8_416, out s9_417, out s10_418, out s11_419, out t4_420);
	}
	else
	{
		Eq_2 a2_157;
		Eq_2 a1_38;
		word32 a5_397;
		word32 a4_396;
		net_buf_simple_pull_mem(a2, 0x10, out a1_38, out a4_396, out a5_397);
		Eq_2 s4_147 = *a2;
		Eq_2 s1_144 = a0_27;
		word32 a5_401;
		word32 a4_400;
		word32 a3_399;
		word32 a1_398;
		Eq_2 a0_44 = bt_mesh_elem_find(a0_27, a1_38, out a1_398, out a3_399, out a4_400, out a5_401);
		if (a0_44 == 0x00)
		{
			a2_157.u0 = 0x01;
			bLoc23_314 = (byte) (word32) ((word32) *((word32) a2 + 4) < ~0x04);
		}
		else
		{
			Eq_2 a0_58;
			Eq_2 a3_61;
			Eq_2 a4_62;
			Eq_2 s8_70;
			get_model(a0_44, a2, fp + -35, out s1_144, out a0_58, out a3_61, out a4_62, out s2_145, out s4_147, out s8_70);
			s0_118 = a0_58;
			a2_157.u0 = 0x02;
			if (a0_58 != 0x00)
			{
				Eq_2 a3_82;
				word32 s0_86;
				Eq_2 s5_93;
				Eq_2 s6_94;
				Eq_2 s5_125;
				word32 s1_421;
				word32 s2_422;
				word32 s3_423;
				word32 s4_424;
				word32 s7_425;
				word32 s9_426;
				word32 s11_427;
				word32 s1_428;
				word32 a3_429;
				word32 s2_430;
				word32 s3_431;
				word32 s4_432;
				word32 s8_433;
				ra = mod_sub_list_clear(bt_mesh_lpn_group_del(ra, s1_144, (word32) a0_58 + 16, 0x02, a3_61, a4_62, s2_145, s6, s8_70, s9, mstatus, dwLoc3C, dwLoc38, s2, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArg0158, out s0_86, out s1_421, out a3_82, out s2_422, out s3_423, out s4_424, out s5_93, out s6_94, out s7_425, out s9_426, out s11_427, out mstatus), s0_86, a3_82, s5_93, s6_94, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg28, dwArg3C, dwArg4C, dwArgE8, out s0_118, out s1_428, out a3_429, out s2_430, out s3_431, out s4_432, out s5_125, out s6, out s7, out s8_433, out s9, out s11);
				Eq_2 a0_136;
				Eq_2 a3_139;
				Eq_2 s8_149;
				word32 s5_434;
				s1_144 = va_add(ra, s5_125, fp + -0x0022, dwLoc08, out a0_136, out a3_139, out s2_145, out s3_146, out s4_147, out s5_434, out s8_149);
				a2_157 = a0_136;
				if (a0_136 == 0x00)
				{
					*((word32) s0_118 + 16) = 0x00;
					ra = bt_mesh_lpn_group_add(ra, s1_144, 0x00, a3_139, s2_145, s4_147, s6, s8_149, s9, mstatus, dwLoc3C, dwLoc38, s2, dwArg08, dwArg18, dwArg20, dwArg24, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, out s0_118, out s1_144, out s2_145, out s3_146, out s4_147, out s6, out s7, out s9, out s11, out mstatus);
					a2_157 = a0_136;
				}
			}
		}
		send_mod_sub_status(ra, s0_118, s1_144, s3_146, a2_157, s1_144, (word32) bLoc23_314, s2_145, s4_147, s6, s7, s9, s11, mstatus, dwLoc38, dwLoc34, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg48, s1, dwArg68, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgD4);
	}
}

