pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 230404CA: void mod_sub_overwrite(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s3, Register word32 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE4, Stack word32 dwArgF8, Stack word32 dwArg0128, Stack word32 dwArg0168)
void mod_sub_overwrite(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s3, word32 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgE4, word32 dwArgF8, word32 dwArg0128, word32 dwArg0168)
{
	word32 a5_371;
	word32 a4_370;
	word32 a2_369;
	word32 a1_368;
	Eq_2 a0_26 = net_buf_simple_pull_le16(a5, out a1_368, out a2_369, out a4_370, out a5_371);
	byte bLoc21_292 = SLICE(s4, byte, 24);
	word24 nLoc24_311 = (word24) s4;
	Eq_2 s4_149 = a1;
	Eq_2 s0_156 = a2;
	Eq_2 a5_32 = (int32) (word16) a0_26;
	if (a5_32 <= 0x00)
	{
		word32 s1_379;
		word32 a0_380;
		word32 a1_381;
		word32 a2_382;
		word32 a3_383;
		word32 a4_384;
		word32 a5_385;
		word32 a7_386;
		word32 s2_387;
		word32 s3_388;
		word32 s4_389;
		word32 s5_390;
		word32 s6_391;
		word32 s7_392;
		word32 s8_393;
		word32 s9_394;
		word32 s10_395;
		word32 s11_396;
		word32 t4_397;
		printf(ra, &g_t230B8560, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_379, out a0_380, out a1_381, out a2_382, out a3_383, out a4_384, out a5_385, out a7_386, out s2_387, out s3_388, out s4_389, out s5_390, out s6_391, out s7_392, out s8_393, out s9_394, out s10_395, out s11_396, out t4_397);
	}
	else
	{
		Eq_2 a2_171;
		Eq_2 a1_36;
		word32 a2_372;
		word32 a4_373;
		word32 a5_374;
		Eq_2 s1_148 = net_buf_simple_pull_le16(a5_32, out a1_36, out a2_372, out a4_373, out a5_374);
		Eq_2 s2_159 = a0_26;
		word32 a1_375;
		word32 a3_376;
		word32 a4_377;
		word32 a5_378;
		Eq_2 a0_43 = bt_mesh_elem_find(a0_26, a1_36, out a1_375, out a3_376, out a4_377, out a5_378);
		if (a0_43 == 0x00)
		{
			a2_171.u0 = 0x01;
			bLoc21_292 = (byte) (word32) ((word32) *((word32) a2 + 4) < ~0x04);
		}
		else
		{
			Eq_2 a0_57;
			Eq_2 a3_60;
			Eq_2 s8_69;
			word32 a4_398;
			get_model(a0_43, a2, fp + -33, out s1_148, out a0_57, out a3_60, out a4_398, out s2_159, out s4_149, out s8_69);
			s0_156 = a0_57;
			a2_171.u0 = 0x02;
			if (a0_57 != 0x00)
			{
				a2_171.u0 = 0x01;
				if ((word32) (word16) ((word32) s1_148 + 0x04000000) <= 0x03FFFF00)
				{
					Eq_2 a3_88;
					word32 s0_92;
					Eq_2 s5_99;
					Eq_2 s6_100;
					ptr32 mstatus_106;
					Eq_2 a3_118;
					struct Eq_213162 * s0_124;
					Eq_2 s1_125;
					Eq_2 s2_128;
					Eq_2 s4_130;
					Eq_2 s6_132;
					Eq_2 s8_134;
					Eq_2 s9_135;
					word32 s1_399;
					word32 s2_400;
					word32 s3_401;
					word32 s4_402;
					word32 s7_403;
					word32 s9_404;
					word32 s11_405;
					word32 s3_406;
					word32 s5_407;
					word32 s7_408;
					word32 s11_409;
					Eq_2 ra_123 = mod_sub_list_clear(bt_mesh_lpn_group_del(ra, s1_148, (word32) a0_57 + 16, 0x02, a3_60, 0x03FFFF00, s2_159, s6, s8_69, s9, mstatus, dwLoc2C, dwLoc28, dwLoc18, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArg0168, out s0_92, out s1_399, out a3_88, out s2_400, out s3_401, out s4_402, out s5_99, out s6_100, out s7_403, out s9_404, out s11_405, out mstatus_106), s0_92, a3_88, s5_99, s6_100, dwArg00, dwArg04, dwArg10, dwArg14, dwArg38, dwArg4C, s3, dwArgF8, out s0_124, out s1_125, out a3_118, out s2_128, out s3_406, out s4_130, out s5_407, out s6_132, out s7_408, out s8_134, out s9_135, out s11_409);
					s0_124->w0010 = (word16) s1_125;
					word32 s3_410;
					ra = bt_mesh_lpn_group_add(ra_123, s1_125, s1_125, a3_118, s2_128, s4_130, s6_132, s8_134, s9_135, mstatus_106, dwLoc2C, dwLoc28, dwLoc18, dwArg18, dwArg28, dwArg30, dwArg34, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, out s0_156, out s1_148, out s2_159, out s3_410, out s4_149, out s6, out s7, out s9, out s11, out mstatus);
					a2_171.u0 = 0x00;
				}
			}
		}
		send_mod_sub_status(ra, s0_156, s1_148, s4_149, a2_171, s2_159, (word32) bLoc21_292, s2_159, s4_149, s6, s7, s9, s11, mstatus, dwLoc28, SEQ(bLoc21_292, nLoc24_311), dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg34, dwArg38, dwArg48, dwArg4C, s5, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgE4);
	}
	0x00 = dwArg0128;
}

// 23040588: void mod_reset(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack word32 dwArg0128)
void mod_reset(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 s5, Eq_2 s6, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, word32 dwArg0128)
{
	word32 s0_42;
	word32 s1_43;
	word32 a3_44;
	word32 s2_45;
	word32 s3_46;
	word32 s4_47;
	word32 s5_48;
	word32 s6_49;
	word32 s7_50;
	word32 s8_51;
	word32 s9_52;
	word32 s11_53;
	mod_sub_list_clear(ra, a0, a3, s5, s6, dwArg30, dwArg34, dwArg40, dwArg44, dwArg68, dwArg7C, dwArg8C, dwArg0128, out s0_42, out s1_43, out a3_44, out s2_45, out s3_46, out s4_47, out s5_48, out s6_49, out s7_50, out s8_51, out s9_52, out s11_53);
}

