pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304058C: Register Eq_2 bt_mesh_cfg_get()
// Called from:
//      clear_friendship
//      ctl_recv
//      bt_mesh_heartbeat_send
Eq_2 bt_mesh_cfg_get()
{
	return g_t4200F42C;
}

// 23040596: Register Eq_2 bt_mesh_subnet_del(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      net_key_del
//      bt_mesh_cfg_reset
Eq_2 bt_mesh_subnet_del(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 s0_100 = a0;
	Eq_2 a0_9 = g_t4200F42C;
	if (a0_9 != 0x00)
	{
		Eq_2 a4_18 = (word32) *((word32) a0_9 + 56);
		if (a4_18 == (word32) (*((word32) a0 + 28)))
		{
			((word32) a0_9 + 48)->u0 = 0x00;
			((word32) a0_9 + 52)->u0 = 0x00;
			word32 s6_301;
			word32 s8_302;
			word32 s3_298;
			word32 s4_299;
			word32 s5_300;
			word32 a4_295;
			word32 a5_296;
			word32 s2_297;
			word32 a1_292;
			word32 a2_293;
			word32 a3_294;
			word32 a0_291;
			k_delayed_work_cancel((word32) a0_9 + 0x0C, a3, a4_18, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_291, out a1_292, out a2_293, out a3_294, out a4_295, out a5_296, out s2_297, out s3_298, out s4_299, out s5_300, out s6_301, out s8_302);
		}
	}
	Eq_2 ra_116;
	Eq_2 a4_52 = (word32) *((word32) a0 + 28);
	struct Eq_213325 * s1_53 = &g_t4200D6BC;
	ra_116 = ra;
	if ((word32) g_w4200D870 == a4_52)
	{
		word32 s2_304;
		word32 s4_305;
		word32 s6_306;
		word32 a5_303;
		ra_116 = bt_mesh_app_key_del(ra, a4_52, dwArgF8, out s0_100, out s1_53, out a5_303, out s2_304, out s4_305, out s6_306, out s7);
	}
	Eq_2 a4_83 = (word32) s1_53->w01DC;
	if (a4_83 == (word32) (*((word32) s0_100 + 28)))
	{
		word32 s4_319;
		word32 s6_320;
		word32 s1_316;
		word32 a5_317;
		word32 s2_318;
		ra_116 = bt_mesh_app_key_del(ra_116, a4_83, dwArgF8, out s0_100, out s1_316, out a5_317, out s2_318, out s4_319, out s6_320, out s7);
	}
	ptr32 s1_125;
	ptr32 mstatus_131;
	ptr32 s2_133;
	ptr32 s4_135;
	ptr32 s6_137;
	ptr32 a3_151;
	ptr32 a4_152;
	word32 a1_313;
	word32 a2_314;
	word32 a5_315;
	word32 s8_310;
	word32 t1_311;
	word32 a0_312;
	word32 a3_307;
	word32 s3_308;
	word32 s5_309;
	Eq_2 ra_154 = memset(bt_mesh_friend_clear_net_idx(ra_116, s0_100, (word32) *((word32) s0_100 + 28), mstatus, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, ra, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s1_125, out a3_307, out s2_133, out s3_308, out s4_135, out s5_309, out s6_137, out s8_310, out mstatus_131), s0_100, 0x00, 228, out t1_311, out a0_312, out a1_313, out a2_314, out a3_151, out a4_152, out a5_315);
	((word32) s0_100 + 28)->u2 = ~0x00;
	0x00 = (int8) dwArg38;
	s1Out = s1_125;
	a3Out = a3_151;
	a4Out = a4_152;
	s2Out = s2_133;
	s4Out = s4_135;
	s6Out = s6_137;
	s7Out = s7;
	mstatusOut = mstatus_131;
	return ra_154;
}

// 2304062E: void net_key_del(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0114, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void net_key_del(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a5, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0114, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	Eq_2 s2_46 = a0;
	Eq_2 s1_17 = a1;
	word32 a1_241;
	word32 a2_242;
	word32 a4_243;
	word32 a5_244;
	Eq_2 a0_19 = net_buf_simple_pull_le16(a5, out a1_241, out a2_242, out a4_243, out a5_244);
	if (a0_19 < 0x01000000)
	{
		word32 a3_245;
		word32 a4_246;
		word32 a5_247;
		Eq_2 a0_26 = bt_mesh_subnet_get(a0_19, out a3_245, out a4_246, out a5_247);
		Eq_2 a3_30 = 0x00;
		if (a0_26 != 0x00)
		{
			a3_30.u0 = 0x0C;
			if ((word32) *a1 != a0_19)
			{
				word32 a3_267;
				word32 a4_268;
				ra = bt_mesh_subnet_del(ra, a0_26, 0x0C, mstatus, s0, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s1_17, out a3_267, out a4_268, out s2_46, out s4, out s6, out s7, out mstatus);
				a3_30.u0 = 0x00;
			}
		}
		0x00 = (int8) dwArg38;
		send_net_key_status(ra, s0, s1_17, dwArg10, a3_30, s2_46, s4, s6, s7, s9, s11, mstatus, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg48, dwArg64, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114);
	}
	else
	{
		0x00 = (int8) dwArg38;
		word32 s1_248;
		word32 a0_249;
		word32 a1_250;
		word32 a2_251;
		word32 a3_252;
		word32 a4_253;
		word32 a5_254;
		word32 a7_255;
		word32 s2_256;
		word32 s3_257;
		word32 s4_258;
		word32 s5_259;
		word32 s6_260;
		word32 s7_261;
		word32 s8_262;
		word32 s9_263;
		word32 s10_264;
		word32 s11_265;
		word32 t4_266;
		printf(ra, &g_t230B83E8, a3, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_248, out a0_249, out a1_250, out a2_251, out a3_252, out a4_253, out a5_254, out a7_255, out s2_256, out s3_257, out s4_258, out s5_259, out s6_260, out s7_261, out s8_262, out s9_263, out s10_264, out s11_265, out t4_266);
	}
}

// 23040690: Register Eq_2 bt_mesh_cfg_reset(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      bt_mesh_reset
Eq_2 bt_mesh_cfg_reset(Eq_2 ra, Eq_2 s0, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, ptr32 & a3Out, ptr32 & a4Out)
{
	Eq_2 s0_7 = g_t4200F42C;
	if (s0_7 == 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		return ra;
	}
	else
	{
		Eq_2 ra_39;
		bt_mesh_set_hb_sub_dst(0x00);
		*(union Eq_2 *) 64 = s0_7;
		((word32) s0_7 + 0x0044)->u0 = 0x00;
		((word32) s0_7 + 72)->u0 = 0x00;
		Eq_2 a3_22 = (word32) g_w4200D8DC;
		ra_39 = ra;
		if (a3_22 != 0x0FFFFFFF)
		{
			word32 s1_250;
			word32 a4_251;
			word32 s2_252;
			word32 s4_253;
			word32 s6_254;
			word32 s7_255;
			ra_39 = bt_mesh_subnet_del(ra, 0x4200D8C0, a3_22, mstatus, s0, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s1_250, out a3_22, out a4_251, out s2_252, out s4_253, out s6_254, out s7_255, out mstatus);
		}
		Eq_2 a4_57 = (word32) g_w4200D9C0;
		if (a4_57 != 0x0FFFFFFF)
		{
			word32 s1_263;
			word32 a3_264;
			word32 s2_265;
			word32 s4_266;
			word32 s6_267;
			word32 s7_268;
			word32 mstatus_269;
			ra_39 = bt_mesh_subnet_del(ra_39, 0x4200D9A4, a3_22, mstatus, s0, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s1_263, out a3_264, out a4_57, out s2_265, out s4_266, out s6_267, out s7_268, out mstatus_269);
		}
		word32 s0_256;
		word32 s1_257;
		word32 a3_258;
		word32 a4_259;
		word32 s2_260;
		word32 s6_261;
		word32 s7_262;
		Eq_2 ra_106 = bt_mesh_model_foreach(ra_39, &g_t23040588, 0x00, a4_57, dwArg0118, out s0_256, out s1_257, out a3_258, out a4_259, out s2_260, out s6_261, out s7_262);
		ptr32 a3_128;
		ptr32 a4_129;
		word32 t1_270;
		word32 a0_271;
		word32 a1_272;
		word32 a2_273;
		word32 a5_274;
		Eq_2 ra_131 = memset(ra_106, 1107379032, 0x00, 0x14, out t1_270, out a0_271, out a1_272, out a2_273, out a3_128, out a4_129, out a5_274);
		a3Out = a3_128;
		a4Out = a4_129;
		return ra_131;
	}
}

// 23040720: void sys_put_be32(Register Eq_213742 a0, Register (ptr32 Eq_213743) a1)
// Called from:
//      bt_mesh_net_obfuscate
//      bt_mesh_net_encrypt
//      bt_mesh_net_decrypt
//      bt_mesh_app_encrypt
//      bt_mesh_app_decrypt
//      bt_mesh_net_beacon_update
void sys_put_be32(Eq_213742 a0, struct Eq_213743 * a1)
{
	a1->b0001 = (byte) (a0 >> 0x10);
	a1->b0000 = (byte) (a0 >> 0x18);
	a1->b0002 = (byte) ((word32) (word16) a0 >> 8);
	a1->b0003 = (byte) a0;
}

// 23040742: Register Eq_2 bt_mesh_ccm_encrypt(Register Eq_2 ra, Register (ptr32 Eq_213769) s1, Register Eq_2 a0, Register Eq_2 a1, Register int32 a6, Register out ptr32 s0Out, Register out (ptr32 Eq_213774) s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_213779) a5Out, Register out (ptr32 Eq_213774) s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      bt_mesh_net_encrypt
//      bt_mesh_app_encrypt
Eq_2 bt_mesh_ccm_encrypt(Eq_2 ra, struct Eq_213769 * s1, Eq_2 a0, Eq_2 a1, int32 a6, ptr32 & s0Out, struct Eq_213774 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_213774 & a5Out, struct Eq_213774 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	word32 a6_933;
	word32 a7_934;
	word32 a4_931;
	word32 a5_932;
	word32 a2_929;
	word32 a1_928;
	word32 a3_930;
	memcpy((char *) fp - 0x008F, a1, 0x0D, out a1_928, out a2_929, out a3_930, out a4_931, out a5_932, out a6_933, out a7_934);
	ptr32 a0_67;
	word32 s10_77;
	Eq_2 s4_78;
	Eq_2 s8_80;
	word32 s6_940;
	word32 s5_939;
	word32 s0_935;
	word32 a3_936;
	word32 a4_937;
	word32 s2_938;
	struct Eq_213774 * s3_152;
	struct Eq_213774 * s1_139;
	ptr32 a1_131;
	struct Eq_213774 * a5_135;
	Eq_2 ra_150 = bt_encrypt_be(ra, a0, out s0_935, out s1_139, out a0_67, out a1_131, out a3_936, out a4_937, out a5_135, out s2_938, out s3_152, out s4_78, out s5_939, out s6_940, out s8_80, out s10_77);
	ptr32 s0_155 = a0_67;
	if (a0_67 == 0x00)
	{
		word32 a2_942;
		word32 a3_943;
		word32 a4_944;
		word32 a5_945;
		word32 a6_946;
		word32 a7_947;
		word32 a1_941;
		memcpy((char *) fp - 0x008F, s8_80, 0x0D, out a1_941, out a2_942, out a3_943, out a4_944, out a5_945, out a6_946, out a7_947);
		ptr32 a0_130;
		word32 a4_950;
		word32 s8_951;
		word32 s0_948;
		word32 a3_949;
		word32 s6_142;
		Eq_2 s10_140;
		word32 s5_153;
		byte * s2_151;
		Eq_2 s4_141;
		ra_150 = bt_encrypt_be(ra_150, s4_78, out s0_948, out s1_139, out a0_130, out a1_131, out a3_949, out a4_950, out a5_135, out s2_151, out s3_152, out s4_141, out s5_153, out s6_142, out s8_951, out s10_140);
		s0_155 = a0_130;
		if (a0_130 == 0x00)
		{
			ptr32 a0_198;
			if (s1_139 == null)
			{
l230407D4:
				struct Eq_213774 * a5_286 = s5_153 + 0x0F >> 4;
				s3_152 &= 0x0F;
				if (s3_152 == null)
					s3_152 = (struct Eq_213774 *) 0x10;
				s1_139 = null;
				s7 = 0x10;
				s11 = 0x01;
				while (a5_286 != s1_139)
				{
					byte s2_443[];
					if (a5_286 != s1_139->a0000 + 1)
					{
						struct Eq_214030 * a5_463 = null;
						do
						{
							Mem477[fp + -144 + a5_463:byte] = SLICE(CONVERT(Mem472[fp + -80 + a5_463:byte], byte, word32) ^ CONVERT(Mem472[s2_151 + a5_463:byte], byte, word32), byte, 0);
							++a5_463;
						} while (a5_463 != (struct Eq_214030 *) 0x10);
						word32 s2_964;
						word32 a4_963;
						word32 a3_962;
						word32 s0_961;
						word32 s6_966;
						word32 s5_965;
						word32 s10_967;
						Eq_2 s4_495;
						Eq_2 s8_497;
						ra_150 = bt_encrypt_be(ra_150, s4_141, out s0_961, out s1_139, out a0_198, out a1_131, out a3_962, out a4_963, out a5_135, out s2_964, out s3_152, out s4_495, out s5_965, out s6_966, out s8_497, out s10_967);
						if (a0_198 != 0x00)
							goto l2304089E;
						word32 a5_972;
						word32 a3_970;
						word32 a4_971;
						word32 a1_968;
						word32 a2_969;
						word32 a6_973;
						word32 a7_974;
						memcpy(fp + -0x008F, s8_497, 0x0D, out a1_968, out a2_969, out a3_970, out a4_971, out a5_972, out a6_973, out a7_974);
						word32 a3_975;
						word32 s8_977;
						word32 a4_976;
						int32 s6_548;
						ra_150 = bt_encrypt_be(ra_150, s4_495, out s0_155, out s1_139, out a0_198, out a1_131, out a3_975, out a4_976, out a5_135, out s2_443, out s3_152, out s4_141, out s5_153, out s6_548, out s8_977, out s10_140);
						if (a0_198 != 0x00)
							goto l2304089E;
						a5_286 = null;
						do
						{
							Mem577[s6_548 + a5_286:byte] = SLICE(CONVERT(Mem570[s2_443 + a5_286:byte], byte, word32) ^ CONVERT(Mem570[(fp + -112) + a5_286:byte], byte, word32), byte, 0);
							++a5_286;
						} while (a5_286 != (struct Eq_213774 *) 0x10);
					}
					else
					{
						struct Eq_213774 * a5_310;
						for (a5_310 = null; a5_310 < s3_152; ++a5_310)
							Mem325[fp + -144 + a5_310:byte] = SLICE(CONVERT(Mem320[fp + -80 + a5_310:byte], byte, word32) ^ CONVERT(Mem320[s2_151 + a5_310:byte], byte, word32), byte, 0);
						struct Eq_213774 * a5_326;
						for (a5_326 = s3_152; a5_326 != (struct Eq_213774 *) 0x10; ++a5_326)
							Mem336[fp + -144 + a5_326:byte] = SLICE(CONVERT(Mem332[fp + -80 + a5_326:byte], byte, word32), byte, 0);
						word32 a4_980;
						word32 s2_981;
						word32 s0_978;
						word32 a3_979;
						word32 s5_982;
						word32 s6_983;
						Eq_2 s4_358;
						Eq_2 s8_360;
						word32 s10_984;
						ra_150 = bt_encrypt_be(ra_150, s4_141, out s0_978, out s1_139, out a0_198, out a1_131, out a3_979, out a4_980, out a5_135, out s2_981, out s3_152, out s4_358, out s5_982, out s6_983, out s8_360, out s10_984);
						if (a0_198 != 0x00)
							goto l2304089E;
						struct Eq_214197 * a5_372 = null;
						do
						{
							Mem386[fp + -96 + a5_372:byte] = SLICE(CONVERT(Mem381[fp + -0x0080 + a5_372:byte], byte, word32) ^ CONVERT(Mem381[(fp + -80) + a5_372:byte], byte, word32), byte, 0);
							++a5_372;
						} while (a5_372 != (struct Eq_214197 *) 0x10);
						word32 a7_991;
						word32 a3_987;
						word32 a4_988;
						word32 a5_989;
						word32 a2_986;
						word32 a1_985;
						word32 a6_990;
						memcpy(fp + -0x008F, s8_360, 0x0D, out a1_985, out a2_986, out a3_987, out a4_988, out a5_989, out a6_990, out a7_991);
						word32 a4_993;
						int32 s6_434;
						word32 a3_992;
						word32 s8_994;
						ra_150 = bt_encrypt_be(ra_150, s4_358, out s0_155, out s1_139, out a0_198, out a1_131, out a3_992, out a4_993, out a5_135, out s2_443, out s3_152, out s4_141, out s5_153, out s6_434, out s8_994, out s10_140);
						if (a0_198 != 0x00)
							goto l2304089E;
						a5_286 = null;
						do
						{
							Mem461[s6_434 + a5_286:byte] = SLICE(CONVERT(Mem454[s2_443 + a5_286:byte], byte, word32) ^ CONVERT(Mem454[(fp + -112) + a5_286:byte], byte, word32), byte, 0);
							a5_286 = (struct Eq_213774 *) (a5_286->a0000 + 1);
						} while (a5_286 < s3_152);
					}
					s2_151 = (byte *) (s2_443 + 16);
				}
				word32 a7_956;
				word32 a2_952;
				word32 a3_953;
				word32 a4_954;
				word32 a6_955;
				memcpy(a6 + s5_153, (char *) fp - 96, s10_140, out a1_131, out a2_952, out a3_953, out a4_954, out a5_135, out a6_955, out a7_956);
			}
			else
			{
				struct Eq_213774 * a3_157 = (struct Eq_213774 *) 0x02;
				a5_135 = (struct Eq_213774 *) (s1_139->a0000 + 2);
				s1_139 = null;
				do
				{
					byte * a4_167 = s1_139 + s6_142;
					if (a5_135 <= (struct Eq_213774 *) 0x10)
					{
						while (a3_157 < a5_135)
						{
							Mem239[fp + -144 + a3_157:byte] = SLICE(CONVERT(Mem233[fp + -80 + a3_157:byte], byte, word32) ^ CONVERT(Mem233[a4_167 + 0x00:byte], byte, word32), byte, 0);
							a3_157 = (struct Eq_213774 *) (a3_157->a0000 + 1);
							++a4_167;
						}
						for (; a5_135 != (struct Eq_213774 *) 0x10; ++a5_135)
							Mem250[fp + -144 + a5_135:byte] = SLICE(CONVERT(Mem246[fp + -80 + a5_135:byte], byte, word32), byte, 0);
						word32 a4_958;
						word32 s8_960;
						word32 a3_957;
						word32 s6_959;
						ra_150 = bt_encrypt_be(ra_150, s4_141, out s0_155, out s1_139, out a0_198, out a1_131, out a3_957, out a4_958, out a5_135, out s2_151, out s3_152, out s4_141, out s5_153, out s6_959, out s8_960, out s10_140);
						if (a0_198 != 0x00)
							break;
						goto l230407D4;
					}
					struct Eq_213774 * a5_171 = a3_157;
					do
					{
						Mem185[fp + -144 + a5_171:byte] = SLICE(CONVERT(Mem179[fp + -80 + a5_171:byte], byte, word32) ^ CONVERT(Mem179[a4_167 + 0x00:byte], byte, word32), byte, 0);
						++a5_171;
						++a4_167;
					} while (a5_171 != (struct Eq_213774 *) 0x10);
					word32 a5_998;
					word32 a3_996;
					word32 a4_997;
					word32 s2_999;
					word32 s5_1000;
					word32 s0_995;
					word32 s10_1002;
					word32 s8_1001;
					ra_150 = bt_encrypt_be(ra_150, s4_141, out s0_995, out s1_139, out a0_198, out a1_131, out a3_996, out a4_997, out a5_998, out s2_999, out s3_152, out s4_141, out s5_1000, out s6_142, out s8_1001, out s10_1002);
					a5_135 = (struct Eq_213774 *) 0x02;
					a3_157 = null;
				} while (a0_198 == 0x00);
l2304089E:
				s7 = 0x10;
				s0_155 = a0_198;
			}
		}
	}
	ptr32 s9_631 = s1->ptr011C;
	ptr32 s5_632 = s1->ptr013C;
	ptr32 a3_634 = s1->ptr017C;
	s0Out = s0_155;
	s1Out = s1_139;
	a0Out = dwLoc18;
	a1Out = a1_131;
	a3Out = a3_634;
	a4Out = dwLoc38;
	a5Out = a5_135;
	s3Out = s3_152;
	s5Out = s5_632;
	s6Out = dwLoc7C;
	s7Out = s7;
	s9Out = s9_631;
	s10Out = dwLoc9C;
	s11Out = s11;
	return ra_150;
}

