pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23040A28: Register Eq_2 bt_mesh_ccm_decrypt(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 (ptr32 Eq_215991)) a2, Register (ptr32 Eq_214334) a3, Stack Eq_2 dwArgA8, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out (ptr32 Eq_214334) a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_214334) s3Out, Register out (ptr32 Eq_214344) s5Out, Register out Eq_2 s6Out, Register out (ptr32 (ptr32 Eq_215991)) s7Out, Register out (ptr32 (ptr32 Eq_215991)) s9Out, Register out Eq_2 s10Out, Register out Eq_214349 s11Out)
// Called from:
//      bt_mesh_net_decrypt
//      bt_mesh_app_decrypt
//      bt_mesh_prov_decrypt
Eq_2 bt_mesh_ccm_decrypt(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_215991 ** a2, struct Eq_214334 * a3, Eq_2 dwArgA8, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, struct Eq_214334 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, struct Eq_214334 & s3Out, struct Eq_214334 & s5Out, union Eq_2 & s6Out, struct Eq_215991 & s7Out, struct Eq_215991 & s9Out, union Eq_2 & s10Out, union Eq_214349 & s11Out)
{
	if (a3 == null)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x15;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		return ra;
	}
	else
	{
		word32 a7_928;
		word32 a3_924;
		word32 a2_923;
		word32 a1_922;
		word32 a6_927;
		word32 a5_926;
		word32 a4_925;
		memcpy((char *) fp - 0x008F, a1, 0x0D, out a1_922, out a2_923, out a3_924, out a4_925, out a5_926, out a6_927, out a7_928);
		word32 a0_68;
		Eq_2 s6_80;
		word32 s8_81;
		word32 a4_929;
		word32 a5_930;
		word32 s2_931;
		word32 s4_932;
		word32 s10_933;
		struct Eq_214334 * s3_152;
		struct Eq_214334 * s5_153;
		Eq_2 s0_138;
		Eq_2 s1_139;
		struct Eq_214334 * a3_133;
		Eq_2 a1_131;
		Eq_2 ra_150 = bt_encrypt_be(ra, a0, out s0_138, out s1_139, out a0_68, out a1_131, out a3_133, out a4_929, out a5_930, out s2_931, out s3_152, out s4_932, out s5_153, out s6_80, out s8_81, out s10_933);
		if (a0_68 == 0x00)
		{
			word32 a5_938;
			word32 a1_934;
			word32 a2_935;
			word32 a4_937;
			word32 a3_936;
			word32 a6_939;
			word32 a7_940;
			memcpy((char *) fp - 0x008F, s6_80, 0x0D, out a1_934, out a2_935, out a3_936, out a4_937, out a5_938, out a6_939, out a7_940);
			word32 a0_130;
			word32 a4_941;
			word32 a5_942;
			word32 s2_943;
			word32 s10_944;
			Eq_2 s8_143;
			word32 s4_141;
			Eq_2 s6_142;
			ra_150 = bt_encrypt_be(ra_150, s0_138, out s0_138, out s1_139, out a0_130, out a1_131, out a3_133, out a4_941, out a5_942, out s2_943, out s3_152, out s4_141, out s5_153, out s6_142, out s8_143, out s10_944);
			if (a0_130 == 0x00)
			{
				if (s3_152 == null)
				{
l23040ABE:
					uint32 a5_284 = s4_141 + 0x0F;
					s1_139 &= 0x0F;
					if (s1_139 == 0x00)
						s1_139.u0 = 0x10;
					struct Eq_214334 * a5_291 = (word32) (word16) (a5_284 >> 4);
					s9 = a2;
					s5_153 = null;
					while (s5_153 < a5_291)
					{
						struct Eq_214334 * s5_311 = s5_153->a0000 + 1;
						uint32 s3_314 = (word32) (word16) s5_311;
						if (a5_291 == s5_311)
						{
							word32 a1_964;
							word32 a2_965;
							word32 a3_966;
							word32 a4_967;
							word32 a5_968;
							word32 a6_969;
							word32 a7_970;
							memcpy(fp + -0x008F, s6_142, 0x0D, out a1_964, out a2_965, out a3_966, out a4_967, out a5_968, out a6_969, out a7_970);
							s11 = s5_311 << 0x08 | s3_314 >> 0x08;
							word32 a0_472;
							Eq_2 s10_482;
							Eq_2 s2_493;
							word32 a4_971;
							word32 a5_972;
							word32 s4_973;
							word32 s6_974;
							word32 s8_975;
							ra_150 = bt_encrypt_be(ra_150, s0_138, out s0_138, out s1_139, out a0_472, out a1_131, out a3_133, out a4_971, out a5_972, out s2_493, out s3_152, out s4_973, out s5_153, out s6_974, out s8_975, out s10_482);
							if (a0_472 != 0x00)
								goto l23040B72;
							Eq_2 a5_497 = 0x00;
							while (true)
							{
								Eq_2 s3_499 = s1_139;
								if (a5_497 >= s1_139)
									break;
								Mem513[fp + -0x00A0 + a5_497:byte] = SLICE(CONVERT(Mem508[s9 + a5_497:byte], byte, word32) ^ CONVERT(Mem508[(fp + -112) + a5_497:byte], byte, word32), byte, 0);
								++a5_497;
							}
							word32 a1_976;
							word32 a2_977;
							word32 a3_978;
							word32 a4_979;
							word32 a5_980;
							word32 a6_981;
							word32 a7_982;
							memcpy(s2_493, fp + -0x00A0, s1_139, out a1_976, out a2_977, out a3_978, out a4_979, out a5_980, out a6_981, out a7_982);
							Eq_2 a5_531 = 0x00;
							do
							{
								Mem545[fp + -144 + a5_531:byte] = SLICE(CONVERT(Mem540[fp + -96 + a5_531:byte], byte, word32) ^ CONVERT(Mem540[(fp + -0x00A0) + a5_531:byte], byte, word32), byte, 0);
								++a5_531;
							} while (a5_531 < s1_139);
							for (; s3_499 != s10_482; ++s3_499)
								Mem556[fp + -144 + s3_499:byte] = SLICE(CONVERT(Mem552[fp + -96 + s3_499:byte], byte, word32), byte, 0);
							word32 a0_567;
							struct Eq_214334 * s10_577;
							word32 a4_983;
							word32 a5_984;
							word32 s2_985;
							ra_150 = bt_encrypt_be(ra_150, s0_138, out s0_138, out s1_139, out a0_567, out a1_131, out a3_133, out a4_983, out a5_984, out s2_985, out s3_152, out s4_141, out s5_153, out s6_142, out s8_143, out s10_577);
							if (a0_567 != 0x00)
								goto l23040B72;
							a5_291 = null;
							do
							{
								Mem606[fp + -80 + a5_291:byte] = SLICE(CONVERT(Mem601[fp + -0x0080 + a5_291:byte], byte, word32) ^ CONVERT(Mem601[(fp + -96) + a5_291:byte], byte, word32), byte, 0);
								++a5_291;
							} while (a5_291 != s10_577);
						}
						else
						{
							word32 a1_952;
							word32 a2_953;
							word32 a3_954;
							word32 a4_955;
							word32 a5_956;
							word32 a6_957;
							word32 a7_958;
							memcpy(fp + -0x008F, s6_142, 0x0D, out a1_952, out a2_953, out a3_954, out a4_955, out a5_956, out a6_957, out a7_958);
							s11 = s5_311 << 0x08 | s3_314 >> 0x08;
							word32 a0_342;
							struct Eq_214334 * s10_352;
							Eq_2 s2_363;
							word32 a4_959;
							word32 a5_960;
							word32 s4_961;
							word32 s6_962;
							word32 s8_963;
							ra_150 = bt_encrypt_be(ra_150, s0_138, out s0_138, out s1_139, out a0_342, out a1_131, out a3_133, out a4_959, out a5_960, out s2_363, out s3_152, out s4_961, out s5_153, out s6_962, out s8_963, out s10_352);
							if (a0_342 != 0x00)
								goto l23040B72;
							struct Eq_214334 * a5_367 = null;
							do
							{
								Mem381[fp + -0x00A0 + a5_367:byte] = SLICE(CONVERT(Mem376[s9 + a5_367:byte], byte, word32) ^ CONVERT(Mem376[(fp + -112) + a5_367:byte], byte, word32), byte, 0);
								++a5_367;
							} while (a5_367 != s10_352);
							word32 a1_986;
							word32 a2_987;
							word32 a3_988;
							word32 a4_989;
							word32 a5_990;
							word32 a6_991;
							word32 a7_992;
							memcpy(s2_363, fp + -0x00A0, 0x10, out a1_986, out a2_987, out a3_988, out a4_989, out a5_990, out a6_991, out a7_992);
							struct Eq_214334 * a5_400 = null;
							do
							{
								Mem414[fp + -144 + a5_400:byte] = SLICE(CONVERT(Mem409[fp + -96 + a5_400:byte], byte, word32) ^ CONVERT(Mem409[(fp + -0x00A0) + a5_400:byte], byte, word32), byte, 0);
								++a5_400;
							} while (a5_400 != s10_352);
							word32 a0_423;
							word32 a4_993;
							word32 s2_994;
							word32 s10_995;
							ra_150 = bt_encrypt_be(ra_150, s0_138, out s0_138, out s1_139, out a0_423, out a1_131, out a3_133, out a4_993, out a5_291, out s2_994, out s3_152, out s4_141, out s5_153, out s6_142, out s8_143, out s10_995);
							if (a0_423 != 0x00)
								goto l23040B72;
						}
						s9 = (struct Eq_215991 **) ((char *) s9 + 16);
					}
					word32 a2_945;
					word32 a4_946;
					word32 a5_947;
					memcmp(fp->aFFFFFF90 + 32, (char *) a2 + s4_141, s8_143, out a1_131, out a2_945, out a3_133, out a4_946, out a5_947) == 0x00;
				}
				else
				{
					s9 = null;
					a3_133 = (struct Eq_214334 *) 0x02;
					struct Eq_214334 * a5_162 = s3_152->a0000 + 2;
					s3_152 = (struct Eq_214334 *) 0x10;
					do
					{
						word32 a4_166 = s5_153 + s9;
						if (s3_152 >= a5_162)
						{
							while (a3_133 < a5_162)
							{
								Mem238[fp + -144 + a3_133:byte] = SLICE(CONVERT(Mem232[fp + -96 + a3_133:byte], byte, word32) ^ CONVERT(Mem232[a4_166 + 0x00:byte], byte, word32), byte, 0);
								a3_133 = (struct Eq_214334 *) (a3_133->a0000 + 1);
								++a4_166;
							}
							for (; a5_162 != (struct Eq_214334 *) 0x10; ++a5_162)
								Mem249[fp + -144 + a5_162:byte] = SLICE(CONVERT(Mem245[fp + -96 + a5_162:byte], byte, word32), byte, 0);
							word32 a0_258;
							word32 a4_948;
							word32 a5_949;
							word32 s2_950;
							word32 s10_951;
							ra_150 = bt_encrypt_be(ra_150, s0_138, out s0_138, out s1_139, out a0_258, out a1_131, out a3_133, out a4_948, out a5_949, out s2_950, out s3_152, out s4_141, out s5_153, out s6_142, out s8_143, out s10_951);
							if (a0_258 != 0x00)
								break;
							goto l23040ABE;
						}
						struct Eq_214334 * a5_170 = a3_133;
						do
						{
							Mem184[fp + -144 + a5_170:byte] = SLICE(CONVERT(Mem178[fp + -96 + a5_170:byte], byte, word32) ^ CONVERT(Mem178[a4_166 + 0x00:byte], byte, word32), byte, 0);
							++a5_170;
							++a4_166;
						} while (a5_170 != s3_152);
						s9 = (struct Eq_215991 **) ((char *) s9 + (s3_152 - a3_133));
						word32 a0_197;
						word32 a3_996;
						word32 a4_997;
						word32 a5_998;
						word32 s2_999;
						word32 s4_1000;
						word32 s6_1001;
						word32 s8_1002;
						word32 s10_1003;
						ra_150 = bt_encrypt_be(ra_150, s0_138, out s0_138, out s1_139, out a0_197, out a1_131, out a3_996, out a4_997, out a5_998, out s2_999, out s3_152, out s4_1000, out s5_153, out s6_1001, out s8_1002, out s10_1003);
						a5_162 = (struct Eq_214334 *) 0x02;
						a3_133 = null;
					} while (a0_197 == 0x00);
				}
			}
		}
l23040B72:
		Eq_2 s10_651 = *((word32) dwArgA8 + 0x0088);
		Eq_2 s6_652 = *((word32) dwArgA8 + 0x00A8);
		Eq_2 s2_653 = *((word32) dwArgA8 + 200);
		Eq_2 a4_654 = *((word32) dwArgA8 + 232);
		ptr32 a0_655 = *((word32) dwArgA8 + 0x0C);
		s0Out = s0_138;
		s1Out = s1_139;
		a0Out = a0_655;
		a1Out = a1_131;
		a3Out = a3_133;
		a4Out = a4_654;
		s2Out = s2_653;
		s3Out = s3_152;
		s5Out = s5_153;
		s6Out = s6_652;
		s7Out = a2;
		s9Out = s9;
		s10Out = s10_651;
		s11Out = s11;
		return ra_150;
	}
}

// 23040D34: Register Eq_2 bt_mesh_aes_cmac(Register Eq_2 ra, Register Eq_2 a0, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_197405) a4Out, Register out Eq_2 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      beacon_send
//      bt_mesh_aes_cmac_one
//      bt_mesh_k2
//      bt_mesh_prov_conf
//      prov_random
Eq_2 bt_mesh_aes_cmac(Eq_2 ra, Eq_2 a0, union Eq_2 & a2Out, ptr32 & a3Out, struct Eq_197405 & a4Out, union Eq_2 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	Eq_2 a5_105;
	word32 a0_22;
	word32 s1_31;
	Eq_2 a1_24;
	struct Eq_214946 * a5_23;
	Eq_2 s2_32;
	struct Eq_197405 * a4_141;
	ptr32 a3_139;
	Eq_2 a2_137;
	ptr32 s3_147;
	ptr32 s4_149;
	ptr32 s5_151;
	ptr32 s8_153;
	Eq_2 ra_30 = tc_cmac_setup(ra, fp + -0x0118, a0, fp + -0x00C0, dwLocE8, out s1_31, out a0_22, out a1_24, out a2_137, out a3_139, out a4_141, out a5_23, out s2_32, out s3_147, out s4_149, out s5_151, out s8_153);
	if (a0_22 != 0x00)
	{
		while (s1_31 != 0x00)
		{
			word32 a0_55;
			word32 s1_59;
			word32 s0_177;
			ra_30 = tc_cmac_update(ra_30, fp + -0x0118, a1_24, a2_137, a4_141, a5_23, out s0_177, out s1_59, out a0_55, out a1_24, out a2_137, out a3_139, out a4_141, out a5_23, out s2_32, out s3_147, out s4_149, out s5_151, out s8_153);
			if (a0_55 == 0x00)
				goto l23040D58;
			s1_31 = s1_59 + ~0x00;
		}
		a5_105.u0 = 0x00;
		word32 a1_178;
		if (tc_cmac_final(ra_30, s2_32, fp + -0x0118, out a1_178, out a2_137, out a3_139, out a4_141, out s3_147, out s4_149, out s5_151, out s8_153) != 0x00)
		{
l23040D7A:
			a2Out = a2_137;
			a3Out = a3_139;
			a4Out = a4_141;
			a5Out = a5_105;
			s3Out = s3_147;
			s4Out = s4_149;
			s5Out = s5_151;
			s8Out = s8_153;
			return a5_105;
		}
	}
l23040D58:
	a5_105.u0 = ~0x04;
	goto l23040D7A;
}

// 23040D90: Register Eq_2 bt_mesh_aes_cmac_one(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      bt_mesh_s1
//      bt_mesh_k1
//      bt_mesh_k2
//      bt_mesh_k3
//      bt_mesh_k4
//      bt_mesh_virtual_addr
//      bt_mesh_prov_conf_salt
//      bt_mesh_net_beacon_update
Eq_2 bt_mesh_aes_cmac_one(Eq_2 ra, Eq_2 a0, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	ptr32 a2_15;
	ptr32 a3_16;
	ptr32 a4_17;
	ptr32 a5_18;
	ptr32 s3_21;
	ptr32 s4_22;
	ptr32 s5_23;
	ptr32 s8_24;
	Eq_2 a0_13 = bt_mesh_aes_cmac(ra, a0, out a2_15, out a3_16, out a4_17, out a5_18, out s3_21, out s4_22, out s5_23, out s8_24);
	a2Out = a2_15;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_18;
	s3Out = s3_21;
	s4Out = s4_22;
	s5Out = s5_23;
	s8Out = s8_24;
	return a0_13;
}

// 23040DA6: Register word32 bt_mesh_s1(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      bt_mesh_k2
//      bt_mesh_k3
//      bt_mesh_k4
//      bt_mesh_id128
//      bt_mesh_virtual_addr
word32 bt_mesh_s1(Eq_2 ra, Eq_2 a0, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	word32 a1_67;
	word32 a2_68;
	word32 a3_69;
	word32 a4_70;
	word32 a5_71;
	strlen(a0, out a1_67, out a2_68, out a3_69, out a4_70, out a5_71);
	ptr32 a3_29;
	ptr32 a4_30;
	ptr32 a5_31;
	ptr32 s3_34;
	ptr32 s4_35;
	ptr32 s5_36;
	ptr32 s8_37;
	word32 a2_72;
	a0Out = (word32) (bt_mesh_aes_cmac_one(ra, fp + -32, out a2_72, out a3_29, out a4_30, out a5_31, out s3_34, out s4_35, out s5_36, out s8_37) != 0x00);
	a3Out = a3_29;
	a4Out = a4_30;
	a5Out = a5_31;
	s3Out = s3_34;
	s4Out = s4_35;
	s5Out = s5_36;
	s8Out = s8_37;
	return dwArgE4;
}

