pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23040DD4: Register Eq_2 bt_mesh_k1(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      bt_mesh_id128
//      bt_mesh_prov_conf_key
//      prov_data
Eq_2 bt_mesh_k1(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s5Out)
{
	ptr32 a3_25;
	ptr32 a4_26;
	ptr32 a5_27;
	ptr32 s3_30;
	ptr32 s5_32;
	word32 a2_113;
	word32 s4_114;
	word32 s8_115;
	Eq_2 a0_22 = bt_mesh_aes_cmac_one(ra, a2, out a2_113, out a3_25, out a4_26, out a5_27, out s3_30, out s4_114, out s5_32, out s8_115);
	if (a0_22 < 0x00)
	{
		a0Out = a0_22;
		a2Out = dwArg10;
		a3Out = a3_25;
		a4Out = a4_26;
		a5Out = a5_27;
		s3Out = s3_30;
		s5Out = s5_32;
		return <invalid>;
	}
	else
	{
		word32 a1_116;
		word32 a2_117;
		word32 a3_118;
		word32 a4_119;
		word32 a5_120;
		strlen(a3, out a1_116, out a2_117, out a3_118, out a4_119, out a5_120);
		ptr32 a2_62;
		ptr32 a3_63;
		ptr32 a4_64;
		ptr32 a5_65;
		ptr32 s3_68;
		ptr32 s5_70;
		word32 s4_121;
		word32 s8_122;
		a0Out = bt_mesh_aes_cmac_one(ra, a4, out a2_62, out a3_63, out a4_64, out a5_65, out s3_68, out s4_121, out s5_70, out s8_122);
		a2Out = a2_62;
		a3Out = a3_63;
		a4Out = a4_64;
		a5Out = a5_65;
		s3Out = s3_68;
		s5Out = s5_70;
		return <invalid>;
	}
}

// 23040E16: Register Eq_2 bt_mesh_k2(Register Eq_2 ra, Register Eq_2 a5, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s9Out)
// Called from:
//      bt_mesh_net_keys_create
//      friend_cred_set
Eq_2 bt_mesh_k2(Eq_2 ra, Eq_2 a5, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s9Out)
{
	Eq_2 s0_111;
	word32 a0_33;
	word32 a3_268;
	word32 a5_269;
	word32 s4_270;
	word32 s5_271;
	word32 s8_272;
	ptr32 a4_128;
	Eq_2 s3_100;
	bt_mesh_s1(ra, 0x230B8844, out a0_33, out a3_268, out a4_128, out a5_269, out s3_100, out s4_270, out s5_271, out s8_272);
	if (a0_33 == 0x00)
	{
		word32 a2_273;
		word32 a3_274;
		word32 a5_275;
		word32 s4_276;
		word32 s5_277;
		word32 s8_278;
		Eq_2 a0_58 = bt_mesh_aes_cmac_one(ra, fp + -0x0068, out a2_273, out a3_274, out a4_128, out a5_275, out s3_100, out s4_276, out s5_277, out s8_278);
		s0_111 = a0_58;
		if (a0_58 == 0x00)
		{
			byte * s4_101;
			word32 a2_279;
			word32 a3_280;
			word32 a5_281;
			word32 s5_282;
			word32 s8_283;
			Eq_2 a0_92 = bt_mesh_aes_cmac(ra, fp + -72, out a2_279, out a3_280, out a4_128, out a5_281, out s3_100, out s4_101, out s5_282, out s8_283);
			byte bLoc49_228 = SLICE(fp + -0x0069, byte, 24);
			s0_111 = a0_92;
			if (a0_92 == 0x00)
			{
				*s4_101 = (byte) ((word32) bLoc49_228 & 0x007F);
				word32 a2_284;
				word32 a3_285;
				word32 a5_286;
				word32 s4_287;
				word32 s5_288;
				word32 s8_289;
				Eq_2 a0_124 = bt_mesh_aes_cmac(ra, fp + -72, out a2_284, out a3_285, out a4_128, out a5_286, out s3_100, out s4_287, out s5_288, out s8_289);
				s0_111 = a0_124;
				if (a0_124 == 0x00)
				{
					word32 a1_290;
					word32 a2_291;
					word32 a3_292;
					word32 a4_293;
					word32 a5_294;
					word32 a6_295;
					word32 a7_296;
					memcpy(s3_100, fp + -88, 0x10, out a1_290, out a2_291, out a3_292, out a4_293, out a5_294, out a6_295, out a7_296);
					word32 a2_297;
					word32 a3_298;
					word32 a5_299;
					word32 s4_300;
					word32 s5_301;
					word32 s8_302;
					Eq_2 a0_166 = bt_mesh_aes_cmac(ra, fp + -72, out a2_297, out a3_298, out a4_128, out a5_299, out s3_100, out s4_300, out s5_301, out s8_302);
					s0_111 = a0_166;
					if (a0_166 == 0x00)
					{
						word32 a1_303;
						word32 a2_304;
						word32 a3_305;
						word32 a5_306;
						word32 a6_307;
						word32 a7_308;
						memcpy(a5, fp + -88, 0x10, out a1_303, out a2_304, out a3_305, out a4_128, out a5_306, out a6_307, out a7_308);
					}
				}
			}
		}
	}
	else
		s0_111.u0 = 0x01;
	s1Out = dwArgA4;
	a0Out = s0_111;
	a3Out = dwArgC0;
	a4Out = a4_128;
	s2Out = a5;
	s3Out = s3_100;
	s9Out = dwArg18;
	return dwArgE8;
}

// 23040EE4: Register Eq_2 bt_mesh_k3(Register Eq_2 ra, Register Eq_2 a1, Register out ptr32 a3Out)
// Called from:
//      bt_mesh_net_keys_create
Eq_2 bt_mesh_k3(Eq_2 ra, Eq_2 a1, ptr32 & a3Out)
{
	Eq_2 s0_109;
	word32 a0_24;
	word32 a4_145;
	word32 a5_146;
	word32 s3_147;
	word32 s4_148;
	word32 s5_149;
	word32 s8_150;
	ptr32 a3_101;
	bt_mesh_s1(ra, 587958348, out a0_24, out a3_101, out a4_145, out a5_146, out s3_147, out s4_148, out s5_149, out s8_150);
	if (a0_24 == 0x00)
	{
		word32 a2_151;
		word32 a4_152;
		word32 a5_153;
		word32 s3_154;
		word32 s4_155;
		word32 s5_156;
		word32 s8_157;
		Eq_2 a0_49 = bt_mesh_aes_cmac_one(ra, fp + -48, out a2_151, out a3_101, out a4_152, out a5_153, out s3_154, out s4_155, out s5_156, out s8_157);
		s0_109 = a0_49;
		if (a0_49 == 0x00)
		{
			word32 a2_158;
			word32 a4_159;
			word32 a5_160;
			word32 s3_161;
			word32 s4_162;
			word32 s5_163;
			word32 s8_164;
			Eq_2 a0_73 = bt_mesh_aes_cmac_one(ra, fp + -32, out a2_158, out a3_101, out a4_159, out a5_160, out s3_161, out s4_162, out s5_163, out s8_164);
			s0_109 = a0_73;
			if (a0_73 == 0x00)
			{
				word32 a1_165;
				word32 a2_166;
				word32 a4_167;
				word32 a5_168;
				word32 a6_169;
				word32 a7_170;
				memcpy(a1, fp + -40, 0x08, out a1_165, out a2_166, out a3_101, out a4_167, out a5_168, out a6_169, out a7_170);
			}
		}
	}
	else
		s0_109.u0 = 0x01;
	a3Out = a3_101;
	return s0_109;
}

// 23040F4E: Register Eq_2 bt_mesh_k4(Register Eq_2 ra, Register Eq_2 s0, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_208043 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      app_key_set
Eq_2 bt_mesh_k4(Eq_2 ra, Eq_2 s0, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_208043 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 a0_108;
	byte bLoc21_101 = SLICE(s0, byte, 24);
	word32 a0_21;
	word32 a3_132;
	word32 a4_133;
	word32 s4_134;
	word32 s8_135;
	Eq_208043 a5_113;
	ptr32 s3_118;
	ptr32 s5_119;
	Eq_2 s0_29 = bt_mesh_s1(ra, 587958356, out a0_21, out a3_132, out a4_133, out a5_113, out s3_118, out s4_134, out s5_119, out s8_135);
	if (a0_21 == 0x00)
	{
		word32 a2_136;
		word32 a3_137;
		word32 a4_138;
		word32 s4_139;
		word32 s8_140;
		a0_108 = bt_mesh_aes_cmac_one(ra, fp + -48, out a2_136, out a3_137, out a4_138, out a5_113, out s3_118, out s4_139, out s5_119, out s8_140);
		if (a0_108 == 0x00)
		{
			word32 a2_141;
			word32 a3_142;
			word32 a4_143;
			word32 s4_144;
			word32 s8_145;
			a0_108 = bt_mesh_aes_cmac_one(ra, fp + -32, out a2_141, out a3_142, out a4_143, out a5_113, out s3_118, out s4_144, out s5_119, out s8_145);
			if (a0_108 == 0x00)
			{
				ui32 a5_88 = (word32) bLoc21_101;
				*s0_29 = (byte) (a5_88 & 63);
				a5_113 = a5_88 & 63;
			}
		}
	}
	else
		a0_108.u0 = 0x01;
	s1Out = a0;
	a0Out = a0_108;
	a5Out = a5_113;
	s3Out = s3_118;
	s4Out = dwArgF4;
	s5Out = s5_119;
	return s0_29;
}

// 23040FAA: Register word32 bt_mesh_id128(Register Eq_2 ra, Register Eq_2 a1, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      bt_mesh_net_keys_create
word32 bt_mesh_id128(Eq_2 ra, Eq_2 a1, ptr32 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s3Out, ptr32 & s5Out)
{
	ptr32 a0_35;
	word32 a0_15;
	word32 a5_100;
	word32 s4_101;
	word32 s8_102;
	ptr32 a3_18;
	Eq_2 a4_19;
	ptr32 s3_24;
	ptr32 s5_26;
	bt_mesh_s1(ra, a1, out a0_15, out a3_18, out a4_19, out a5_100, out s3_24, out s4_101, out s5_26, out s8_102);
	if (a0_15 == 0x00)
	{
		word32 a2_103;
		word32 a5_104;
		s1 = bt_mesh_k1(ra, fp + -32, 0x230B883C, a4_19, out a0_35, out a2_103, out a3_18, out a4_19, out a5_104, out s3_24, out s5_26);
	}
	else
		a0_35 = 0x01;
	a0Out = a0_35;
	a3Out = a3_18;
	a4Out = a4_19;
	s3Out = s3_24;
	s5Out = s5_26;
	return s1;
}

// 23040FDE: Register Eq_2 bt_mesh_net_obfuscate(Register Eq_2 ra, Register Eq_2 a0, Register Eq_213742 a1, Register Eq_2 a2, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out (ptr32 Eq_215600) s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_215604 a3Out, Register out (ptr32 byte) a4Out, Register out (ptr32 Eq_215600) a5Out, Register out (ptr32 Eq_215607) s2Out, Register out (ptr32 Eq_2) s3Out, Register out (ptr32 uint16) s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 s10Out)
// Called from:
//      net_decrypt.isra.1
//      bt_mesh_net_resend
//      bt_mesh_net_encode
//      bt_mesh_net_recv
//      create_friend_pdu
Eq_2 bt_mesh_net_obfuscate(Eq_2 ra, Eq_2 a0, Eq_213742 a1, Eq_2 a2, Eq_2 dwArg0128, ptr32 & s0Out, struct Eq_215600 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_215604 & a3Out, byte & a4Out, struct Eq_215600 & a5Out, struct Eq_215607 & s2Out, union Eq_2 & s3Out, uint16 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & s10Out)
{
	sys_put_be32(a1, fp + -43);
	word32 a6_169;
	word32 a7_170;
	word32 a4_167;
	word32 a5_168;
	word32 a2_165;
	word32 a3_166;
	word32 a1_164;
	memcpy(fp + -39, (word32) a0 + 7, 0x07, out a1_164, out a2_165, out a3_166, out a4_167, out a5_168, out a6_169, out a7_170);
	ptr32 a0_45;
	ptr32 a1_46;
	word32 s0_53;
	struct Eq_215600 * s1_54;
	ptr32 s10_55;
	uint16 * s4_56;
	ptr32 s6_57;
	ptr32 s8_58;
	struct Eq_215607 * s2_66;
	union Eq_2 * s3_67;
	ptr32 s5_68;
	struct Eq_215600 * a5_115;
	Eq_215604 a3_113;
	byte * a4_114;
	Eq_2 ra_65 = bt_encrypt_be(ra, a2, out s0_53, out s1_54, out a0_45, out a1_46, out a3_113, out a4_114, out a5_115, out s2_66, out s3_67, out s4_56, out s5_68, out s6_57, out s8_58, out s10_55);
	if (a0_45 == 0x00)
	{
		a5_115 = s0_53 + 1;
		a4_114 = fp + -32;
		do
		{
			++a5_115;
			a3_113 = (word32) a5_115->b0000 ^ (word32) (*a4_114);
			a5_115[0x0FFF] = (struct Eq_215600) (byte) a3_113;
			++a4_114;
		} while (s1_54 != a5_115);
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_54;
	a0Out = a0_45;
	a1Out = a1_46;
	a2Out = dwArg0100;
	a3Out = a3_113;
	a4Out = a4_114;
	a5Out = a5_115;
	s2Out = s2_66;
	s3Out = s3_67;
	s4Out = s4_56;
	s5Out = s5_68;
	s6Out = s6_57;
	s8Out = s8_58;
	s10Out = s10_55;
	return ra_65;
}

// 23041042: Register Eq_2 bt_mesh_net_encrypt(Register Eq_2 ra, Register Eq_2 a0, Register Eq_213742 a2, Register word32 a3, Register (ptr32 Eq_215703) a5, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      bt_mesh_net_resend
//      bt_mesh_net_encode
//      bt_mesh_net_recv
//      create_friend_pdu
Eq_2 bt_mesh_net_encrypt(Eq_2 ra, Eq_2 a0, Eq_213742 a2, word32 a3, struct Eq_215703 * a5, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_215718 * a1_13 = a5->ptr0000;
	struct Eq_213769 * s1_20 = (struct Eq_213769 *) 0x04;
	if ((int32) (byte) (word32) a5->b0001 < 0x00)
		s1_20 = (struct Eq_213769 *) 0x08;
	sys_put_be32(a2, fp + ~0x16);
	ptr32 a0_75;
	ptr32 a3_78;
	Eq_2 a4_79;
	Eq_2 s0_84;
	Eq_2 s1_85;
	ptr32 s10_86;
	ptr32 s3_87;
	ptr32 s5_89;
	ptr32 s6_90;
	ptr32 s9_92;
	ptr32 s7_100;
	ptr32 s11_101;
	ptr32 a5_107;
	ptr32 a1_106;
	Eq_2 ra_83 = bt_mesh_ccm_encrypt(ra, s1_20, a0, fp + ~0x1F, a1_13->dw0000 + 0x07, out s0_84, out s1_85, out a0_75, out a1_106, out a3_78, out a4_79, out a5_107, out s3_87, out s5_89, out s6_90, out s7_100, out s9_92, out s10_86, out s11_101);
	if (a0_75 == 0x00)
		net_buf_simple_add(s0_84, s1_85, a4_79, out a1_106, out a5_107);
	s0Out = s0_84;
	s1Out = s1_85;
	a1Out = a1_106;
	a3Out = a3_78;
	a4Out = a4_79;
	a5Out = a5_107;
	s2Out = a0_75;
	s3Out = s3_87;
	s5Out = s5_89;
	s6Out = s6_90;
	s7Out = s7_100;
	s9Out = s9_92;
	s10Out = s10_86;
	s11Out = s11_101;
	return ra_83;
}

// 230410E6: Register Eq_2 bt_mesh_net_decrypt(Register Eq_2 ra, Register Eq_2 a0, Register Eq_213742 a2, Register word32 a3, Register (ptr32 Eq_215789) a5, Stack Eq_2 dwArg88, Register out (ptr32 Eq_215791) s1Out, Register out Eq_215792 a0Out, Register out (ptr32 Eq_215793) a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_215795) a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      net_decrypt.isra.1
//      bt_mesh_net_resend
Eq_2 bt_mesh_net_decrypt(Eq_2 ra, Eq_2 a0, Eq_213742 a2, word32 a3, struct Eq_215789 * a5, Eq_2 dwArg88, struct Eq_215791 & s1Out, union Eq_215792 & a0Out, struct Eq_215793 & a1Out, ptr32 & a3Out, struct Eq_215795 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_215804 * a1_13 = a5->ptr0000;
	word32 s1_20 = 0x04;
	if ((int32) (byte) (word32) a5->b0001 < 0x00)
		s1_20 = 0x08;
	sys_put_be32(a2, fp + ~0x16);
	int32 a6_60 = a1_13->dw0000;
	word32 a3_66 = (word32) (word16) ((word32) a1_13->w0004 - s1_20);
	a1_13->w0004 = (word16) a3_66;
	Eq_215792 a0_79;
	struct Eq_215793 * a1_80;
	ptr32 a3_82;
	struct Eq_215795 * a4_83;
	struct Eq_215791 * s1_89;
	ptr32 s10_90;
	ptr32 s2_91;
	ptr32 s3_92;
	ptr32 s5_94;
	ptr32 s6_95;
	ptr32 s7_96;
	ptr32 s9_105;
	ptr32 s11_106;
	word32 s0_152;
	Eq_2 ra_87 = bt_mesh_ccm_decrypt(ra, a0, fp + ~0x1F, a6_60 + 0x07, a3_66 + ~0x06, dwArg88, out s0_152, out s1_89, out a0_79, out a1_80, out a3_82, out a4_83, out s2_91, out s3_92, out s5_94, out s6_95, out s7_96, out s9_105, out s10_90, out s11_106);
	s1Out = s1_89;
	a0Out = a0_79;
	a1Out = a1_80;
	a3Out = a3_82;
	a4Out = a4_83;
	s2Out = s2_91;
	s3Out = s3_92;
	s5Out = s5_94;
	s6Out = s6_95;
	s7Out = s7_96;
	s9Out = s9_105;
	s10Out = s10_90;
	s11Out = s11_106;
	return ra_87;
}

// 23041186: Register Eq_2 bt_mesh_app_encrypt(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a7, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB4, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_215892) s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      bt_mesh_trans_send
Eq_2 bt_mesh_app_encrypt(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a7, Eq_2 dwArg94, Eq_2 dwArgB4, Eq_2 dwArg0128, union Eq_2 & s1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, struct Eq_215892 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s10Out, ptr32 & s11Out)
{
	Eq_213742 a0_14 = a2 << 0x1F | a7;
	sys_put_be32(a0_14, fp + -31);
	sys_put_be32(a0_14, fp + -23);
	0x00 = (int8) a4;
	int32 a6_47 = *dwArgB4;
	struct Eq_213769 * s1_51 = (struct Eq_213769 *) 0x04;
	if (dwArg94 != 0x00)
		s1_51 = (struct Eq_213769 *) 0x08;
	struct Eq_215892 * a0_62;
	ptr32 a3_65;
	Eq_2 a4_66;
	Eq_2 s0_71;
	Eq_2 s1_72;
	ptr32 s10_73;
	ptr32 s3_74;
	ptr32 s5_76;
	ptr32 s6_77;
	ptr32 s11_88;
	word32 s9_168;
	word32 s7_167;
	word32 a1_166;
	ptr32 a5_136;
	Eq_2 ra_70 = bt_mesh_ccm_encrypt(ra, s1_51, a0, fp + -32, a6_47, out s0_71, out s1_72, out a0_62, out a1_166, out a3_65, out a4_66, out a5_136, out s3_74, out s5_76, out s6_77, out s7_167, out s9_168, out s10_73, out s11_88);
	if (a0_62 == null)
	{
		word32 a1_169;
		net_buf_simple_add(s0_71, s1_72, a4_66, out a1_169, out a5_136);
	}
	0x00 = (int8) dwArg0128;
	s1Out = s1_72;
	a3Out = a3_65;
	a4Out = a4_66;
	a5Out = a5_136;
	s2Out = a0_62;
	s3Out = s3_74;
	s5Out = s5_76;
	s6Out = s6_77;
	s10Out = s10_73;
	s11Out = s11_88;
	return ra_70;
}

// 2304121A: Register Eq_2 bt_mesh_app_decrypt(Register Eq_2 a0, Register Eq_2 a2, Register ui32 a5, Stack Eq_2 dwArg68, Stack (ptr32 (ptr32 Eq_215991)) dwArg84, Stack Eq_2 dwArgA4, Register out (ptr32 Eq_215969) s0Out, Register out ptr32 a3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 s11Out)
// Called from:
//      sdu_recv
Eq_2 bt_mesh_app_decrypt(Eq_2 a0, Eq_2 a2, ui32 a5, Eq_2 dwArg68, struct Eq_215991 ** dwArg84, Eq_2 dwArgA4, struct Eq_215969 & s0Out, ptr32 & a3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & s11Out)
{
	Eq_213742 a0_16 = a2 << 0x1F | a5;
	sys_put_be32(a0_16, fp + -47);
	sys_put_be32(a0_16, fp + -39);
	struct Eq_214334 * a3_51 = (word32) *((char *) *dwArg84 + 4);
	word32 a0_65;
	ptr32 a3_68;
	Eq_2 a4_69;
	struct Eq_215969 * s0_74;
	Eq_2 s2_77;
	ptr32 s5_80;
	ptr32 s6_81;
	ptr32 s11_92;
	word32 s9_175;
	word32 s10_176;
	word32 s7_174;
	word32 s3_173;
	word32 a1_172;
	word32 s1_171;
	Eq_2 ra_73 = bt_mesh_ccm_decrypt(dwArgA4, a0, fp + -48, dwArg84, a3_51, dwArg68, out s0_74, out s1_171, out a0_65, out a1_172, out a3_68, out a4_69, out s2_77, out s3_173, out s5_80, out s6_81, out s7_174, out s9_175, out s10_176, out s11_92);
	if (a0_65 == 0x00)
	{
		word32 a1_177;
		word32 a5_178;
		net_buf_simple_add(s2_77, (word32) s0_74->w0004, a4_69, out a1_177, out a5_178);
	}
	s0Out = s0_74;
	a3Out = a3_68;
	s5Out = s5_80;
	s6Out = s6_81;
	s8Out = dwArgD4;
	s11Out = s11_92;
	return ra_73;
}

// 230412B2: Register (ptr32 Eq_194081) bt_mesh_fcs_calc(Register (ptr32 Eq_194081) a0, Register word32 a1, Register out Eq_216046 a5Out)
// Called from:
//      prov_send
struct Eq_194081 * bt_mesh_fcs_calc(struct Eq_194081 * a0, word32 a1, union Eq_216046 & a5Out)
{
	struct Eq_194081 * a1_6 = a0 + a1;
	Eq_216046 a5_14 = 0x00FF;
	while (a0 != a1_6)
	{
		++a0;
		a5_14 = (word32) (a5_14 ^ (word32) a0->bFFFFFFFF)->b230B886C;
	}
	a5Out = a5_14;
	return ~a5_14 & 0x00FF;
}

// 230412DE: Register Eq_2 bt_mesh_fcs_check(Register Eq_2 a0, Register word32 a1, Register (ptr32 Eq_216068) a2, Register out ptr32 a3Out)
// Called from:
//      gen_prov_start
Eq_2 bt_mesh_fcs_check(Eq_2 a0, word32 a1, struct Eq_216068 * a2, ptr32 & a3Out)
{
	int32 a5_21 = 0x00FF;
	ptr32 a3_12 = (word32) (word16) (a2 + (word32) (*((word32) a0 + 4)));
	while ((word32) (word16) a2 != a3_12)
	{
		++a2;
		a5_21 = (word32) (a5_21 ^ (word32) a2->bFFFFFFFF)->b230B886C;
	}
	Eq_2 a0_32 = (word32) ((word32) (a5_21 ^ a1)->b230B886C < -0x00D0);
	a3Out = a3_12;
	return a0_32;
}

// 23041324: Register word32 bt_mesh_virtual_addr(Register Eq_2 ra, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      va_add
//      mod_pub_va_set
word32 bt_mesh_virtual_addr(Eq_2 ra, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	Eq_2 a0_37;
	word32 a0_17;
	word32 a4_112;
	word32 a5_113;
	ptr32 a3_20;
	ptr32 s3_26;
	ptr32 s4_27;
	ptr32 s5_28;
	ptr32 s8_29;
	Eq_2 s0_25 = bt_mesh_s1(ra, 587958372, out a0_17, out a3_20, out a4_112, out a5_113, out s3_26, out s4_27, out s5_28, out s8_29);
	if (a0_17 == 0x00)
	{
		word32 a2_114;
		word32 a4_115;
		word32 a5_116;
		a0_37 = bt_mesh_aes_cmac_one(ra, fp + -48, out a2_114, out a3_20, out a4_115, out a5_116, out s3_26, out s4_27, out s5_28, out s8_29);
		if (a0_37 == 0x00)
			*s0_25 = (word16) ((word32) (word14) ((word32) bLoc12 << 8 | (word32) bLoc11) | 0xF8000000);
	}
	else
		a0_37.u0 = 0x01;
	s1Out = a0;
	a0Out = a0_37;
	a3Out = a3_20;
	s3Out = s3_26;
	s4Out = s4_27;
	s5Out = s5_28;
	s8Out = s8_29;
	return dwArgE4;
}

