pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23041374: Register Eq_2 bt_mesh_prov_conf_salt(Register Eq_2 ra, Register out ptr32 a3Out)
// Called from:
//      prov_confirm
Eq_2 bt_mesh_prov_conf_salt(Eq_2 ra, ptr32 & a3Out)
{
	ptr32 a3_19;
	word32 a2_44;
	word32 a4_45;
	word32 a5_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s8_50;
	Eq_2 a0_16 = bt_mesh_aes_cmac_one(ra, fp + ~0x1F, out a2_44, out a3_19, out a4_45, out a5_46, out s3_47, out s4_48, out s5_49, out s8_50);
	a3Out = a3_19;
	return a0_16;
}

// 23041394: Register word32 bt_mesh_prov_conf_key(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register out ptr32 a2Out, Register out ptr32 a3Out)
// Called from:
//      prov_confirm
word32 bt_mesh_prov_conf_key(Eq_2 ra, Eq_2 a1, Eq_2 a2, ptr32 & a2Out, ptr32 & a3Out)
{
	word32 a0_11;
	ptr32 a2_13;
	ptr32 a3_14;
	word32 a4_33;
	word32 a5_34;
	word32 s3_35;
	word32 s5_36;
	bt_mesh_k1(ra, a1, 0x230B885C, a2, out a0_11, out a2_13, out a3_14, out a4_33, out a5_34, out s3_35, out s5_36);
	a2Out = a2_13;
	a3Out = a3_14;
	return a0_11;
}

// 230413A8: Register Eq_2 bt_mesh_prov_conf(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      prov_confirm
//      prov_random
Eq_2 bt_mesh_prov_conf(Eq_2 ra, Eq_2 a0, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	ptr32 a3_19;
	ptr32 a4_20;
	ptr32 s5_26;
	ptr32 s8_27;
	word32 a2_47;
	word32 a5_48;
	word32 s3_49;
	word32 s4_50;
	Eq_2 a0_16 = bt_mesh_aes_cmac(ra, a0, out a2_47, out a3_19, out a4_20, out a5_48, out s3_49, out s4_50, out s5_26, out s8_27);
	a3Out = a3_19;
	a4Out = a4_20;
	s5Out = s5_26;
	s8Out = s8_27;
	return a0_16;
}

// 230413C4: Register Eq_2 bt_mesh_prov_decrypt(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 (ptr32 Eq_215991)) a2, Stack Eq_2 dwArgA8, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      prov_data
Eq_2 bt_mesh_prov_decrypt(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_215991 ** a2, Eq_2 dwArgA8, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out)
{
	ptr32 a0_14;
	ptr32 a3_17;
	ptr32 s0_23;
	ptr32 s2_26;
	word32 s1_47;
	word32 a1_48;
	word32 a4_49;
	word32 s3_50;
	word32 s5_51;
	word32 s6_52;
	word32 s7_53;
	word32 s9_54;
	word32 s10_55;
	word32 s11_56;
	Eq_2 ra_22 = bt_mesh_ccm_decrypt(ra, a0, a1, a2, (struct Eq_214334 *) 0x19, dwArgA8, out s0_23, out s1_47, out a0_14, out a1_48, out a3_17, out a4_49, out s2_26, out s3_50, out s5_51, out s6_52, out s7_53, out s9_54, out s10_55, out s11_56);
	s0Out = s0_23;
	a0Out = a0_14;
	a3Out = a3_17;
	s2Out = s2_26;
	return ra_22;
}

// 230413D2: Register word32 bt_mesh_beacon_auth(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      auth_match
//      bt_mesh_net_beacon_update
word32 bt_mesh_beacon_auth(Eq_2 ra, Eq_2 a0, Eq_2 a2, ptr32 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	ptr32 a1_44;
	Eq_213742 a3_26;
	word32 a1_121;
	word32 a2_122;
	word32 a4_123;
	word32 a5_124;
	word32 a6_125;
	word32 a7_126;
	memcpy(fp + -47, a2, 0x08, out a1_121, out a2_122, out a3_26, out a4_123, out a5_124, out a6_125, out a7_126);
	sys_put_be32(a3_26, fp + -39);
	ptr32 s3_51;
	ptr32 s4_52;
	ptr32 s5_53;
	word32 a2_127;
	word32 s8_128;
	ptr32 a3_46;
	Eq_2 a4_100;
	ptr32 a5_101;
	if (bt_mesh_aes_cmac_one(ra, a0, out a2_127, out a3_46, out a4_100, out a5_101, out s3_51, out s4_52, out s5_53, out s8_128) == 0x00)
	{
		word32 a2_129;
		word32 a6_130;
		word32 a7_131;
		memcpy(a4_100, fp + -32, 0x08, out a1_44, out a2_129, out a3_46, out a4_100, out a5_101, out a6_130, out a7_131);
	}
	a1Out = a1_44;
	a3Out = a3_46;
	a4Out = a4_100;
	a5Out = a5_101;
	s3Out = s3_51;
	s4Out = s4_52;
	s5Out = s5_53;
	s8Out = dwArgD4;
	return dwArg84;
}

// 23041422: void health_period_status(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void health_period_status(Eq_2 ra, Eq_2 s1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	if (a3 == 0x08000037)
	{
		Eq_2 a4_17 = *(union Eq_2 *) 0x0800004F;
		Eq_2 a5_24;
		word32 a1_140;
		word32 a2_141;
		Eq_2 a0_21 = net_buf_simple_pull_u8(*s1, out a1_140, out a2_141, out a5_24);
		*s1 = (byte) a0_21;
		word32 s0_161;
		word32 s1_162;
		word32 a0_163;
		word32 a1_164;
		word32 a2_165;
		word32 a3_166;
		word32 a4_167;
		word32 a5_168;
		word32 s2_169;
		word32 s3_170;
		word32 s4_171;
		word32 s5_172;
		word32 s6_173;
		word32 s7_174;
		word32 s8_175;
		word32 s9_176;
		word32 s10_177;
		word32 s11_178;
		k_sem_give(ra, (word32) a0_21 + 8, a3, a4_17, a5_24, mstatus, dwArg14, dwArg18, dwArg60, dwArg64, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_161, out s1_162, out a0_163, out a1_164, out a2_165, out a3_166, out a4_167, out a5_168, out s2_169, out s3_170, out s4_171, out s5_172, out s6_173, out s7_174, out s8_175, out s9_176, out s10_177, out s11_178);
	}
	else
	{
		word32 s1_142;
		word32 a0_143;
		word32 a1_144;
		word32 a2_145;
		word32 a3_146;
		word32 a4_147;
		word32 a5_148;
		word32 a7_149;
		word32 s2_150;
		word32 s3_151;
		word32 s4_152;
		word32 s5_153;
		word32 s6_154;
		word32 s7_155;
		word32 s8_156;
		word32 s9_157;
		word32 s10_158;
		word32 s11_159;
		word32 t4_160;
		printf(ra, &g_t230B8AAC, a3, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_142, out a0_143, out a1_144, out a2_145, out a3_146, out a4_147, out a5_148, out a7_149, out s2_150, out s3_151, out s4_152, out s5_153, out s6_154, out s7_155, out s8_156, out s9_157, out s10_158, out s11_159, out t4_160);
	}
}

// 23041472: void health_current_status(Register Eq_2 ra, Register (ptr32 Eq_216472) s1, Register word32 a1, Register Eq_2 a3, Register Eq_2 a5, Stack word32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack word32 dwArg44, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void health_current_status(Eq_2 ra, struct Eq_216472 * s1, word32 a1, Eq_2 a3, Eq_2 a5, word32 dwArg00, word32 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, word32 dwArg44, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	Eq_2 a5_20;
	word32 a1_134;
	word32 a2_135;
	Eq_2 a0_17 = net_buf_simple_pull_u8(a5, out a1_134, out a2_135, out a5_20);
	word32 a1_24;
	word32 a4_26;
	word32 a2_136;
	word32 a5_137;
	Eq_2 a0_23 = net_buf_simple_pull_le16(a5_20, out a1_24, out a2_136, out a4_26, out a5_137);
	<anonymous> * t1_28 = s1->ptr0004;
	if (t1_28 != null)
		t1_28();
	else
	{
		word32 s1_138;
		word32 a0_139;
		word32 a1_140;
		word32 a2_141;
		word32 a3_142;
		word32 a4_143;
		word32 a5_144;
		word32 a7_145;
		word32 s2_146;
		word32 s3_147;
		word32 s4_148;
		word32 s5_149;
		word32 s6_150;
		word32 s7_151;
		word32 s8_152;
		word32 s9_153;
		word32 s10_154;
		word32 s11_155;
		word32 t4_156;
		printf(ra, &g_t230B89D8, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_138, out a0_139, out a1_140, out a2_141, out a3_142, out a4_143, out a5_144, out a7_145, out s2_146, out s3_147, out s4_148, out s5_149, out s6_150, out s7_151, out s8_152, out s9_153, out s10_154, out s11_155, out t4_156);
	}
}

// 230414C6: void health_fault_status(Register Eq_2 ra, Register (ptr32 Eq_216553) s0, Register word32 a1, Register (ptr32 Eq_216555) a2, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void health_fault_status(Eq_2 ra, struct Eq_216553 * s0, word32 a1, struct Eq_216555 * a2, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	struct Eq_274 * a0_154;
	if (a1 != 0x05)
	{
		a0_154 = (struct Eq_274 *) &g_t230B8A00;
		goto l230414DE;
	}
	word32 a2_352;
	word32 a1_351;
	Eq_2 a5_28;
	Eq_2 a0_25 = net_buf_simple_pull_u8(s0->t0018, out a1_351, out a2_352, out a5_28);
	int32 * s3_108 = &g_dw4200F430;
	uint16 * s0_29 = *((word32) a5_28 + 4);
	if (a5_28 != 0x00)
	{
		a5_28 = (word32) *a5_28;
		if (a5_28 != a0_25)
		{
			a0_154 = (struct Eq_274 *) &g_t230B8A2C;
			goto l23041512;
		}
	}
	word32 a4_372;
	word32 a5_373;
	Eq_2 a1_36;
	Eq_2 a2_37;
	Eq_2 a0_35 = net_buf_simple_pull_le16(a5_28, out a1_36, out a2_37, out a4_372, out a5_373);
	Eq_2 a5_42 = (word32) *s0_29;
	if (a5_42 == a0_35)
	{
		if (a5_42 != 0x00)
			*a5_42 = (byte) a0_25;
		union Eq_2 * a4_50 = (word32) a2->w0004;
		Eq_2 a5_53 = *(union Eq_2 *) 0x05;
		if (a4_50 > (union Eq_2 *) 0x05)
		{
			word32 s1_374;
			word32 s2_379;
			word32 a7_378;
			word32 a5_377;
			word32 s4_380;
			word32 s5_381;
			word32 s7_383;
			word32 s9_385;
			word32 s6_382;
			word32 s8_384;
			word32 s11_387;
			word32 s10_386;
			word32 t4_388;
			word32 a3_375;
			word32 a4_376;
			ra = printf(ra, &g_t230B8A80, 0x05, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_374, out a0_35, out a1_36, out a2_37, out a3_375, out a4_376, out a5_377, out a7_378, out s2_379, out s3_108, out s4_380, out s5_381, out s6_382, out s7_383, out s8_384, out s9_385, out s10_386, out s11_387, out t4_388);
		}
		else
			*a4_50 = (union Eq_2 *) a5_53;
		Eq_2 a4_95;
		Eq_2 a5_96;
		Eq_2 a3_100;
		word32 a1_407;
		word32 a2_408;
		word32 a6_409;
		word32 a7_410;
		memcpy(a0_35, a1_36, a2_37, out a1_407, out a2_408, out a3_100, out a4_95, out a5_96, out a6_409, out a7_410);
		int32 a0_111 = *s3_108;
		word32 s0_389;
		word32 a0_391;
		word32 s1_390;
		word32 a1_392;
		word32 a2_393;
		word32 a3_394;
		word32 a4_395;
		word32 a5_396;
		word32 s2_397;
		word32 s3_398;
		word32 s4_399;
		word32 s5_400;
		word32 s6_401;
		word32 s7_402;
		word32 s8_403;
		word32 s9_404;
		word32 s10_405;
		word32 s11_406;
		k_sem_give(ra, a0_111 + 0x08, a3_100, a4_95, a5_96, mstatus, dwArg14, dwArg18, dwArg60, s3, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_389, out s1_390, out a0_391, out a1_392, out a2_393, out a3_394, out a4_395, out a5_396, out s2_397, out s3_398, out s4_399, out s5_400, out s6_401, out s7_402, out s8_403, out s9_404, out s10_405, out s11_406);
		return;
	}
	a0_154 = (struct Eq_274 *) &g_t230B8A54;
l230414DE:
	word32 t4_371;
	word32 s9_368;
	word32 s10_369;
	word32 s11_370;
	word32 s6_365;
	word32 s7_366;
	word32 s8_367;
	word32 s1_353;
	word32 s5_364;
	word32 a1_355;
	word32 a2_356;
	word32 a5_359;
	word32 a0_354;
	word32 a3_357;
	word32 a4_358;
	word32 s2_361;
	word32 s3_362;
	word32 a7_360;
	word32 s4_363;
	printf(ra, a0_154, 0x05, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_353, out a0_354, out a1_355, out a2_356, out a3_357, out a4_358, out a5_359, out a7_360, out s2_361, out s3_362, out s4_363, out s5_364, out s6_365, out s7_366, out s8_367, out s9_368, out s10_369, out s11_370, out t4_371);
}

