pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304157E: void health_attention_status(Register Eq_2 ra, Register (ptr32 Eq_2) s1, Register Eq_2 a0, Register (ptr32 Eq_216787) a1, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void health_attention_status(Eq_2 ra, union Eq_2 * s1, Eq_2 a0, struct Eq_216787 * a1, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	Eq_2 a3_9 = a1->t0014;
	if (a1 == (struct Eq_216787 *) 0x08000007)
	{
		Eq_2 a3_18 = g_t4200F018;
		Eq_2 a5_19 = *s1;
		if (s1 != null)
		{
			word32 a1_180;
			word32 a2_181;
			a0 = net_buf_simple_pull_u8(a5_19, out a1_180, out a2_181, out a5_19);
			*s1 = (union Eq_2 *) (byte) a0;
		}
		Eq_2 a0_35 = (word32) a0 + 8;
		word32 s0_182;
		word32 s1_183;
		word32 a0_184;
		word32 a1_185;
		word32 a2_186;
		word32 a3_187;
		word32 a4_188;
		word32 a5_189;
		word32 s2_190;
		word32 s3_191;
		word32 s4_192;
		word32 s5_193;
		word32 s6_194;
		word32 s7_195;
		word32 s8_196;
		word32 s9_197;
		word32 s10_198;
		word32 s11_199;
		k_sem_give(ra, a0_35, a3_18, 0x08000007, a5_19, mstatus, dwArg14, dwArg18, dwArg60, dwArg64, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_182, out s1_183, out a0_184, out a1_185, out a2_186, out a3_187, out a4_188, out a5_189, out s2_190, out s3_191, out s4_192, out s5_193, out s6_194, out s7_195, out s8_196, out s9_197, out s10_198, out s11_199);
	}
	else
	{
		word32 s1_161;
		word32 a0_162;
		word32 a1_163;
		word32 a2_164;
		word32 a3_165;
		word32 a4_166;
		word32 a5_167;
		word32 a7_168;
		word32 s2_169;
		word32 s3_170;
		word32 s4_171;
		word32 s5_172;
		word32 s6_173;
		word32 s7_174;
		word32 s8_175;
		word32 s9_176;
		word32 s10_177;
		word32 s11_178;
		word32 t4_179;
		printf(ra, &g_t230B89A8, a3_9, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_161, out a0_162, out a1_163, out a2_164, out a3_165, out a4_166, out a5_167, out a7_168, out s2_169, out s3_170, out s4_171, out s5_172, out s6_173, out s7_174, out s8_175, out s9_176, out s10_177, out s11_178, out t4_179);
	}
}

// 230415C8: void attention_off(Register (ptr32 Eq_216914) a0)
void attention_off(struct Eq_216914 * a0)
{
	struct Eq_216915 * a5_5 = a0->ptrFFFFFFFC;
	if (a5_5 == null)
		return;
	<anonymous> * t1_6 = a5_5->ptr0014;
	if (t1_6 == null)
		return;
	word32 t1_11;
	t1_6();
}

// 230415DE: void send_attention_status(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124, Stack word32 dwArg0128)
// Called from:
//      attention_get
//      attention_set
void send_attention_status(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124, word32 dwArg0128)
{
	Eq_2 a5_27;
	Eq_2 a0_24 = k_delayed_work_remaining_get(s0, a0, (word32) *((word32) a0 + 24) + 8, out a5_27);
	Eq_2 a5_37;
	word32 a4_188;
	word32 a2_187;
	word32 a1_186;
	Eq_2 s1_38 = bt_mesh_model_msg_init(0x08000007, a5_27, out a1_186, out a2_187, out a4_188, out a5_37);
	word32 a5_189;
	net_buf_simple_add_u8(fp + -28, (a0_24 ^ 1000) & 0x00FF, a5_37, out a5_189);
	word32 a0_58;
	Eq_2 a3_61;
	word32 s0_190;
	word32 s1_191;
	word32 a2_192;
	word32 a4_193;
	word32 a5_194;
	word32 mstatus_195;
	Eq_2 ra_67 = bt_mesh_model_send(ra, a0_24, s1_38, s1_38, a1, fp + -28, 0x00, a1, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_190, out s1_191, out a0_58, out a2_192, out a3_61, out a4_193, out a5_194, out mstatus_195);
	if (a0_58 != 0x00)
	{
		word32 s1_196;
		word32 a0_197;
		word32 a1_198;
		word32 a2_199;
		word32 a3_200;
		word32 a4_201;
		word32 a5_202;
		word32 a7_203;
		word32 s2_204;
		word32 s3_205;
		word32 s4_206;
		word32 s5_207;
		word32 s6_208;
		word32 s7_209;
		word32 s8_210;
		word32 s9_211;
		word32 s10_212;
		word32 s11_213;
		word32 t4_214;
		printf(ra_67, &g_t230B8C94, a3_61, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_196, out a0_197, out a1_198, out a2_199, out a3_200, out a4_201, out a5_202, out a7_203, out s2_204, out s3_205, out s4_206, out s5_207, out s6_208, out s7_209, out s8_210, out s9_211, out s10_212, out s11_213, out t4_214);
	}
	0x00 = dwArg0128;
}

// 23041648: void attention_get(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124, Stack word32 dwArg0128)
void attention_get(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124, word32 dwArg0128)
{
	send_attention_status(ra, s0, a0, a1, s4, s6, s7, s9, s11, mstatus, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, dwArg0128);
}

// 2304164C: Register Eq_2 health_period_set_unrel(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s11Out)
// Called from:
//      health_period_set
Eq_2 health_period_set_unrel(Eq_2 ra, Eq_2 a3, Eq_2 a5, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s11Out)
{
	word32 a1_110;
	word32 a2_111;
	word32 a5_112;
	Eq_2 a0_13 = net_buf_simple_pull_u8(a5, out a1_110, out a2_111, out a5_112);
	if (a0_13 <= 0x0F)
	{
		*(union Eq_2 *) 0x1A = (byte) ((word32) *(union Eq_2 *) 0x1A & ~0x0F | a0_13 & 0x0F);
		s2Out = s2;
		s4Out = s4;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s11Out = s11;
		return ra;
	}
	else
	{
		ptr32 s11_45;
		ptr32 s2_46;
		ptr32 s4_48;
		ptr32 s6_50;
		ptr32 s7_51;
		ptr32 s9_53;
		word32 s1_113;
		word32 a0_114;
		word32 a1_115;
		word32 a2_116;
		word32 a3_117;
		word32 a4_118;
		word32 a5_119;
		word32 a7_120;
		word32 s3_121;
		word32 s5_122;
		word32 s8_123;
		word32 s10_124;
		word32 t4_125;
		Eq_2 ra_42 = printf(ra, &g_t230B8C74, a3, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_113, out a0_114, out a1_115, out a2_116, out a3_117, out a4_118, out a5_119, out a7_120, out s2_46, out s3_121, out s4_48, out s5_122, out s6_50, out s7_51, out s8_123, out s9_53, out s10_124, out s11_45, out t4_125);
		s2Out = s2_46;
		s4Out = s4_48;
		s6Out = s6_50;
		s7Out = s7_51;
		s9Out = s9_53;
		s11Out = s11_45;
		return ra_42;
	}
}

