pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304168E: void send_health_period_status(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124)
// Called from:
//      health_period_set
//      health_period_get
void send_health_period_status(Eq_2 ra, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124)
{
	Eq_2 a5_27;
	word32 a4_176;
	word32 a2_175;
	word32 a1_174;
	Eq_2 s1_28 = bt_mesh_model_msg_init(0x08000037, fp + -36, out a1_174, out a2_175, out a4_176, out a5_27);
	Eq_2 s0_30 = *((word32) a5_27 + 8);
	word32 a5_177;
	net_buf_simple_add_u8(fp + -28, (word32) *((word32) a5_27 + 11) & 0x0F, a5_27, out a5_177);
	word32 a0_49;
	Eq_2 a3_52;
	word32 s0_178;
	word32 s1_179;
	word32 a2_180;
	word32 a4_181;
	word32 a5_182;
	word32 mstatus_183;
	Eq_2 ra_58 = bt_mesh_model_send(ra, s0_30, s1_28, s0_30, s1_28, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_178, out s1_179, out a0_49, out a2_180, out a3_52, out a4_181, out a5_182, out mstatus_183);
	if (a0_49 != 0x00)
	{
		word32 s1_184;
		word32 a0_185;
		word32 a1_186;
		word32 a2_187;
		word32 a3_188;
		word32 a4_189;
		word32 a5_190;
		word32 a7_191;
		word32 s2_192;
		word32 s3_193;
		word32 s4_194;
		word32 s5_195;
		word32 s6_196;
		word32 s7_197;
		word32 s8_198;
		word32 s9_199;
		word32 s10_200;
		word32 s11_201;
		word32 t4_202;
		printf(ra_58, &g_t230B8CB8, a3_52, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_184, out a0_185, out a1_186, out a2_187, out a3_188, out a4_189, out a5_190, out a7_191, out s2_192, out s3_193, out s4_194, out s5_195, out s6_196, out s7_197, out s8_198, out s9_199, out s10_200, out s11_201, out t4_202);
	}
}

// 230416E8: void health_period_set(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg60, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124)
void health_period_set(Eq_2 ra, Eq_2 a3, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg60, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124)
{
	Eq_2 s11_26;
	Eq_2 s2_27;
	Eq_2 s4_29;
	Eq_2 s6_31;
	Eq_2 s7_32;
	Eq_2 s9_34;
	Eq_2 ra_23 = health_period_set_unrel(ra, a3, a5, dwLoc08, dwArg18, dwArg60, dwArg88, dwArgAC, out s2_27, out s4_29, out s6_31, out s7_32, out s9_34, out s11_26);
	send_health_period_status(ra_23, s2_27, s4_29, s6_31, s7_32, s9_34, s11_26, mstatus, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124);
}

// 23041708: void health_period_get(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124)
void health_period_get(Eq_2 ra, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124)
{
	send_health_period_status(ra, s2, s4, s6, s7, s9, s11, mstatus, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124);
}

// 2304170C: void health_fault_test_unrel(Register word32 ra, Register (ptr32 Eq_217405) s1, Register Eq_2 a5, Stack word32 dwArg00, Stack word32 dwArg04, Stack word32 dwArg44)
void health_fault_test_unrel(word32 ra, struct Eq_217405 * s1, Eq_2 a5, word32 dwArg00, word32 dwArg04, word32 dwArg44)
{
	word32 a0_10 = s1->dw0018;
	Eq_2 a5_19;
	word32 a2_92;
	word32 a1_91;
	Eq_2 a0_16 = net_buf_simple_pull_u8(a5, out a1_91, out a2_92, out a5_19);
	struct Eq_217423 * a5_27;
	word32 a4_95;
	word32 a2_94;
	word32 a1_93;
	Eq_2 a0_23 = net_buf_simple_pull_le16(a5_19, out a1_93, out a2_94, out a4_95, out a5_27);
	word32 s1_28 = a5_27->dw0004;
	if (a5_27 == null)
		return;
	<anonymous> * t1_29 = a5_27->ptr000C;
	if (t1_29 == null)
		return;
	word32 t1_50;
	t1_29();
}

// 23041750: void health_fault_clear_unrel(Register word32 ra, Register word32 s0, Register (ptr32 Eq_217449) s1, Register Eq_2 a5, Stack word32 dwArg10, Stack word32 dwArg14)
void health_fault_clear_unrel(word32 ra, word32 s0, struct Eq_217449 * s1, Eq_2 a5, word32 dwArg10, word32 dwArg14)
{
	word32 a0_10 = s1->dw0018;
	struct Eq_217457 * a5_19;
	word32 a4_75;
	word32 a2_74;
	word32 a1_73;
	Eq_2 a0_15 = net_buf_simple_pull_le16(a5, out a1_73, out a2_74, out a4_75, out a5_19);
	word32 s1_20 = a5_19->dw0004;
	if (a5_19 == null)
		return;
	<anonymous> * t1_21 = a5_19->ptr0008;
	if (t1_21 == null)
		return;
	word32 t1_41;
	t1_21();
}

// 23041786: Register Eq_2 health_get_registered(Register Eq_2 ra, Register (ptr32 Eq_217482) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out (ptr32 byte) s1Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s11Out)
// Called from:
//      health_fault_test
//      health_fault_clear
//      health_fault_get
Eq_2 health_get_registered(Eq_2 ra, struct Eq_217482 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0128, ptr32 & s0Out, byte & s1Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s11Out)
{
	ptr32 s9_113;
	ptr32 s7_112;
	ptr32 s6_111;
	ptr32 s4_138;
	ptr32 s2_136;
	ptr32 s11_109;
	byte * s1_133;
	Eq_2 ra_132;
	struct Eq_217508 * s4_17 = a0->ptr0018;
	word32 * a2_28;
	Eq_2 a4_29;
	word32 a5_246;
	word32 a1_245;
	bt_mesh_model_msg_init(0x05, a5, out a1_245, out a2_28, out a4_29, out a5_246);
	Eq_2 a5_37;
	word32 a1_247;
	Eq_2 a0_35 = net_buf_simple_add(a2, 0x01, a4_29, out a1_247, out a5_37);
	word32 a5_249;
	word32 a4_248;
	net_buf_simple_add_le16(a2, a1, a5_37, out a4_248, out a5_249);
	Eq_2 a5_45 = s4_17->t0004;
	if (a5_45 != 0x00 && *((word32) a5_45 + 4) != null)
	{
		word32 a4_262;
		Eq_2 a0_77 = net_buf_simple_tailroom(a2, out a4_262);
		word32 s0_81 = *a2_28;
		<anonymous> * a5_83 = *((word32) s4_17->t0004 + 4);
		struct Eq_217600 * sp_91;
		Eq_2 s0_93;
		word32 a0_98;
		Eq_2 a3_102;
		Eq_2 a4_103;
		a5_83();
		if (a0_98 == 0x00)
		{
			word32 a1_263;
			word32 a5_264;
			net_buf_simple_add(s0_93, (word32) sp_91->b000F, a4_103, out a1_263, out a5_264);
			goto l23041808;
		}
		word32 a0_265;
		word32 a1_266;
		word32 a2_267;
		word32 a3_268;
		word32 a4_269;
		word32 a5_270;
		word32 a7_271;
		word32 s3_272;
		word32 s5_273;
		word32 s8_274;
		word32 s10_275;
		word32 t4_276;
		ra_132 = printf(ra_132, &g_t230B8C30, a3_102, sp_91->t0008, sp_91->t0028, sp_91->t0070, sp_91->t0074, sp_91->t0098, sp_91->t00BC, out s1_133, out a0_265, out a1_266, out a2_267, out a3_268, out a4_269, out a5_270, out a7_271, out s2_136, out s3_272, out s4_138, out s5_273, out s6_111, out s7_112, out s8_274, out s9_113, out s10_275, out s11_109, out t4_276);
	}
	else
	{
		word32 a2_252;
		word32 a3_253;
		word32 a4_254;
		word32 a0_250;
		word32 a1_251;
		word32 a5_255;
		word32 a7_256;
		word32 s3_257;
		word32 s5_258;
		word32 s8_259;
		word32 s10_260;
		word32 t4_261;
		ra_132 = printf(ra, &g_t230B8C50, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_133, out a0_250, out a1_251, out a2_252, out a3_253, out a4_254, out a5_255, out a7_256, out s2_136, out s3_257, out s4_138, out s5_258, out s6_111, out s7_112, out s8_259, out s9_113, out s10_260, out s11_109, out t4_261);
	}
	*s1_133 = 0x00;
l23041808:
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_133;
	s2Out = s2_136;
	s4Out = s4_138;
	s6Out = s6_111;
	s7Out = s7_112;
	s9Out = s9_113;
	s11Out = s11_109;
	return ra_132;
}

// 23041826: void health_fault_test(Register Eq_2 ra, Register (ptr32 Eq_217482) a0, Register word32 a1, Register Eq_2 a3, Register ptr32 mstatus)
void health_fault_test(Eq_2 ra, struct Eq_217482 * a0, word32 a1, Eq_2 a3, ptr32 mstatus)
{
	struct Eq_217508 * s3_18 = a0->ptr0018;
	Eq_2 a5_31;
	word32 a1_240;
	word32 a2_241;
	net_buf_simple_pull_u8(fp + -0x0068, out a1_240, out a2_241, out a5_31);
	word32 a1_36;
	word32 a2_242;
	word32 a4_243;
	word32 a5_244;
	Eq_2 a0_35 = net_buf_simple_pull_le16(a5_31, out a1_36, out a2_242, out a4_243, out a5_244);
	struct Eq_217706 * sp_3 = fp + -144;
	struct Eq_217482 * s0_20 = a0;
	Eq_2 a5_40 = s3_18->t0004;
	Eq_2 s1_41 = a0_35;
	if (a5_40 != 0x00)
	{
		a5_40 = *((word32) a5_40 + 0x0C);
		if (a5_40 != 0x00)
		{
			word32 a0_53;
			a5_40();
			if (a0_53 != 0x00)
			{
				word32 s1_251;
				word32 a0_252;
				word32 a1_253;
				word32 a2_254;
				word32 a3_255;
				word32 a4_256;
				word32 a5_257;
				word32 a7_258;
				word32 s2_259;
				word32 s3_260;
				word32 s4_261;
				word32 s5_262;
				word32 s6_263;
				word32 s7_264;
				word32 s8_265;
				word32 s9_266;
				word32 s10_267;
				word32 s11_268;
				word32 t4_269;
				printf(ra, &g_t230B8BD8, a3, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_251, out a0_252, out a1_253, out a2_254, out a3_255, out a4_256, out a5_257, out a7_258, out s2_259, out s3_260, out s4_261, out s5_262, out s6_263, out s7_264, out s8_265, out s9_266, out s10_267, out s11_268, out t4_269);
				return;
			}
		}
	}
	Eq_2 s0_80;
	Eq_2 s1_81;
	Eq_2 s11_83;
	Eq_2 s2_84;
	Eq_2 s4_86;
	Eq_2 s6_88;
	Eq_2 s7_89;
	Eq_2 s9_91;
	word32 a0_103;
	Eq_2 a3_106;
	word32 s0_245;
	word32 s1_246;
	word32 a2_247;
	word32 a4_248;
	word32 a5_249;
	word32 mstatus_250;
	Eq_2 ra_112 = bt_mesh_model_send(health_get_registered(ra, s0_20, s1_41, &sp_3->t001C, a3, a5_40, sp_3->t0040, sp_3->t0044, sp_3->t0068, sp_3->t008C, sp_3->t0128, out s0_80, out s1_81, out s2_84, out s4_86, out s6_88, out s7_89, out s9_91, out s11_83), s0_80, s1_81, s0_80, s2_84, &sp_3->t001C, 0x00, s2_84, s4_86, s6_88, s7_89, s9_91, s11_83, mstatus, sp_3->t0018, sp_3->t001C, sp_3->t0020, sp_3->t0024, sp_3->t0028, sp_3->t002C, sp_3->t0034, sp_3->t0048, sp_3->t004C, sp_3->t0068, sp_3->t006C, sp_3->t0074, sp_3->t0078, sp_3->t0088, sp_3->t0098, sp_3->t00A8, sp_3->t00B8, sp_3->t00C8, sp_3->t00D8, sp_3->t00E8, sp_3->t00F4, sp_3->t00F8, sp_3->t0108, sp_3->t0118, sp_3->t0128, sp_3->t0134, sp_3->t0154, out s0_245, out s1_246, out a0_103, out a2_247, out a3_106, out a4_248, out a5_249, out mstatus_250);
	if (a0_103 != 0x00)
	{
		word32 s1_270;
		word32 a0_271;
		word32 a1_272;
		word32 a2_273;
		word32 a3_274;
		word32 a4_275;
		word32 a5_276;
		word32 a7_277;
		word32 s2_278;
		word32 s3_279;
		word32 s4_280;
		word32 s5_281;
		word32 s6_282;
		word32 s7_283;
		word32 s8_284;
		word32 s9_285;
		word32 s10_286;
		word32 s11_287;
		word32 t4_288;
		printf(ra_112, &g_t230B8C00, a3_106, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_270, out a0_271, out a1_272, out a2_273, out a3_274, out a4_275, out a5_276, out a7_277, out s2_278, out s3_279, out s4_280, out s5_281, out s6_282, out s7_283, out s8_284, out s9_285, out s10_286, out s11_287, out t4_288);
	}
}

// 230418B4: void health_fault_clear(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_217482) a0, Register word32 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD4)
void health_fault_clear(Eq_2 ra, Eq_2 s1, struct Eq_217482 * a0, word32 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgD4)
{
	Eq_2 ra_41;
	struct Eq_217508 * s3_16 = a0->ptr0018;
	word32 a2_29;
	word32 a5_279;
	word32 a1_277;
	word32 a4_278;
	Eq_2 a0_27 = net_buf_simple_pull_le16(fp + -0x0068, out a1_277, out a2_29, out a4_278, out a5_279);
	struct Eq_217482 * s0_20 = a0;
	Eq_2 a5_32 = s3_16->t0004;
	Eq_2 s1_33 = a0_27;
	ra_41 = ra;
	if (a5_32 != 0x00)
	{
		a5_32 = *((word32) a5_32 + 8);
		ra_41 = ra;
		if (a5_32 != 0x00)
			a5_32();
	}
	Eq_2 s0_72;
	Eq_2 s1_73;
	Eq_2 s11_75;
	Eq_2 s2_76;
	Eq_2 s4_78;
	Eq_2 s6_80;
	Eq_2 s7_81;
	Eq_2 s9_83;
	word32 a0_95;
	Eq_2 a3_98;
	word32 a5_284;
	word32 mstatus_285;
	word32 a2_282;
	word32 a4_283;
	word32 s1_281;
	word32 s0_280;
	Eq_2 ra_104 = bt_mesh_model_send(health_get_registered(ra_41, s0_20, s1_33, fp - 116, a3, a5_32, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, dwArgA8, out s0_72, out s1_73, out s2_76, out s4_78, out s6_80, out s7_81, out s9_83, out s11_75), s0_72, s1_73, s0_72, s2_76, fp - 116, 0x00, s2_76, s4_78, s6_80, s7_81, s9_83, s11_75, mstatus, dwLoc68, dwLoc64, dwLoc60, dwLoc5C, dwLoc58, dwLoc54, dwLoc4C, dwLoc38, dwLoc34, dwLoc18, dwLoc14, dwLoc0C, dwLoc08, fp + -0x0068, dwArg18, dwArg28, s1, dwArg48, dwArg58, dwArg68, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgD4, out s0_280, out s1_281, out a0_95, out a2_282, out a3_98, out a4_283, out a5_284, out mstatus_285);
	if (a0_95 != 0x00)
	{
		word32 t4_304;
		word32 s11_303;
		word32 s10_302;
		word32 s9_301;
		word32 s8_300;
		word32 s7_299;
		word32 s6_298;
		word32 s5_297;
		word32 s4_296;
		word32 s3_295;
		word32 s2_294;
		word32 a7_293;
		word32 a5_292;
		word32 a4_291;
		word32 a3_290;
		word32 a2_289;
		word32 a1_288;
		word32 a0_287;
		word32 s1_286;
		printf(ra_104, &g_t230B8C00, a3_98, 0x00480000, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_286, out a0_287, out a1_288, out a2_289, out a3_290, out a4_291, out a5_292, out a7_293, out s2_294, out s3_295, out s4_296, out s5_297, out s6_298, out s7_299, out s8_300, out s9_301, out s10_302, out s11_303, out t4_304);
	}
}

// 23041922: void health_fault_get(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_217482) a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE4)
void health_fault_get(Eq_2 ra, Eq_2 s0, struct Eq_217482 * a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgE4)
{
	Eq_2 a5_26;
	Eq_2 s0_39;
	Eq_2 s1_40;
	Eq_2 s11_42;
	Eq_2 s2_43;
	Eq_2 s4_45;
	Eq_2 s6_47;
	Eq_2 s7_48;
	Eq_2 s9_50;
	word32 a0_61;
	Eq_2 a3_64;
	word32 a4_193;
	word32 a2_192;
	word32 s1_191;
	word32 s0_190;
	word32 a4_189;
	word32 a2_188;
	word32 a1_187;
	word32 a5_194;
	word32 mstatus_195;
	Eq_2 ra_70 = bt_mesh_model_send(health_get_registered(ra, a0, net_buf_simple_pull_le16(fp + -88, out a1_187, out a2_188, out a4_189, out a5_26), fp + -100, a3, a5_26, dwLoc30, dwLoc2C, dwLoc08, dwArg1C, dwArgB8, out s0_39, out s1_40, out s2_43, out s4_45, out s6_47, out s7_48, out s9_50, out s11_42), s0_39, s1_40, s0_39, s1_40, fp + -100, 0x00, s2_43, s4_45, s6_47, s7_48, s9_50, s11_42, mstatus, dwLoc58, dwLoc54, dwLoc50, dwLoc4C, dwLoc48, dwLoc44, s0, dwLoc28, dwLoc24, dwLoc08, dwLoc04, dwArg04, dwArg08, fp + -88, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgE4, out s0_190, out s1_191, out a0_61, out a2_192, out a3_64, out a4_193, out a5_194, out mstatus_195);
	if (a0_61 != 0x00)
	{
		word32 s1_196;
		word32 a0_197;
		word32 a1_198;
		word32 a2_199;
		word32 a3_200;
		word32 a4_201;
		word32 a5_202;
		word32 a7_203;
		word32 s2_204;
		word32 s3_205;
		word32 s4_206;
		word32 s5_207;
		word32 s6_208;
		word32 s7_209;
		word32 s8_210;
		word32 s9_211;
		word32 s10_212;
		word32 s11_213;
		word32 t4_214;
		printf(ra_70, &g_t230B8C00, a3_64, 0x00480000, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_196, out a0_197, out a1_198, out a2_199, out a3_200, out a4_201, out a5_202, out a7_203, out s2_204, out s3_205, out s4_206, out s5_207, out s6_208, out s7_209, out s8_210, out s9_211, out s10_212, out s11_213, out t4_214);
	}
}

