pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23041972: void health_pub_update(Register Eq_2 ra, Register (ptr32 Eq_218274) a0, Register Eq_2 a3, Register Eq_2 a5, Register word32 s4, Register Eq_2 s6, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArg0128)
void health_pub_update(Eq_2 ra, struct Eq_218274 * a0, Eq_2 a3, Eq_2 a5, word32 s4, Eq_2 s6, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArg0128)
{
	struct Eq_218284 * s2_102;
	byte * s3_146;
	struct Eq_218286 * s1_142;
	uint16 * s5_148;
	struct Eq_218288 * s2_21 = a0->ptr0008;
	struct Eq_218292 * s6_22 = a0->ptr0018;
	Eq_2 s0_24 = s2_21->t0014;
	word32 * a2_30;
	Eq_2 a4_31;
	word32 a1_266;
	word32 a5_267;
	bt_mesh_model_msg_init(0x04, a5, out a1_266, out a2_30, out a4_31, out a5_267);
	word32 a5_269;
	word32 a1_268;
	Eq_2 a0_37 = net_buf_simple_add(s0_24, 0x01, a4_31, out a1_268, out a5_269);
	word32 a1_270;
	word32 a5_271;
	Eq_2 a0_43 = net_buf_simple_add(s0_24, 0x02, a4_31, out a1_270, out a5_271);
	word32 a5_272;
	struct Eq_189068 * a0_47 = bt_mesh_comp_get(out a5_272);
	struct Eq_218332 * sp_164 = fp + -48;
	byte bLoc23_205 = SLICE(s4, byte, 8);
	<anonymous> ** a5_49 = s6_22->ptr0004;
	if (a5_49 != null && *a5_49 != null)
	{
		word32 a4_288;
		Eq_2 a0_82 = net_buf_simple_tailroom(s0_24, out a4_288);
		word32 s0_87 = *a2_30;
		bLoc23_205 = (byte) a0_82;
		<anonymous> * a5_89 = *s6_22->ptr0004;
		Eq_2 ra_96;
		struct Eq_218405 * s1_97;
		Eq_2 s0_101;
		word32 a0_104;
		Eq_2 a3_108;
		Eq_2 a4_109;
		a5_89();
		if (a0_104 == 0x00)
		{
			uint32 a5_122 = (word32) sp_164->w000E;
			s1_97->b0000 = (byte) a5_122;
			Eq_2 a1_125 = (word32) sp_164->b000D;
			s1_97->b0001 = (byte) (a5_122 >> 8);
			word32 a5_290;
			word32 a1_289;
			net_buf_simple_add(s0_101, a1_125, a4_109, out a1_289, out a5_290);
			goto l23041A24;
		}
		word32 a0_291;
		word32 a1_292;
		word32 a2_293;
		word32 a3_294;
		word32 a4_295;
		word32 a5_296;
		word32 a7_297;
		word32 s4_298;
		word32 s6_299;
		word32 s7_300;
		word32 s8_301;
		word32 s9_302;
		word32 s10_303;
		word32 s11_304;
		word32 t4_305;
		printf(ra_96, &g_t230B8C30, a3_108, sp_164->t0008, sp_164->t0028, sp_164->t0070, sp_164->t0074, sp_164->t0098, sp_164->t00BC, out s1_142, out a0_291, out a1_292, out a2_293, out a3_294, out a4_295, out a5_296, out a7_297, out s2_102, out s3_146, out s4_298, out s5_148, out s6_299, out s7_300, out s8_301, out s9_302, out s10_303, out s11_304, out t4_305);
	}
	else
	{
		word32 t4_287;
		word32 s9_284;
		word32 s10_285;
		word32 s11_286;
		word32 s6_281;
		word32 s7_282;
		word32 s8_283;
		word32 a5_278;
		word32 a7_279;
		word32 s4_280;
		word32 a2_275;
		word32 a3_276;
		word32 a4_277;
		word32 a0_273;
		word32 a1_274;
		printf(ra, &g_t230B8C50, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_142, out a0_273, out a1_274, out a2_275, out a3_276, out a4_277, out a5_278, out a7_279, out s2_102, out s3_146, out s4_280, out s5_148, out s6_281, out s7_282, out s8_283, out s9_284, out s10_285, out s11_286, out t4_287);
	}
	uint32 a5_157 = (word32) *s5_148;
	s1_142->b0000 = (byte) a5_157;
	s1_142->b0001 = (byte) (a5_157 >> 8);
	*s3_146 = 0x00;
	sp_164->b000D = 0x00;
l23041A24:
	s2_102->b000B = (byte) ((word32) s2_102->b000B & -33 | (word32) ((word32) bLoc23_205 != 0x00) << 0x05);
	0x00 = dwArg0128;
}

Eq_2 g_t2304198A = 
	{
		-0x007B
	};
// 23041A62: void bt_mesh_health_srv_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack word32 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118)
// Called from:
//      mod_init
void bt_mesh_health_srv_init(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, word32 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArg0118)
{
	struct Eq_274 * a0_45;
	if (s0 == 0x00)
	{
		if (a1 == 0x00)
			goto l23041A74;
		a0_45 = (struct Eq_274 *) &g_t230B8AF8;
	}
	else
	{
		if (a4 != 0x00)
		{
			g_t2304198A = a4;
			word32 s2_34;
			word32 s5_185;
			word32 s4_184;
			word32 s3_183;
			word32 a5_182;
			word32 a4_181;
			word32 a3_180;
			word32 a0_179;
			*k_delayed_work_init(ra, s0, (word32) s0 + 8, a3, a4, mstatus, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a0_179, out a3_180, out a4_181, out a5_182, out s2_34, out s3_183, out s4_184, out s5_185) = s0;
			if (s2_34 != 0x00)
				g_t420265A4 = s0;
l23041A74:
			goto l23041A86;
		}
		a0_45 = (struct Eq_274 *) &g_t230B8B1C;
	}
	word32 a0_187;
	word32 a1_188;
	word32 s1_186;
	word32 a2_189;
	word32 a3_190;
	word32 a4_191;
	word32 a5_192;
	word32 a7_193;
	word32 s2_194;
	word32 s3_195;
	word32 s4_196;
	word32 s5_197;
	word32 s6_198;
	word32 s7_199;
	word32 s8_200;
	word32 s9_201;
	word32 s10_202;
	word32 s11_203;
	word32 t4_204;
	printf(ra, a0_45, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_186, out a0_187, out a1_188, out a2_189, out a3_190, out a4_191, out a5_192, out a7_193, out s2_194, out s3_195, out s4_196, out s5_197, out s6_198, out s7_199, out s8_200, out s9_201, out s10_202, out s11_203, out t4_204);
l23041A86:
	0x00 = dwArg38;
}

// 23041ACC: Register Eq_2 bt_mesh_attention(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_218621) a5, Register ptr32 mstatus, Stack ptr32 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      attention_set_unrel
//      prov_invite
//      bt_mesh_pb_gatt_close
Eq_2 bt_mesh_attention(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, struct Eq_218621 * a5, ptr32 mstatus, ptr32 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		a5 = (struct Eq_218621 *) &g_dw42026000;
		Eq_2 s0_16 = g_t420265A4;
		if (s0_16 == 0x00)
		{
			ptr32 a0_174;
			ptr32 a3_179;
			ptr32 a4_180;
			Eq_2 s1_183;
			ptr32 s11_185;
			Eq_2 s4_188;
			ptr32 s5_189;
			ptr32 s6_190;
			ptr32 s7_191;
			ptr32 s8_192;
			ptr32 s9_193;
			word32 a1_363;
			word32 a2_364;
			word32 a5_365;
			word32 s2_367;
			word32 a7_366;
			word32 s10_369;
			word32 s3_368;
			word32 t4_370;
			Eq_2 ra_182 = printf(ra, &g_t230B8AD8, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_183, out a0_174, out a1_363, out a2_364, out a3_179, out a4_180, out a5_365, out a7_366, out s2_367, out s3_368, out s4_188, out s5_189, out s6_190, out s7_191, out s8_192, out s9_193, out s10_369, out s11_185, out t4_370);
			s0Out = s0_16;
			s1Out = s1_183;
			a0Out = a0_174;
			a3Out = a3_179;
			a4Out = a4_180;
			s4Out = s4_188;
			s5Out = s5_189;
			s6Out = s6_190;
			s7Out = s7_191;
			s8Out = s8_192;
			s9Out = s9_193;
			s11Out = s11_185;
			mstatusOut = mstatus;
			return ra_182;
		}
		s0 = *s1;
	}
	else
		s1 = a0;
	Eq_2 s2_19 = (word32) s0 + 8;
	if (a1 == 0x00)
	{
		ptr32 a0_31;
		ptr32 a3_33;
		ptr32 a4_34;
		struct Eq_218719 * a5_35;
		word32 s2_37;
		word32 a1_39;
		ptr32 s5_44;
		ptr32 s6_45;
		word32 a2_371;
		word32 s3_372;
		word32 s4_373;
		word32 s8_374;
		Eq_2 s1_36 = k_delayed_work_cancel(s2_19, a3, a4, mstatus, dwArg14, dwArg18, dwArg88, dwArg98, dwArgC8, dwArg0108, out a0_31, out a1_39, out a2_371, out a3_33, out a4_34, out a5_35, out s2_37, out s3_372, out s4_373, out s5_44, out s6_45, out s8_374);
		Eq_2 s0_53 = a5_35->t0004;
		if (a5_35 != null)
		{
			<anonymous> * t1_54 = a5_35->ptr0014;
			if (t1_54 != null)
			{
				Eq_2 ra_70;
				Eq_2 s0_71;
				Eq_2 s1_72;
				ptr32 a0_74;
				word32 a5_75;
				ptr32 s8_76;
				Eq_2 s4_78;
				word32 t1_82;
				ptr32 mstatus_83;
				ptr32 a4_84;
				ptr32 a3_85;
				word32 tp_86;
				ptr32 s5_89;
				ptr32 s6_90;
				word32 t5_93;
				word32 t6_94;
				word32 s10_224;
				ptr32 s11_225;
				ptr32 s7_226;
				ptr32 s9_227;
				t1_54();
				s0Out = s0_71;
				s1Out = s1_72;
				a0Out = a0_74;
				a3Out = a3_85;
				a4Out = a4_84;
				s4Out = s4_78;
				s5Out = s5_89;
				s6Out = s6_90;
				s7Out = s7_226;
				s8Out = s8_76;
				s9Out = s9_227;
				s11Out = s11_225;
				mstatusOut = mstatus_83;
				return ra_70;
			}
		}
		s0Out = s0_53;
		s1Out = s1_36;
		a0Out = a0_31;
		a3Out = a3_33;
		a4Out = a4_34;
		s4Out = dwArg04;
		s5Out = s5_44;
		s6Out = s6_45;
		s7Out = s7;
		s8Out = dwLoc1C;
		s9Out = s9;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		word32 s0_97 = a5->dw0004;
		if (a5 != null)
		{
			<anonymous> * a5_98 = a5->ptr0010;
			if (a5_98 != null)
			{
				word32 t1_115;
				word32 tp_119;
				word32 t5_126;
				word32 t6_127;
				word32 s10_229;
				a5_98();
			}
		}
		Eq_2 a1_131 = (word32) a1 + 1000;
		ptr32 a0_144;
		ptr32 a3_146;
		ptr32 a4_147;
		Eq_2 s1_150;
		Eq_2 s4_153;
		ptr32 s8_154;
		ptr32 s5_160;
		ptr32 s6_161;
		word32 a1_375;
		word32 a2_376;
		word32 a5_377;
		word32 s2_378;
		word32 s3_379;
		s0Out = k_delayed_work_submit(a1_131, a3, a4, mstatus, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_150, out a0_144, out a1_375, out a2_376, out a3_146, out a4_147, out a5_377, out s2_378, out s3_379, out s4_153, out s5_160, out s6_161, out s8_154);
		s1Out = s1_150;
		a0Out = a0_144;
		a3Out = a3_146;
		a4Out = a4_147;
		s4Out = s4_153;
		s5Out = s5_160;
		s6Out = s6_161;
		s7Out = s7;
		s8Out = s8_154;
		s9Out = s9;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
}

// 23041B5A: Register Eq_2 attention_set_unrel(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack ptr32 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      attention_set
Eq_2 attention_set_unrel(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, ptr32 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_218621 * a5_16;
	word32 a1_87;
	word32 a2_88;
	Eq_2 a0_13 = net_buf_simple_pull_u8(a5, out a1_87, out a2_88, out a5_16);
	ptr32 s0_34;
	ptr32 s1_35;
	ptr32 s4_38;
	ptr32 s6_40;
	ptr32 mstatus_49;
	ptr32 s11_52;
	ptr32 s7_53;
	ptr32 s9_54;
	word32 a0_89;
	word32 a3_90;
	word32 a4_91;
	word32 s5_92;
	word32 s8_93;
	Eq_2 ra_50 = bt_mesh_attention(ra, s0, s1, a0, a0_13, a3, a4, a5_16, mstatus, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg24, dwArg28, dwArg70, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s0_34, out s1_35, out a0_89, out a3_90, out a4_91, out s4_38, out s5_92, out s6_40, out s7_53, out s8_93, out s9_54, out s11_52, out mstatus_49);
	s0Out = s0_34;
	s1Out = s1_35;
	s4Out = s4_38;
	s6Out = s6_40;
	s7Out = s7_53;
	s9Out = s9_54;
	s11Out = s11_52;
	mstatusOut = mstatus_49;
	return ra_50;
}

// 23041B76: void attention_set(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg60, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0124, Stack word32 dwArg0128, Stack Eq_2 dwArg0138)
void attention_set(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg60, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0124, word32 dwArg0128, Eq_2 dwArg0138)
{
	ptr32 mstatus_26;
	Eq_2 s0_28;
	Eq_2 s1_29;
	Eq_2 s11_31;
	Eq_2 s4_34;
	Eq_2 s6_36;
	Eq_2 s7_37;
	Eq_2 s9_39;
	Eq_2 ra_27 = attention_set_unrel(ra, a0, a1, a0, a3, a4, a5, mstatus, dwLoc10, s0, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg60, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s0_28, out s1_29, out s4_34, out s6_36, out s7_37, out s9_39, out s11_31, out mstatus_26);
	send_attention_status(ra_27, s0, s0_28, s1_29, s4_34, s6_36, s7_37, s9_39, s11_31, mstatus_26, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, dwArg0128);
}

// 23041B96: Register Eq_2 bt_mesh_provision(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      prov_data
Eq_2 bt_mesh_provision(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	word32 s0_41 = 0x00;
	word32 t4_600;
	word32 s10_598;
	word32 s11_599;
	word32 s8_596;
	word32 s9_597;
	word32 s6_594;
	word32 s7_595;
	word32 s4_592;
	word32 s5_593;
	word32 a7_590;
	word32 s3_591;
	word32 a4_588;
	word32 a5_589;
	word32 a1_586;
	word32 a2_587;
	word32 a0_585;
	word32 s1_584;
	word32 s2_54;
	Eq_2 a3_47;
	Eq_2 ra_50 = printf(ra, &g_t230B8CE0, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_584, out a0_585, out a1_586, out a2_587, out a3_47, out a4_588, out a5_589, out a7_590, out s2_54, out s3_591, out s4_592, out s5_593, out s6_594, out s7_595, out s8_596, out s9_597, out s10_598, out s11_599, out t4_600);
	do
	{
		++s0_41;
		word32 s9_96;
		word32 t4_616;
		word32 s10_614;
		word32 s11_615;
		word32 s7_612;
		word32 s8_613;
		word32 s5_610;
		word32 s6_611;
		word32 s3_608;
		word32 s4_609;
		word32 a5_606;
		word32 a7_607;
		word32 a2_604;
		word32 a4_605;
		word32 a0_602;
		word32 a1_603;
		word32 s1_601;
		ra_50 = printf(ra_50, s2_54 + 0x0668, a3_47, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_601, out a0_602, out a1_603, out a2_604, out a3_47, out a4_605, out a5_606, out a7_607, out s2_54, out s3_608, out s4_609, out s5_610, out s6_611, out s7_612, out s8_613, out s9_96, out s10_614, out s11_615, out t4_616);
	} while (s0_41 != s9_96);
	word32 s11_632;
	word32 t4_633;
	word32 s9_630;
	word32 s10_631;
	word32 s6_628;
	word32 s7_629;
	word32 s4_626;
	word32 s5_627;
	word32 s2_624;
	word32 s3_625;
	word32 a5_622;
	word32 a7_623;
	word32 a2_620;
	word32 a4_621;
	word32 a0_618;
	word32 a1_619;
	word32 s1_617;
	word32 s8_119;
	Eq_2 a3_106;
	Eq_2 ra_109 = printf(ra_50, &g_t230B8D00, a3_47, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_617, out a0_618, out a1_619, out a2_620, out a3_106, out a4_621, out a5_622, out a7_623, out s2_624, out s3_625, out s4_626, out s5_627, out s6_628, out s7_629, out s8_119, out s9_630, out s10_631, out s11_632, out t4_633);
	Eq_2 s0_123 = 0x00;
	do
	{
		s0_123 = (word32) s0_123 + 1;
		Eq_2 s2_148;
		Eq_2 s6_152;
		word32 t4_648;
		word32 s10_646;
		word32 s11_647;
		word32 s7_644;
		word32 s9_645;
		word32 s4_642;
		word32 s5_643;
		word32 a7_640;
		word32 s3_641;
		word32 a4_638;
		word32 a5_639;
		word32 a1_636;
		word32 a2_637;
		word32 s1_634;
		word32 a0_635;
		ra_109 = printf(ra_109, s8_119 + 0x0668, a3_106, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_634, out a0_635, out a1_636, out a2_637, out a3_106, out a4_638, out a5_639, out a7_640, out s2_148, out s3_641, out s4_642, out s5_643, out s6_152, out s7_644, out s8_119, out s9_645, out s10_646, out s11_647, out t4_648);
	} while (s0_123 != s2_148);
	Eq_2 a3_168;
	Eq_2 a4_169;
	word32 t4_664;
	word32 s10_662;
	word32 s11_663;
	word32 s8_660;
	word32 s9_661;
	word32 s6_658;
	word32 s7_659;
	word32 s3_656;
	word32 s4_657;
	word32 a7_654;
	word32 s2_655;
	word32 a2_652;
	word32 a5_653;
	word32 a0_650;
	word32 a1_651;
	word32 s1_649;
	Eq_2 s5_178;
	Eq_2 ra_171 = printf(ra_109, &g_t230B8D20, s6_152, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_649, out a0_650, out a1_651, out a2_652, out a3_168, out a4_169, out a5_653, out a7_654, out s2_655, out s3_656, out s4_657, out s5_178, out s6_658, out s7_659, out s8_660, out s9_661, out s10_662, out s11_663, out t4_664);
	ui32 a0_191;
	word32 s8_670;
	word32 a5_668;
	word32 s4_669;
	word32 a2_666;
	word32 a4_667;
	word32 a1_665;
	Eq_2 a3_194;
	Eq_2 s1_197 = atomic_or(s0_123, 0x01, a3_168, a4_169, mstatus, out a0_191, out a1_665, out a2_666, out a3_194, out a4_667, out a5_668, out s4_669, out s8_670);
	Eq_2 s0_202 = -69;
	if ((a0_191 & 0x01) == 0x00)
	{
		Eq_2 s2_217;
		ui32 s4_219;
		Eq_2 s5_220;
		Eq_2 a0_236;
		Eq_2 a3_239;
		Eq_2 a4_240;
		Eq_2 s1_246;
		struct Eq_2096 * s11_248;
		word32 s6_253;
		word32 s7_254;
		word32 a3_672;
		word32 s1_671;
		ra_171 = bt_mesh_net_create(bt_mesh_proxy_prov_disable(ra_171, -69, a0_191 & 0x01, 0x4200D000, mstatus, dwLoc30, s8, s6, s4, s2, s0, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, s7, s5, s3, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s1_671, out a3_672, out s2_217, out s4_219, out s5_220, out mstatus), s4_219, s5_220, s2_217, mstatus, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_246, out a0_236, out a3_239, out a4_240, out s5_178, out s6_253, out s7_254, out s11_248);
		s0_202 = a0_236;
		if (a0_236 != 0x00)
		{
			Eq_2 a4_324;
			Eq_2 s4_327;
			word32 s8_328;
			word32 a0_678;
			word32 a1_679;
			word32 a2_680;
			word32 a5_681;
			s1_197 = atomic_and(a0_236, ~0x01, a3_239, a4_240, mstatus, out a0_678, out a1_679, out a2_680, out a3_194, out a4_324, out a5_681, out s4_327, out s8_328);
			if (s8_328 == 0x00)
			{
				word32 a5_682;
				ra_171 = bt_mesh_proxy_prov_enable(ra_171, a0_236, a3_194, a4_324, s4_327, s5_178, s6_253, s11_248, mstatus, s8, s6, s4, dwLoc18, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg28, dwArg30, dwArg38, dwArg48, dwArg4C, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgE8, out s1_197, out a3_194, out a5_682, out s5_178, out mstatus);
			}
		}
		else
		{
			g_t4200D6C0.u0 = 0x00;
			bt_mesh_comp_provision(s7_254, a3_239);
			Eq_2 a4_277;
			Eq_2 a3_282;
			word32 a1_673;
			word32 a2_674;
			word32 a5_675;
			word32 a6_676;
			word32 a7_677;
			memcpy(0x4200D860, s1_246, 0x10, out a1_673, out a2_674, out a3_282, out a4_277, out a5_675, out a6_676, out a7_677);
			ra_171 = bt_mesh_net_start(ra_171, a0_236, a3_282, a4_277, s11_248, mstatus, s6, s4, s0, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg18, dwArg20, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0128, dwArg0138, out s1_197, out a3_194, out s5_178, out mstatus);
		}
	}
	0x00 = (int8) dwArg0128;
	s1Out = s1_197;
	a0Out = s0_202;
	a3Out = a3_194;
	s5Out = s5_178;
	mstatusOut = mstatus;
	return ra_171;
}

