pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23041C9C: Register Eq_2 bt_mesh_reset(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out ptr32 a3Out)
// Called from:
//      blemesh_reset
//      node_reset
Eq_2 bt_mesh_reset(Eq_2 ra, Eq_2 s0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, ptr32 & a3Out)
{
	if ((atomic_get(0x4200D6C4) & 0x01) == 0x00)
	{
		a3Out = a3;
		return ra;
	}
	else
	{
		g_t4200D6BC.u0 = 0x00;
		g_t4200D6C0.u0 = 0x00;
		Eq_2 a3_25;
		Eq_2 a4_26;
		word32 t1_404;
		word32 a0_405;
		word32 a1_406;
		word32 a2_407;
		word32 a5_408;
		Eq_2 ra_28 = memset(ra, 0x4200D6C4, 0x00, 0x04, out t1_404, out a0_405, out a1_406, out a2_407, out a3_25, out a4_26, out a5_408);
		word32 a0_409;
		word32 a1_410;
		word32 a2_411;
		word32 a3_412;
		word32 a4_413;
		word32 a5_414;
		word32 s2_415;
		word32 s3_416;
		word32 s4_417;
		word32 s5_418;
		word32 s6_419;
		word32 s8_420;
		k_delayed_work_cancel(0x4200D83C, a3_25, a4_26, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_409, out a1_410, out a2_411, out a3_412, out a4_413, out a5_414, out s2_415, out s3_416, out s4_417, out s5_418, out s6_419, out s8_420);
		Eq_2 a3_60;
		Eq_2 a4_61;
		Eq_2 a3_79;
		Eq_2 a4_80;
		Eq_2 s2_86;
		Eq_2 a3_102;
		Eq_2 a4_103;
		ptr32 mstatus_107;
		Eq_2 s3_114;
		Eq_2 s4_115;
		Eq_2 s5_116;
		Eq_2 s6_117;
		Eq_2 s7_118;
		Eq_2 s8_119;
		ptr32 mstatus_137;
		Eq_2 s0_139;
		Eq_2 a3_161;
		Eq_2 s1_164;
		ptr32 mstatus_170;
		Eq_2 s2_172;
		Eq_2 s3_173;
		ptr32 mstatus_192;
		Eq_2 s2_197;
		Eq_2 s3_198;
		Eq_2 a3_219;
		Eq_2 a4_220;
		Eq_2 a3_227;
		Eq_2 a4_228;
		ptr32 mstatus_232;
		word32 a3_421;
		word32 s4_422;
		word32 s5_423;
		word32 s6_424;
		word32 s8_425;
		word32 t1_426;
		word32 a0_427;
		word32 a1_428;
		word32 a2_429;
		word32 a5_430;
		word32 s1_431;
		word32 s2_432;
		word32 s3_433;
		word32 s4_434;
		word32 s5_435;
		word32 s6_436;
		word32 s7_437;
		word32 s8_438;
		word32 s9_439;
		Eq_2 ra_233 = bt_mesh_scan_disable(memset(bt_mesh_proxy_gatt_disable(bt_mesh_friend_clear_net_idx(bt_mesh_lpn_disable(bt_mesh_tx_reset(bt_mesh_rx_reset(bt_mesh_cfg_reset(ra_28, 0x4200D000, mstatus, s0, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out a3_60, out a4_61), a3_60, a4_61, mstatus, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg20, dwArg24, dwArg40, dwArg44, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out a3_79, out a4_80, out s2_86), 0x4200D000, a3_79, a4_80, s2_86, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg40, dwArg44, dwArg48, dwArg58, dwArg68, ra, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out a3_102, out a4_103, out s3_114, out s4_115, out s5_116, out s6_117, out s7_118, out s8_119, out mstatus_107), 0x01, a3_102, a4_103, s3_114, s4_115, s5_116, s6_117, s7_118, s8_119, mstatus_107, dwLoc10, s0, dwLoc08, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_139, out a3_421, out mstatus_137), s0_139, 0x0FFFFFFF, mstatus_137, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, ra, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s1_164, out a3_161, out s2_172, out s3_173, out s4_422, out s5_423, out s6_424, out s8_425, out mstatus_170), s0_139, s1_164, a3_161, s2_172, s3_173, mstatus_170, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg68, dwArg6C, ra, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s2_197, out s3_198, out mstatus_192), 0x4200D860, 0x00, 0x10, out t1_426, out a0_427, out a1_428, out a2_429, out a3_219, out a4_220, out a5_430), s0_139, a3_219, a4_220, s2_197, s3_198, mstatus_192, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s1_431, out a3_227, out a4_228, out s2_432, out s3_433, out s4_434, out s5_435, out s6_436, out s7_437, out s8_438, out s9_439, out mstatus_232);
		Eq_2 a4_257;
		word32 a5_440;
		word32 s2_441;
		word32 s3_442;
		word32 s4_443;
		word32 s5_444;
		word32 s6_445;
		bt_mesh_beacon_disable(a3_227, a4_228, mstatus_232, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a4_257, out a5_440, out s2_441, out s3_442, out s4_443, out s5_444, out s6_445);
		ptr32 a3_278;
		Eq_2 ra_282 = bt_mesh_comp_unprovision(ra_233, a4_257, dwArg0118, out a3_278);
		bt_mesh_prov_reset();
		a3Out = a3_278;
		return ra_282;
	}
}

// 23041D26: Register ui32 bt_mesh_is_provisioned()
// Called from:
//      blemesh_seg_send
//      blemesh_net_send
//      blemesh_init
//      blemesh_iv_update
//      bt_mesh_lpn_set
//      model_send
//      beacon_send
//      bt_mesh_beacon_enable
//      bt_mesh_prov_enable
//      bt_mesh_prov_disable
//      bt_mesh_net_recv
//      bt_mesh_pb_adv_recv
//      bt_mesh_proxy_identity_enable
//      bt_mesh_proxy_adv_start
ui32 bt_mesh_is_provisioned()
{
	return atomic_get(0x4200D6C4) & 0x01;
}

// 23041D3E: Register Eq_2 bt_mesh_prov_enable(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register word32 s6, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_186119 a0Out, Register out Eq_2 a3Out)
// Called from:
//      blemesh_pb
Eq_2 bt_mesh_prov_enable(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s4, Eq_2 s5, word32 s6, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_186119 & a0Out, union Eq_2 & a3Out)
{
	Eq_2 s0_11 = a0;
	Eq_186119 s1_14 = -69;
	if (bt_mesh_is_provisioned() == 0x00)
	{
		word32 a5_307;
		bt_mesh_prov_get(out a5_307);
		word32 a1_308;
		word32 a2_309;
		word32 a5_310;
		word32 a6_311;
		word32 a7_312;
		Eq_2 a4_107;
		memcpy(fp + -35, a1, 0x10, out a1_308, out a2_309, out a3, out a4_107, out a5_310, out a6_311, out a7_312);
		if ((a0 & 1) != 0x00)
		{
			Eq_2 a3_47;
			Eq_2 a4_48;
			word32 s0_313;
			word32 s1_314;
			word32 a1_315;
			word32 s2_316;
			word32 s3_317;
			word32 s4_318;
			word32 s5_319;
			word32 s6_320;
			word32 s7_321;
			word32 s8_322;
			ra = bt_mesh_scan_enable(ra, a0, -69, a4_107, s2, s4, mstatus, dwLoc2C, 0x00, 0x00, s0, dwLoc18, dwLoc08, dwLoc04, dwArg08, dwArg0C, dwArg20, dwArg24, dwArg28, dwArg38, dwArg48, 0x00, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, out s0_313, out s1_314, out a1_315, out a3_47, out a4_48, out s2_316, out s3_317, out s4_318, out s5_319, out s6_320, out s7_321, out s8_322, out s11, out mstatus);
			word32 a5_323;
			word32 s2_324;
			s0_11 = bt_mesh_beacon_enable(ra, a3_47, a4_48, mstatus, dwLoc2C, 0x00, dwArgC8, dwArg0108, dwArg0148, out a3, out a4_107, out a5_323, out s2_324, out s4, out s5, out s6);
		}
		Eq_2 s0_98 = s0_11 & 0x02;
		s1_14.u0 = 0x00;
		if (s0_98 != 0x00)
		{
			Eq_2 a5_115;
			ptr32 mstatus_123;
			Eq_2 s5_130;
			word32 s1_325;
			word32 a3_326;
			word32 s0_327;
			word32 a0_328;
			word32 a4_329;
			word32 a5_330;
			word32 s2_331;
			word32 s3_332;
			word32 s4_333;
			word32 s5_334;
			word32 s6_335;
			word32 s7_336;
			word32 s8_337;
			word32 s9_338;
			word32 s11_339;
			word32 mstatus_340;
			ra = bt_mesh_adv_update(bt_mesh_proxy_prov_enable(ra, s0_98, a3, a4_107, s4, s5, s6, s11, mstatus, dwLoc2C, 0x00, 0x00, dwLoc18, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg28, dwArg30, dwArg38, dwArg48, dwArg4C, 0x00, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgE8, out s1_325, out a3_326, out a5_115, out s5_130, out mstatus_123), a5_115, s5_130, mstatus_123, dwArg00, dwArg04, dwArg28, dwArg4C, 0x00, dwArg98, dwArgB8, dwArgE8, dwArgF8, dwArg0138, out s0_327, out s1_14, out a0_328, out a3, out a4_329, out a5_330, out s2_331, out s3_332, out s4_333, out s5_334, out s6_335, out s7_336, out s8_337, out s9_338, out s11_339, out mstatus_340);
		}
	}
	a0Out = s1_14;
	a3Out = a3;
	return ra;
}

// 23041D9C: Register Eq_2 bt_mesh_prov_disable(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_186063 a0Out, Register out Eq_2 a3Out)
// Called from:
//      blemesh_pb
Eq_2 bt_mesh_prov_disable(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_186063 & a0Out, union Eq_2 & a3Out)
{
	Eq_186063 s1_111 = -69;
	if (bt_mesh_is_provisioned() == 0x00)
	{
		if ((a0 & 1) != 0x00)
		{
			Eq_2 a4_23;
			Eq_2 s2_28;
			Eq_2 s3_29;
			word32 a5_280;
			word32 s4_281;
			word32 s5_282;
			word32 s6_283;
			word32 s1_284;
			word32 a4_285;
			word32 s3_286;
			word32 s4_287;
			word32 s5_288;
			word32 s6_289;
			word32 s7_290;
			word32 s8_291;
			word32 s9_292;
			ra = bt_mesh_scan_disable(ra, a0, bt_mesh_beacon_disable(a3, a4, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a4_23, out a5_280, out s2_28, out s3_29, out s4_281, out s5_282, out s6_283), a4_23, s2_28, s3_29, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s1_284, out a3, out a4_285, out s2, out s3_286, out s4_287, out s5_288, out s6_289, out s7_290, out s8_291, out s9_292, out mstatus);
		}
		s1_111.u0 = 0x00;
		if ((a0 & 0x02) != 0x00)
		{
			word32 s2_293;
			word32 s4_294;
			word32 s5_295;
			word32 mstatus_296;
			ra = bt_mesh_proxy_prov_disable(ra, a0 & 0x02, 0x01, s2, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg6C, ra, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s1_111, out a3, out s2_293, out s4_294, out s5_295, out mstatus_296);
		}
	}
	a0Out = s1_111;
	a3Out = a3;
	return ra;
}

// 23041DD6: Register Eq_2 bt_mesh_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a4, Register (ptr32 Eq_186267) a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 a0Out, Register out Eq_2 a3Out)
// Called from:
//      blemesh_init
Eq_2 bt_mesh_init(Eq_2 ra, Eq_2 s0, Eq_2 a4, struct Eq_186267 * a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & a0Out, union Eq_2 & a3Out)
{
	Eq_2 a0_16;
	Eq_2 a4_20;
	word32 s1_25;
	Eq_2 a3_135;
	Eq_2 ra_119 = bt_mesh_comp_register(ra, a4, a5, dwArg0108, out s1_25, out a0_16, out a3_135, out a4_20);
	Eq_2 s0_139 = a0_16;
	if (a0_16 == 0x00)
	{
		Eq_2 a0_38;
		Eq_2 a4_42;
		ptr32 mstatus_62;
		ra_119 = bt_mesh_prov_init(ra_119, a0_16, s1_25, a3_135, a4_20, mstatus, s0, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, ra, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out a0_38, out a3_135, out a4_42, out mstatus_62);
		s0_139 = a0_38;
		if (a0_38 == 0x00)
		{
			Eq_2 a4_71;
			Eq_2 a4_86;
			Eq_2 a4_101;
			Eq_2 a5_102;
			Eq_2 a3_115;
			Eq_2 a4_116;
			ra_119 = bt_mesh_adv_init(ra_119, bt_mesh_beacon_init(ra_119, a0_38, bt_mesh_trans_init(ra_119, bt_mesh_net_init(ra_119, a3_135, a4_42, mstatus_62, ra, dwArgA8, dwArgC8, dwArg0108, out a4_71), a4_71, mstatus_62, dwArg28, ra, dwArgA8, dwArgC8, dwArg0108, out a4_86), a4_86, mstatus_62, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a4_101, out a5_102), a4_101, a5_102, mstatus_62, dwLoc10, s0, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out a3_115, out a4_116);
			s0_139 = bt_mesh_proxy_init(ra_119, a3_115, a4_116, mstatus_62, dwArg64, dwArg98, dwArgB8, dwArgF8, out a3_135);
		}
	}
	a0Out = s0_139;
	a3Out = a3_135;
	return ra_119;
}

// 23041E14: Register Eq_2 send_cb_finalize(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_220189) a5, Stack (ptr32 int32) dwArg10, Stack Eq_2 dwArg14, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a1Out)
// Called from:
//      bt_mesh_net_resend
//      bt_mesh_ctl_send
Eq_2 send_cb_finalize(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, struct Eq_220189 * a5, int32 * dwArg10, Eq_2 dwArg14, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a1Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a1Out = a1;
		return ra;
	}
	else
	{
		struct Eq_220198 * a0_12 = a5->t0000;
		Eq_2 s1_14 = a1;
		struct Eq_220198 * s0_15 = a0_12;
		if (a5 != null)
		{
			word32 t1_27;
			word32 tp_28;
			a5();
		}
		<anonymous> * t1_31 = s0_15->ptr0004;
		if (t1_31 == null)
		{
			s0Out = s0;
			s1Out = s1_14;
			a1Out = a1;
			return ra;
		}
		else
		{
			Eq_2 s0_48;
			Eq_2 s1_49;
			Eq_2 ra_50;
			Eq_2 a1_52;
			word32 t1_54;
			t1_31();
			s0Out = s0_48;
			s1Out = s1_49;
			a1Out = a1_52;
			return ra_50;
		}
	}
}

