pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23041E50: Register Eq_2 auth_match(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_220221) a0, Register Eq_2 a1, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Register out Eq_2 s0Out, Register out (ptr32 Eq_220221) s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      bt_mesh_subnet_find
Eq_2 auth_match(Eq_2 ra, Eq_2 s1, struct Eq_220221 * a0, Eq_2 a1, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, union Eq_2 & s0Out, struct Eq_220221 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	ptr32 a5_115;
	struct Eq_220221 * s1_102 = a0;
	ptr32 s2_10 = (char *) a0 + 33;
	ptr32 s3_106 = a2;
	Eq_2 s0_166 = a4;
	word32 a1_223;
	word32 a2_224;
	word32 a5_225;
	ptr32 a4_159;
	ptr32 a3_157;
	if (memcmp(a1, (char *) a0 + 33, 0x08, out a1_223, out a2_224, out a3_157, out a4_159, out a5_225) == 0x00)
	{
		word32 a1_226;
		word32 a3_227;
		word32 a4_228;
		word32 a5_229;
		word32 s4_230;
		word32 s8_231;
		s0_166 = bt_mesh_beacon_auth(ra, (char *) a0 + 73, (char *) a0 + 33, out a1_226, out a3_227, out a4_228, out a5_229, out s3_106, out s4_230, out s5, out s8_231);
		a5_115 = 0x01;
		word32 a1_232;
		word32 a2_233;
		word32 a5_234;
		if (memcmp(s0_166, fp + -40, 0x08, out a1_232, out a2_233, out a3_157, out a4_159, out a5_234) == 0x00)
		{
l23041EB6:
			s0Out = s0_166;
			s1Out = s1_102;
			a0Out = a5_115;
			a3Out = a3_157;
			a4Out = a4_159;
			a5Out = a5_115;
			s2Out = s2_10;
			s3Out = s3_106;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s9Out = s9;
			s10Out = s10;
			return ra;
		}
		word32 a3_235;
		s0_166 = bt_hex_real(s0_166, 0x08, out a3_235);
		Eq_2 a3_84;
		bt_hex_real(fp + -40, 0x08, out a3_84);
		word32 a0_236;
		word32 a1_237;
		word32 a2_238;
		word32 a5_239;
		word32 a7_240;
		word32 s4_241;
		word32 s8_242;
		word32 s11_243;
		word32 t4_244;
		ra = printf(ra, &g_t230B8D6C, a3_84, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_102, out a0_236, out a1_237, out a2_238, out a3_157, out a4_159, out a5_239, out a7_240, out s2_10, out s3_106, out s4_241, out s5, out s6, out s7, out s8_242, out s9, out s10, out s11_243, out t4_244);
	}
	a5_115 = 0x00;
	goto l23041EB6;
}

// 23041EC6: Register Eq_2 net_decrypt.isra.1(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register (ptr32 Eq_220357) a4, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_220364) s0Out, Register out (ptr32 Eq_220365) s1Out, Register out Eq_220366 a0Out, Register out (ptr32 Eq_220367) a1Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_220369) a4Out, Register out (ptr32 Eq_220370) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out (ptr32 Eq_220375) s7Out, Register out (ptr32 Eq_220376) s8Out, Register out (ptr32 Eq_220377) s9Out, Register out (ptr32 Eq_220378) s10Out, Register out ptr32 s11Out)
// Called from:
//      bt_mesh_net_decode
Eq_2 net_decrypt.isra.1(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, struct Eq_220357 * a4, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg7C, Eq_2 dwArgE8, Eq_2 dwArg0198, struct Eq_220364 & s0Out, struct Eq_220365 & s1Out, union Eq_220366 & a0Out, struct Eq_220367 & a1Out, union Eq_2 & a3Out, struct Eq_220369 & a4Out, struct Eq_220370 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, struct Eq_220375 & s7Out, struct Eq_220376 & s8Out, struct Eq_220377 & s9Out, struct Eq_220378 & s10Out, ptr32 & s11Out)
{
	Eq_220366 a0_162;
	Eq_2 a4_31 = g_t4200D6BC & 0x01 ^ (word32) (*a2) >> 7;
	struct Eq_220393 * a5_38 = (word32) a4->b0020 & ~0x01 | a4_31;
	a4->b0020 = (byte) a5_38;
	Eq_2 s0_40 = a5_38->t0008;
	*((word32) s0_40 + 4) = 0x00;
	a5_38->t0000 = s0_40;
	word32 a5_432;
	word32 a1_431;
	Eq_2 a0_46 = net_buf_simple_add(s0_40, a3, a4_31, out a1_431, out a5_432);
	ui32 a5_53;
	word32 a3_435;
	word32 a7_438;
	word32 a6_437;
	word32 a4_436;
	word32 a1_433;
	word32 a2_434;
	memcpy(a0_46, a2, a3, out a1_433, out a2_434, out a3_435, out a4_436, out a5_53, out a6_437, out a7_438);
	word32 a0_71;
	struct Eq_220440 * s4_85;
	word32 s8_441;
	word32 a5_440;
	word32 s0_439;
	struct Eq_220365 * s1_149;
	struct Eq_220369 * a4_146;
	struct Eq_220446 * a2_115;
	struct Eq_220370 * s2_152;
	struct Eq_220378 * s10_150;
	Eq_2 a3_145;
	struct Eq_220367 * a1_143;
	Eq_2 s3_153;
	ptr32 s6_156;
	ptr32 s5_155;
	Eq_2 ra_148 = bt_mesh_net_obfuscate(ra, a0_46, g_t4200D6BC - (a5_53 & 0x01), a1, dwArgE8, out s0_439, out s1_149, out a0_71, out a1_143, out a2_115, out a3_145, out a4_146, out a5_440, out s2_152, out s3_153, out s4_85, out s5_155, out s6_156, out s8_441, out s10_150);
	if (a0_71 == 0x00)
	{
		if (((word32) s1_149->t0020 & 48) == 0x00)
		{
			struct Eq_220446 * s2_110 = s4_85->dw06BC - (s1_149->t0020 & 1) << 8 | (word32) a1_143->b0002;
			struct Eq_220446 * a1_114;
			word32 a3_442;
			word32 a4_443;
			word32 a5_444;
			word32 a6_445;
			word32 a7_446;
			memcpy(fp + -36, &a1_143->b0002 + 1, 0x04, out a1_114, out a2_115, out a3_442, out a4_443, out a5_444, out a6_445, out a7_446);
			do
			{
				struct Eq_220549 * a5_131 = a1_114->ptr0000;
				if (a1_114 == a2_115)
				{
					a5_131 = a1_114->ptr0004;
					if (a1_114 == s2_110)
					{
						word32 a0_447;
						word32 a2_448;
						word32 a5_449;
						word32 a7_450;
						word32 s4_451;
						word32 s8_452;
						word32 t4_453;
						ra_148 = printf(ra_148, &g_t230B9174, 0x42014460, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_149, out a0_447, out a1_143, out a2_448, out a3_145, out a4_146, out a5_449, out a7_450, out s2_152, out s3_153, out s4_451, out s5_155, out s6_156, out s7, out s8_452, out s9, out s10_150, out s11, out t4_453);
						a0_162.u0 = -69;
						goto l23041FFA;
					}
				}
			} while (a5_131 != (struct Eq_220549 *) 3187588008);
			ui32 a5_169 = (word32) g_w4200F434;
			s1_149->w0022 = (word16) a5_169;
			struct Eq_220549 * a4_177 = (a5_169 << 0x03) + 0x42014400;
			a2_115->ptr0000 = a4_177;
			a4_177->ptr0004 = s2_110;
			g_w4200F434 = (word16) ((word32) (word16) (a5_169 + 0x01) & 0x0C);
			a3_145.u0 = 0x4200F434;
			a4_146 = (struct Eq_220369 *) 0x0C;
		}
		int32 a5_195 = (int32) (word16) ((word32) a4_146->b0005 << 8 | (word32) a4_146->b0006);
		s1_149->t0008 = (word16) (word32) (word16) a5_195;
		if (a5_195 <= 0x00)
		{
			word32 a0_454;
			word32 a2_455;
			word32 a5_456;
			word32 a7_457;
			word32 s4_458;
			word32 s8_459;
			word32 t4_460;
			ra_148 = printf(ra_148, &g_t230B91A0, a3_145, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_149, out a0_454, out a1_143, out a2_455, out a3_145, out a4_146, out a5_456, out a7_457, out s2_152, out s3_153, out s4_458, out s5_155, out s6_156, out s7, out s8_459, out s9, out s10_150, out s11, out t4_460);
			a0_162.u0 = ~0x15;
		}
		else
		{
			word32 a3_203 = 0x01;
			Eq_213742 a2_209 = s4_85->dw06BC - (a2_115 & 1);
			ui32 a5_210 = (word32) a2_115->ptr0020->b0020;
			if ((a5_210 & 48) != 48)
				a3_203 = 0x00;
			ra_148 = bt_mesh_net_decrypt(ra_148, s3_153, a2_209, a3_203, a5_210 & 48, dwArg48, out s1_149, out a0_162, out a1_143, out a3_145, out a4_146, out s2_152, out s3_153, out s5_155, out s6_156, out s7, out s9, out s10_150, out s11);
		}
	}
	else
		a0_162.u0 = ~0x01;
l23041FFA:
	0x00 = (int8) dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_149;
	a0Out = a0_162;
	a1Out = a1_143;
	a3Out = a3_145;
	a4Out = a4_146;
	s2Out = s2_152;
	s3Out = s3_153;
	s4Out = dwArgF4;
	s5Out = s5_155;
	s6Out = s6_156;
	s7Out = s7;
	s8Out = dwArgD4;
	s9Out = s9;
	s10Out = s10_150;
	s11Out = s11;
	return ra_148;
}

// 2304203C: Register ui32 atomic_test_bit.constprop.8(Register out ptr32 a2Out)
// Called from:
//      bt_mesh_net_flags
//      bt_mesh_net_iv_update
//      ivu_refresh
//      bt_mesh_next_seq
//      bt_mesh_net_resend
//      bt_mesh_net_encode
ui32 atomic_test_bit.constprop.8(ptr32 & a2Out)
{
	ui32 a0_11 = atomic_get(0x4200D6C4) >> 2 & 0x01;
	a2Out = dwArg10;
	return a0_11;
}

// 23042056: Register Eq_2 bt_mesh_subnet_get(Register Eq_2 a0, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      blemesh_seg_send
//      blemesh_net_send
//      bt_mesh_model_send
//      bt_mesh_model_publish
//      mod_publish
//      bt_mesh_beacon_recv
//      krp_get
//      node_identity_get
//      app_key_get
//      krp_set
//      net_key_update
//      net_key_add
//      app_key_set
//      hb_publish
//      heartbeat_pub_set
//      app_key_del
//      node_identity_set
//      net_key_del
//      bt_mesh_heartbeat_send
//      create_friend_pdu
//      enqueue_update
Eq_2 bt_mesh_subnet_get(Eq_2 a0, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_13;
	if (a0 == 0x0FFFFFFF)
	{
		a5_13.u0 = 0x4200D8C0;
		goto l23042088;
	}
	word32 a5_11;
	if ((word32) g_w4200D8DC != a0)
	{
		a3 = (word32) g_w4200D9C0;
		a5_13.u0 = 0x00;
		if (a3 != a0)
			goto l23042088;
		a5_11 = 0x01;
	}
	else
		a5_11 = 0x00;
	a5_13 = a5_11 + 0x4200D9A4;
l23042088:
	a3Out = a3;
	a4Out = 0x4200D6BC;
	a5Out = a5_13;
	return a5_13;
}

// 23042096: Register Eq_2 bt_mesh_net_keys_create(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s11Out)
// Called from:
//      net_key_update
//      net_key_add
//      bt_mesh_net_create
Eq_2 bt_mesh_net_keys_create(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s11Out)
{
	ptr32 s5_129;
	ptr32 a4_122;
	ptr32 s1_138;
	ptr32 s3_127;
	ptr32 s0_113;
	struct Eq_274 * a0_141;
	byte bLoc11_191 = SLICE(s0, byte, 24);
	ptr32 a0_23;
	Eq_2 s1_33;
	word32 a4_258;
	word32 s3_259;
	Eq_2 s2_166;
	Eq_2 a3_121;
	ptr32 s9_173;
	Eq_2 ra_162 = bt_mesh_k2(ra, (word32) a0 + 57, out s1_33, out a0_23, out a3_121, out a4_258, out s2_166, out s3_259, out s9_173);
	if (a0_23 != 0x00)
	{
		s0_113 = a0_23;
		a0_141 = (struct Eq_274 *) &g_t230B8FBC;
	}
	else
	{
		word32 a1_260;
		word32 a2_261;
		word32 a3_262;
		word32 a4_263;
		word32 a5_264;
		word32 a6_265;
		word32 a7_266;
		memcpy(s1_33, s2_166, 0x10, out a1_260, out a2_261, out a3_262, out a4_263, out a5_264, out a6_265, out a7_266);
		*((word32) s1_33 + 16) = (byte) (word32) bLoc11_191;
		ptr32 a0_66 = bt_mesh_k3(ra_162, (word32) s1_33 + 33, out a3_121);
		s0_113 = a0_66;
		if (a0_66 != 0x00)
			a0_141 = (struct Eq_274 *) &g_t230B8FEC;
		else
		{
			ptr32 a0_92;
			word32 a4_267;
			word32 s3_268;
			word32 s5_269;
			bt_mesh_id128(ra_162, 0x230B9008, out a0_92, out a3_121, out a4_267, out s3_268, out s5_269);
			s0_113 = a0_92;
			if (a0_92 != 0x00)
				a0_141 = (struct Eq_274 *) &g_t230B9010;
			else
			{
				ptr32 a0_118;
				s1_138 = bt_mesh_id128(ra_162, 0x230B9034, out a0_118, out a3_121, out a4_122, out s3_127, out s5_129);
				s0_113 = a0_118;
				if (a0_118 == 0x00)
				{
l230420CE:
					s0Out = s0_113;
					s1Out = s1_138;
					a0Out = s0_113;
					a3Out = a3_121;
					a4Out = a4_122;
					s2Out = s2_166;
					s3Out = s3_127;
					s4Out = dwArg04;
					s5Out = s5_129;
					s6Out = s6;
					s7Out = s7;
					s9Out = s9_173;
					s11Out = s11;
					return ra_162;
				}
				a0_141 = (struct Eq_274 *) &g_t230B903C;
			}
		}
	}
	word32 a0_270;
	word32 a1_271;
	word32 a2_272;
	word32 a5_273;
	word32 a7_274;
	word32 s4_275;
	word32 s8_276;
	word32 s10_277;
	word32 t4_278;
	ra_162 = printf(ra_162, a0_141, a3_121, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_138, out a0_270, out a1_271, out a2_272, out a3_121, out a4_122, out a5_273, out a7_274, out s2_166, out s3_127, out s4_275, out s5_129, out s6, out s7, out s8_276, out s9_173, out s10_277, out s11, out t4_278);
	goto l230420CE;
}

// 23042146: Register Eq_2 friend_cred_set(Register Eq_2 ra, Register (ptr32 Eq_189802) a0, Register word32 a1, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_220862) s0Out, Register out (ptr32 Eq_220863) s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s11Out)
// Called from:
//      friend_cred_update
//      friend_cred_create
Eq_2 friend_cred_set(Eq_2 ra, struct Eq_189802 * a0, word32 a1, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0128, struct Eq_220862 & s0Out, struct Eq_220863 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s11Out)
{
	Eq_2 a0_23;
	if ((word32) g_w4200D7E8 == (word32) a0->w0002)
	{
		word32 a5_204;
		bt_mesh_primary_addr(out a5_204);
		a0_23 = (word32) a0->w0002;
	}
	else
	{
		word32 a5_203;
		a0_23 = bt_mesh_primary_addr(out a5_203);
	}
	uint32 a5_42 = (word32) a0->w0004;
	byte bLoc25_131 = (byte) ((word32) a0->w0006 >> 0x08);
	word32 a0_63;
	ptr32 s2_101;
	struct Eq_220863 * s1_167;
	ptr32 a4_162;
	Eq_2 a3_161;
	ptr32 s3_102;
	ptr32 s9_108;
	Eq_2 ra_166 = bt_mesh_k2(ra, a0 + (a1 + 58) / 8, out s1_167, out a0_63, out a3_161, out a4_162, out s2_101, out s3_102, out s9_108);
	Eq_2 dwLoc28_140 = SEQ(bLoc25_131, (byte) a5_42, (byte) (a5_42 >> 0x08), (byte) a0_23);
	if (a0_63 != 0x00)
	{
		word32 a0_205;
		word32 a1_206;
		word32 a2_207;
		word32 a5_208;
		word32 a7_209;
		word32 s4_210;
		word32 s5_211;
		word32 s8_212;
		word32 s10_213;
		word32 t4_214;
		ra_166 = printf(ra_166, &g_t230B8FBC, a3_161, dwLoc28_140, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_167, out a0_205, out a1_206, out a2_207, out a3_161, out a4_162, out a5_208, out a7_209, out s2_101, out s3_102, out s4_210, out s5_211, out s6, out s7, out s8_212, out s9_108, out s10_213, out s11, out t4_214);
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_167;
	a3Out = a3_161;
	a4Out = a4_162;
	s2Out = s2_101;
	s3Out = s3_102;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9_108;
	s11Out = s11;
	return ra_166;
}

// 230421FA: Register Eq_2 friend_cred_refresh(Register word32 a0, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      krp_set
//      bt_mesh_kr_update
Eq_2 friend_cred_refresh(word32 a0, ptr32 & a3Out, ptr32 & a4Out)
{
	if ((word32) g_w4201436E != 0x00 && (word32) g_w4201436C == a0)
	{
		word32 a7_137;
		word32 a6_136;
		word32 a5_135;
		word32 a2_134;
		word32 a1_133;
		memcpy(0x42014374, 1107379093, 33, out a1_133, out a2_134, out a3, out a4, out a5_135, out a6_136, out a7_137);
	}
	if ((word32) g_w420143B8 == 0x00 || (word32) g_w420143B6 != a0)
	{
		a3Out = a3;
		a4Out = a4;
		return <invalid>;
	}
	else
	{
		ptr32 a4_52;
		ptr32 a3_57;
		word32 a7_142;
		word32 a6_141;
		word32 a5_140;
		word32 a2_139;
		word32 a1_138;
		memcpy(1107379134, 1107379167, 33, out a1_138, out a2_139, out a3_57, out a4_52, out a5_140, out a6_141, out a7_142);
		a3Out = a3_57;
		a4Out = a4_52;
		return <invalid>;
	}
}

// 2304225E: Register Eq_2 friend_cred_update(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out (ptr32 Eq_189802) a0Out, Register out ptr32 s2Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s11Out)
// Called from:
//      net_key_update
Eq_2 friend_cred_update(Eq_2 ra, Eq_2 a0, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArg0118, union Eq_2 & s1Out, struct Eq_189802 & a0Out, ptr32 & s2Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s11Out)
{
	struct Eq_189802 * a0_119;
	Eq_2 s1_144 = a0;
	struct Eq_221032 * s0_15 = &g_w4201436C;
	if ((word32) g_w4201436E != 0x00 && (word32) g_w4201436C == (word32) (*((word32) a0 + 28)))
	{
		a0_119 = (struct Eq_189802 *) &g_w4201436C;
		word32 a3_217;
		word32 a4_218;
		word32 s3_219;
		ra = friend_cred_set(ra, &g_w4201436C, 0x01, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118, out s0_15, out s1_144, out a3_217, out a4_218, out s2, out s3_219, out s6, out s7, out s9, out s11);
		if (true)
			goto l2304229E;
	}
	if ((word32) s0_15->w004C != 0x00 && (word32) s0_15->w004A == (word32) (*((word32) s1_144 + 28)))
	{
		a0_119 = (struct Eq_189802 *) &s0_15->w004A;
		word32 s0_220;
		word32 a3_221;
		word32 a4_222;
		word32 s3_223;
		ra = friend_cred_set(ra, a0_119, 0x01, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118, out s0_220, out s1_144, out a3_221, out a4_222, out s2, out s3_223, out s6, out s7, out s9, out s11);
		if (a0_119 != null)
		{
l2304229E:
			s1Out = s1_144;
			a0Out = a0_119;
			s2Out = s2;
			s6Out = s6;
			s7Out = s7;
			s9Out = s9;
			s11Out = s11;
			return ra;
		}
	}
	a0_119 = null;
	goto l2304229E;
}

// 230422C6: Register Eq_2 friend_cred_clear(Register Eq_2 ra, Register (ptr32 Eq_189802) a0, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_189830) a4Out)
// Called from:
//      friend_cred_create
//      friend_cred_del
//      ctl_recv
Eq_2 friend_cred_clear(Eq_2 ra, struct Eq_189802 * a0, ptr32 & a1Out, ptr32 & a3Out, struct Eq_189830 & a4Out)
{
	a0->w0000 = ~0x00;
	a0->w0002 = 0x00;
	a0->w0004 = 0x00;
	a0->w0006 = 0x00;
	ptr32 a1_14;
	ptr32 a3_16;
	struct Eq_189830 * a4_17;
	word32 t1_25;
	word32 a0_26;
	word32 a2_27;
	word32 a5_28;
	Eq_2 ra_19 = memset(ra, &a0->w0006 + 1, 0x00, 66, out t1_25, out a0_26, out a1_14, out a2_27, out a3_16, out a4_17, out a5_28);
	a1Out = a1_14;
	a3Out = a3_16;
	a4Out = a4_17;
	return ra_19;
}

// 230422E4: Register Eq_2 friend_cred_create(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0118, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s3Out)
// Called from:
//      ctl_recv
//      bt_mesh_friend_req
Eq_2 friend_cred_create(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArg0118, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s3Out)
{
	ptr32 a3_100;
	ptr32 a4_101;
	Eq_2 ra_105;
	word32 a5_19;
	ptr32 s3_109;
	Eq_2 a5_12 = (word32) g_w4201436E;
	if (a5_12 != 0x00 && (a1 != a5_12 || (word32) g_w4201436C != (word32) (*((word32) a0 + 28))))
	{
		Eq_2 a5_22 = (word32) g_w420143B8;
		if (a5_22 != 0x00 && (a1 != a5_22 || (word32) g_w420143B6 != (word32) (*((word32) a0 + 28))))
		{
			word32 a2_336;
			word32 a5_337;
			word32 a0_334;
			word32 a1_335;
			word32 s1_333;
			word32 a7_338;
			word32 s2_339;
			word32 s4_340;
			word32 s5_341;
			word32 s6_342;
			word32 s7_343;
			word32 s8_344;
			word32 s9_345;
			word32 s10_346;
			word32 s11_347;
			word32 t4_348;
			ra_105 = printf(ra, &g_t230B9150, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_333, out a0_334, out a1_335, out a2_336, out a3_100, out a4_101, out a5_337, out a7_338, out s2_339, out s3_109, out s4_340, out s5_341, out s6_342, out s7_343, out s8_344, out s9_345, out s10_346, out s11_347, out t4_348);
			goto l2304236C;
		}
		a5_19 = 0x01;
	}
	else
		a5_19 = 0x00;
	struct Eq_221222 * a5_62 = a5_19 + 74;
	word32 a5_73 = (word32) *((word32) a0 + 28);
	a5_62->w4201436E = (word16) a1;
	a5_62->w42014370 = (word16) a2;
	a5_62->w4201436C = (word16) a5_73;
	a5_62->w42014372 = (word16) a3;
	struct Eq_221246 * s1_107;
	word32 s2_349;
	word32 s6_350;
	word32 s7_351;
	word32 s9_352;
	word32 s11_353;
	struct Eq_189802 * s0_106;
	ra_105 = friend_cred_set(ra, &a5_62->w4201436C, 0x00, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118, out s0_106, out s1_107, out a3_100, out a4_101, out s2_349, out s3_109, out s6_350, out s7_351, out s9_352, out s11_353);
	if (a5_62 == &g_w4201436C)
	{
		if ((word32) s1_107->b001E == 0x00)
			goto l23042384;
		word32 s1_355;
		word32 s2_356;
		word32 s6_357;
		word32 s7_358;
		word32 s9_359;
		word32 s11_360;
		ra_105 = friend_cred_set(ra_105, s0_106, 0x01, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118, out s0_106, out s1_355, out a3_100, out a4_101, out s2_356, out s3_109, out s6_357, out s7_358, out s9_359, out s11_360);
		if (s0_106 == null)
		{
l23042384:
			a3Out = a3_100;
			a4Out = a4_101;
			s3Out = s3_109;
			return ra_105;
		}
	}
	word32 a1_354;
	ra_105 = friend_cred_clear(ra_105, s0_106, out a1_354, out a3_100, out a4_101);
l2304236C:
	goto l23042384;
}

// 23042390: Register Eq_2 friend_cred_del(Register Eq_2 ra, Register ptr32 a0, Register ptr32 a1, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      clear_friendship
//      friend_clear
Eq_2 friend_cred_del(Eq_2 ra, ptr32 a0, ptr32 a1, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	struct Eq_189802 * a0_11;
	if ((word32) g_w4201436E != a1 || (word32) g_w4201436C != a0)
	{
		ptr32 a3_14 = (word32) g_w420143B8;
		if (a3_14 == a1)
		{
			a3_14 = (word32) g_w420143B6;
			if (a3_14 == a0)
			{
				a0_11 = (struct Eq_189802 *) &g_w420143B6;
l230423C2:
				ptr32 a1_31;
				ptr32 a3_33;
				ptr32 a4_34;
				Eq_2 ra_36 = friend_cred_clear(ra, a0_11, out a1_31, out a3_33, out a4_34);
				a0Out = 0x00;
				a1Out = a1_31;
				a3Out = a3_33;
				a4Out = a4_34;
				a5Out = 0x00;
				return ra_36;
			}
		}
		a0Out = ~0x01;
		a1Out = a1;
		a3Out = a3_14;
		a4Out = 0x4201436C;
		a5Out = ~0x01;
		return ra;
	}
	else
	{
		a0_11 = (struct Eq_189802 *) &g_w4201436C;
		goto l230423C2;
	}
}

