pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 230423DE: Register (ptr32 Eq_221336) friend_cred_get(Register (ptr32 Eq_221336) a0, Register Eq_221337 a1, Register (ptr32 byte) a2, Register ptr32 a3, Register ptr32 a4, Register out Eq_221337 a1Out, Register out ptr32 a3Out)
// Called from:
//      create_friend_pdu
struct Eq_221336 * friend_cred_get(struct Eq_221336 * a0, Eq_221337 a1, byte * a2, ptr32 a3, ptr32 a4, union Eq_221337 & a1Out, ptr32 & a3Out)
{
	struct Eq_221336 * a7_16;
	ptr32 a6_10;
	word32 t1_7 = (word32) a0->w001C;
	if ((word32) g_w4201436C == t1_7)
	{
		if (a1 == 0x00)
		{
			a6_10 = 0x00;
			goto l23042418;
		}
		a6_10 = 0x00;
		if ((word32) g_w4201436E == a1)
		{
l23042418:
			if (a2 != null)
			{
				a1 = (word32) ((word32) a0->b001E + 33 + (a6_10 + 74))->b42014374;
				*a2 = (byte) a1;
			}
			if (a3 != 0x00)
			{
				a1 = a6_10 + 74;
				(word32) a1 + ((word32) a0->b001E + 0x2A) + 0x4201436C = a3;
			}
			a7_16 = null;
			if (a4 != 0x00)
			{
				word32 a3_69 = (word32) a0->b001E;
				(a6_10 + 74 + (a3_69 + 0x3A))->ptr4201436C = a4;
				a3 = a3_69 + 0x3A;
			}
l23042478:
			a1Out = a1;
			a3Out = a3;
			return a7_16;
		}
	}
	a7_16 = (struct Eq_221336 *) ~0x01;
	if ((word32) g_w420143B6 != t1_7 || a1 != 0x00 && (word32) g_w420143B8 != a1)
		goto l23042478;
	a6_10 = 0x01;
	goto l23042418;
}

// 2304247C: Register Eq_2 bt_mesh_net_flags(Register Eq_2 a0)
// Called from:
//      bt_mesh_beacon_create
//      bt_mesh_net_beacon_update
//      enqueue_update
Eq_2 bt_mesh_net_flags(Eq_2 a0)
{
	Eq_2 s0_10 = 0x00;
	if (a0 != 0x00)
		s0_10 = (word32) *((word32) a0 + 30);
	word32 a2_31;
	if (atomic_test_bit.constprop.8(out a2_31) != 0x00)
		s0_10 |= 2;
	return s0_10;
}

// 2304249E: Register Eq_2 bt_mesh_net_beacon_update(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      bt_mesh_beacon_recv
//      bt_mesh_beacon_enable
//      krp_set
//      net_key_update
//      net_key_add
//      bt_mesh_net_create
//      bt_mesh_net_iv_update
//      ctl_recv
Eq_2 bt_mesh_net_beacon_update(Eq_2 ra, Eq_2 a0, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	bt_mesh_net_flags(a0);
	ptr32 a0_14 = (word32) a0 + 0x0089;
	if ((word32) *((word32) a0 + 30) == 0x00)
		a0_14 = (word32) a0 + 48;
	Eq_2 a2_25 = a0_14 + 33;
	Eq_2 a0_26 = a0_14 + 73;
	ptr32 a1_30;
	ptr32 a3_32;
	ptr32 a4_33;
	ptr32 a5_34;
	ptr32 s3_38;
	ptr32 s4_39;
	ptr32 s5_40;
	ptr32 s8_41;
	Eq_2 s0_37 = bt_mesh_beacon_auth(ra, a0_26, a2_25, out a1_30, out a3_32, out a4_33, out a5_34, out s3_38, out s4_39, out s5_40, out s8_41);
	a1Out = a1_30;
	a3Out = a3_32;
	a4Out = a4_33;
	a5Out = a5_34;
	s3Out = s3_38;
	s4Out = s4_39;
	s5Out = s5_40;
	s8Out = s8_41;
	return s0_37;
}

// 230424D8: Register Eq_2 bt_mesh_net_create(Register Eq_2 ra, Register ui32 a1, Register Eq_2 a2, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s11Out)
// Called from:
//      bt_mesh_provision
Eq_2 bt_mesh_net_create(Eq_2 ra, ui32 a1, Eq_2 a2, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s11Out)
{
	ptr32 s7_102;
	ptr32 s6_101;
	ptr32 s5_160;
	Eq_2 a3_120;
	ptr32 a0_169;
	Eq_2 a4_119;
	Eq_2 ra_148;
	Eq_2 s1_105;
	ptr32 s11_100;
	word32 s3_111;
	Eq_2 s0_108;
	word32 s4_107;
	word32 t1_286;
	word32 a0_287;
	word32 a1_288;
	word32 a2_289;
	word32 a3_290;
	word32 a4_291;
	word32 a5_292;
	Eq_2 ra_34 = memset(ra, 0x42014400, 0x00, 96, out t1_286, out a0_287, out a1_288, out a2_289, out a3_290, out a4_291, out a5_292);
	g_w4200F434 = 0x00;
	g_b4200D8DE = (byte) (a1 & 1);
	if ((a1 & 1) != 0x00)
	{
		word32 a0_98;
		word32 s2_295;
		word32 s9_296;
		ra_148 = bt_mesh_net_keys_create(ra_34, 0x4200D6BC, 0x4200D949, a2, s2, dwArg30, dwArg34, dwArg58, dwArg7C, out s0_108, out s1_105, out a0_98, out a3_120, out a4_119, out s2_295, out s3_111, out s4_107, out s5_160, out s6_101, out s7_102, out s9_296, out s11_100);
		if (a0_98 != 0x00)
		{
l2304252A:
			a0_169 = ~0x04;
			goto l2304252C;
		}
		*((word32) s0_108 + 0x0223) = 0x02;
	}
	else
	{
		word32 a0_69;
		word32 s2_293;
		word32 s9_294;
		ra_148 = bt_mesh_net_keys_create(ra_34, 0x4200D6BC, 0x4200D8F0, a2, s2, dwArg30, dwArg34, dwArg58, dwArg7C, out s0_108, out s1_105, out a0_69, out a3_120, out a4_119, out s2_293, out s3_111, out s4_107, out s5_160, out s6_101, out s7_102, out s9_294, out s11_100);
		if (a0_69 != 0x00)
			goto l2304252A;
	}
	((word32) s0_108 + 544)->u2 = (word16) s4_107;
	*((word32) s0_108 + 0x0224) = 0x00;
	*s0_108 = s3_111;
	if ((s1_105 >> 1 & 0x01) != 0x00)
	{
		word32 a0_305;
		word32 a1_306;
		word32 a2_307;
		word32 a3_308;
		word32 a4_309;
		word32 a5_310;
		word32 s4_311;
		word32 s8_312;
		s1_105 = atomic_or(s0_108, 0x04, a3_120, a4_119, mstatus, out a0_305, out a1_306, out a2_307, out a3_308, out a4_309, out a5_310, out s4_311, out s8_312);
	}
	else
	{
		word32 a0_297;
		word32 a1_298;
		word32 a2_299;
		word32 a3_300;
		word32 a4_301;
		word32 a5_302;
		word32 s4_303;
		word32 s8_304;
		s1_105 = atomic_and(s0_108, ~0x04, a3_120, a4_119, mstatus, out a0_297, out a1_298, out a2_299, out a3_300, out a4_301, out a5_302, out s4_303, out s8_304);
	}
	*((word32) s0_108 + 380) = 0x60;
	word32 a1_313;
	word32 a5_314;
	word32 s3_315;
	word32 s4_316;
	word32 s8_317;
	bt_mesh_net_beacon_update(ra_148, (word32) s0_108 + 516, out a1_313, out a3_120, out a4_119, out a5_314, out s3_315, out s4_316, out s5_160, out s8_317);
	a0_169 = 0x00;
l2304252C:
	s1Out = s1_105;
	a0Out = a0_169;
	a3Out = a3_120;
	a4Out = a4_119;
	s5Out = s5_160;
	s6Out = s6_101;
	s7Out = s7_102;
	s11Out = s11_100;
	return ra_148;
}

// 2304258E: void bt_mesh_net_revoke_keys(Register Eq_2 a0)
// Called from:
//      krp_set
//      bt_mesh_kr_update
void bt_mesh_net_revoke_keys(Eq_2 a0)
{
	word32 a1_117;
	word32 a2_118;
	word32 a3_119;
	word32 a4_120;
	word32 a5_121;
	word32 a6_122;
	word32 a7_123;
	memcpy((word32) a0 + 48, (word32) a0 + 0x0089, 89, out a1_117, out a2_118, out a3_119, out a4_120, out a5_121, out a6_122, out a7_123);
	if ((word32) g_w4200D870 == (word32) (*((word32) a0 + 28)) && (word32) g_b4200D874 != 0x00)
	{
		word32 a1_124;
		word32 a2_125;
		word32 a3_126;
		word32 a4_127;
		word32 a5_128;
		word32 a6_129;
		word32 a7_130;
		memcpy(0x4200D875, 0x4200D886, 0x11, out a1_124, out a2_125, out a3_126, out a4_127, out a5_128, out a6_129, out a7_130);
		g_b4200D874 = 0x00;
	}
	if ((word32) g_w4200D898 == (word32) (*((word32) a0 + 28)) && (word32) g_b4200D89C != 0x00)
	{
		word32 a1_131;
		word32 a2_132;
		word32 a3_133;
		word32 a4_134;
		word32 a5_135;
		word32 a6_136;
		word32 a7_137;
		memcpy(0x4200D89D, 0x4200D8AE, 0x11, out a1_131, out a2_132, out a3_133, out a4_134, out a5_135, out a6_136, out a7_137);
		g_b4200D89C = 0x00;
	}
}

// 23042606: Register Eq_2 bt_mesh_kr_update(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_191307 a4Out, Register out Eq_191308 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      bt_mesh_beacon_recv
//      ctl_recv
Eq_2 bt_mesh_kr_update(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_191307 & a4Out, union Eq_191308 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	Eq_191307 a4_127;
	word32 a5_11 = (word32) *((word32) a0 + 31);
	if ((word32) *((word32) a0 + 30) == a1 || a5_11 != 0x00)
	{
		*((word32) a0 + 30) = (byte) (word32) (a1 != 0x00);
		a4_127.u0 = 0x01;
		if (a1 != 0x00)
		{
			if (a5_11 != 0x01)
				goto l2304262A;
			*((word32) a0 + 31) = 0x02;
		}
		else
		{
			if (a5_11 != 0x01)
			{
				a4_127.u0 = 0x02;
				if (a5_11 != 0x02)
				{
l23042628:
					goto l2304262A;
				}
			}
			else if (a2 == 0x00)
				goto l2304262A;
			bt_mesh_net_revoke_keys(a0);
			s1 = friend_cred_refresh((word32) *((word32) a0 + 28), out a3, out a4_127);
			*((word32) a0 + 31) = 0x00;
		}
l2304262A:
		s1Out = s1;
		a0Out = dwArg10;
		a3Out = a3;
		a4Out = a4_127;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		return ra;
	}
	else
	{
		word32 t4_267;
		word32 s8_265;
		word32 s11_266;
		word32 s4_264;
		word32 a5_262;
		word32 a7_263;
		word32 a2_261;
		word32 a0_259;
		word32 a1_260;
		ra = printf(ra, &g_t230B8D8C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_259, out a1_260, out a2_261, out a3, out a4_127, out a5_262, out a7_263, out s2, out s3, out s4_264, out s5, out s6, out s7, out s8_265, out s9, out s10, out s11_266, out t4_267);
		goto l23042628;
	}
}

// 23042672: void bt_mesh_rpl_reset(Register Eq_2 ra, Stack Eq_2 dwArg38)
// Called from:
//      bt_mesh_net_iv_update
void bt_mesh_rpl_reset(Eq_2 ra, Eq_2 dwArg38)
{
	struct Eq_221833 * s0_16 = &g_t4200D6BC;
	do
	{
		if ((word32) s0_16->w03CC != 0x00)
		{
			if ((word32) s0_16->b03CE != 0x00)
			{
				word32 t1_82;
				word32 a0_83;
				word32 a1_84;
				word32 a2_85;
				word32 a3_86;
				word32 a4_87;
				word32 a5_88;
				ra = memset(ra, &s0_16->w03CC, 0x00, 0x08, out t1_82, out a0_83, out a1_84, out a2_85, out a3_86, out a4_87, out a5_88);
			}
			else
				s0_16->b03CE = 0x01;
		}
		++s0_16;
	} while (s0_16 != &g_t4200D6E4);
	0x00 = (int8) dwArg38;
}

// 230426BA: Register Eq_2 bt_mesh_net_sec_update(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out (ptr32 Eq_198322) s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_198327 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_beacon_recv
//      bt_mesh_next_seq
//      seg_tx_reset
Eq_2 bt_mesh_net_sec_update(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg30, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, struct Eq_198322 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, union Eq_198327 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	word32 a0_11;
	if (a0 != 0x00)
		a0_11 = (word32) *((word32) a0 + 28);
	else
		a0_11 = 0x0FFFFFFF;
	Eq_198327 a4_15;
	ptr32 a3_14 = bt_mesh_friend_sec_update(a0_11, out a4_15);
	word32 a5_187;
	Eq_2 a0_17 = bt_mesh_gatt_proxy_get(out a5_187);
	if (a0_17 != 0x01)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = a0_17;
		a1Out = a1;
		a3Out = a3_14;
		a4Out = a4_15;
		a5Out = 0x01;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		ptr32 a5_38;
		struct Eq_198322 * s0_40;
		Eq_2 s1_41;
		Eq_2 s2_42;
		ptr32 s3_43;
		ptr32 s4_44;
		ptr32 s8_45;
		Eq_2 a0_47;
		ptr32 a1_48;
		ptr32 a3_49;
		Eq_198327 a4_50;
		ptr32 mstatus_52;
		ptr32 s10_54;
		ptr32 s11_55;
		ptr32 s5_56;
		ptr32 s6_57;
		ptr32 s7_58;
		ptr32 s9_59;
		Eq_2 ra_53 = bt_mesh_proxy_beacon_send(ra, s1, a0, s2, mstatus, dwArg08, dwArg10, dwArg18, dwArg1C, dwArg30, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out s0_40, out s1_41, out a0_47, out a1_48, out a3_49, out a4_50, out a5_38, out s2_42, out s3_43, out s4_44, out s5_56, out s6_57, out s7_58, out s8_45, out s9_59, out s10_54, out s11_55, out mstatus_52);
		s0Out = s0_40;
		s1Out = s1_41;
		a0Out = a0_47;
		a1Out = a1_48;
		a3Out = a3_49;
		a4Out = a4_50;
		a5Out = a5_38;
		s2Out = s2_42;
		s3Out = s3_43;
		s4Out = s4_44;
		s5Out = s5_56;
		s6Out = s6_57;
		s7Out = s7_58;
		s8Out = s8_45;
		s9Out = s9_59;
		s10Out = s10_54;
		s11Out = s11_55;
		mstatusOut = mstatus_52;
		return ra_53;
	}
}

// 230426F0: Register Eq_2 bt_mesh_net_iv_update(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s11Out)
// Called from:
//      bt_mesh_beacon_recv
//      ivu_refresh
//      bt_mesh_next_seq
//      seg_tx_reset
//      ctl_recv
Eq_2 bt_mesh_net_iv_update(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s11Out)
{
	struct Eq_274 * a0_304;
	Eq_2 a3_107;
	Eq_2 a4_108;
	Eq_2 s1_110;
	Eq_2 a4_101;
	Eq_2 a2_19;
	int32 a0_18 = atomic_test_bit.constprop.8(out a2_19);
	Eq_2 s2_136 = a0;
	Eq_2 s1_16 = a1;
	Eq_2 s0_20 = *a2_19;
	if (a0_18 == 0x00)
	{
		if (a2_19 == a0)
			goto l23042724;
		if (a0 >= a2_19)
		{
			a5 = (word32) a2_19 + 42;
			if ((word32) a2_19 + 42 >= a0)
			{
				if ((word32) a2_19 + 1 < a0)
				{
					word32 s1_59;
					word32 s6_646;
					word32 s10_648;
					word32 s8_647;
					word32 s5_645;
					word32 t1_650;
					word32 a1_652;
					word32 t4_649;
					word32 a0_651;
					word32 a1_637;
					word32 a0_636;
					word32 a4_640;
					word32 a2_638;
					word32 a3_639;
					word32 s3_643;
					word32 a7_642;
					word32 s4_644;
					word32 a5_641;
					word32 a2_653;
					word32 a5_654;
					ra = memset(printf(ra, &g_t230B8F20, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_59, out a0_636, out a1_637, out a2_638, out a3_639, out a4_640, out a5_641, out a7_642, out s2_136, out s3_643, out s4_644, out s5_645, out s6_646, out s7, out s8_647, out s9, out s10_648, out s11, out t4_649), (word32) s0_20 + 0x03CC, 0x00, 40, out t1_650, out a0_651, out a1_652, out a2_653, out a3, out a4_101, out a5_654);
					*s0_20 = s2_136;
					*((word32) s0_20 + 4) = 0x00;
					if (s1_59 == 0x00)
						goto l23042820;
					goto l2304276E;
				}
				if ((word32) a2_19 + 1 == a0)
				{
					if (a1 == 0x00)
					{
						word32 a0_674;
						word32 a2_675;
						word32 a7_676;
						word32 s10_677;
						word32 t4_678;
						ra = printf(ra, &g_t230B8F40, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_16, out a0_674, out a1, out a2_675, out a3, out a4, out a5, out a7_676, out s2_136, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10_677, out s11, out t4_678);
						goto l230427D4;
					}
				}
				else if (a1 == 0x00)
					goto l230427D4;
l230427E4:
				a4_101 = (word32) *((word32) s0_20 + 380);
				if (a4_101 <= 95)
				{
					word32 s1_679;
					word32 a0_680;
					word32 a2_681;
					word32 a7_682;
					word32 s10_683;
					word32 t4_684;
					ra = printf(ra, &g_t230B8F64, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_679, out a0_680, out a1, out a2_681, out a3, out a4, out a5, out a7_682, out s2_136, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10_683, out s11, out t4_684);
l23042724:
					s1_16.u0 = 0x00;
					goto l230427D4;
				}
				if (a1 == 0x00)
				{
					if (bt_mesh_tx_in_progress() != 0x00)
					{
						Eq_2 a3_249;
						Eq_2 a4_250;
						word32 s1_685;
						word32 a0_686;
						word32 a1_687;
						word32 a2_688;
						word32 a5_689;
						word32 a7_690;
						word32 s4_691;
						word32 s8_692;
						word32 s10_693;
						word32 t4_694;
						ra = printf(ra, &g_t230B8F88, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_685, out a0_686, out a1_687, out a2_688, out a3_249, out a4_250, out a5_689, out a7_690, out s2_136, out s3, out s4_691, out s5, out s6, out s7, out s8_692, out s9, out s10_693, out s11, out t4_694);
						word32 a0_695;
						word32 a2_696;
						s1_16 = atomic_or(s0_20, 32, a3_249, a4_250, mstatus, out a0_695, out a1, out a2_696, out a3, out a4, out a5, out s4, out s8);
						goto l230427D4;
					}
l23042820:
					word32 a0_655;
					word32 a1_656;
					word32 a2_657;
					word32 a5_658;
					word32 s4_659;
					word32 s8_660;
					s1_110 = atomic_and(s0_20, ~0x04, a3, a4_101, mstatus, out a0_655, out a1_656, out a2_657, out a3_107, out a4_108, out a5_658, out s4_659, out s8_660);
					goto l23042778;
				}
l2304276E:
				word32 a0_661;
				word32 a1_662;
				word32 a2_663;
				word32 a5_664;
				word32 s4_665;
				word32 s8_666;
				s1_110 = atomic_or(s0_20, 0x04, a3, a4_101, mstatus, out a0_661, out a1_662, out a2_663, out a3_107, out a4_108, out a5_664, out s4_665, out s8_666);
l23042778:
				*((word32) s0_20 + 380) = 0x00;
				if (s1_110 != 0x00)
				{
					*s0_20 = s2_136;
					bt_mesh_rpl_reset(ra, dwArg28);
				}
				else
					*((word32) s0_20 + 4) = 0x00;
				word32 s1_669;
				word32 a0_670;
				word32 a2_671;
				word32 a4_672;
				word32 a5_673;
				Eq_2 s0_171 = k_delayed_work_submit(172800000, a3_107, a4_108, mstatus, s0, dwLoc08, dwArg14, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s1_669, out a0_670, out a1, out a2_671, out a3, out a4_672, out a5_673, out s2_136, out s3, out s4, out s5, out s6, out s8);
				if ((word32) *((word32) s0_171 + 544) != 0x0FFFFFFF)
				{
					word32 a4_667;
					word32 a5_668;
					s0_171 = bt_mesh_net_beacon_update(ra, (word32) s0_171 + 516, out a1, out a3, out a4_667, out a5_668, out s3, out s4, out s5, out s8);
				}
				a4 = (word32) *((word32) s0_171 + 772);
				a5 = 0x0FFFFFFF;
				s1_16.u0 = 0x01;
				if (a4 != 0x0FFFFFFF)
					bt_mesh_net_beacon_update(ra, (word32) s0_171 + 744, out a1, out a3, out a4, out a5, out s3, out s4, out s5, out s8);
l230427D4:
				0x00 = (int8) dwArg38;
				s1Out = s1_16;
				a0Out = s1_16;
				a1Out = a1;
				a3Out = a3;
				a4Out = a4;
				a5Out = a5;
				s2Out = s2_136;
				s3Out = s3;
				s4Out = s4;
				s5Out = s5;
				s6Out = s6;
				s7Out = s7;
				s8Out = s8;
				s9Out = s9;
				s11Out = s11;
				return ra;
			}
		}
		a0_304 = (struct Eq_274 *) &g_t230B8EF4;
l2304271C:
		word32 a0_631;
		word32 a2_632;
		word32 a7_633;
		word32 s1_630;
		word32 s10_634;
		word32 t4_635;
		ra = printf(ra, a0_304, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_630, out a0_631, out a1, out a2_632, out a3, out a4, out a5, out a7_633, out s2_136, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10_634, out s11, out t4_635);
		goto l23042724;
	}
	else
	{
		if (a2_19 != a0)
		{
			a0_304 = (struct Eq_274 *) &g_t230B8ECC;
			goto l2304271C;
		}
		if (a1 != 0x00)
			goto l23042724;
		goto l230427E4;
	}
}

