pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23042832: void ivu_refresh(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void ivu_refresh(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_222348 a5_13 = (word32) g_b4200D838 + 48 & 0x00FF;
	g_b4200D838 = (byte) a5_13;
	if (a5_13 > 95)
	{
		word32 a2_186;
		if (atomic_test_bit.constprop.8(out a2_186) == 0x00)
			return;
		Eq_2 a0_23;
		Eq_2 a3_26;
		word32 s1_200;
		word32 s2_201;
		word32 s3_202;
		word32 s4_203;
		word32 s5_204;
		word32 s6_205;
		word32 s8_206;
		bt_mesh_beacon_ivu_initiator(0x4200D6BC, 0x01, a3, 95, mstatus, s0, dwArg24, dwArg28, ra, dwArg98, dwArgA8, dwArgD8, dwArgE8, dwArg0118, dwArg0128, dwArg0168, out s1_200, out a0_23, out a3_26, out s2_201, out s3_202, out s4_203, out s5_204, out s6_205, out s8_206);
		word32 s1_207;
		word32 a0_208;
		word32 a1_209;
		word32 a3_210;
		word32 a4_211;
		word32 a5_212;
		word32 s2_213;
		word32 s3_214;
		word32 s4_215;
		word32 s5_216;
		word32 s6_217;
		word32 s7_218;
		word32 s8_219;
		word32 s9_220;
		word32 s11_221;
		bt_mesh_net_iv_update(ra, s0, a0_23, 0x00, a3_26, mstatus, dwArg14, dwArg18, dwArg28, dwArg38, dwArg60, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s1_207, out a0_208, out a1_209, out a3_210, out a4_211, out a5_212, out s2_213, out s3_214, out s4_215, out s5_216, out s6_217, out s7_218, out s8_219, out s9_220, out s11_221);
	}
	else
	{
		word32 s1_187;
		word32 a0_188;
		word32 a1_189;
		word32 a2_190;
		word32 a3_191;
		word32 a4_192;
		word32 a5_193;
		word32 s2_194;
		word32 s3_195;
		word32 s4_196;
		word32 s5_197;
		word32 s6_198;
		word32 s8_199;
		k_delayed_work_submit(172800000, a3, 95, mstatus, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_187, out a0_188, out a1_189, out a2_190, out a3_191, out a4_192, out a5_193, out s2_194, out s3_195, out s4_196, out s5_197, out s6_198, out s8_199);
	}
}

// 23042890: Register Eq_2 bt_mesh_next_seq(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_net_resend
//      bt_mesh_net_encode
//      encode_friend_ctl
//      bt_mesh_friend_enqueue_tx
Eq_2 bt_mesh_next_seq(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0168, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 a5_11 = *((word32) s1 + 4);
	*((word32) s1 + 5) = a5_11;
	ptr32 a4_12 = (word32) s1 + 1;
	word32 a2_245;
	if (atomic_test_bit.constprop.8(out a2_245) == 0x00)
	{
		Eq_2 s0_16 = *((word32) s1 + 5);
		a5_11.u0 = 8000000;
		if (s1 <= ~0x007A11FE)
			goto l230428E2;
		if ((word32) *((word32) s0_16 + 544) == 0x00)
		{
l230428CC:
			union Eq_2 * a0_30;
			Eq_2 a3_33;
			word32 s1_246;
			word32 s2_247;
			word32 s3_248;
			word32 s4_249;
			word32 s5_250;
			word32 s6_251;
			word32 s8_252;
			bt_mesh_beacon_ivu_initiator(s0_16, 0x01, a3, (word32) s1 + 1, mstatus, s0, dwArg24, dwArg28, ra, dwArg98, dwArgA8, dwArgD8, dwArgE8, dwArg0118, dwArg0128, dwArg0168, out s1_246, out a0_30, out a3_33, out s2_247, out s3_248, out s4_249, out s5_250, out s6_251, out s8_252);
			Eq_2 s1_59;
			Eq_2 s2_60;
			word32 a0_253;
			word32 a1_254;
			word32 a3_255;
			word32 a4_256;
			word32 a5_257;
			word32 s3_258;
			word32 s4_259;
			word32 s5_260;
			word32 s6_261;
			word32 s7_262;
			word32 s8_263;
			word32 s9_264;
			word32 s11_265;
			word32 s0_266;
			word32 a0_267;
			word32 a1_268;
			word32 a3_269;
			word32 s6_270;
			word32 s7_271;
			word32 s8_272;
			word32 s9_273;
			word32 s11_274;
			ra = bt_mesh_net_sec_update(bt_mesh_net_iv_update(ra, *a0_30, (char *) a0_30 + 1, 0x01, a3_33, mstatus, dwArg04, dwArg08, dwArg18, dwArg28, dwArg50, dwArg54, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s1_59, out a0_253, out a1_254, out a3_255, out a4_256, out a5_257, out s2_60, out s3_258, out s4_259, out s5_260, out s6_261, out s7_262, out s8_263, out s9_264, out s11_265), s1_59, 0x00, s2_60, mstatus, dwLoc08, dwArg00, dwArg08, dwArg0C, dwArg20, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_266, out s1, out a0_267, out a1_268, out a3_269, out a4_12, out a5_11, out s2, out s3, out s4, out s5, out s6_270, out s7_271, out s8_272, out s9_273, out s10, out s11_274, out mstatus);
			goto l230428E2;
		}
		a5_11 = (word32) *((word32) s0_16 + 772);
		if (a5_11 == 0x00)
			goto l230428CC;
	}
l230428E2:
	s1Out = s1;
	a0Out = s1;
	a4Out = a4_12;
	a5Out = a5_11;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s10Out = s10;
	mstatusOut = mstatus;
	return ra;
}

// 230428EE: Register Eq_2 bt_mesh_net_resend(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ui32 a2, Register (ptr32 int32) s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      seg_tx_send_unacked
Eq_2 bt_mesh_net_resend(Eq_2 ra, Eq_2 s0, Eq_2 a0, ui32 a2, int32 * s2, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a3_223;
	ptr32 a1_255;
	Eq_2 a4_239;
	Eq_2 ra_226;
	Eq_2 s1_262;
	ptr32 s2_229;
	Eq_2 s5_232;
	ptr32 s3_230;
	ptr32 s7_244;
	ptr32 s6_233;
	ptr32 s9_245;
	Eq_2 s0_110;
	struct Eq_274 * a0_289;
	Eq_2 a0_47;
	struct Eq_215789 * a5_52;
	int32 * s2_59;
	word32 s3_60;
	word32 s6_63;
	word32 a2_455;
	word32 s0_456;
	word32 s1_457;
	word32 a1_458;
	word32 a2_459;
	word32 a4_460;
	word32 s4_461;
	word32 s5_462;
	word32 s8_463;
	word32 s10_464;
	Eq_2 a3_160;
	Eq_2 ra_165 = bt_mesh_net_obfuscate(ra, s0, g_t4200D6BC - atomic_test_bit.constprop.8(out a2_455), (word32) a0 + (a2 + 0x00C2), dwArgF8, out s0_456, out s1_457, out a0_47, out a1_458, out a2_459, out a3_160, out a4_460, out a5_52, out s2_59, out s3_60, out s4_461, out s5_462, out s6_63, out s8_463, out s10_464);
	if (a0_47 != 0x00)
	{
		s0_110 = a0_47;
		a0_289 = (struct Eq_274 *) &g_t230B90DC;
	}
	else
	{
		Eq_2 a0_82;
		Eq_2 s1_92;
		word32 a2_465;
		word32 a1_466;
		word32 a4_467;
		word32 s2_468;
		word32 s3_469;
		word32 s5_470;
		word32 s6_471;
		word32 s7_472;
		word32 s9_473;
		word32 s10_474;
		word32 s11_475;
		ra_165 = bt_mesh_net_decrypt(ra_165, s3_60 + 65 + s6_63, *s2_59 - atomic_test_bit.constprop.8(out a2_465), 0x00, a5_52, s5, out s1_92, out a0_82, out a1_466, out a3_160, out a4_467, out s2_468, out s3_469, out s5_470, out s6_471, out s7_472, out s9_473, out s10_474, out s11_475);
		s0_110 = a0_82;
		if (a0_82 != 0x00)
			a0_289 = (struct Eq_274 *) &g_t230B90FC;
		else
		{
			uint32 a0_112;
			struct Eq_215703 * a5_115;
			int32 * s2_126;
			Eq_2 s3_127;
			word32 s1_476;
			word32 a4_477;
			word32 s4_478;
			word32 s5_479;
			word32 s10_480;
			Eq_2 ra_122 = bt_mesh_next_seq(ra_165, a0_82, s1_92, a3_160, mstatus, dwLoc30, s8, s6, s4, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg08, dwArg18, dwArg20, dwArg24, dwArg28, dwArg38, dwArg48, s5, dwArg68, dwArg6C, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0138, out s1_476, out a0_112, out a4_477, out a5_115, out s2_126, out s3_127, out s4_478, out s5_479, out s10_480, out mstatus);
			a5_115->b0002 = (byte) (a0_112 >> 0x10);
			a5_115->b0003 = (byte) (a0_112 >> 0x08);
			int32 s0_147 = *s2_126;
			a5_115->b0004 = (byte) a0_112;
			int32 * s2_170;
			Eq_2 s7_175;
			ui32 s9_177;
			word32 a2_481;
			word32 s0_482;
			word32 s1_483;
			word32 a1_484;
			word32 a4_485;
			word32 a5_486;
			word32 s3_487;
			word32 s5_488;
			word32 s6_489;
			word32 s10_490;
			word32 s11_491;
			ra_165 = bt_mesh_net_encrypt(ra_122, s3_127, s0_147 - atomic_test_bit.constprop.8(out a2_481), 0x00, a5_115, out s0_482, out s1_483, out a1_484, out a3_160, out a4_485, out a5_486, out s2_170, out s3_487, out s5_488, out s6_489, out s7_175, out s9_177, out s10_490, out s11_491);
			s0_110 = s3_127;
			if (s3_127 != 0x00)
				a0_289 = (struct Eq_274 *) &g_t230B9118;
			else
			{
				Eq_2 a0_193;
				Eq_2 a4_197;
				Eq_2 s3_206;
				Eq_2 s4_207;
				Eq_2 s5_208;
				Eq_2 s6_209;
				ui32 s8_210;
				word32 a2_501;
				word32 s0_502;
				word32 s1_503;
				word32 a1_504;
				word32 a2_505;
				word32 a5_506;
				word32 s2_507;
				word32 s10_508;
				ra_165 = bt_mesh_net_obfuscate(ra_165, s3_127, *s2_170 - atomic_test_bit.constprop.8(out a2_501), s7_175, dwArgF8, out s0_502, out s1_503, out a0_193, out a1_504, out a2_505, out a3_160, out a4_197, out a5_506, out s2_507, out s3_206, out s4_207, out s5_208, out s6_209, out s8_210, out s10_508);
				s0_110 = a0_193;
				if (a0_193 == 0x00)
				{
					word32 a0_222;
					struct Eq_220189 * a5_224;
					Eq_2 s4_231;
					word32 s1_509;
					word32 a1_510;
					word32 s10_511;
					word32 s11_512;
					ra_226 = bt_mesh_proxy_relay(ra_165, s6_209, s8_210 << 0x08 | s9_177, a4_197, s3_206, s4_207, s5_208, s6_209, mstatus, dwLoc30, s8, s6, dwLoc10, dwLoc08, dwLoc04, dwArg08, dwArg28, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_110, out s1_509, out a0_222, out a1_510, out a3_223, out a4_239, out a5_224, out s2_229, out s3_230, out s4_231, out s5_232, out s6_233, out s7_244, out s9_245, out s10_511, out s11_512, out mstatus);
					if (a0_222 != 0x00)
						ra_226 = send_cb_finalize(ra_226, s0_110, s4_231, s5_232, a5_224, s2, s0, out s0_110, out s1_262, out a1_255);
					else
					{
						word32 a5_513;
						word32 s8_514;
						s1_262 = bt_mesh_adv_send(ra_226, s0_110, s4_231, s5_232, a4_239, mstatus, dwArgB8, dwArgF8, dwArg0138, out a1_255, out a3_223, out a4_239, out a5_513, out s2_229, out s3_230, out s5_232, out s6_233, out s8_514);
					}
l2304294C:
					0x00 = (int8) dwArg0128;
					s0Out = s4;
					s1Out = s1_262;
					a0Out = s0_110;
					a1Out = a1_255;
					a2Out = dwArgB8;
					a3Out = a3_223;
					a4Out = a4_239;
					s2Out = s2_229;
					s3Out = s3_230;
					s4Out = dwArg78;
					s5Out = s5_232;
					s6Out = s6_233;
					s7Out = s7_244;
					s8Out = s5;
					s9Out = s9_245;
					mstatusOut = mstatus;
					return ra_226;
				}
				a0_289 = (struct Eq_274 *) &g_t230B9134;
			}
		}
	}
	word32 a0_492;
	word32 a2_493;
	word32 a5_494;
	word32 a7_495;
	word32 s4_496;
	word32 s8_497;
	word32 s10_498;
	word32 s11_499;
	word32 t4_500;
	ra_226 = printf(ra_165, a0_289, a3_160, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_262, out a0_492, out a1_255, out a2_493, out a3_223, out a4_239, out a5_494, out a7_495, out s2_229, out s3_230, out s4_496, out s5_232, out s6_233, out s7_244, out s8_497, out s9_245, out s10_498, out s11_499, out t4_500);
	goto l2304294C;
}

// 23042A32: Register Eq_2 bt_mesh_net_encode(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register (ptr32 Eq_223034) a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_2) s2Out, Register out ptr32 s3Out, Register out (ptr32 int32) s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      send_filter_status
//      bt_mesh_ctl_send
Eq_2 bt_mesh_net_encode(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 a3, struct Eq_223034 * a5, Eq_2 s2, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, int32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a0_208;
	ptr32 a1_212;
	ptr32 a3_214;
	ptr32 a4_215;
	ptr32 a5_216;
	ptr32 s1_221;
	Eq_2 ra_219;
	ptr32 s11_223;
	ptr32 s10_222;
	ptr32 s3_225;
	union Eq_2 * s2_224;
	ptr32 s6_228;
	int32 * s5_227;
	ptr32 s9_231;
	ptr32 s7_229;
	struct Eq_274 * a0_282;
	if ((word32) a5->w0002 == 0x0FFFFFFF)
	{
		word32 a4_539;
		if (net_buf_simple_tailroom(a1, out a4_539) <= 0x07)
		{
			a0_282 = (struct Eq_274 *) &g_t230B8E58;
			goto l23042A6C;
		}
	}
	word32 a4_538;
	if (net_buf_simple_tailroom(a1, out a4_538) <= 0x03)
	{
		a0_282 = (struct Eq_274 *) &g_t230B8E80;
l23042A6C:
		word32 t4_551;
		word32 s8_550;
		word32 s4_549;
		word32 a7_548;
		word32 a2_547;
		word32 a0_546;
		ra_219 = printf(ra, a0_282, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_221, out a0_546, out a1_212, out a2_547, out a3_214, out a4_215, out a5_216, out a7_548, out s2_224, out s3_225, out s4_549, out s5_227, out s6_228, out s7_229, out s8_550, out s9_231, out s10_222, out s11_223, out t4_551);
		a0_208.u0 = ~0x15;
		goto l23042A72;
	}
	Eq_2 s1_42 = *(union Eq_2 *) 0x07;
	net_buf_simple_push_be16((word32) *(union Eq_2 *) 0x07, (struct Eq_223123 *) 0x03);
	net_buf_simple_push_be16((word32) *((word32) s1_42 + 8), (struct Eq_223123 *) 0x03);
	word32 a4_540;
	Eq_2 a0_53 = net_buf_simple_push(0x03, 0x03, out a4_540);
	uint32 a0_64;
	Eq_2 a4_66;
	word32 s4_80;
	word32 s10_545;
	word32 s5_544;
	word32 s2_543;
	word32 a5_542;
	word32 s1_541;
	word32 s3_138;
	Eq_2 ra_133 = bt_mesh_next_seq(ra, a0_53, s1_42, a3, mstatus, s6, s4, s2, s0, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg28, dwArg30, dwArg34, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0148, out s1_541, out a0_64, out a4_66, out a5_542, out s2_543, out s3_138, out s4_80, out s5_544, out s10_545, out mstatus);
	*a0_53 = (byte) (a0_64 >> 0x10);
	*((word32) a0_53 + 1) = (byte) (a0_64 >> 0x08);
	*((word32) a0_53 + 2) = (byte) a0_64;
	struct Eq_223186 * s1_97 = *((word32) a4_66 + 4);
	Eq_2 a1_100 = (word32) *((word32) a4_66 + 11);
	if (s4_80 == 0x0FFFFFFF)
		a1_100 |= 0x0080;
	Eq_2 s1_160;
	Eq_2 a4_118;
	ui32 s4_159;
	struct Eq_215703 * a5_107 = net_buf_simple_push_u8(a1_100, a4_66);
	ui32 a4_110 = (word32) s1_97->b000B;
	struct Eq_215718 * s1_111 = a5_107->ptr0000;
	if ((a4_110 & 1) != 0x00)
	{
		Eq_2 a2_116 = (word32) a5_107->w001C;
		a4_118.u0 = 0x4201436C;
		word32 a3_119 = 0x00;
		if ((word32) g_w4201436C == a2_116)
		{
l23042B18:
			struct Eq_223268 * s0_171 = (word32) a5_107->b001E + 33 + (a3_119 + 74);
			s4_159 = (word32) s0_171->b42014374;
			s1_160 = &s0_171->b42014374 + 1;
			goto l23042B44;
		}
		Eq_2 a3_120 = (word32) g_w420143B6;
		if (a3_120 == a2_116)
		{
			a3_119 = 0x01;
			goto l23042B18;
		}
		word32 a2_554;
		word32 a3_555;
		word32 a4_556;
		word32 a5_557;
		word32 a7_558;
		word32 s2_559;
		struct Eq_223295 * s1_134;
		word32 s4_560;
		word32 s5_561;
		word32 s6_562;
		word32 s7_563;
		word32 a1_553;
		word32 a0_552;
		word32 s8_564;
		word32 s9_565;
		word32 s10_566;
		word32 s11_567;
		word32 t4_568;
		ra_133 = printf(ra_133, &g_t230B8EA4, a3_120, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_134, out a0_552, out a1_553, out a2_554, out a3_555, out a4_556, out a5_557, out a7_558, out s2_559, out s3_138, out s4_560, out s5_561, out s6_562, out s7_563, out s8_564, out s9_565, out s10_566, out s11_567, out t4_568);
		ui32 a5_147 = (word32) s1_134->b000B;
		s1_134->b000B = (byte) (a5_147 & ~0x01);
		a5_107 = a5_147 & ~0x01;
	}
	else
		s1_111->b000B = (byte) (a4_110 & ~0x01);
	word32 s0_153 = (word32) a5_107->b001E;
	a4_118 = a5_107 + (s0_153 + 89) / 31;
	s4_159 = (word32) *((word32) a4_118 + 64);
	s1_160 = a5_107 + (s0_153 + 0x009A) / 31;
l23042B44:
	a0_208 = s1_160;
	word32 a2_569;
	word32 a2_570;
	word32 s0_571;
	ra_219 = bt_mesh_net_encrypt(ra_133, s1_160, g_t4200D6BC - atomic_test_bit.constprop.8(out a2_570), s3_138, net_buf_simple_push_u8((s4_159 | (word32) g_t4200D6BC - atomic_test_bit.constprop.8(out a2_569) << 7) & 0x00FF, a4_118), out s0_571, out s1_221, out a1_212, out a3_214, out a4_215, out a5_216, out s2_224, out s3_225, out s5_227, out s6_228, out s7_229, out s9_231, out s10_222, out s11_223);
	if (s1_160 == 0x00)
	{
		Eq_2 s1_239 = *s2_224;
		word32 a2_572;
		Eq_213742 a1_247 = *s5_227 - atomic_test_bit.constprop.8(out a2_572);
		0x00 = (int8) dwArgA8;
		Eq_2 a0_256;
		ptr32 a1_257;
		ptr32 a3_259;
		ptr32 a4_260;
		ptr32 a5_261;
		Eq_2 s0_265;
		ptr32 s1_266;
		ptr32 s10_267;
		union Eq_2 * s2_268;
		ptr32 s3_269;
		int32 * s5_271;
		ptr32 s6_272;
		word32 a2_573;
		word32 s4_574;
		word32 s8_575;
		Eq_2 ra_264 = bt_mesh_net_obfuscate(ra_219, s1_239, a1_247, dwArg48, dwArg0128, out s0_265, out s1_266, out a0_256, out a1_257, out a2_573, out a3_259, out a4_260, out a5_261, out s2_268, out s3_269, out s4_574, out s5_271, out s6_272, out s8_575, out s10_267);
		s0Out = s0_265;
		s1Out = s1_266;
		a0Out = a0_256;
		a1Out = a1_257;
		a3Out = a3_259;
		a4Out = a4_260;
		a5Out = a5_261;
		s2Out = s2_268;
		s3Out = s3_269;
		s5Out = s5_271;
		s6Out = s6_272;
		s7Out = s7_229;
		s9Out = s9_231;
		s10Out = s10_267;
		s11Out = s11_223;
		mstatusOut = mstatus;
		return ra_264;
	}
l23042A72:
	0x00 = (int8) dwArgA8;
	s0Out = s1;
	s1Out = s1_221;
	a0Out = a0_208;
	a1Out = a1_212;
	a3Out = a3_214;
	a4Out = a4_215;
	a5Out = a5_216;
	s2Out = s2_224;
	s3Out = s3_225;
	s5Out = s5_227;
	s6Out = s6_228;
	s7Out = s7_229;
	s9Out = s9_231;
	s10Out = s10_222;
	s11Out = s11_223;
	mstatusOut = mstatus;
	return ra_219;
}

