pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23042BEE: Register Eq_2 bt_mesh_net_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out (ptr32 Eq_184603) s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out (ptr32 Eq_184613) s6Out, Register out (ptr32 Eq_184614) s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out (ptr32 Eq_184617) s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      blemesh_net_send
//      bt_mesh_trans_send
//      bt_mesh_ctl_send
Eq_2 bt_mesh_net_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & s0Out, struct Eq_184603 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, struct Eq_184613 & s6Out, struct Eq_184614 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, struct Eq_184617 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s4_19 = *((word32) a0 + 4);
	struct Eq_223450 * sp_193 = fp + ~0x1F;
	struct Eq_223034 * a5_20 = (struct Eq_223034 *) 0x00FF;
	if ((word32) *((word32) s4_19 + 11) == 0x00FF)
		*((word32) s4_19 + 11) = (byte) bt_mesh_default_ttl_get(out a5_20);
	Eq_2 a0_49;
	word32 a3_612;
	word32 s0_611;
	struct Eq_220189 * a5_114;
	Eq_2 s5_187;
	Eq_2 s6_190;
	Eq_2 s3_142;
	Eq_2 s2_146;
	Eq_2 s1_144;
	Eq_2 a1_126;
	ptr32 mstatus_103;
	Eq_2 a4_101;
	ptr32 s9_107;
	struct Eq_184614 * s7_106;
	ptr32 s11_105;
	struct Eq_184617 * s10_104;
	Eq_2 ra_148 = bt_mesh_net_encode(ra, a0, a2, (word32) a1 + 8, a3, a5_20, a1, s4_19, s6, mstatus, dwLoc20, s4, s2, s0, dwLoc08, dwArg08, dwArg10, dwArg14, dwArg18, dwArg28, dwArg30, dwArg34, dwArg38, dwArg58, dwArg5C, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, out s0_611, out s1_144, out a0_49, out a1_126, out a3_612, out a4_101, out a5_114, out s2_146, out s3_142, out s5_187, out s6_190, out s7_106, out s9_107, out s10_104, out s11_105, out mstatus_103);
	Eq_2 s4_185 = a0_49;
	if (a0_49 == 0x00)
	{
		if ((word32) a5_114->b000B != 0x01)
		{
			word32 a0_84;
			word32 s0_613;
			word32 a3_614;
			ra_148 = bt_mesh_proxy_relay(ra_148, s5_187, (word32) a5_114->t0004, 0x01, s3_142, a0_49, s5_187, s6_190, mstatus_103, dwLoc20, s4, s2, dwArg00, dwArg08, dwArg0C, dwArg18, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgB8, out s0_613, out s1_144, out a0_84, out a1_126, out a3_614, out a4_101, out a5_114, out s2_146, out s3_142, out s4_185, out s5_187, out s6_190, out s7_106, out s9_107, out s10_104, out s11_105, out mstatus_103);
			if (a0_84 != 0x00)
			{
				Eq_2 s0_113 = a5_114->t0004;
				a5_114 = (int32) a5_114->t0004;
				if (a5_114 > null)
				{
					word32 s0_615;
					ra_148 = send_cb_finalize(ra_148, s0_113, s1_144, s3_142, a5_114, dwLoc10, dwLoc0C, out s0_615, out s1_144, out a1_126);
					goto l23042C5A;
				}
			}
		}
		Eq_2 s0_117 = a5_114->t0004;
		struct Eq_223603 * a5_122;
		Eq_2 a3_121;
		Eq_2 a4_123;
		if (bt_mesh_fixed_group_match((word32) a5_114->t0004, out a3_121, out a4_123, out a5_122) == 0x00)
		{
			s0_117 = a5_122->t0004;
			if (bt_mesh_elem_find((word32) a5_122->t0004, a1_126, out a1_126, out a3_121, out a4_123, out a5_122) == 0x00)
			{
				Eq_2 s0_139 = a5_122->t0004;
				a4_101 = (word32) a5_122->b000B;
				if (a4_101 != 0x01)
				{
					word32 a5_631;
					word32 s3_632;
					word32 a3_630;
					word32 s8_635;
					word32 s6_634;
					word32 s5_633;
					s1_144 = bt_mesh_adv_send(ra_148, s0_139, s1_144, s3_142, a4_101, mstatus_103, dwArgC8, dwArg0108, dwArg0148, out a1_126, out a3_630, out a4_101, out a5_631, out s2_146, out s3_632, out s5_633, out s6_634, out s8_635);
				}
				goto l23042C5A;
			}
		}
		if (s1_144 != 0x00)
		{
			word32 s1_176 = a5_122->t0000;
			if (a5_122 != null)
				a5_122();
		}
		net_buf_ref(s2_146);
		word32 s8_621;
		<anonymous> * a5_238;
		word32 s1_240;
		word32 s4_620;
		Eq_2 a4_237;
		Eq_2 a3_236;
		word32 s0_244 = (word32) net_buf_slist_put(s2_146, a3_121, a4_123, mstatus_103, out s1_240, out a3_236, out a4_237, out a5_238, out s4_620, out s8_621) + 0x06BC;
		if (s1_240 != 0x00 && a5_238 != null)
			a5_238();
		word32 a0_622;
		word32 s5_627;
		word32 a3_623;
		word32 a5_624;
		word32 s3_625;
		word32 s4_626;
		word32 s8_629;
		word32 s6_628;
		k_work_submit(s0_244 + 0x0C, a3_236, a4_237, mstatus_103, sp_193->t0004, sp_193->t0084, sp_193->t00F8, sp_193->t0138, sp_193->t0178, out s1_144, out a0_622, out a1_126, out a3_623, out a4_101, out a5_624, out s2_146, out s3_625, out s4_626, out s5_627, out s6_628, out s8_629);
	}
l23042C5A:
	word32 s0_616;
	ptr32 a1_314;
	ptr32 a3_316;
	ptr32 a4_317;
	ptr32 a5_318;
	ptr32 mstatus_321;
	struct Eq_184603 * s1_324;
	ptr32 s2_325;
	ptr32 s3_326;
	ptr32 s4_327;
	ptr32 s5_328;
	struct Eq_184613 * s6_329;
	word32 a0_617;
	word32 a2_618;
	word32 s8_619;
	Eq_2 ra_322 = net_buf_unref(ra_148, s1_144, s2_146, a1_126, a4_101, mstatus_103, dwLoc20, s4, s2, dwArg08, dwArg58, s3, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_616, out s1_324, out a0_617, out a1_314, out a2_618, out a3_316, out a4_317, out a5_318, out s2_325, out s3_326, out s4_327, out s5_328, out s6_329, out s8_619, out mstatus_321);
	s0Out = s1;
	s1Out = s1_324;
	a0Out = s4_327;
	a1Out = a1_314;
	a3Out = a3_316;
	a4Out = a4_317;
	a5Out = a5_318;
	s2Out = s2_325;
	s3Out = s3_326;
	s4Out = dwArg04;
	s5Out = s5_328;
	s6Out = s6_329;
	s7Out = s7_106;
	s8Out = s4;
	s9Out = s9_107;
	s10Out = s10_104;
	s11Out = s11_105;
	mstatusOut = mstatus_321;
	return ra_322;
}

