pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23042CE6: Register Eq_2 bt_mesh_subnet_find(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg5C, Stack Eq_2 dwArgA8, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out (ptr32 byte) s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      bt_mesh_beacon_recv
Eq_2 bt_mesh_subnet_find(Eq_2 ra, Eq_2 a0, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg5C, Eq_2 dwArgA8, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, byte & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	ptr32 a0_104;
	ptr32 a4_107;
	ptr32 a5_109;
	Eq_2 s2_116 = a0;
	byte * s5_136 = a4;
	ptr32 s3_114 = a1;
	ptr32 s6_101 = a3;
	Eq_2 s1_105 = 0x4200D6BC;
	if ((word32) g_w4200D8DC != 0x0FFFFFFF)
	{
		word32 a0_41;
		struct Eq_223765 * s0_48;
		ra = auth_match(ra, 0x4200D6BC, &g_t4200D8F0, a0, dwArg10, dwArg14, dwArg5C, out s0_48, out s1_105, out a0_41, out a3, out a4_107, out a5_109, out s2_116, out s3_114, out s5_136, out s6_101, out s7, out s9, out s10);
		if (a0_41 != 0x00)
		{
			a0_104 = (char *) s0_48 + 516;
			goto l23042D66;
		}
		if ((word32) s0_48->b0223 != 0x00)
		{
			word32 a0_76;
			word32 s0_83;
			word32 a5_380;
			ra = auth_match(ra, s1_105, &s0_48->b0223 + 0x006A, s2_116, dwArg10, dwArg14, dwArg5C, out s0_83, out s1_105, out a0_76, out a3, out a4_107, out a5_380, out s2_116, out s3_114, out s5_136, out s6_101, out s7, out s9, out s10);
			if (a0_76 != 0x00)
			{
				a0_104 = s0_83 + 516;
				goto l23042DA0;
			}
		}
	}
	a4_107 = (word32) *((word32) s1_105 + 772);
	a5_109 = 0x0FFFFFFF;
	if (a4_107 != 0x0FFFFFFF)
	{
		word32 a0_121;
		Eq_2 s1_129;
		word32 s0_381;
		ra = auth_match(ra, s1_105, (word32) s1_105 + 792, s2_116, dwArg10, dwArg14, dwArg5C, out s0_381, out s1_129, out a0_121, out a3, out a4_107, out a5_109, out s2_116, out s3_114, out s5_136, out s6_101, out s7, out s9, out s10);
		if (a0_121 != 0x00)
		{
			a0_104 = (word32) s1_129 + 744;
l23042D66:
			*s5_136 = 0x00;
l23042D6A:
			0x00 = (int8) dwArgA8;
			a0Out = a0_104;
			a3Out = a3;
			a4Out = a4_107;
			a5Out = a5_109;
			s2Out = s2_116;
			s3Out = s3_114;
			s4Out = dwArg04;
			s5Out = s5_136;
			s6Out = s6_101;
			s7Out = s7;
			s9Out = s9;
			s10Out = s10;
			return ra;
		}
		a5_109 = (word32) *((word32) s1_129 + 775);
		if (a5_109 != 0x00)
		{
			word32 a0_155;
			word32 s1_163;
			word32 s0_382;
			ra = auth_match(ra, s1_129, (word32) s1_129 + 881, s2_116, dwArg10, dwArg14, dwArg5C, out s0_382, out s1_163, out a0_155, out a3, out a4_107, out a5_109, out s2_116, out s3_114, out s5_136, out s6_101, out s7, out s9, out s10);
			if (a0_155 != 0x00)
			{
				a0_104 = s1_163 + 744;
l23042DA0:
				*s5_136 = 0x01;
				a5_109 = 0x01;
				goto l23042D6A;
			}
		}
	}
	a0_104 = 0x00;
	goto l23042D6A;
}

// 23042DB2: Register Eq_2 bt_mesh_net_decode(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_220357) a2, Register Eq_2 a3, Register Eq_2 s10, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_223904 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_223907 a4Out, Register out Eq_223904 a5Out, Register out (ptr32 Eq_223909) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s9Out, Register out (ptr32 Eq_223916) s10Out, Register out Eq_2 s11Out)
// Called from:
//      bt_mesh_net_recv
//      proxy_complete_pdu
Eq_2 bt_mesh_net_decode(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, struct Eq_220357 * a2, Eq_2 a3, Eq_2 s10, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg3C, Eq_2 dwArg7C, Eq_2 dwArgA8, Eq_2 dwArg0158, Eq_2 dwArg0198, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_223904 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_223907 & a4Out, union Eq_223904 & a5Out, struct Eq_223909 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s9Out, struct Eq_223916 & s10Out, union Eq_2 & s11Out)
{
	Eq_223907 a4_268;
	Eq_2 s1_119;
	struct Eq_223916 * s10_112;
	Eq_2 s11_104;
	struct Eq_223909 * s2_1000;
	ptr32 s3_1009;
	ptr32 s5_1012;
	Eq_2 s9_1032;
	Eq_2 s7_1029;
	Eq_223904 a5_365;
	Eq_2 a1_129 = (word32) *((word32) a0 + 4);
	if (a1_129 <= 0x11)
	{
		Eq_2 a0_506;
		struct Eq_223966 * s1_515;
		word32 s11_1148;
		word32 t4_1149;
		word32 s10_1147;
		word32 a1_1133;
		word32 a3_1135;
		word32 a2_1134;
		word32 a4_1136;
		word32 a5_1137;
		word32 a7_1138;
		word32 s2_1139;
		word32 s4_1141;
		word32 s3_1140;
		word32 s6_1143;
		word32 s5_1142;
		word32 s7_1144;
		word32 s8_1145;
		word32 s9_1146;
		Eq_2 ra_514 = printf(ra, &g_t230B8DC4, a3, s10, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_515, out a0_506, out a1_1133, out a2_1134, out a3_1135, out a4_1136, out a5_1137, out a7_1138, out s2_1139, out s3_1140, out s4_1141, out s5_1142, out s6_1143, out s7_1144, out s8_1145, out s9_1146, out s10_1147, out s11_1148, out t4_1149);
		Eq_2 a3_533;
		bt_hex_real(a0_506, (word32) s1_515->w0004, out a3_533);
		word32 s4_1154;
		word32 s8_1155;
		word32 t4_1156;
		word32 a0_1150;
		word32 a2_1151;
		word32 a5_1152;
		word32 a7_1153;
		ra = printf(ra_514, &g_t230BC2D4, a3_533, s10, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_119, out a0_1150, out a1_129, out a2_1151, out a3, out a4_268, out a5_1152, out a7_1153, out s2_1000, out s3_1009, out s4_1154, out s5_1012, out s6, out s7_1029, out s8_1155, out s9_1032, out s10_112, out s11_104, out t4_1156);
		a5_365.u0 = ~0x15;
		goto l23042E02;
	}
	a4_268 = (a1 & 3) << 0x04;
	a2->b0020 = (byte) ((word32) a2->b0020 & -49 | a4_268);
	s9_1032 = *a0;
	s1_119 = (word32) *((word32) a0 + 4);
	s10_112 = (struct Eq_223916 *) &g_w4201436C;
	struct Eq_223958 * s8_107 = &g_t4200D6BC;
	struct Eq_220357 * s0_117 = a2;
	s7_1029 = a3;
	s3_1009 = 0x00;
	s2_1000 = (struct Eq_223909 *) &g_t4200D6BC;
	s5_1012 = 0x0FFFFFFF;
	s11_104.u0 = 1107379110;
l23042E62:
	ptr32 a5_59 = (word32) s8_107->w0220;
	if (a5_59 == s5_1012)
	{
l23043054:
		++s8_107;
		if (s3_1009 != 0x00)
		{
			a5_365.u0 = ~0x01;
			goto l23042E02;
		}
		s3_1009 = 0x01;
		goto l23042E62;
	}
	word32 s4_142;
	ui32 a5_263;
	s6 = (char *) s8_107 + 516;
	if ((word32) s10_112->w0000 == a5_59)
	{
		if ((word32) s10_112->b0008 == ((word32) (*s9_1032) & 0x007F))
		{
			word32 a0_79;
			word32 a4_1157;
			ra = net_decrypt.isra.1(ra, s1_119, &s10_112->b0008 + 0x0011, s9_1032, s1_119, s0_117, dwLoc10, dwLoc0C, dwArg08, dwArg3C, dwArgA8, dwArg0158, out s0_117, out s1_119, out a0_79, out a1_129, out a3, out a4_1157, out s2_1000, out s3_1009, out s4_142, out s5_1012, out s6, out s7_1029, out s8_107, out s9_1032, out s10_112, out s11_104);
			if (a0_79 == 0x00)
				goto l23042FD2;
		}
		if ((word32) s8_107->b0223 != 0x00 && (word32) s10_112->b0029 == ((word32) (*s9_1032) & 0x007F))
		{
			word32 a0_128;
			word32 a4_1158;
			ra = net_decrypt.isra.1(ra, s1_119, s11_104, s9_1032, s1_119, s0_117, dwLoc10, dwLoc0C, dwArg08, dwArg3C, dwArgA8, dwArg0158, out s0_117, out s1_119, out a0_128, out a1_129, out a3, out a4_1158, out s2_1000, out s3_1009, out s4_142, out s5_1012, out s6, out s7_1029, out s8_107, out s9_1032, out s10_112, out s11_104);
			if (a0_128 == 0x00)
				goto l23043010;
		}
	}
	if ((word32) s10_112->w004A == (word32) s8_107->w0220)
	{
		if ((word32) s10_112->b0052 == ((word32) (*s9_1032) & 0x007F))
		{
			word32 a0_178;
			word32 a4_1159;
			ra = net_decrypt.isra.1(ra, s1_119, 1107379151, s9_1032, s1_119, s0_117, dwLoc10, dwLoc0C, dwArg08, dwArg3C, dwArgA8, dwArg0158, out s0_117, out s1_119, out a0_178, out a1_129, out a3, out a4_1159, out s2_1000, out s3_1009, out s4_142, out s5_1012, out s6, out s7_1029, out s8_107, out s9_1032, out s10_112, out s11_104);
			if (a0_178 == 0x00)
			{
l23042FD2:
				a5_263 = (word32) s0_117->b0020 | 4;
				goto l23042FDA;
			}
		}
		if ((word32) s8_107->b0223 == 0x00 || (word32) s10_112->b0073 != ((word32) (*s9_1032) & 0x007F))
			goto l23042EEE;
		word32 a0_227;
		word32 a4_1160;
		ra = net_decrypt.isra.1(ra, s1_119, 0x420143F0, s9_1032, s1_119, s0_117, dwLoc10, dwLoc0C, dwArg08, dwArg3C, dwArgA8, dwArg0158, out s0_117, out s1_119, out a0_227, out a1_129, out a3, out a4_1160, out s2_1000, out s3_1009, out s4_142, out s5_1012, out s6, out s7_1029, out s8_107, out s9_1032, out s10_112, out s11_104);
		if (a0_227 == 0x00)
		{
l23043010:
			s0_117->b0020 = (byte) ((word32) s0_117->b0020 | 2);
			goto l23042FD2;
		}
	}
l23042EEE:
	a4_268 = (word32) s8_107->b0244;
	if (a4_268 == ((word32) (*s9_1032) & 0x007F))
	{
		word32 a0_281;
		ra = net_decrypt.isra.1(ra, s1_119, &s8_107->b0244 + 41, s9_1032, s1_119, s0_117, dwLoc10, dwLoc0C, dwArg08, dwArg3C, dwArgA8, dwArg0158, out s0_117, out s1_119, out a0_281, out a1_129, out a3, out a4_268, out s2_1000, out s3_1009, out s4_142, out s5_1012, out s6, out s7_1029, out s8_107, out s9_1032, out s10_112, out s11_104);
		if (a0_281 == 0x00)
			goto l23042F16;
	}
	if ((word32) s8_107->b0223 != 0x00)
	{
		a4_268 = (word32) s8_107->b029D;
		if (a4_268 == ((word32) (*s9_1032) & 0x007F))
		{
			word32 a0_327;
			ra = net_decrypt.isra.1(ra, s1_119, &s8_107->b029D + 41, s9_1032, s1_119, s0_117, dwLoc10, dwLoc0C, dwArg08, dwArg3C, dwArgA8, dwArg0158, out s0_117, out s1_119, out a0_327, out a1_129, out a3, out a4_268, out s2_1000, out s3_1009, out s4_142, out s5_1012, out s6, out s7_1029, out s8_107, out s9_1032, out s10_112, out s11_104);
			if (a0_327 == 0x00)
			{
				a5_263 = (word32) s0_117->b0020 | 2;
l23042FDA:
				s0_117->b0020 = (byte) a5_263;
l23042F16:
				struct Eq_274 * a0_462;
				s3_1009 += 228;
				s2_1000 += s3_1009 / 228;
				word32 a5_383 = (word32) s2_1000->w0220;
				s0_117->dw0000 = s6;
				s0_117->w0004 = (word16) a5_383;
				s0_117->w0006 = ~0x00;
				ui32 a5_398 = (word32) *((word32) *s7_1029 + 1);
				s0_117->b000D = (byte) (a5_398 & 0x007F);
				s0_117->b000F = (byte) (0x00 - (word32) ((a5_398 & 0x007F) != 0x00));
				s0_117->b0020 = (byte) ((word32) s0_117->b0020 & ~0x08 | ((word32) (*((word32) (*s7_1029) + 1)) >> 7) << 0x03);
				struct Eq_224320 * a4_412 = *s7_1029;
				ui32 a3_414 = (word32) a4_412->b0003;
				((word32) a4_412->b0002 << 16 | a3_414 << 8 | (word32) a4_412->b0004)->ptr001C = s0_117;
				struct Eq_224346 * a4_421 = *s7_1029;
				ui32 a5_425 = (word32) a4_421->b0007 << 8 | (word32) a4_421->b0008;
				s0_117->w000A = (word16) a5_425;
				a3 = a3_414 << 8;
				if (s4_142 != 0x03 && a5_425 == 0x00)
				{
					a0_462 = (struct Eq_274 *) &g_t230B8DF0;
					goto l23042FA6;
				}
				a4_268.u0 = 0x00FB;
				if ((word32) (word16) (a5_425 + 0x0100) <= 0x00FB)
				{
					a0_462 = (struct Eq_274 *) &g_t230B8E28;
l23042FA6:
					word32 a0_1161;
					word32 a5_1163;
					word32 t4_1167;
					word32 a7_1164;
					word32 s4_1165;
					word32 s8_1166;
					word32 a2_1162;
					ra = printf(ra, a0_462, a3_414 << 8, s10, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_119, out a0_1161, out a1_129, out a2_1162, out a3, out a4_268, out a5_1163, out a7_1164, out s2_1000, out s3_1009, out s4_1165, out s5_1012, out s6, out s7_1029, out s8_1166, out s9_1032, out s10_112, out s11_104, out t4_1167);
					a5_365.u0 = -77;
					goto l23042E02;
				}
				if (s4_142 != 0x01)
				{
					a5_365.u0 = -77;
					word32 a5_1168;
					if (bt_mesh_elem_find((word32) s0_117->w0008, a1_129, out a1_129, out a3, out a4_268, out a5_1168) != 0x00)
					{
l23042E02:
						0x00 = (int8) dwArg0198;
						s0Out = dwArg0158;
						s1Out = s1_119;
						a0Out = a5_365;
						a1Out = a1_129;
						a3Out = a3;
						a4Out = a4_268;
						a5Out = a5_365;
						s2Out = s2_1000;
						s3Out = s3_1009;
						s4Out = dwLoc14;
						s5Out = s5_1012;
						s6Out = s6;
						s7Out = s7_1029;
						s9Out = s9_1032;
						s10Out = s10_112;
						s11Out = s11_104;
						return ra;
					}
				}
				a5_365.u0 = 0x00;
				goto l23042E02;
			}
		}
	}
	goto l23043054;
}

