pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23043094: Register Eq_2 bt_mesh_net_recv(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s8, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_195935 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out Eq_2 s9Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_scan_cb
//      bt_mesh_net_local
//      proxy_complete_pdu
Eq_2 bt_mesh_net_recv(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, ptr32 a1, Eq_2 a2, Eq_2 s2, Eq_2 s4, Eq_2 s8, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_195935 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, union Eq_2 & s9Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	word32 a0_1363;
	word32 t1_1362;
	word32 a2_1364;
	word32 a3_1365;
	Eq_195935 a5_1243;
	Eq_2 a4_1241;
	Eq_2 a1_1235;
	Eq_2 ra_37 = memset(ra, fp + -0x0044, 0x00, 36, out t1_1362, out a0_1363, out a1_1235, out a2_1364, out a3_1365, out a4_1241, out a5_1243);
	uint16 wLoc3C_655 = (uint16) s0;
	uint16 wLoc3A_657 = SLICE(s0, uint16, 16);
	ptr32 s0_1268 = a1;
	Eq_2 s2_1285 = a0;
	Eq_2 s3_1288 = a2;
	uint16 wLoc6C_654 = (uint16) (fp + -100);
	byte bLoc38_647 = (byte) a1;
	Eq_2 a0_1234 = bt_mesh_is_provisioned();
	if (a0_1234 == 0x00)
	{
l23043190:
		s0Out = s0_1268;
		s1Out = dwArgA4;
		a0Out = a0_1234;
		a1Out = a1_1235;
		a3Out = dwArgC0;
		a4Out = a4_1241;
		a5Out = a5_1243;
		s2Out = s2_1285;
		s3Out = s3_1288;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = dwArg18;
		s10Out = s10;
		mstatusOut = mstatus;
		return dwArgE8;
	}
	Eq_2 s11_57;
	Eq_2 s9_63;
	word32 a3_1367;
	word32 s1_1366;
	Eq_2 ra_68 = bt_mesh_net_decode(ra_37, s1, a0, a2, fp + -0x0044, fp + -112, s10, dwLoc68, s2, s0, dwLoc34, dwArg0C, dwArg38, dwArgE8, dwArg0128, out s0_1268, out s1_1366, out a0_1234, out a1_1235, out a3_1367, out a4_1241, out a5_1243, out s2_1285, out s3_1288, out s4, out s5, out s6, out s7, out s9_63, out s10, out s11_57);
	if (a0_1234 != 0x00)
		goto l23043190;
	Eq_2 a0_76 = net_buf_simple_headroom(a4_1241);
	Eq_2 s1_79 = (word32) wLoc6C_654;
	word16 wLoc6A_986 = SLICE(fp + -100, word16, 16);
	if (s3_1288 == 0x02)
	{
		a1_1235 = (word32) wLoc3C_655;
		bt_mesh_proxy_addr_add(s2_1285, a1_1235);
	}
	ui32 a4_109 = 0x01;
	word32 a5_1370;
	word32 a4_1369;
	word32 a3_1368;
	if (bt_mesh_fixed_group_match((word32) wLoc3A_657, out a3_1368, out a4_1369, out a5_1370) == 0x00)
	{
		word32 a1_1371;
		word32 a3_1372;
		word32 a4_1373;
		word32 a5_1374;
		a4_109 = (word32) (bt_mesh_elem_find((word32) wLoc3A_657, a1_1235, out a1_1371, out a3_1372, out a4_1373, out a5_1374) != 0x00);
	}
	byte bLoc24_661 = (byte) ((word32) bLoc24 & -65 | a4_109 << 6);
	Eq_2 a3_151;
	word32 s1_158;
	Eq_2 ra_156 = bt_mesh_trans_recv(ra_68, a0_76, s1_79, fp + -112, s2_1285, s3_1288, s4, s6, s7, s8, s9_63, s10, s11_57, mstatus, fp + -100, fp + -100, dwLoc68, dwLoc64, dwLoc60, dwLoc5C, dwLoc58, dwLoc54, dwLoc48, dwLoc18, dwLoc14, dwLoc0C, dwLoc08, dwArg08, dwArg14, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgC8, out s0_1268, out s1_158, out a0_1234, out a1_1235, out a3_151, out a4_1241, out s2_1285, out s3_1288, out s4, out s5, out s6, out s7, out s8, out s10, out mstatus);
	if (a0_1234 == ~0x0A)
	{
		a4_1241 = (word32) wLoc22;
		word32 a4_1377;
		word32 a3_1376;
		word32 a2_1375;
		word32 a5_1378;
		word32 a7_1379;
		word32 s9_1380;
		word32 s11_1381;
		word32 t4_1382;
		ra_156 = printf(ra_156, &g_t230B905C, a3_151, dwLoc68, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_158, out a0_1234, out a1_1235, out a2_1375, out a3_1376, out a4_1377, out a5_1378, out a7_1379, out s2_1285, out s3_1288, out s4, out s5, out s6, out s7, out s8, out s9_1380, out s10, out s11_1381, out t4_1382);
		Eq_2 a5_208 = (a4_1241 << 0x03) + 0x42014400;
		null = (union Eq_2 *) a5_208;
		*(union Eq_2 *) 4 = a5_208;
		g_w4200F434 = (word16) a4_1241;
	}
	int32 a5_217 = (int32) wLoc3A_657;
	if (a5_217 > 0x00)
	{
		a5_1243 = a5_217 & 0x00C0;
		if ((a5_217 & 0x00C0) != 0x00)
			goto l23043190;
	}
	Eq_2 a5_246;
	Eq_2 a0_245;
	s0_1268 = (word32) (word16) dwLoc2C;
	ui32 a5_224 = (word32) bLoc24_661;
	a0_1234 = (word32) a0_1234 + s0_1268;
	uint16 wLoc6C_761 = (word16) s1_158;
	a5_1243 = a5_224 & 48;
	a4_1241 = (word32) bLoc37;
	if ((a5_224 & 48) == 0x10)
	{
		a5_1243.u0 = 0x01;
		if (a4_1241 == 0x01)
			goto l23043190;
	}
	else
	{
		s0_1268 = 0x01;
		if (a4_1241 <= 0x01)
			goto l23043190;
		if ((a5_224 & 48) == 0x00)
		{
			word32 a5_1383;
			if (bt_mesh_relay_get(out a5_1383) != 0x01)
			{
				a0_1234 = bt_mesh_gatt_proxy_get(out a5_1243);
				if (a0_1234 != 0x01)
					goto l23043190;
			}
			if (((word32) bLoc24_661 & 48) == 0x00)
			{
				a0_245 = bt_mesh_relay_retransmit_get(out a5_246);
l230431CE:
				ptr32 a0_274;
				Eq_2 a1_275;
				Eq_2 a3_277;
				struct Eq_224827 * s2_288;
				word32 s1_1385;
				word32 a4_1386;
				word32 s0_1384;
				word32 s11_1396;
				word32 a5_1387;
				word32 s3_1388;
				word32 s4_1389;
				word32 s5_1390;
				word32 s6_1391;
				word32 s7_1392;
				word32 s9_1394;
				word32 s8_1393;
				word32 s10_1395;
				Eq_2 ra_283 = bt_mesh_adv_create(ra_156, a0_245, 0x00, a5_246, s5, mstatus, dwLoc30, dwLoc2C, dwLoc08, dwArg14, dwArg1C, dwArg28, dwArg68, dwArg88, dwArgB8, out s0_1384, out s1_1385, out a0_274, out a1_275, out a3_277, out a4_1386, out a5_1387, out s2_288, out s3_1388, out s4_1389, out s5_1390, out s6_1391, out s7_1392, out s8_1393, out s9_1394, out s10_1395, out s11_1396, out mstatus);
				s0_1268 = a0_274;
				if (a0_274 == 0x00)
				{
					word32 s9_1401;
					word32 t4_1403;
					word32 s11_1402;
					word32 a7_1400;
					word32 s1_1397;
					word32 a2_1398;
					word32 a3_1399;
					printf(ra_283, &g_t230B9094, a3_277, dwLoc68, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_1397, out a0_1234, out a1_1235, out a2_1398, out a3_1399, out a4_1241, out a5_1243, out a7_1400, out s2_1285, out s3_1288, out s4, out s5, out s6, out s7, out s8, out s9_1401, out s10, out s11_1402, out t4_1403);
					goto l23043190;
				}
				Eq_2 dwLoc38_918 = SEQ(wLoc36, bLoc37, bLoc38_647);
				if (((word32) bLoc24_661 & 48) != 0x10)
				{
					0x00 = (int8) dwArg54;
					*(union Eq_2 *) 0x11 = (byte) ((word32) *(union Eq_2 *) 0x11 & -0x0080);
					0x00 = (int8) dwArg54;
					*(union Eq_2 *) 0x11 = (byte) ((word32) bLoc37 + ~0x00 | (word32) (*((union Eq_2 *) 0x11)));
				}
				null = dwLoc0C;
				byte * a3_326;
				word32 a4_1406;
				word32 a5_1407;
				word32 a1_1404;
				word32 a2_1405;
				net_buf_simple_add_mem(a0_274 + 8, a1_275, (word32) wLoc6C_761, 0x10, out a1_1404, out a2_1405, out a3_326, out a4_1406, out a5_1407);
				ui32 a5_339 = (word32) bLoc24_661;
				word32 s1_341 = (word32) s2_288->b001E;
				ui32 a5_342 = a5_339 & 0x04;
				Eq_2 a0_345 = s2_288 + (s1_341 + 0x009A) / 31;
				Eq_2 dwLoc6C_988 = SEQ(wLoc6A_986, wLoc6C_761);
				if ((a5_339 & 0x04) != 0x00)
				{
					ui32 a5_348 = (word32) (&(s2_288 + (s1_341 + 89) / 31)->b001E)[0x0022];
					ui32 a4_349 = (word32) *a3_326;
					*a3_326 = (byte) (a4_349 & -0x0080);
					a5_342 = a5_348 | (word32) (*(a4_349 & -0x0080));
					*(a4_349 & -0x0080) = (byte) a5_342;
				}
				Eq_2 a4_466;
				Eq_2 a1_406;
				Eq_2 s1_415;
				struct Eq_274 * a0_535;
				struct Eq_215703 * a5_364 = a5_342 & 0x01;
				ui32 a5_375;
				word32 s1_380;
				word32 s2_383;
				int32 * s3_384;
				word32 a1_1408;
				word32 a4_1409;
				word32 s5_1410;
				word32 s9_1412;
				word32 s10_1413;
				word32 s11_1414;
				word32 s6_1411;
				Eq_2 a3_373;
				Eq_2 s0_379;
				Eq_2 ra_378 = bt_mesh_net_encrypt(ra_283, a0_345, g_t4200D6BC - a5_364, 0x00, a5_364, out s0_379, out s1_380, out a1_1408, out a3_373, out a4_1409, out a5_375, out s2_383, out s3_384, out s5_1410, out s6_1411, out s7, out s9_1412, out s10_1413, out s11_1414);
				if (a0_345 != 0x00)
				{
					a0_535 = (struct Eq_274 *) &g_t230B90AC;
					goto l2304328A;
				}
				word32 a0_405;
				Eq_2 s3_418;
				Eq_2 s4_419;
				Eq_2 s5_420;
				Eq_2 s6_421;
				word32 a5_1416;
				word32 s8_1418;
				word32 s2_1417;
				word32 a2_1415;
				Eq_2 a4_409;
				ra_378 = bt_mesh_net_obfuscate(ra_378, a0_345, *s3_384 - (a5_375 & 0x01), s1_380 + 0x0069 + s2_383, dwArgB8, out s0_379, out s1_415, out a0_405, out a1_406, out a2_1415, out a3_373, out a4_409, out a5_1416, out s2_1417, out s3_418, out s4_419, out s5_420, out s6_421, out s8_1418, out s10);
				if (a0_405 != 0x00)
				{
					a0_535 = (struct Eq_274 *) &g_t230B90C4;
l2304328A:
					word32 s9_1431;
					word32 t4_1433;
					word32 s11_1432;
					word32 a2_1421;
					word32 a3_1422;
					word32 a5_1423;
					word32 a7_1424;
					word32 s2_1425;
					word32 s4_1427;
					word32 s5_1428;
					word32 s6_1429;
					word32 s8_1430;
					word32 s3_1426;
					word32 a0_1420;
					ra_378 = printf(ra_378, a0_535, a3_373, dwLoc68, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_415, out a0_1420, out a1_406, out a2_1421, out a3_1422, out a4_466, out a5_1423, out a7_1424, out s2_1425, out s3_1426, out s4_1427, out s5_1428, out s6_1429, out s7, out s8_1430, out s9_1431, out s10, out s11_1432, out t4_1433);
					goto l2304328E;
				}
				Eq_225071 a5_435;
				word32 a5_1419;
				if (bt_mesh_gatt_proxy_get(out a5_1419) != 0x01)
				{
					ui32 a5_433 = (word32) bLoc24_661;
					a4_409.u0 = 0x10;
					a5_435 = a5_433 & 48;
					if ((a5_433 & 48) != 0x10)
					{
l230432D0:
						a4_466.u0 = 0x01;
						uint32 a5_484 = a5_435 >> 4;
						if ((a5_484 & 0x03) == 0x01)
						{
l2304330C:
							word32 s6_1447;
							word32 s8_1448;
							word32 s2_1444;
							word32 s3_1445;
							word32 s5_1446;
							word32 a3_1442;
							word32 a5_1443;
							s1_415 = bt_mesh_adv_send(ra_378, s0_379, 0x00, 0x00, a4_466, mstatus, dwArg78, dwArgB8, dwArgF8, out a1_406, out a3_1442, out a4_466, out a5_1443, out s2_1444, out s3_1445, out s5_1446, out s6_1447, out s8_1448);
							goto l2304328E;
						}
						Eq_2 a0_486;
						if ((a5_484 & 0x03) != 0x00)
						{
							a4_466.u0 = 0x02;
							if ((a5_484 & 0x03) != 0x02)
								goto l2304328E;
							word32 a5_1453;
							a0_486 = bt_mesh_gatt_proxy_get(out a5_1453);
						}
						else
						{
							word32 a5_1449;
							a0_486 = bt_mesh_relay_get(out a5_1449);
						}
						if ((word32) (a0_486 < ~0x01) != 0x00)
							goto l2304330C;
l2304328E:
						word32 a3_1452;
						word32 a2_1451;
						word32 s1_1450;
						net_buf_unref(ra_378, s1_415, s0_379, a1_406, a4_466, mstatus, a0_1234, dwLoc6C_988, dwLoc68, dwLoc48, dwArg08, dwArg14, dwArg28, dwArg34, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArg0108, out s0_1268, out s1_1450, out a0_1234, out a1_1235, out a2_1451, out a3_1452, out a4_1241, out a5_1243, out s2_1285, out s3_1288, out s4, out s5, out s6, out s8, out mstatus);
						goto l23043190;
					}
				}
				word32 a0_449;
				word32 s6_1439;
				word32 s11_1441;
				word32 s9_1440;
				word32 s3_1436;
				word32 s4_1437;
				word32 s5_1438;
				word32 a3_1434;
				word32 s2_1435;
				ra_378 = bt_mesh_proxy_relay(ra_378, s4_419, (word32) wLoc3A_657, a4_409, s3_418, s4_419, s5_420, s6_421, mstatus, a0_1234, dwLoc6C_988, dwLoc68, dwLoc50, dwLoc48, s4, dwLoc38_918, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg68, out s0_379, out s1_415, out a0_449, out a1_406, out a3_1434, out a4_466, out a5_435, out s2_1435, out s3_1436, out s4_1437, out s5_1438, out s6_1439, out s7, out s9_1440, out s10, out s11_1441, out mstatus);
				if (a0_449 != 0x00)
				{
					a5_435.u0 = (int32) wLoc3A_657;
					if (a5_435 > 0x00)
						goto l2304328E;
				}
				goto l230432D0;
			}
		}
	}
	a0_245 = bt_mesh_net_transmit_get(out a5_246);
	goto l230431CE;
}

// 23043318: void bt_mesh_net_local(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s8, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void bt_mesh_net_local(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s8, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	struct Eq_225342 ** s1_11 = &g_ptr4200D6D4;
	ra_31 = ra;
	while (true)
	{
		Eq_2 ra_31;
		Eq_2 a0_19;
		Eq_2 s2_25;
		Eq_2 s1_24 = net_buf_slist_get(s1_11, a3, a4, mstatus, dwArg28, out a0_19, out s2_25);
		if (a0_19 == 0x00)
			break;
		Eq_2 a1_36;
		Eq_2 a4_39;
		Eq_2 s0_42;
		Eq_2 s1_43;
		ptr32 mstatus_63;
		word32 a0_205;
		word32 a3_206;
		word32 a5_207;
		word32 s2_208;
		word32 s3_209;
		word32 s4_210;
		word32 s5_211;
		word32 s6_212;
		word32 s7_213;
		word32 s8_214;
		word32 s9_215;
		word32 s0_216;
		word32 a0_217;
		word32 a1_218;
		word32 a2_219;
		word32 a5_220;
		word32 s2_221;
		word32 s3_222;
		word32 s5_223;
		word32 s6_224;
		ra_31 = net_buf_unref(bt_mesh_net_recv(ra_31, a0_19, s1_24, (word32) a0_19 + 8, 0x00, 0x01, s2_25, s4, s8, s10, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out s0_42, out s1_43, out a0_205, out a1_36, out a3_206, out a4_39, out a5_207, out s2_208, out s3_209, out s4_210, out s5_211, out s6_212, out s7_213, out s8_214, out s9_215, out s10, out mstatus_63), s1_43, s0_42, a1_36, a4_39, mstatus_63, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_216, out s1_11, out a0_217, out a1_218, out a2_219, out a3, out a4, out a5_220, out s2_221, out s3_222, out s4, out s5_223, out s6_224, out s8, out mstatus);
	}
}

// 23043350: Register Eq_2 bt_mesh_net_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_provision
Eq_2 bt_mesh_net_start(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 a3_105;
	Eq_2 a4_106;
	Eq_2 s0_112;
	word32 s6_27;
	Eq_2 s5_26;
	Eq_2 s4_25;
	word32 a5_300;
	if (bt_mesh_beacon_get(out a5_300) == 0x01)
	{
		word32 a5_304;
		word32 s2_305;
		s0_112 = bt_mesh_beacon_enable(ra, a3, a4, mstatus, s0, ra, dwArgE8, dwArg0128, dwArg0168, out a3_105, out a4_106, out a5_304, out s2_305, out s4_25, out s5_26, out s6_27);
	}
	else
	{
		word32 s2_302;
		word32 s3_303;
		word32 a5_301;
		a3_105 = bt_mesh_beacon_disable(a3, a4, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a4_106, out a5_301, out s2_302, out s3_303, out s4_25, out s5_26, out s6_27);
		s0_112 = s0;
	}
	Eq_2 ra_111;
	ra_111 = ra;
	word32 a5_319;
	if (bt_mesh_gatt_proxy_get(out a5_319) != 0x02)
	{
		Eq_2 a5_76;
		ptr32 mstatus_84;
		Eq_2 s5_91;
		word32 s11_318;
		word32 s8_316;
		word32 s9_317;
		word32 s6_314;
		word32 s7_315;
		word32 s5_313;
		word32 s4_312;
		word32 s2_310;
		word32 s3_311;
		word32 a0_308;
		word32 a5_309;
		word32 s1_307;
		ra_111 = bt_mesh_adv_update(bt_mesh_proxy_gatt_enable(ra, s0_112, a3_105, a4_106, s4_25, s5_26, s6_27, s11, mstatus, s0, dwLoc08, dwLoc04, dwArg08, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg48, dwArg50, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArg0108, out a5_76, out s5_91, out mstatus_84), a5_76, s5_91, mstatus_84, dwArg20, dwArg24, dwArg48, dwArg6C, dwArg78, dwArgB8, dwArgD8, dwArg0108, dwArg0118, dwArg0158, out s0_112, out s1_307, out a0_308, out a3_105, out a4_106, out a5_309, out s2_310, out s3_311, out s4_312, out s5_313, out s6_314, out s7_315, out s8_316, out s9_317, out s11_318, out mstatus);
	}
	Eq_2 a3_141;
	Eq_2 a4_142;
	ptr32 mstatus_146;
	Eq_2 ra_147 = bt_mesh_lpn_init(ra_111, s0_112, a3_105, a4_106, mstatus, s0, dwLoc08, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg1C, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg48, dwArg58, dwArg68, ra, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out a3_141, out a4_142, out mstatus_146);
	ptr32 a3_170;
	ptr32 s5_179;
	ptr32 s1_175 = bt_mesh_friend_init(ra_147, a3_141, a4_142, mstatus_146, dwArg64, dwArg98, dwArgB8, dwArgF8, out a3_170, out s5_179);
	word32 a5_306;
	bt_mesh_primary_addr(out a5_306);
	bt_mesh_prov_complete();
	s1Out = s1_175;
	a3Out = a3_170;
	s5Out = s5_179;
	mstatusOut = mstatus_146;
	return ra_147;
}

