pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304339E: Register Eq_2 bt_mesh_net_init(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg84, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out ptr32 a4Out)
// Called from:
//      bt_mesh_init
Eq_2 bt_mesh_net_init(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg84, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArg0118, ptr32 & a4Out)
{
	Eq_2 a3_19;
	Eq_2 a4_20;
	word32 a0_56;
	word32 a5_57;
	word32 s2_58;
	word32 s3_59;
	word32 s4_60;
	word32 s5_61;
	k_delayed_work_init(ra, 0x4200D6BC, 0x4200D83C, a3, a4, mstatus, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a0_56, out a3_19, out a4_20, out a5_57, out s2_58, out s3_59, out s4_60, out s5_61);
	Eq_2 a3_40;
	ptr32 a4_41;
	word32 a5_62;
	k_work_init(0x4200D6C8, a3_19, a4_20, mstatus, out a3_40, out a4_41, out a5_62);
	a4Out = a4_41;
	return a3_40;
}

// 230433D2: void ack_complete()
void ack_complete()
{
	g_b4200FB4C = ~0x00;
}

// 230433DE: void prov_capabilities()
// Called from:
//      gen_prov_start
//      bt_mesh_pb_gatt_recv
void prov_capabilities()
{
}

// 230433E0: void prov_failed(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void prov_failed(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t230B9664, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 230433F0: Register Eq_2 prov_buf_init(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a5, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      send_input_complete
//      prov_send_fail_msg
//      prov_confirm
//      prov_invite
//      prov_random
//      prov_data
//      send_pub_key
Eq_2 prov_buf_init(Eq_2 a0, Eq_2 a1, Eq_2 a5, union Eq_2 & a4Out, ptr32 & a5Out)
{
	net_buf_simple_reserve((word32 *) 0x05, a5);
	ptr32 a5_26;
	a4Out = net_buf_simple_add_u8(a0, a1, a5, out a5_26);
	a5Out = a5_26;
	return a1;
}

// 23043412: Register Eq_2 adv_buf_create(Register Eq_2 ra, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      prov_send
//      bearer_ctl_send
//      gen_prov_start
Eq_2 adv_buf_create(Eq_2 ra, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	word32 a0_14;
	ptr32 mstatus_22;
	word32 s0_131;
	word32 s2_132;
	word32 s9_133;
	word32 s10_134;
	word32 s11_135;
	Eq_2 a3_17;
	ptr32 a1_15;
	ptr32 a4_18;
	ptr32 a5_19;
	ptr32 s1_101;
	ptr32 s3_105;
	ptr32 s4_106;
	ptr32 s5_107;
	ptr32 s6_108;
	ptr32 s7_109;
	ptr32 s8_110;
	Eq_2 ra_100 = bt_mesh_adv_create(ra, 0x0A, 400, a5, s5, mstatus, dwArg30, dwArg34, dwArg58, ra, dwArg7C, dwArg88, dwArgC8, dwArgE8, dwArg0118, out s0_131, out s1_101, out a0_14, out a1_15, out a3_17, out a4_18, out a5_19, out s2_132, out s3_105, out s4_106, out s5_107, out s6_108, out s7_109, out s8_110, out s9_133, out s10_134, out s11_135, out mstatus_22);
	if (a0_14 == 0x00)
	{
		word32 a0_136;
		word32 a2_137;
		word32 a7_138;
		word32 s2_139;
		word32 s9_140;
		word32 s10_141;
		word32 s11_142;
		word32 t4_143;
		ra_100 = printf(ra_100, &g_t230B91E8, a3_17, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_101, out a0_136, out a1_15, out a2_137, out a3_17, out a4_18, out a5_19, out a7_138, out s2_139, out s3_105, out s4_106, out s5_107, out s6_108, out s7_109, out s8_110, out s9_140, out s10_141, out s11_142, out t4_143);
	}
	s1Out = s1_101;
	a1Out = a1_15;
	a3Out = a3_17;
	a4Out = a4_18;
	a5Out = a5_19;
	s3Out = s3_105;
	s4Out = s4_106;
	s5Out = s5_107;
	s6Out = s6_108;
	s7Out = s7_109;
	s8Out = s8_110;
	mstatusOut = mstatus_22;
	return ra_100;
}

// 2304343E: Register Eq_2 free_segments(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out Eq_19263 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      prov_clear_tx
//      prov_send
Eq_2 free_segments(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s1Out, union Eq_19263 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 s0_13 = 0x42014460;
	Eq_2 s1_119 = 0x4201446C;
	ra_118 = ra;
	do
	{
		Eq_2 ra_118;
		Eq_19263 a0_102 = *((word32) s0_13 + 316);
		if (a0_102 == 0x00)
			break;
		*((word32) s0_13 + 316) = 0x00;
		Eq_2 a0_18 = *((word32) a4 + 20);
		*((word32) a4 + 8) = (byte) ((word32) *((word32) a4 + 8) & ~0x04);
		word32 a2_166;
		word32 s4_167;
		word32 s8_168;
		ra_118 = net_buf_unref(ra_118, s1_119, a0_18, a1, a4, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_13, out s1_119, out a0_102, out a1, out a2_166, out a3, out a4, out a5, out s2, out s3, out s4_167, out s5, out s6, out s8_168, out mstatus);
	} while (s0_13 != s1_119);
	s1Out = s1_119;
	a0Out = a0_102;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra_118;
}

// 2304347C: Register Eq_2 prov_clear_tx(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      gen_prov_ack
//      prov_send
//      bearer_ctl_send
//      prov_pub_key
//      gen_prov_ctl
Eq_2 prov_clear_tx(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 a4_14;
	Eq_2 a1_19;
	word32 a0_84;
	word32 a2_85;
	word32 a3_86;
	word32 a5_87;
	word32 s2_88;
	word32 s3_89;
	word32 s4_90;
	word32 s5_91;
	word32 s6_92;
	word32 s8_93;
	k_delayed_work_cancel(0x420145A8, a3, a4, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_84, out a1_19, out a2_85, out a3_86, out a4_14, out a5_87, out s2_88, out s3_89, out s4_90, out s5_91, out s6_92, out s8_93);
	ptr32 a0_36;
	ptr32 a3_41;
	ptr32 a4_42;
	ptr32 a5_43;
	ptr32 mstatus_46;
	ptr32 s5_51;
	word32 s1_94;
	word32 s2_95;
	word32 s3_96;
	word32 s6_97;
	Eq_2 ra_47 = free_segments(ra, s0, a1_19, a4_14, mstatus, dwArg18, dwArg68, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s1_94, out a0_36, out a3_41, out a4_42, out a5_43, out s2_95, out s3_96, out s5_51, out s6_97, out mstatus_46);
	a0Out = a0_36;
	a3Out = a3_41;
	a4Out = a4_42;
	a5Out = a5_43;
	s5Out = s5_51;
	mstatusOut = mstatus_46;
	return ra_47;
}

// 23043494: void gen_prov_ack(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_225870) a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void gen_prov_ack(Eq_2 ra, Eq_2 s0, struct Eq_225870 * a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	if (g_a4201459C[0] == 0x00)
		return;
	Eq_2 a4_8 = (word32) a0->b0004;
	if (a4_8 != (word32) g_b42014598)
		return;
	word32 mstatus_127;
	word32 s5_126;
	word32 a5_125;
	word32 a4_124;
	word32 a3_123;
	word32 a0_122;
	prov_clear_tx(ra, s0, a3, a4_8, mstatus, dwArg18, dwArg24, dwArg28, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, out a0_122, out a3_123, out a4_124, out a5_125, out s5_126, out mstatus_127);
}

// 230434B4: Register Eq_2 send_reliable(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      prov_send
//      bearer_ctl_send
Eq_2 send_reliable(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	struct Eq_225931 * a1_16;
	word32 a5_179;
	g_t42014590 = k_uptime_get(out a1_16, out a5_179);
	g_ptr42014594 = a1_16;
	Eq_2 s0_22 = 0x42014460;
	Eq_2 s1_145 = 0x00;
	Eq_2 s2_146 = 0x03;
	ptr32 s3_147 = 0x4200F000;
	while (*((word32) s0_22 + 316) != 0x00)
	{
		Eq_2 a1_34;
		if ((word32) s1_145 + 1 != s2_146)
		{
			a1_34.u0 = 0x00;
			if (*((word32) s0_22 + 320) == 0x00)
				goto l230434F6;
		}
		else
		{
l230434F6:
			a1_34 = s3_147 + -1212;
		}
		word32 a1_180;
		word32 a5_181;
		word32 s8_182;
		s1_145 = bt_mesh_adv_send(ra, s0_22, a1_34, 0x00, a4, mstatus, dwArgC8, dwArg0108, dwArg0148, out a1_180, out a3, out a4, out a5_181, out s2_146, out s3_147, out s5, out s6, out s8_182);
		s0_22 = (word32) s0_22 + 4;
		if (s1_145 == s2_146)
			break;
	}
	a3Out = a3;
	a4Out = a4;
	s2Out = s2_146;
	s3Out = s3_147;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	return s1_145;
}

