pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23043512: Register Eq_2 prov_send(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s0Out, Register out (ptr32 Eq_226031) s1Out, Register out Eq_226032 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      send_input_complete
//      prov_send_fail_msg
//      prov_confirm
//      prov_invite
//      prov_random
//      prov_data
//      send_pub_key
Eq_2 prov_send(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s0Out, struct Eq_226031 & s1Out, union Eq_226032 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a3_36;
	Eq_2 a4_37;
	Eq_2 s1_40;
	Eq_2 s2_41;
	word32 a5_767;
	word32 s3_768;
	word32 s5_770;
	word32 s6_771;
	word32 s8_772;
	word32 s4_769;
	word32 a2_766;
	word32 a1_765;
	word32 a0_764;
	Eq_2 s0_39 = k_delayed_work_submit(0x0EFFFA60, a3, a4, mstatus, s8, s6, dwLoc0C, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out s1_40, out a0_764, out a1_765, out a2_766, out a3_36, out a4_37, out a5_767, out s2_41, out s3_768, out s4_769, out s5_770, out s6_771, out s8_772);
	Eq_2 a0_57 = *((word32) s2_41 + 4);
	if (a0_57 == 0x00)
	{
		ptr32 a0_58;
		Eq_2 a5_63;
		ptr32 mstatus_66;
		Eq_2 s5_72;
		word32 a3_773;
		word32 a4_774;
		word32 a5_776;
		word32 s4_777;
		word32 s8_778;
		word32 a1_775;
		Eq_2 s7_212;
		struct Eq_226031 * s1_306;
		ptr32 mstatus_220;
		ptr32 s6_320;
		ptr32 s5_319;
		ptr32 s3_317;
		ptr32 a4_310;
		ptr32 a3_309;
		Eq_2 ra_219 = adv_buf_create(prov_clear_tx(ra, s0_39, a3_36, a4_37, mstatus, dwLoc18, dwLoc0C, dwLoc08, dwArg38, s5, ra, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, out a0_58, out a3_773, out a4_774, out a5_63, out s5_72, out mstatus_66), a5_63, s5_72, mstatus_66, dwLoc18, dwArg00, dwArg04, dwArg28, dwArg30, dwArg34, dwArg4C, s5, dwArg7C, dwArg98, dwArgB8, dwArgE8, out s1_306, out a1_775, out a3_309, out a4_310, out a5_776, out s3_317, out s4_777, out s5_319, out s6_320, out s7_212, out s8_778, out mstatus_220);
		ptr32 s2_109 = a0_58;
		Eq_226032 a0_110 = -55;
		if (a0_58 != 0x00)
		{
			struct Eq_253509 ** a5_112 = (word32) s1_306->b0598;
			Eq_2 s4_114 = 0x0080;
			if (((char *) a5_112 - 1 & 0x00FF) <= 0x00FD)
				s4_114 = (char *) a5_112 + 1 & 0x00FF;
			Eq_2 a1_121 = s1_306->t0580;
			s1_306->b0598 = (byte) s4_114;
			Eq_2 a5_131;
			net_buf_simple_add_be32(a0_58 + 8, a1_121, a5_112, out a5_131);
			word32 a5_784;
			net_buf_simple_add_u8(a0_58 + 8, s4_114, a5_131, out a5_784);
			Eq_2 a5_138 = (word32) *((word32) s0_39 + 4);
			ui32 a1_140 = 0x00;
			if (a5_138 > 0x14)
			{
				a5_138.u0 = 0x17;
				a1_140 = (((byte) a5_138.u0 - 20 & 0x00FF) >> 0x17) + 0x01 & 0x00FF;
			}
			struct Eq_194075 * a5_155;
			net_buf_simple_add_u8(a0_58 + 8, a1_140 << 2 & 252, a5_138, out a5_155);
			word32 a4_785;
			word32 a5_786;
			struct Eq_194081 * a0_160 = net_buf_simple_add_be16(a0_58 + 8, (word32) *((word32) s0_39 + 4), a5_155, out a4_785, out a5_786);
			struct Eq_226292 * s0_164 = a0_160->ptr0000;
			Eq_2 a5_169;
			word32 a5_787;
			Eq_2 a4_173 = net_buf_simple_add_u8(a0_58 + 8, bt_mesh_fcs_calc(a0_160, (word32) *((word32) s0_39 + 4), out a5_169), a5_169, out a5_787);
			s1_306->ptr059C = a0_58;
			Eq_2 a1_178 = (word32) s0_164->w0004;
			if (a1_178 > 0x14)
				a1_178.u0 = 0x14;
			uint32 s2_182 = a1_178 << 0x10;
			Eq_2 s0_184 = *a1_178;
			word32 a1_788;
			word32 a2_789;
			word32 a5_790;
			Eq_2 a3_193;
			Eq_2 a4_194;
			net_buf_simple_add_mem(a0_58 + 8, a1_178, s2_182 >> 0x10, a4_173, out a1_788, out a2_789, out a3_193, out a4_194, out a5_790);
			word32 a1_791;
			word32 a5_792;
			word32 a0_206 = net_buf_simple_pull(s0_184, s2_182 >> 0x10, out a1_791, out a5_792);
			Eq_2 s5_211 = 0x00;
			s7_212.u0 = 0x08;
			while (true)
			{
				Eq_2 a5_216 = (word32) *((word32) s0_184 + 4);
				if (a5_216 == 0x00)
					break;
				if (s5_211 == s7_212)
				{
					Eq_2 a1_335;
					Eq_2 a4_338;
					word32 t4_811;
					word32 a5_813;
					word32 a0_812;
					word32 s6_806;
					word32 s9_808;
					word32 s10_809;
					word32 s11_810;
					word32 s8_807;
					word32 a7_801;
					word32 s3_803;
					word32 s4_804;
					word32 s5_805;
					word32 s2_802;
					word32 s1_796;
					word32 a2_798;
					word32 a3_799;
					word32 a5_800;
					word32 a0_797;
					ra_219 = free_segments(printf(ra_219, &g_t230B77D8, a3_193, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_796, out a0_797, out a1_335, out a2_798, out a3_799, out a4_338, out a5_800, out a7_801, out s2_802, out s3_803, out s4_804, out s5_805, out s6_806, out s7_212, out s8_807, out s9_808, out s10_809, out s11_810, out t4_811), s0_184, a1_335, a4_338, mstatus_220, dwLoc18, dwArg38, s5, ra, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_306, out a0_812, out a3_309, out a4_310, out a5_813, out s2_109, out s3_317, out s5_319, out s6_320, out mstatus_220);
					a0_110.u0 = ~0x06;
					goto l23043652;
				}
				Eq_2 a1_222;
				Eq_2 a4_225;
				struct Eq_253509 ** a5_226;
				struct Eq_226382 * s1_231;
				Eq_2 s4_236;
				word32 s5_237;
				struct Eq_226385 * s6_238;
				uint32 s8_240;
				word32 a3_794;
				word32 s3_795;
				ra_219 = adv_buf_create(ra_219, a5_216, s5_211, mstatus_220, dwLoc18, dwArg00, dwArg04, dwArg28, dwArg30, dwArg34, dwArg4C, s5, dwArg7C, dwArg98, dwArgB8, dwArgE8, out s1_231, out a1_222, out a3_794, out a4_225, out a5_226, out s3_795, out s4_236, out s5_237, out s6_238, out s7_212, out s8_240, out mstatus_220);
				s5_211 = s5_237 + 0x04;
				if (a0_206 == 0x00)
				{
					word32 a0_814;
					word32 a5_815;
					ra_219 = free_segments(ra_219, s0_184, a1_222, a4_225, mstatus_220, dwLoc18, dwArg38, s5, ra, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_306, out a0_814, out a3_309, out a4_310, out a5_815, out s2_109, out s3_317, out s5_319, out s6_320, out mstatus_220);
					a0_110.u0 = -55;
					goto l23043652;
				}
				s6_238->dw0140 = a0_206;
				uint32 a1_253 = (word32) *((word32) s0_184 + 4);
				if (s8_240 < a1_253)
					a1_253 = 0x17;
				Eq_2 s2_261 = a0_206 + 8;
				Eq_2 a5_267;
				net_buf_simple_add_be32(s2_261, s1_231->t0120, a5_226, out a5_267);
				Eq_2 a5_273;
				net_buf_simple_add_u8(s2_261, s4_236, a5_267, out a5_273);
				ui32 a1_275 = s5_237 + 0x04 | 2;
				word32 a5_816;
				Eq_2 a4_279 = net_buf_simple_add_u8(s2_261, a1_275 & 0x00FF, a5_273, out a5_816);
				uint32 s3_256 = a1_253 << 0x10;
				s0_184 = *(a1_275 & 0x00FF);
				word32 a2_818;
				word32 a5_819;
				word32 a1_817;
				net_buf_simple_add_mem(s2_261, a1_275 & 0x00FF, s3_256 >> 0x10, a4_279, out a1_817, out a2_818, out a3_193, out a4_194, out a5_819);
				word32 a5_821;
				word32 a1_820;
				a0_206 = net_buf_simple_pull(s0_184, s3_256 >> 0x10, out a1_820, out a5_821);
			}
			word32 s4_793;
			s1_306 = send_reliable(ra_219, a4_194, mstatus_220, dwArg98, dwArgD8, dwArg0118, out a3_309, out a4_310, out s2_109, out s3_317, out s4_793, out s5_319, out s6_320);
			a0_110.u0 = 0x00;
		}
l23043652:
		0x00 = (int8) dwArg0128;
		s0Out = s4;
		s1Out = s1_306;
		a0Out = a0_110;
		a3Out = a3_309;
		a4Out = a4_310;
		s2Out = s2_109;
		s3Out = s3_317;
		s4Out = dwArg78;
		s5Out = s5_319;
		s6Out = s6_320;
		s7Out = s7_212;
		s8Out = s5;
		mstatusOut = mstatus_220;
		return ra_219;
	}
	else
	{
		0x00 = (int8) dwArg0128;
		Eq_226032 a0_427;
		ptr32 a3_430;
		ptr32 a4_431;
		ptr32 mstatus_435;
		ptr32 s0_437;
		struct Eq_226031 * s1_438;
		ptr32 s2_441;
		ptr32 s3_442;
		Eq_2 s4_443;
		ptr32 s5_444;
		ptr32 s6_445;
		Eq_2 s7_446;
		Eq_2 s8_447;
		word32 a1_779;
		word32 a5_780;
		word32 s10_782;
		word32 s11_783;
		word32 s9_781;
		Eq_2 ra_436 = bt_mesh_proxy_send(ra, s1_40, a0_57, 0x03, a3_36, s2_41, mstatus, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg50, s7, s5, dwArg70, dwArg78, dwArg7C, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s0_437, out s1_438, out a0_427, out a1_779, out a3_430, out a4_431, out a5_780, out s2_441, out s3_442, out s4_443, out s5_444, out s6_445, out s7_446, out s8_447, out s9_781, out s10_782, out s11_783, out mstatus_435);
		s0Out = s0_437;
		s1Out = s1_438;
		a0Out = a0_427;
		a3Out = a3_430;
		a4Out = a4_431;
		s2Out = s2_441;
		s3Out = s3_442;
		s4Out = s4_443;
		s5Out = s5_444;
		s6Out = s6_445;
		s7Out = s7_446;
		s8Out = s8_447;
		mstatusOut = mstatus_435;
		return ra_436;
	}
}

// 230436CC: Register Eq_2 send_input_complete(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_2 a3Out)
// Called from:
//      bt_mesh_input_number
//      bt_mesh_input_string
Eq_2 send_input_complete(Eq_2 ra, Eq_2 a3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_2 & a3Out)
{
	Eq_2 a4_16;
	word32 a5_154;
	prov_buf_init(fp + -28, 0x04, fp + -36, out a4_16, out a5_154);
	word32 a0_27;
	word32 s3_159;
	word32 s2_158;
	word32 a4_157;
	word32 s1_156;
	word32 s0_155;
	word32 s4_160;
	word32 s5_161;
	word32 s6_162;
	word32 s7_163;
	word32 s8_164;
	word32 mstatus_165;
	Eq_2 a3_129;
	Eq_2 ra_133 = prov_send(ra, a3, a4_16, s5, s6, s7, s8, mstatus, dwLoc30, dwLoc2C, dwLoc28, dwLoc1C, dwLoc18, dwLoc14, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg38, dwArg40, dwArg48, dwArg4C, fp + -36, fp + -36, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_155, out s1_156, out a0_27, out a3_129, out a4_157, out s2_158, out s3_159, out s4_160, out s5_161, out s6_162, out s7_163, out s8_164, out mstatus_165);
	if (a0_27 != 0x00)
	{
		word32 s1_166;
		word32 a0_167;
		word32 a1_168;
		word32 a2_169;
		word32 a4_170;
		word32 a5_171;
		word32 a7_172;
		word32 s2_173;
		word32 s3_174;
		word32 s4_175;
		word32 s5_176;
		word32 s6_177;
		word32 s7_178;
		word32 s8_179;
		word32 s9_180;
		word32 s10_181;
		word32 s11_182;
		word32 t4_183;
		ra_133 = printf(ra_133, &g_t230B9978, a3_129, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_166, out a0_167, out a1_168, out a2_169, out a3_129, out a4_170, out a5_171, out a7_172, out s2_173, out s3_174, out s4_175, out s5_176, out s6_177, out s7_178, out s8_179, out s9_180, out s10_181, out s11_182, out t4_183);
	}
	g_b42014488 = 0x05;
	a3Out = a3_129;
	return ra_133;
}

