pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304370A: Register Eq_2 bearer_ctl_send(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      gen_prov_ctl
//      protocol_timeout
Eq_2 bearer_ctl_send(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s4Out, ptr32 & mstatusOut)
{
	int32 a0_25;
	Eq_2 a5_30;
	ptr32 mstatus_33;
	Eq_2 s5_39;
	struct Eq_253509 ** a5_53;
	ptr32 mstatus_56;
	word32 a3_217;
	word32 a4_218;
	word32 s1_219;
	word32 a1_220;
	word32 s3_221;
	word32 s5_222;
	word32 s6_223;
	word32 s7_224;
	word32 s8_225;
	ptr32 a4_130;
	ptr32 a3_129;
	Eq_2 s4_126;
	Eq_2 ra_57 = adv_buf_create(prov_clear_tx(ra, a0, a3, a4, mstatus, dwLoc18, dwLoc0C, dwLoc08, dwArg38, dwArg58, ra, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, out a0_25, out a3_217, out a4_218, out a5_30, out s5_39, out mstatus_33), a5_30, s5_39, mstatus_33, dwLoc18, dwArg00, dwArg04, dwArg28, dwArg30, dwArg34, dwArg4C, dwArg58, dwArg7C, dwArg98, dwArgB8, dwArgE8, out s1_219, out a1_220, out a3_129, out a4_130, out a5_53, out s3_221, out s4_126, out s5_222, out s6_223, out s7_224, out s8_225, out mstatus_56);
	if (a0_25 != 0x00)
	{
		Eq_2 a5_86;
		net_buf_simple_add_be32(a0_25 + 8, g_t42014580, a5_53, out a5_86);
		Eq_2 a5_91;
		net_buf_simple_add_u8(a0_25 + 8, 0x00, a5_86, out a5_91);
		Eq_2 a4_106;
		word32 a5_226;
		word32 a1_227;
		word32 a2_228;
		word32 a3_229;
		word32 a5_230;
		net_buf_simple_add_mem(a0_25 + 8, s4_126, a2, net_buf_simple_add_u8(a0_25 + 8, (a0 << 0x02 | 3) & 0x00FF, a5_91, out a5_226), out a1_227, out a2_228, out a3_229, out a4_106, out a5_230);
		g_a4201459C[0] = a0_25;
		word32 s2_231;
		word32 s3_232;
		word32 s5_233;
		word32 s6_234;
		send_reliable(ra_57, a4_106, mstatus_56, dwArg98, dwArgD8, dwArg0118, out a3_129, out a4_130, out s2_231, out s3_232, out s4_126, out s5_233, out s6_234);
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	a3Out = a3_129;
	a4Out = a4_130;
	s4Out = s4_126;
	mstatusOut = mstatus_56;
	return ra_57;
}

// 23043784: Register word32 prov_send_fail_msg(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
// Called from:
//      prov_confirm
//      prov_random
//      prov_data
//      prov_start
//      pub_key_ready
//      gen_prov_cont
//      gen_prov_start
//      send_pub_key
//      bt_mesh_pb_gatt_recv
word32 prov_send_fail_msg(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 a5_21;
	word32 a4_170;
	prov_buf_init(fp + -28, 0x09, fp + -36, out a4_170, out a5_21);
	word32 a0_36;
	ptr32 mstatus_44;
	Eq_2 s0_46;
	word32 s3_174;
	word32 s2_173;
	word32 s1_172;
	word32 a5_171;
	word32 s4_175;
	word32 s5_176;
	word32 s6_177;
	word32 s7_178;
	word32 s8_179;
	Eq_2 a4_40;
	Eq_2 a3_39;
	Eq_2 ra_45 = prov_send(ra, a3, net_buf_simple_add_u8(fp + -28, a0, a5_21, out a5_171), s5, s6, s7, s8, mstatus, dwLoc30, dwLoc2C, dwLoc28, s0, dwLoc18, dwLoc14, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg38, dwArg40, dwArg48, dwArg4C, fp + -36, fp + -36, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_46, out s1_172, out a0_36, out a3_39, out a4_40, out s2_173, out s3_174, out s4_175, out s5_176, out s6_177, out s7_178, out s8_179, out mstatus_44);
	if (a0_36 != 0x00)
	{
		word32 s1_187;
		word32 a0_188;
		word32 a1_189;
		word32 a2_190;
		word32 a5_191;
		word32 a7_192;
		word32 s2_193;
		word32 s3_194;
		word32 s4_195;
		word32 s5_196;
		word32 s6_197;
		word32 s7_198;
		word32 s8_199;
		word32 s9_200;
		word32 s10_201;
		word32 s11_202;
		word32 t4_203;
		printf(ra_45, &g_t230B987C, a3_39, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_187, out a0_188, out a1_189, out a2_190, out a3_39, out a4_40, out a5_191, out a7_192, out s2_193, out s3_194, out s4_195, out s5_196, out s6_197, out s7_198, out s8_199, out s9_200, out s10_201, out s11_202, out t4_203);
	}
	word32 a5_101;
	word32 a0_180;
	word32 a1_181;
	word32 a2_182;
	word32 a3_183;
	word32 a4_184;
	word32 s4_185;
	word32 s8_186;
	atomic_or(s0_46, 32, a3_39, a4_40, mstatus_44, out a0_180, out a1_181, out a2_182, out a3_183, out a4_184, out a5_101, out s4_185, out s8_186);
	return a5_101;
}

// 230437D6: Register Eq_2 reset_state(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      gen_prov_ctl
//      bt_mesh_pb_gatt_close
//      protocol_timeout
//      bt_mesh_prov_init
Eq_2 reset_state(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	word32 s8_322;
	word32 s4_320;
	word32 s6_321;
	word32 s2_318;
	word32 s3_319;
	word32 a2_316;
	word32 a5_317;
	word32 a1_315;
	struct Eq_227018 * a0_16;
	Eq_2 a4_19;
	Eq_2 a3_18;
	Eq_2 s5_108;
	Eq_2 s1_21 = k_delayed_work_cancel(0x420145D0, a3, a4, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_16, out a1_315, out a2_316, out a3_18, out a4_19, out a5_317, out s2_318, out s3_319, out s4_320, out s5_108, out s6_321, out s8_322);
	Eq_2 s0_49 = 0x42014000;
	struct Eq_218621 * a5_38 = (word32) *((word32) s1_21 + 0x007C);
	if (a5_38 != null)
	{
		word32 s9_328;
		word32 s11_329;
		word32 s7_326;
		word32 s8_327;
		word32 s4_324;
		word32 s6_325;
		word32 s1_323;
		ra = bt_mesh_attention(ra, 0x42014000, s1_21, 0x00, 0x00, a3_18, a4_19, a5_38, mstatus, dwLoc10, s0, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg60, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s0_49, out s1_323, out a0_16, out a3_18, out a4_19, out s4_324, out s5_108, out s6_325, out s7_326, out s8_327, out s9_328, out s11_329, out mstatus);
	}
	Eq_2 s1_100 = a0_16->t0004;
	if (a0_16 != null)
	{
		word32 a5_332;
		word32 a3_330;
		word32 a4_331;
		s1_100 = bt_conn_unref(s0_49, a3_18, a4_19, mstatus, out a3_330, out a4_331, out a5_332);
	}
	Eq_2 a3_93;
	word32 a5_338;
	word32 a2_336;
	word32 a4_337;
	word32 a0_334;
	word32 a1_335;
	word32 t1_333;
	Eq_2 ra_96 = memset(ra, (word32) s0_49 + 1120, 0x00, 328, out t1_333, out a0_334, out a1_335, out a2_336, out a3_93, out a4_337, out a5_338);
	*((word32) s1_100 + 293) = ~0x00;
	*((word32) s1_100 + 300) = bt_mesh_proxy_get_buf((struct Eq_227123 *) ~0x00);
	word32 a0_111;
	ptr32 mstatus_125;
	ptr32 s5_130;
	ptr32 s2_118;
	ptr32 s3_129;
	ptr32 s1_117;
	Eq_2 a3_114;
	ptr32 a4_115;
	ptr32 a5_116;
	Eq_2 ra_126 = bt_pub_key_gen(ra_96, &g_dw4200EB50, a3_93, s5_108, mstatus, dwArg08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s1_117, out a0_111, out a3_114, out a4_115, out a5_116, out s2_118, out s3_129, out s5_130, out mstatus_125);
	if (a0_111 != 0x00)
	{
		word32 t4_350;
		word32 s10_348;
		word32 s11_349;
		word32 s8_346;
		word32 s9_347;
		word32 s6_344;
		word32 s7_345;
		word32 a7_342;
		word32 s4_343;
		word32 a1_340;
		word32 a2_341;
		word32 a0_339;
		ra_126 = printf(ra_126, &g_t230B9950, a3_114, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_117, out a0_339, out a1_340, out a2_341, out a3_114, out a4_115, out a5_116, out a7_342, out s2_118, out s3_129, out s4_343, out s5_130, out s6_344, out s7_345, out s8_346, out s9_347, out s10_348, out s11_349, out t4_350);
	}
	s1Out = s1_117;
	a3Out = a3_114;
	a4Out = a4_115;
	a5Out = a5_116;
	s2Out = s2_118;
	s3Out = s3_129;
	s5Out = s5_130;
	mstatusOut = mstatus_125;
	return ra_126;
}

// 2304384A: void reset_adv_link(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      prov_retransmit
//      gen_prov_ctl
void reset_adv_link(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	word32 s5_176;
	word32 a5_175;
	word32 a0_174;
	ptr32 mstatus_18;
	Eq_2 a4_14;
	Eq_2 a3_13;
	Eq_2 ra_19 = prov_clear_tx(ra, s0, a3, a4, mstatus, dwArg08, dwArg14, dwArg18, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158, out a0_174, out a3_13, out a4_14, out a5_175, out s5_176, out mstatus_18);
	Eq_2 a5_36 = *((word32) g_t4200F438 + 44);
	if (a5_36 != 0x00)
		a5_36();
	word32 mstatus_184;
	word32 s5_183;
	word32 s3_182;
	word32 s2_181;
	word32 a5_180;
	word32 a4_179;
	word32 a3_178;
	word32 s1_177;
	reset_state(ra_19, s0, a3_13, a4_14, mstatus_18, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg60, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s1_177, out a3_178, out a4_179, out a5_180, out s2_181, out s3_182, out s5_183, out mstatus_184);
}

