pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304386A: void prov_confirm(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void prov_confirm(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	struct Eq_274 * a0_193;
	word32 a7_381;
	word32 a6_380;
	word32 a5_379;
	word32 a4_378;
	word32 a3_377;
	word32 a2_376;
	word32 a1_375;
	memcpy(0x4201448C, a0, 0x10, out a1_375, out a2_376, out a3_377, out a4_378, out a5_379, out a6_380, out a7_381);
	Eq_2 a3_117;
	if (bt_mesh_prov_conf_salt(ra, out a3_117) != 0x00)
		a0_193 = (struct Eq_274 *) &g_t230B9494;
	else
	{
		struct Eq_64398 * a2_65;
		if (bt_mesh_prov_conf_key(ra, 0x420144BC, 0x420144CC, out a2_65, out a3_117) != 0x00)
			a0_193 = (struct Eq_274 *) &g_t230B94BC;
		else
		{
			word32 a0_86;
			Eq_2 a5_91;
			word32 s8_385;
			word32 s4_384;
			word32 a4_383;
			word32 a1_382;
			bt_rand(0x4201449C, 0x10, a2_65, out a0_86, out a1_382, out a3_117, out a4_383, out a5_91, out s4_384, out s8_385);
			if (a0_86 != 0x00)
				a0_193 = (struct Eq_274 *) &g_t230B94E4;
			else
			{
				Eq_2 a4_101;
				word32 a5_400;
				Eq_2 s1_103 = prov_buf_init(fp + -52, 0x05, a5_91, out a4_101, out a5_400);
				word32 a1_401;
				word32 a5_402;
				net_buf_simple_add(fp + -52, 0x10, a4_101, out a1_401, out a5_402);
				Eq_2 a4_118;
				Eq_2 s5_124;
				Eq_2 s8_125;
				if (bt_mesh_prov_conf(ra, s1_103, out a3_117, out a4_118, out s5_124, out s8_125) == 0x00)
				{
					word32 a0_137;
					Eq_2 a3_140;
					struct Eq_227503 * s0_147;
					word32 s1_403;
					word32 a4_404;
					word32 s2_405;
					word32 s3_406;
					word32 s4_407;
					word32 s5_408;
					word32 s6_409;
					word32 s7_410;
					word32 s8_411;
					word32 mstatus_412;
					Eq_2 ra_146 = prov_send(ra, a3_117, a4_118, s5_124, s6, s7, s8_125, mstatus, dwLoc40, dwLoc3C, 0x00160000, dwLoc2C, s2, s0, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg28, dwArg30, dwArg38, dwArg3C, fp + -40, dwArg4C, s1, ra, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_147, out s1_403, out a0_137, out a3_140, out a4_404, out s2_405, out s3_406, out s4_407, out s5_408, out s6_409, out s7_410, out s8_411, out mstatus_412);
					if (a0_137 != 0x00)
					{
						word32 s1_413;
						word32 a0_414;
						word32 a1_415;
						word32 a2_416;
						word32 a3_417;
						word32 a4_418;
						word32 a5_419;
						word32 a7_420;
						word32 s2_421;
						word32 s3_422;
						word32 s4_423;
						word32 s5_424;
						word32 s6_425;
						word32 s7_426;
						word32 s8_427;
						word32 s9_428;
						word32 s10_429;
						word32 s11_430;
						word32 t4_431;
						printf(ra_146, &g_t230B9530, a3_140, 0x00160000, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_413, out a0_414, out a1_415, out a2_416, out a3_417, out a4_418, out a5_419, out a7_420, out s2_421, out s3_422, out s4_423, out s5_424, out s6_425, out s7_426, out s8_427, out s9_428, out s10_429, out s11_430, out t4_431);
					}
					else
						s0_147->b0028 = 0x06;
					return;
				}
				a0_193 = (struct Eq_274 *) &g_t230B9508;
			}
		}
	}
	Eq_2 a3_210;
	Eq_2 s5_220;
	Eq_2 s6_221;
	Eq_2 s7_222;
	Eq_2 s8_223;
	word32 a1_388;
	word32 a0_387;
	word32 s1_386;
	word32 a2_389;
	word32 a4_390;
	word32 a5_391;
	word32 a7_392;
	word32 s2_393;
	word32 s3_394;
	word32 s4_395;
	word32 s9_396;
	word32 s10_397;
	word32 s11_398;
	word32 t4_399;
	prov_send_fail_msg(printf(ra, a0_193, a3_117, 0x00160000, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_386, out a0_387, out a1_388, out a2_389, out a3_210, out a4_390, out a5_391, out a7_392, out s2_393, out s3_394, out s4_395, out s5_220, out s6_221, out s7_222, out s8_223, out s9_396, out s10_397, out s11_398, out t4_399), 0x42014460, 0x07, a3_210, s5_220, s6_221, s7_222, s8_223, mstatus, dwLoc40, dwLoc3C, 0x00160000, dwLoc34, dwLoc30, dwLoc2C, s2, s0, dwLoc20, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg38, fp + -40, dwArg4C, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8);
}

// 23043940: void prov_invite(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack word32 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
// Called from:
//      gen_prov_start
//      bt_mesh_pb_gatt_recv
void prov_invite(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, word32 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	Eq_2 a1_13 = (word32) *a0;
	Eq_2 s0_18 = a0;
	if (a1_13 != 0x00)
	{
		word32 s1_340;
		word32 a0_341;
		word32 a3_342;
		word32 a4_343;
		word32 s4_344;
		word32 s9_345;
		word32 s11_346;
		ra = bt_mesh_attention(ra, a0, s1, 0x00, a1_13, a3, a4, fp + -36, mstatus, fp + -36, fp + -36, dwLoc28, s0, dwLoc18, dwLoc0C, dwLoc08, dwArg40, dwArg44, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out s0_18, out s1_340, out a0_341, out a3_342, out a4_343, out s4_344, out s5, out s6, out s7, out s8, out s9_345, out s11_346, out mstatus);
	}
	Eq_2 a5_54 = (word32) *s0_18;
	g_b420144DC = (byte) a5_54;
	word32 a4_318;
	word32 a5_319;
	Eq_2 s1_65 = prov_buf_init(fp + -48, 0x01, a5_54, out a4_318, out a5_319);
	Eq_2 a5_68;
	struct Eq_194075 * a5_73;
	net_buf_simple_add_u8(fp + -48, bt_mesh_elem_count(out a5_68), a5_68, out a5_73);
	Eq_2 a5_78;
	word32 a4_320;
	net_buf_simple_add_be16(fp + -48, 0x01, a5_73, out a4_320, out a5_78);
	word32 a5_321;
	net_buf_simple_add_u8(fp + -48, 0x00, a5_78, out a5_321);
	Eq_2 a5_91;
	net_buf_simple_add_u8(fp + -48, (word32) false, *(union Eq_2 *) 0x0C, out a5_91);
	struct Eq_194075 * a5_97;
	net_buf_simple_add_u8(fp + -48, (word32) *((word32) a5_91 + 0x0011), a5_91, out a5_97);
	Eq_2 a5_103;
	word32 a4_322;
	net_buf_simple_add_be16(fp + -48, (word32) a5_97->w0012, a5_97, out a4_322, out a5_103);
	struct Eq_194075 * a5_109;
	net_buf_simple_add_u8(fp + -48, (word32) *((word32) a5_103 + 20), a5_103, out a5_109);
	Eq_2 a1_112 = (word32) a5_109->w0016;
	word32 a5_324;
	word32 a4_323;
	net_buf_simple_add_be16(fp + -48, a1_112, a5_109, out a4_323, out a5_324);
	0x00 = dwArg34;
	Eq_2 a4_119;
	Eq_2 a3_124;
	word32 a7_329;
	word32 a6_328;
	word32 a5_327;
	word32 a2_326;
	word32 a1_325;
	memcpy((word32) s1_65 + 0x007D, (word32) a1_112 + 1, 11, out a1_325, out a2_326, out a3_124, out a4_119, out a5_327, out a6_328, out a7_329);
	word32 a0_143;
	Eq_2 a3_146;
	struct Eq_227751 * s1_154;
	word32 mstatus_339;
	word32 s8_338;
	word32 s7_337;
	word32 s6_336;
	word32 s5_335;
	word32 s4_334;
	word32 s3_333;
	word32 s2_332;
	word32 a4_331;
	word32 s0_330;
	Eq_2 ra_152 = prov_send(ra, a3_124, a4_119, s5, s6, s7, s8, mstatus, fp + -36, fp + -36, dwLoc28, s0, dwLoc18, dwLoc14, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg38, dwArg40, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_330, out s1_154, out a0_143, out a3_146, out a4_331, out s2_332, out s3_333, out s4_334, out s5_335, out s6_336, out s7_337, out s8_338, out mstatus_339);
	if (a0_143 != 0x00)
	{
		word32 s1_347;
		word32 a0_348;
		word32 a1_349;
		word32 a2_350;
		word32 a3_351;
		word32 a4_352;
		word32 a5_353;
		word32 a7_354;
		word32 s2_355;
		word32 s3_356;
		word32 s4_357;
		word32 s5_358;
		word32 s6_359;
		word32 s7_360;
		word32 s8_361;
		word32 s9_362;
		word32 s10_363;
		word32 s11_364;
		word32 t4_365;
		printf(ra_152, &g_t230B96C4, a3_146, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_347, out a0_348, out a1_349, out a2_350, out a3_351, out a4_352, out a5_353, out a7_354, out s2_355, out s3_356, out s4_357, out s5_358, out s6_359, out s7_360, out s8_361, out s9_362, out s10_363, out s11_364, out t4_365);
	}
	else
		s1_154->b0028 = 0x02;
}

// 23043A12: void buf_sent(Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void buf_sent(Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if (g_a4201459C[0] == 0x00)
		return;
	word32 s1_93;
	word32 a0_94;
	word32 a1_95;
	word32 a2_96;
	word32 a3_97;
	word32 a4_98;
	word32 a5_99;
	word32 s2_100;
	word32 s3_101;
	word32 s4_102;
	word32 s5_103;
	word32 s6_104;
	word32 s8_105;
	k_delayed_work_submit(500, a3, a4, mstatus, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_93, out a0_94, out a1_95, out a2_96, out a3_97, out a4_98, out a5_99, out s2_100, out s3_101, out s4_102, out s5_103, out s6_104, out s8_105);
}

// 23043A2E: Register Eq_2 gen_prov_ack_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out (ptr32 byte) s1Out, Register out ptr32 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      gen_prov_cont
//      gen_prov_start
Eq_2 gen_prov_ack_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0178, union Eq_2 & s0Out, byte & s1Out, ptr32 & a3Out, union Eq_2 & s2Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	byte * s1_15 = &g_b4200EB4C;
	Eq_2 a5_16 = (word32) g_b4200EB4C;
	if (a5_16 != a0)
	{
		s0 = a0;
		word32 a1_287;
		word32 a4_288;
		word32 a5_289;
		word32 s3_290;
		word32 s4_291;
		word32 s8_292;
		ra = adv_buf_create(ra, a5_16, s5, mstatus, dwLoc08, dwArg10, dwArg14, dwArg38, dwArg40, dwArg44, dwArg5C, s1, dwArg8C, dwArgA8, dwArgC8, dwArgF8, out s1_15, out a1_287, out a3, out a4_288, out a5_289, out s3_290, out s4_291, out s5, out s6, out s7, out s8_292, out mstatus);
		s2 = a0;
		if (a0 != 0x00)
		{
			Eq_2 s3_59 = 0x00;
			if ((word32) *s1_15 == 0x00FF)
			{
				*s1_15 = (byte) a0;
				s3_59.u0 = 588036608;
			}
			Eq_2 a5_72;
			net_buf_simple_add_be32((word32) a0 + 8, g_t42014580, &g_ptr42014000, out a5_72);
			Eq_2 a5_78;
			net_buf_simple_add_u8((word32) a0 + 8, a0, a5_72, out a5_78);
			Eq_2 a1_92;
			Eq_2 a4_95;
			Eq_2 s2_100;
			word32 a5_293;
			word32 a3_294;
			word32 a5_295;
			word32 s3_296;
			word32 s5_297;
			word32 s6_298;
			word32 s8_299;
			Eq_2 s1_99 = bt_mesh_adv_send(ra, a0, s3_59, 0x00, net_buf_simple_add_u8((word32) a0 + 8, 0x01, a5_78, out a5_293), mstatus, dwArgC8, dwArg0108, dwArg0148, out a1_92, out a3_294, out a4_95, out a5_295, out s2_100, out s3_296, out s5_297, out s6_298, out s8_299);
			ptr32 a3_123;
			ptr32 mstatus_128;
			Eq_2 s0_130;
			byte * s1_131;
			Eq_2 s2_132;
			Eq_2 s5_135;
			ptr32 s6_136;
			word32 a0_300;
			word32 a1_301;
			word32 a2_302;
			word32 a4_303;
			word32 a5_304;
			word32 s3_305;
			word32 s4_306;
			word32 s8_307;
			Eq_2 ra_129 = net_buf_unref(ra, s1_99, s2_100, a1_92, a4_95, mstatus, dwArg00, dwArg04, dwArg08, dwArg28, dwArg78, dwArg84, dwArg98, dwArgA4, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out s0_130, out s1_131, out a0_300, out a1_301, out a2_302, out a3_123, out a4_303, out a5_304, out s2_132, out s3_305, out s4_306, out s5_135, out s6_136, out s8_307, out mstatus_128);
			s0Out = s0_130;
			s1Out = s1_131;
			a3Out = a3_123;
			s2Out = s2_132;
			s5Out = s5_135;
			s6Out = s6_136;
			s7Out = s7;
			mstatusOut = mstatus_128;
			return ra_129;
		}
	}
	s0Out = s0;
	s1Out = s1_15;
	a3Out = a3;
	s2Out = s2;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

// 23043ABA: void prov_random(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8)
void prov_random(Eq_2 ra, Eq_2 s0, Eq_2 s2, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8)
{
	Eq_2 a3_183;
	Eq_2 s8_196;
	Eq_2 s7_195;
	Eq_2 s6_194;
	Eq_2 s5_193;
	Eq_2 ra_186;
	Eq_2 a0_200;
	struct Eq_274 * a0_151;
	Eq_2 s0_231 = 0x42014460;
	Eq_2 s5_36;
	Eq_2 s8_37;
	word32 a4_433;
	Eq_2 a3_132;
	if (bt_mesh_prov_conf(ra, 0x420144CC, out a3_132, out a4_433, out s5_36, out s8_37) != 0x00)
		a0_151 = (struct Eq_274 *) &g_t230B97B0;
	else
	{
		Eq_2 a5_49;
		Eq_2 a3_50;
		word32 a4_436;
		word32 a1_434;
		word32 a2_435;
		if (memcmp(fp + -96, 0x4201448C, 0x10, out a1_434, out a2_435, out a3_50, out a4_436, out a5_49) != 0x00)
		{
			word32 s11_461;
			word32 t4_462;
			word32 s9_459;
			word32 s10_460;
			word32 s3_457;
			word32 s4_458;
			word32 a7_455;
			word32 s2_456;
			word32 a4_453;
			word32 a5_454;
			word32 a1_451;
			word32 a2_452;
			word32 s1_449;
			word32 a0_450;
			ra_186 = printf(ra, &g_t230B97E0, a3_50, dwLoc68, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_449, out a0_450, out a1_451, out a2_452, out a3_183, out a4_453, out a5_454, out a7_455, out s2_456, out s3_457, out s4_458, out s5_193, out s6_194, out s7_195, out s8_196, out s9_459, out s10_460, out s11_461, out t4_462);
			a0_200.u0 = 0x04;
			goto l23043B1A;
		}
		Eq_2 a4_58;
		word32 a5_437;
		prov_buf_init(fp + -0x006C, 0x06, a5_49, out a4_58, out a5_437);
		Eq_2 a3_69;
		Eq_2 a4_70;
		word32 a5_440;
		word32 a1_438;
		word32 a2_439;
		net_buf_simple_add_mem(fp + -0x006C, 0x4201449C, 0x10, a4_58, out a1_438, out a2_439, out a3_69, out a4_70, out a5_440);
		word32 a0_84;
		Eq_2 a3_87;
		Eq_2 s2_98;
		word32 s7_447;
		word32 s8_448;
		word32 s6_446;
		word32 s4_444;
		word32 s5_445;
		word32 a4_442;
		word32 s3_443;
		word32 s1_441;
		ra = prov_send(ra, a3_69, a4_70, s5_36, s6, s7, s8_37, mstatus, dwLoc70, 0x00150000, dwLoc68, dwLoc5C, dwLoc58, dwLoc54, dwLoc48, s2, s0, dwLoc38, dwLoc34, dwLoc30, dwLoc2C, dwLoc28, dwLoc24, dwLoc20, dwLoc08, dwArg00, dwArg08, dwArg0C, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, out s0_231, out s1_441, out a0_84, out a3_87, out a4_442, out s2_98, out s3_443, out s4_444, out s5_445, out s6_446, out s7_447, out s8_448, out mstatus);
		if (a0_84 != 0x00)
		{
			word32 s1_470;
			word32 a0_471;
			word32 a1_472;
			word32 a2_473;
			word32 a3_474;
			word32 a4_475;
			word32 a5_476;
			word32 a7_477;
			word32 s2_478;
			word32 s3_479;
			word32 s4_480;
			word32 s5_481;
			word32 s6_482;
			word32 s7_483;
			word32 s8_484;
			word32 s9_485;
			word32 s10_486;
			word32 s11_487;
			word32 t4_488;
			printf(ra, &g_t230B9800, a3_87, dwLoc68, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_470, out a0_471, out a1_472, out a2_473, out a3_474, out a4_475, out a5_476, out a7_477, out s2_478, out s3_479, out s4_480, out s5_481, out s6_482, out s7_483, out s8_484, out s9_485, out s10_486, out s11_487, out t4_488);
			return;
		}
		dwLoc60.u0 = 0x00;
		dwLoc5C.u0 = 0x00;
		dwLoc48 = s2_98;
		dwArg38.u0 = 0x10;
		word32 s8_469;
		word32 s5_468;
		word32 s4_467;
		word32 s3_466;
		word32 a4_464;
		word32 a5_465;
		word32 a2_463;
		if (bt_mesh_aes_cmac(ra, fp + -80, out a2_463, out a3_132, out a4_464, out a5_465, out s3_466, out s4_467, out s5_468, out s8_469) == 0x00)
		{
			((word32) s0_231 + 40)->u0 = 0x07;
			return;
		}
		a0_151 = (struct Eq_274 *) &g_t230B9828;
	}
	word32 s1_489;
	word32 a0_490;
	word32 a1_491;
	word32 a2_492;
	word32 a4_493;
	word32 a5_494;
	word32 a7_495;
	word32 s2_496;
	word32 s3_497;
	word32 s4_498;
	word32 s9_499;
	word32 s10_500;
	word32 s11_501;
	word32 t4_502;
	ra_186 = printf(ra, a0_151, a3_132, dwLoc68, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_489, out a0_490, out a1_491, out a2_492, out a3_183, out a4_493, out a5_494, out a7_495, out s2_496, out s3_497, out s4_498, out s5_193, out s6_194, out s7_195, out s8_196, out s9_499, out s10_500, out s11_501, out t4_502);
	a0_200.u0 = 0x07;
l23043B1A:
	prov_send_fail_msg(ra_186, s0_231, a0_200, a3_183, s5_193, s6_194, s7_195, s8_196, mstatus, dwLoc70, 0x00150000, dwLoc68, dwLoc64, dwLoc60, dwLoc5C, dwLoc58, dwLoc54, dwLoc50, dwLoc38, dwLoc30, dwLoc2C, dwLoc28, dwLoc24, dwLoc08, dwLoc04, dwArg08, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98);
}

