pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23043B92: void prov_data(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8)
void prov_data(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8)
{
	byte bLoc38 = (byte) dwLoc38;
	byte bLoc36 = SLICE(dwLoc38, byte, 16);
	byte bLoc34 = (byte) dwLoc34;
	Eq_2 a3_344;
	Eq_2 s8_357;
	Eq_2 s7_356;
	Eq_2 s6_355;
	Eq_2 s5_354;
	Eq_2 ra_347;
	Eq_2 a0_361;
	struct Eq_274 * a0_336;
	word32 a0_42;
	word32 s5_598;
	word32 a5_596;
	word32 s3_597;
	word32 a2_594;
	word32 a4_595;
	Eq_2 a3_147;
	bt_mesh_k1(ra, 0x4201456D, 587961688, fp + -0x006C, out a0_42, out a2_594, out a3_147, out a4_595, out a5_596, out s3_597, out s5_598);
	Eq_2 s0_119 = 0x42014468;
	if (a0_42 != 0x00)
		a0_336 = (struct Eq_274 *) &g_t230B9560;
	else
	{
		word32 a0_68;
		struct Eq_215991 ** s3_77;
		word32 s5_602;
		word32 a4_600;
		word32 a5_601;
		word32 a2_599;
		bt_mesh_k1(ra, 0x4201456D, 0x230B9584, fp + -76, out a0_68, out a2_599, out a3_147, out a4_600, out a5_601, out s3_77, out s5_602);
		if (a0_68 == 0x00)
		{
			word32 a6_608;
			word32 a7_609;
			word32 a4_606;
			word32 a5_607;
			word32 a2_604;
			word32 a3_605;
			word32 a1_603;
			memcpy(fp + -0x007C, fp + -73, 0x0D, out a1_603, out a2_604, out a3_605, out a4_606, out a5_607, out a6_608, out a7_609);
			word32 a0_110;
			Eq_2 a3_113;
			Eq_2 s2_123;
			ra = bt_mesh_prov_decrypt(ra, fp + -0x006C, fp + -0x007C, s3_77, dwArg08, out s0_119, out a0_110, out a3_113, out s2_123);
			if (a0_110 != 0x00)
			{
				word32 t4_627;
				word32 s10_625;
				word32 s11_626;
				word32 s4_623;
				word32 s9_624;
				word32 s2_621;
				word32 s3_622;
				word32 a5_619;
				word32 a7_620;
				word32 a2_617;
				word32 a4_618;
				word32 a0_615;
				word32 a1_616;
				word32 s1_614;
				ra_347 = printf(ra, &g_t230B958C, a3_113, dwLoc98, dwLoc78, dwLoc30, dwLoc2C, dwLoc08, s7, out s1_614, out a0_615, out a1_616, out a2_617, out a3_344, out a4_618, out a5_619, out a7_620, out s2_621, out s3_622, out s4_623, out s5_354, out s6_355, out s7_356, out s8_357, out s9_624, out s10_625, out s11_626, out t4_627);
				a0_361.u0 = 0x06;
				goto l23043C32;
			}
			word32 a0_144;
			Eq_2 a5_149;
			word32 s5_613;
			word32 s3_612;
			word32 a2_610;
			word32 a4_611;
			bt_mesh_k1(ra, s2_123, 587961780, fp + -92, out a0_144, out a2_610, out a3_147, out a4_611, out a5_149, out s3_612, out s5_613);
			if (a0_144 == 0x00)
			{
				Eq_2 a4_178;
				word32 a5_628;
				prov_buf_init(fp + -0x0088, 0x08, a5_149, out a4_178, out a5_628);
				word32 a0_184;
				Eq_2 a3_187;
				ptr32 mstatus_192;
				ui32 s0_194;
				struct Eq_228571 * s1_195;
				ui32 s2_198;
				Eq_2 s3_199;
				ui32 s4_200;
				Eq_2 s5_201;
				Eq_2 s6_202;
				Eq_2 s7_203;
				Eq_2 s8_204;
				word32 a4_629;
				Eq_2 ra_193 = prov_send(ra, a3_147, a4_178, (word32) bLoc3B, (word32) bLoc34, (word32) bLoc36, (word32) bLoc38, mstatus, dwLocA0, dwLoc9C, dwLoc98, dwLoc8C, dwLoc88, dwLoc84, dwLoc78, dwLoc70, dwLoc6C, dwLoc68, s8, s6, s4, s2, s0, dwLoc50, dwLoc38, dwLoc30, dwLoc28, dwLoc24, dwLoc18, 0x00060000, dwLoc08, dwLoc04, dwArg08, dwArg18, s1, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, out s0_194, out s1_195, out a0_184, out a3_187, out a4_629, out s2_198, out s3_199, out s4_200, out s5_201, out s6_202, out s7_203, out s8_204, out mstatus_192);
				if (a0_184 != 0x00)
				{
					word32 s1_644;
					word32 a0_645;
					word32 a1_646;
					word32 a2_647;
					word32 a3_648;
					word32 a4_649;
					word32 a5_650;
					word32 a7_651;
					word32 s2_652;
					word32 s3_653;
					word32 s4_654;
					word32 s5_655;
					word32 s6_656;
					word32 s7_657;
					word32 s8_658;
					word32 s9_659;
					word32 s10_660;
					word32 s11_661;
					word32 t4_662;
					printf(ra_193, &g_t230B95DC, a3_187, dwLoc98, dwLoc78, dwLoc30, dwLoc2C, dwLoc08, s7, out s1_644, out a0_645, out a1_646, out a2_647, out a3_648, out a4_649, out a5_650, out a7_651, out s2_652, out s3_653, out s4_654, out s5_655, out s6_656, out s7_657, out s8_658, out s9_659, out s10_660, out s11_661, out t4_662);
				}
				else
				{
					s1_195->b0028 = ~0x00;
					ui32 s0_215 = s0_194 << 8 | s8_204;
					word32 a0_229;
					Eq_2 a3_232;
					word32 s1_239;
					Eq_2 s5_245;
					ptr32 mstatus_254;
					Eq_2 ra_237 = bt_mesh_provision(ra_193, s0_215 << 16, s2_198 << 8 | s7_203 | s0_215 << 16, s2_198 << 8, s3_199, s4_200 << 8, s5_201, s6_202, s7_203, s8_204, mstatus_192, dwLocA0, dwLoc9C, dwLoc98, fp + -144, fp + -144, dwLoc8C, dwLoc88, dwLoc84, dwLoc80, dwLoc7C, dwLoc78, dwLoc74, dwLoc70, dwLoc6C, dwLoc68, s8, s6, s4, s2, s0, dwLoc38, dwLoc34, dwLoc28, dwLoc18, 0x00060000, dwLoc08, dwArg08, dwArg18, s1, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, out s1_239, out a0_229, out a3_232, out s5_245, out mstatus_254);
					if (a0_229 != 0x00)
					{
						word32 s1_663;
						word32 a0_664;
						word32 a1_665;
						word32 a2_666;
						word32 a3_667;
						word32 a4_668;
						word32 a5_669;
						word32 a7_670;
						word32 s2_671;
						word32 s3_672;
						word32 s4_673;
						word32 s5_674;
						word32 s6_675;
						word32 s7_676;
						word32 s8_677;
						word32 s9_678;
						word32 s10_679;
						word32 s11_680;
						word32 t4_681;
						printf(ra_237, &g_t230B9604, a3_232, dwLoc98, dwLoc78, dwLoc30, dwLoc2C, dwLoc08, s7, out s1_663, out a0_664, out a1_665, out a2_666, out a3_667, out a4_668, out a5_669, out a7_670, out s2_671, out s3_672, out s4_673, out s5_674, out s6_675, out s7_676, out s8_677, out s9_678, out s10_679, out s11_680, out t4_681);
					}
					else if (s1_239 != 0x00)
						bt_mesh_proxy_identity_enable(ra_237, s5_245, mstatus_254, dwLoc80, dwLoc7C, s2, dwLoc34, dwLoc28, dwArg18, dwArg38, dwArg68, dwArg78, dwArgB8);
				}
				return;
			}
			a0_336 = (struct Eq_274 *) &g_t230B95BC;
		}
		else
			a0_336 = (struct Eq_274 *) &g_t230B9624;
	}
	word32 s4_639;
	word32 s3_638;
	word32 s2_637;
	word32 a7_636;
	word32 a5_635;
	word32 a4_634;
	word32 a1_632;
	word32 a2_633;
	word32 a0_631;
	word32 s1_630;
	word32 s9_640;
	word32 s10_641;
	word32 s11_642;
	word32 t4_643;
	ra_347 = printf(ra, a0_336, a3_147, dwLoc98, dwLoc78, dwLoc30, dwLoc2C, dwLoc08, s7, out s1_630, out a0_631, out a1_632, out a2_633, out a3_344, out a4_634, out a5_635, out a7_636, out s2_637, out s3_638, out s4_639, out s5_354, out s6_355, out s7_356, out s8_357, out s9_640, out s10_641, out s11_642, out t4_643);
	a0_361.u0 = 0x07;
l23043C32:
	prov_send_fail_msg(ra_347, s0_119, a0_361, a3_344, s5_354, s6_355, s7_356, s8_357, mstatus, dwLocA0, dwLoc9C, dwLoc98, fp + -144, fp + -144, dwLoc8C, dwLoc88, dwLoc84, dwLoc80, dwLoc68, s6, s4, s2, s0, dwLoc38, dwLoc34, dwLoc28, dwLoc18, 0x00060000, dwLoc08, dwArg08, dwArg18, s1, dwArg38, dwArg48, dwArg58, dwArg68);
}

// 23043D08: Register Eq_2 sys_memcpy_swap.constprop.16(Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 a4Out)
// Called from:
//      pub_key_ready
//      send_pub_key
Eq_2 sys_memcpy_swap.constprop.16(Eq_2 a0, Eq_2 a1, ptr32 & a4Out)
{
	struct Eq_228788 * a5_4 = (word32) a1 + 31;
	do
	{
		a5_4 = (struct Eq_228788 *) ((char *) a5_4 - 1);
		ptr32 a4_9 = (word32) a5_4[1];
		a0 = (word32) a0 + 1;
		*((word32) a0 + 0x0FFF) = (byte) a4_9;
	} while (a5_4 != (word32) a1 - 1);
	a4Out = a4_9;
	return (word32) a1 - 1;
}

// 23043D20: void prov_dh_key_gen(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8)
// Called from:
//      prov_pub_key
//      pub_key_ready
void prov_dh_key_gen(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8)
{
	word32 a4_168;
	sys_memcpy_swap.constprop.16(fp + -80, 0x420144ED, out a4_168);
	word32 a4_169;
	sys_memcpy_swap.constprop.16(fp + -48, 0x4201450D, out a4_169);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg16 = <invalid>;
	Eq_2 stackArg20 = <invalid>;
	Eq_2 stackArg32 = <invalid>;
	Eq_2 stackArg36 = <invalid>;
	Eq_2 stackArg40 = <invalid>;
	Eq_2 stackArg52 = <invalid>;
	Eq_2 stackArg72 = <invalid>;
	Eq_2 stackArg84 = <invalid>;
	Eq_2 stackArg88 = <invalid>;
	Eq_2 stackArg92 = <invalid>;
	Eq_2 stackArg116 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg152 = <invalid>;
	Eq_2 stackArg168 = <invalid>;
	Eq_2 stackArg184 = <invalid>;
	Eq_2 stackArg200 = <invalid>;
	Eq_2 stackArg216 = <invalid>;
	Eq_2 stackArg232 = <invalid>;
	Eq_2 stackArg248 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	Eq_2 stackArg280 = <invalid>;
	Eq_2 stackArg296 = <invalid>;
	Eq_2 stackArg312 = <invalid>;
	bt_dh_key_gen(ra, s1, a1, a3, a4, a5, mstatus, stackArg16, stackArg20, stackArg32, stackArg36, stackArg40, stackArg52, stackArg72, stackArg84, stackArg88, stackArg92, stackArg116, stackArg136, stackArg152, stackArg168, stackArg184, stackArg200, stackArg216, stackArg232, stackArg248, stackArg264, stackArg280, stackArg296, stackArg312);
	if (fp != ~0x4F)
	{
		Eq_2 a3_33;
		Eq_2 s5_43;
		Eq_2 s6_44;
		Eq_2 s7_45;
		Eq_2 s8_46;
		word32 s1_197;
		word32 a0_198;
		word32 a1_199;
		word32 a2_200;
		word32 a4_201;
		word32 a5_202;
		word32 a7_203;
		word32 s2_204;
		word32 s3_205;
		word32 s4_206;
		word32 s9_207;
		word32 s10_208;
		word32 s11_209;
		word32 t4_210;
		prov_send_fail_msg(printf(ra, &g_t230B9648, a3, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_197, out a0_198, out a1_199, out a2_200, out a3_33, out a4_201, out a5_202, out a7_203, out s2_204, out s3_205, out s4_206, out s5_43, out s6_44, out s7_45, out s8_46, out s9_207, out s10_208, out s11_209, out t4_210), 0x42014460, 0x07, a3_33, s5_43, s6_44, s7_45, s8_46, mstatus, dwLoc50, dwLoc4C, dwLoc48, dwLoc44, dwLoc40, dwLoc3C, dwLoc38, dwLoc34, dwLoc30, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8);
	}
}

// 23043D6C: void prov_pub_key(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void prov_pub_key(Eq_2 ra, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	Eq_2 a4_14;
	Eq_2 a3_19;
	word32 a1_189;
	word32 a2_190;
	word32 a5_191;
	word32 a6_192;
	word32 a7_193;
	memcpy(0x420144ED, a0, 64, out a1_189, out a2_190, out a3_19, out a4_14, out a5_191, out a6_192, out a7_193);
	word32 a5_194;
	if (bt_pub_key_get(out a5_194) != 0x00)
		prov_dh_key_gen(ra, a3_19, mstatus, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8);
	else
	{
		Eq_2 a3_68;
		Eq_2 a4_69;
		ptr32 mstatus_73;
		word32 a0_195;
		word32 a5_196;
		word32 s5_197;
		Eq_2 ra_74 = prov_clear_tx(ra, 0x42014000, a3_19, a4_14, mstatus, dwArg08, dwArg14, dwArg18, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158, out a0_195, out a3_68, out a4_69, out a5_196, out s5_197, out mstatus_73);
		Eq_2 a3_94;
		word32 a0_198;
		word32 a1_199;
		word32 a2_200;
		word32 a4_201;
		word32 a5_202;
		word32 s4_203;
		word32 s8_204;
		atomic_or(0x42014000, 0x01, a3_68, a4_69, mstatus_73, out a0_198, out a1_199, out a2_200, out a3_94, out a4_201, out a5_202, out s4_203, out s8_204);
		word32 s1_205;
		word32 a0_206;
		word32 a1_207;
		word32 a2_208;
		word32 a3_209;
		word32 a4_210;
		word32 a5_211;
		word32 a7_212;
		word32 s2_213;
		word32 s3_214;
		word32 s4_215;
		word32 s5_216;
		word32 s6_217;
		word32 s7_218;
		word32 s8_219;
		word32 s9_220;
		word32 s10_221;
		word32 s11_222;
		word32 t4_223;
		printf(ra_74, &g_t230B9790, a3_94, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_205, out a0_206, out a1_207, out a2_208, out a3_209, out a4_210, out a5_211, out a7_212, out s2_213, out s3_214, out s4_215, out s5_216, out s6_217, out s7_218, out s8_219, out s9_220, out s10_221, out s11_222, out t4_223);
	}
}

