pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23043DB8: void prov_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s5, Register ptr32 mstatus, Stack word32 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg6C, Stack word32 dwArg94)
void prov_start(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 s5, ptr32 mstatus, word32 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg6C, word32 dwArg94)
{
	Eq_2 a3_383;
	Eq_2 s8_396;
	Eq_2 s7_395;
	Eq_2 s6_394;
	Eq_2 s5_393;
	Eq_2 ra_386;
	struct Eq_274 * a0_402;
	struct Eq_229120 * sp_169 = (char *) fp - 80;
	if ((word32) *a0 != 0x00)
	{
		a0_402 = (struct Eq_274 *) &g_t230B98AC;
		goto l23043DD6;
	}
	Eq_2 s3_20 = (word32) *((word32) a0 + 1);
	Eq_2 s1_172 = a0;
	if (s3_20 != 0x00)
	{
		a0_402 = (struct Eq_274 *) &g_t230B98C8;
l23043DD6:
		word32 s11_704;
		word32 t4_705;
		word32 a2_695;
		word32 a5_697;
		word32 s10_703;
		word32 a7_698;
		word32 s2_699;
		word32 s4_701;
		word32 s9_702;
		word32 s3_700;
		word32 a4_696;
		word32 a1_694;
		word32 s1_692;
		word32 a0_693;
		ra_386 = printf(ra, a0_402, a3, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_692, out a0_693, out a1_694, out a2_695, out a3_383, out a4_696, out a5_697, out a7_698, out s2_699, out s3_700, out s4_701, out s5_393, out s6_394, out s7_395, out s8_396, out s9_702, out s10_703, out s11_704, out t4_705);
		goto l23043DDA;
	}
	Eq_2 a2_74;
	Eq_2 a1_30;
	word32 a2_686;
	word32 a4_688;
	word32 a5_689;
	word32 a6_690;
	word32 a7_691;
	word32 a3_687;
	memcpy(0x420144E8, a0, 0x05, out a1_30, out a2_686, out a3_687, out a4_688, out a5_689, out a6_690, out a7_691);
	g_b42014488 = 0x03;
	struct Eq_229161 * a4_42 = (word32) *((word32) a0 + 2);
	struct Eq_229161 * a5_45 = (word32) *((word32) a0 + 3);
	s0 = (word32) *((word32) a0 + 4);
	if (a4_42 != (struct Eq_229161 *) 0x01)
	{
		if (a4_42 != null)
		{
			int32 a0_178;
			if (a4_42 != (struct Eq_229161 *) 0x02)
			{
				if (a4_42 != (struct Eq_229161 *) 0x03 || a4_42 < a5_45)
					goto l23043E36;
				ui32 s2_301 = (word32) a5_45->b230CB9FC;
				if (s2_301 != 0x00)
				{
					Eq_2 a3_303 = g_t4200F438;
					Eq_2 a4_306 = (word32) *((word32) a3_303 + 22) & s2_301;
					if (a4_306 == 0x00 || (word32) (*((word32) a3_303 + 20)) < s0)
						goto l23043E36;
					Eq_2 a1_309 = 0x08;
					if (s2_301 != 0x08)
						a1_309.u0 = 0x04;
					word32 s4_326;
					word32 a0_733;
					word32 s8_739;
					word32 a1_734;
					word32 a2_735;
					word32 a4_737;
					word32 a5_738;
					word32 a3_736;
					Eq_2 s1_325 = atomic_or(s0, a1_309, a3_303, a4_306, mstatus, out a0_733, out a1_734, out a2_735, out a3_736, out a4_737, out a5_738, out s4_326, out s8_739);
					Eq_2 a5_335 = *((word32) g_t4200F438 + 32);
					word32 s7_527;
					word32 s9_528;
					word32 s11_525;
					word32 s6_526;
					word32 s10_524;
					word32 a3_349;
					word32 tp_362;
					a5_335();
					goto l23043F24;
				}
			}
			else
			{
				if (a5_45 > (struct Eq_229161 *) 0x04)
					goto l23043E36;
				ui32 s5_97 = (word32) a5_45->b230CB9F4;
				if (s5_97 != 0x00)
				{
					Eq_2 a4_99 = g_t4200F438;
					if (((word32) *((word32) a4_99 + 18) & s5_97) == 0x00 || (word32) (*((word32) a4_99 + 0x0011)) < s0)
						goto l23043E36;
					if (s5_97 == 0x10)
					{
						struct Eq_229701 ** s4_202;
						word32 a0_759;
						word32 a3_761;
						word32 a1_760;
						word32 a5_763;
						word32 a4_762;
						word32 s8_764;
						word32 s1_201 = bt_rand(fp + -64, s0, 0x02, out a0_759, out a1_760, out a3_761, out a4_762, out a5_763, out s4_202, out s8_764);
						word32 a4_206 = fp + -64;
						while (s0 != s3_20)
						{
							ui32 a5_213 = (word32) a4_206->b0000;
							ui32 a3_216 = (a5_213 & 36) + 55;
							if ((a5_213 & 36) <= 0x09)
								a3_216 = (a5_213 & 36) + 48;
							a4_206->b0000 = (byte) a3_216;
							s3_20 = (word32) s3_20 + 1 & 0x00FF;
							++a4_206;
						}
						Mem236[fp + -32 + s0 + 4064:byte] = 0x00;
						word32 a1_765;
						word32 a2_766;
						word32 a3_767;
						word32 a4_768;
						word32 a5_769;
						word32 a6_770;
						word32 a7_771;
						memcpy(0x420144AC, fp + -64, s0, out a1_765, out a2_766, out a3_767, out a4_768, out a5_769, out a6_770, out a7_771);
						word32 t1_772;
						word32 a0_773;
						word32 a1_774;
						word32 a2_775;
						word32 a3_776;
						word32 a4_777;
						word32 a5_778;
						word32 ra_262 = memset(ra, s0 + 0x420144AC, 0x00, 0x10 - s0, out t1_772, out a0_773, out a1_774, out a2_775, out a3_776, out a4_777, out a5_778);
						<anonymous> * a5_269 = *((char *) *s4_202 + 28);
						word32 a3_284;
						word32 tp_297;
						word32 s9_521;
						word32 s7_520;
						word32 s6_519;
						word32 s11_518;
						word32 s10_517;
						a5_269();
					}
					else
					{
						struct Eq_64398 * a2_113;
						word32 a1_740;
						word32 a4_742;
						word32 a5_743;
						word32 a6_744;
						word32 a7_745;
						word32 a3_741;
						memcpy((char *) fp - 64, 587960776, 32, out a1_740, out a2_113, out a3_741, out a4_742, out a5_743, out a6_744, out a7_745);
						struct Eq_229603 ** s4_131;
						word32 s8_751;
						word32 a5_750;
						word32 a4_749;
						word32 a3_748;
						word32 a0_746;
						word32 a1_747;
						Eq_2 s1_130 = bt_rand((char *) fp - 0x0044, 0x04, a2_113, out a0_746, out a1_747, out a3_748, out a4_749, out a5_750, out s4_131, out s8_751);
						word32 s0_138 = (s0 + ~0x00 << 2) + (fp + -32);
						word32 a5_143 = fp + -32 & Mem41[s0_138 + -32:int32];
						g_b420144B9 = (byte) (a5_143 >> 0x10);
						g_w420144BA = (word16) ((word32) (word16) a5_143 >> 8 | a5_143 << 0x08);
						g_b420144B8 = (byte) (a5_143 >> 0x18);
						word32 a2_755;
						word32 a1_754;
						word32 a4_757;
						word32 a3_756;
						word32 a5_758;
						word32 a0_753;
						word32 t1_752;
						Eq_2 ra_162 = memset(ra, 0x420144AC, 0x00, 0x0C, out t1_752, out a0_753, out a1_754, out a2_755, out a3_756, out a4_757, out a5_758);
						<anonymous> * a5_168 = *((char *) *s4_131 + 24);
						word32 a3_179;
						word32 tp_192;
						word32 s9_511;
						word32 s7_510;
						word32 s6_509;
						word32 s11_508;
						word32 s10_507;
						a5_168();
					}
l23043F24:
					if (a0_178 >= 0x00)
						return;
					goto l23043E36;
				}
			}
l23043E36:
			word32 s2_713;
			word32 s4_715;
			word32 s9_716;
			word32 s10_717;
			word32 t4_719;
			word32 s11_718;
			word32 s3_714;
			word32 s1_706;
			word32 a7_712;
			word32 a0_707;
			word32 a1_708;
			word32 a4_710;
			word32 a5_711;
			word32 a2_709;
			ra_386 = printf(ra, &g_t230B98EC, (word32) *((word32) s1_172 + 4), sp_169->t0008, sp_169->t0028, sp_169->t0070, sp_169->t0074, sp_169->t0098, sp_169->t00BC, out s1_706, out a0_707, out a1_708, out a2_709, out a3_383, out a4_710, out a5_711, out a7_712, out s2_713, out s3_714, out s4_715, out s5_393, out s6_394, out s7_395, out s8_396, out s9_716, out s10_717, out s11_718, out t4_719);
l23043DDA:
			prov_send_fail_msg(ra_386, s0, 0x02, a3_383, s5_393, s6_394, s7_395, s8_396, mstatus, sp_169->t0000, sp_169->t0004, sp_169->t0008, sp_169->t000C, sp_169->t0010, sp_169->t0014, sp_169->t0018, sp_169->t001C, sp_169->t0020, sp_169->t0038, sp_169->t0040, sp_169->t0044, sp_169->t0048, sp_169->t004C, sp_169->t0068, sp_169->t006C, sp_169->t0078, sp_169->t0088, sp_169->t008C, sp_169->t0098, sp_169->t00A8, sp_169->t00B8, sp_169->t00C8, sp_169->t00D8, sp_169->t00E8, sp_169->t00F8, sp_169->t0108);
			return;
		}
		s0 |= a5_45;
		if (s0 != 0x00)
			goto l23043E36;
		a2_74.u0 = 0x10;
	}
	else
	{
		s0 |= a5_45;
		if (s0 != 0x00)
			goto l23043E36;
		Eq_2 a2_53 = (word32) a5_45->b0010;
		struct Eq_229378 * a5_58;
		word32 a3_722;
		word32 a6_724;
		word32 a7_725;
		word32 a4_723;
		word32 a2_721;
		word32 a1_720;
		memcpy(0x10 - a2_53 + 0x420144AC, a1_30, a2_53, out a1_720, out a2_721, out a3_722, out a4_723, out a5_58, out a6_724, out a7_725);
		a2_74 = 0x10 - (word32) a5_58->b0010;
	}
	word32 a4_731;
	word32 a5_732;
	word32 a3_730;
	word32 t1_726;
	word32 a1_728;
	word32 a2_729;
	word32 a0_727;
	memset(ra, 0x420144AC, 0x00, a2_74, out t1_726, out a0_727, out a1_728, out a2_729, out a3_730, out a4_731, out a5_732);
}

// 2304400A: void pub_key_ready(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC)
void pub_key_ready(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC)
{
	if (a0 != 0x00)
	{
		ui32 a0_14;
		Eq_2 a3_17;
		word32 a1_151;
		word32 a2_152;
		word32 a4_153;
		word32 a5_154;
		word32 s4_155;
		word32 s8_156;
		atomic_and(s0, ~0x01, a3, a4, mstatus, out a0_14, out a1_151, out a2_152, out a3_17, out a4_153, out a5_154, out s4_155, out s8_156);
		if ((a0_14 & 0x01) == 0x00)
			return;
		prov_dh_key_gen(ra, a3_17, mstatus, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8);
	}
	else
	{
		word32 s1_157;
		word32 a0_158;
		word32 a1_159;
		word32 a2_160;
		word32 a3_161;
		word32 a4_162;
		word32 a5_163;
		word32 a7_164;
		word32 s2_165;
		word32 s3_166;
		word32 s4_167;
		word32 s5_168;
		word32 s6_169;
		word32 s7_170;
		word32 s8_171;
		word32 s9_172;
		word32 s10_173;
		word32 s11_174;
		word32 t4_175;
		printf(ra, &g_t230B9934, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_157, out a0_158, out a1_159, out a2_160, out a3_161, out a4_162, out a5_163, out a7_164, out s2_165, out s3_166, out s4_167, out s5_168, out s6_169, out s7_170, out s8_171, out s9_172, out s10_173, out s11_174, out t4_175);
	}
}

// 2304403C: void prov_complete()
void prov_complete()
{
}

