pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304403E: void prov_retransmit(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void prov_retransmit(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	if ((atomic_get(0x42014460) >> 1 & 0x01) == 0x00)
	{
		word32 s11_479;
		word32 s10_478;
		word32 s5_473;
		word32 s6_474;
		word32 s9_477;
		word32 a4_467;
		word32 s8_476;
		word32 s7_475;
		word32 s4_472;
		word32 a5_468;
		word32 a7_469;
		word32 s3_471;
		word32 s2_470;
		word32 t4_480;
		word32 a3_466;
		word32 a2_465;
		word32 a1_464;
		word32 a0_463;
		word32 s1_462;
		printf(ra, &g_t230B9850, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_462, out a0_463, out a1_464, out a2_465, out a3_466, out a4_467, out a5_468, out a7_469, out s2_470, out s3_471, out s4_472, out s5_473, out s6_474, out s7_475, out s8_476, out s9_477, out s10_478, out s11_479, out t4_480);
		return;
	}
	word32 a1_20;
	word32 a5_461;
	Eq_2 a0_19 = k_uptime_get(out a1_20, out a5_461);
	Eq_2 a4_210 = a0_19 - g_t42014590;
	struct Eq_225931 * a5_204 = g_ptr42014594;
	Eq_2 s0_23 = 0x42014460;
	int32 a1_29 = a1_20 - a5_204 - (word32) (a0_19 < a4_210);
	if (a1_29 > 0x00)
	{
l230440A0:
		word32 t4_497;
		Eq_2 a3_118;
		Eq_2 a4_119;
		word32 a2_484;
		word32 a5_485;
		word32 a1_483;
		word32 a7_486;
		word32 a0_482;
		word32 s1_481;
		word32 s6_491;
		word32 s5_490;
		word32 s4_489;
		word32 s7_492;
		word32 s3_488;
		word32 s2_487;
		word32 s8_493;
		word32 s9_494;
		word32 s10_495;
		word32 s11_496;
		Eq_2 ra_121 = printf(ra, &g_t230B9864, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_481, out a0_482, out a1_483, out a2_484, out a3_118, out a4_119, out a5_485, out a7_486, out s2_487, out s3_488, out s4_489, out s5_490, out s6_491, out s7_492, out s8_493, out s9_494, out s10_495, out s11_496, out t4_497);
		reset_adv_link(ra_121, 0x42014460, a3_118, a4_119, mstatus, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg60, s3, s1, ra, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
	}
	else
	{
		if (a1_29 == 0x00)
		{
			a5_204 = (struct Eq_225931 *) 0x07000530;
			if (a4_210 > 0x07000530)
				goto l230440A0;
		}
		Eq_2 s1_32 = 0x00;
		Eq_2 s2_33 = 0x03;
		word32 s3_206 = 0x4200F000;
		while (*((word32) s0_23 + 316) != 0x00)
		{
			ui32 a5_42 = (word32) a5_204->b0008;
			s1_32 = (word32) s1_32 + 1;
			a5_204 = a5_42 & 0x04;
			if ((a5_42 & 0x04) == 0x00)
			{
				Eq_2 a1_47;
				if (s1_32 != s2_33)
				{
					a1_47.u0 = 0x00;
					if (*((word32) s0_23 + 320) == 0x00)
						goto l230440E4;
				}
				else
				{
l230440E4:
					a1_47 = s3_206 + -1212;
				}
				word32 a1_498;
				word32 a3_499;
				word32 s5_500;
				word32 s6_501;
				word32 s8_502;
				s1_32 = bt_mesh_adv_send(ra, s0_23, a1_47, 0x00, a4_210, mstatus, dwArgC8, dwArg0108, dwArg0148, out a1_498, out a3_499, out a4_210, out a5_204, out s2_33, out s3_206, out s5_500, out s6_501, out s8_502);
			}
			s0_23 = (word32) s0_23 + 4;
			if (s1_32 == s2_33)
				return;
		}
	}
}

// 23044100: void prov_input_complete(Register word32 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg10)
void prov_input_complete(word32 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, word32 dwArg10)
{
	ui32 a0_13;
	word32 a3_16;
	word32 a4_17;
	word32 s8_85;
	word32 s4_84;
	word32 a5_83;
	word32 a2_82;
	word32 a1_81;
	atomic_and(s0, ~0x10, a3, a4, mstatus, out a0_13, out a1_81, out a2_82, out a3_16, out a4_17, out a5_83, out s4_84, out s8_85);
	if ((a0_13 & 0x10) == 0x00)
		return;
	Eq_2 t1_26 = *((word32) g_t4200F438 + 36);
	if (t1_26 == 0x00)
		return;
	word32 t1_38;
	t1_26();
}

// 23044132: void prov_msg_recv(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack word32 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      gen_prov_cont
//      gen_prov_start
void prov_msg_recv(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, word32 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	struct Eq_216068 * a2_26;
	Eq_2 s1_31;
	Eq_2 s5_41;
	word32 a0_525;
	word32 a1_526;
	word32 a3_527;
	word32 a4_528;
	word32 a5_529;
	word32 s2_530;
	word32 s3_531;
	word32 s4_532;
	word32 s6_533;
	word32 s8_534;
	Eq_2 s0_30 = k_delayed_work_submit(0x0EFFFA60, a3, a4, mstatus, dwLoc1C, s2, dwArg04, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s1_31, out a0_525, out a1_526, out a2_26, out a3_527, out a4_528, out a5_529, out s2_530, out s3_531, out s4_532, out s5_41, out s6_533, out s8_534);
	Eq_2 a3_52;
	if (bt_mesh_fcs_check(*((word32) s0_30 + 300), (word32) *((word32) s0_30 + 296), a2_26, out a3_52) == 0x00)
	{
		word32 t4_553;
		word32 s10_551;
		word32 s11_552;
		word32 s8_549;
		word32 s9_550;
		word32 s6_547;
		word32 s7_548;
		word32 s4_545;
		word32 s5_546;
		word32 s2_543;
		word32 s3_544;
		word32 a5_541;
		word32 a7_542;
		word32 a3_539;
		word32 a4_540;
		word32 a1_537;
		word32 a2_538;
		word32 s1_535;
		word32 a0_536;
		printf(ra, &g_t230B96E4, a3_52, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_535, out a0_536, out a1_537, out a2_538, out a3_539, out a4_540, out a5_541, out a7_542, out s2_543, out s3_544, out s4_545, out s5_546, out s6_547, out s7_548, out s8_549, out s9_550, out s10_551, out s11_552, out t4_553);
		return;
	}
	Eq_2 a3_160;
	Eq_2 s7_172;
	Eq_2 s6_171;
	Eq_2 s5_170;
	Eq_2 ra_163;
	Eq_2 a0_177;
	Eq_2 s1_59;
	Eq_2 a3_64;
	ptr32 mstatus_67;
	Eq_2 s0_69;
	struct Eq_230225 * s2_72;
	Eq_2 s5_74;
	Eq_2 s6_75;
	Eq_2 s7_76;
	Eq_2 ra_68 = gen_prov_ack_send(ra, s1_31, (word32) *((word32) s0_30 + 292), s5_41, mstatus, dwLoc20, dwLoc1C, s2, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg20, dwArg24, dwArg3C, dwArg58, s3, ra, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out s0_69, out s1_59, out a3_64, out s2_72, out s5_74, out s6_75, out s7_76, out mstatus_67);
	word32 a5_85 = (word32) *((word32) s0_69 + 292);
	*((word32) s0_69 + 292) = 0x00;
	*((word32) s0_69 + 293) = (byte) a5_85;
	union Eq_2 * a0_91 = atomic_get((char *) s2_72 + 1120) >> 5 & 0x01;
	if (a0_91 != null)
	{
		word32 t4_568;
		word32 s11_567;
		word32 s10_566;
		word32 s9_565;
		word32 s8_564;
		word32 s4_563;
		word32 s3_562;
		word32 s2_561;
		word32 a7_560;
		word32 a5_559;
		word32 a4_558;
		word32 a2_557;
		word32 a1_556;
		word32 a0_555;
		word32 s1_554;
		ra_163 = printf(ra_68, &g_t230B96F4, a3_64, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_554, out a0_555, out a1_556, out a2_557, out a3_160, out a4_558, out a5_559, out a7_560, out s2_561, out s3_562, out s4_563, out s5_170, out s6_171, out s7_172, out s8_564, out s9_565, out s10_566, out s11_567, out t4_568);
		goto l230441B4;
	}
	if (s1_59 != 0x09)
	{
		Eq_2 a2_94 = (word32) *((word32) s0_69 + 40);
		if (a2_94 != s1_59)
		{
			word32 t4_583;
			word32 s11_582;
			word32 s10_581;
			word32 s9_580;
			word32 s8_579;
			word32 s4_578;
			word32 s3_577;
			word32 s2_576;
			word32 a7_575;
			word32 a5_574;
			word32 a4_573;
			word32 a2_572;
			word32 a1_571;
			word32 a0_570;
			word32 s1_569;
			ra_163 = printf(ra_68, &g_t230B9720, a3_64, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_569, out a0_570, out a1_571, out a2_572, out a3_160, out a4_573, out a5_574, out a7_575, out s2_576, out s3_577, out s4_578, out s5_170, out s6_171, out s7_172, out s8_579, out s9_580, out s10_581, out s11_582, out t4_583);
l230441B4:
			a0_177.u0 = 0x03;
			goto l230441B6;
		}
		if (a2_94 > 0x09)
		{
			word32 a5_589;
			word32 a4_588;
			word32 a2_587;
			word32 a1_586;
			word32 a0_585;
			word32 s1_584;
			word32 a7_590;
			word32 s2_591;
			word32 s3_592;
			word32 s4_593;
			word32 s8_594;
			word32 s9_595;
			word32 s10_596;
			word32 s11_597;
			word32 t4_598;
			ra_163 = printf(ra_68, &g_t230B9744, a3_64, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_584, out a0_585, out a1_586, out a2_587, out a3_160, out a4_588, out a5_589, out a7_590, out s2_591, out s3_592, out s4_593, out s5_170, out s6_171, out s7_172, out s8_594, out s9_595, out s10_596, out s11_597, out t4_598);
			a0_177.u0 = 0x01;
			goto l230441B6;
		}
	}
	Eq_2 a3_99 = s2_72->t058C;
	word32 a4_103 = (word32) g_a230B9678[s1_59];
	if (a4_103 + 0x01 == (word32) (*((word32) a3_99 + 4)))
	{
		Eq_2 a3_107 = *a0_91;
		switch (s1_59)
		{
		case 0x00:
			prov_invite(ra_68, s0_69, s1_59, (char *) a0_91 + 1, a3_107, a4_103 + 0x01, s5_74, s6_75, s7_76, dwLoc1C, mstatus_67, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg34, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, s1, ra, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118);
			return;
		case 0x01:
			prov_capabilities();
			return;
		}
	}
	word32 s1_599;
	word32 a0_600;
	word32 a1_601;
	word32 a2_602;
	word32 a4_603;
	word32 a5_604;
	word32 a7_605;
	word32 s2_606;
	word32 s3_607;
	word32 s4_608;
	word32 s8_609;
	word32 s9_610;
	word32 s10_611;
	word32 s11_612;
	word32 t4_613;
	ra_163 = printf(ra_68, &g_t230B976C, a3_99, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_599, out a0_600, out a1_601, out a2_602, out a3_160, out a4_603, out a5_604, out a7_605, out s2_606, out s3_607, out s4_608, out s5_170, out s6_171, out s7_172, out s8_609, out s9_610, out s10_611, out s11_612, out t4_613);
	a0_177.u0 = 0x02;
l230441B6:
	prov_send_fail_msg(ra_163, s0_69, a0_177, a3_160, s5_170, s6_171, s7_172, dwLoc1C, mstatus_67, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, s1, ra, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108);
}

