pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23044246: void gen_prov_cont(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_230468) a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack word32 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178)
void gen_prov_cont(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_230468 * a0, Eq_2 a1, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, word32 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0178)
{
	uint32 a4_12 = (word32) g_b42014586;
	Eq_2 a1_17 = (word32) a0->b0004;
	if (a4_12 == 0x00 && (word32) g_b42014585 == a1_17)
	{
		Eq_2 s1_283;
		Eq_2 s5_289;
		word32 a0_568;
		word32 a1_569;
		word32 a2_570;
		word32 a3_571;
		word32 a4_572;
		word32 a5_573;
		word32 a7_574;
		word32 s2_575;
		word32 s3_576;
		word32 s4_577;
		word32 s6_578;
		word32 s7_579;
		word32 s8_580;
		word32 s9_581;
		word32 s11_583;
		word32 s10_582;
		word32 t4_584;
		Eq_2 ra_282 = printf(ra, &g_t230B92CC, a1, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_283, out a0_568, out a1_569, out a2_570, out a3_571, out a4_572, out a5_573, out a7_574, out s2_575, out s3_576, out s4_577, out s5_289, out s6_578, out s7_579, out s8_580, out s9_581, out s10_582, out s11_583, out t4_584);
		Eq_2 a0_297 = (word32) *((word32) s1_283 + 4);
		word32 mstatus_592;
		word32 s0_585;
		word32 a3_587;
		word32 s1_586;
		word32 s5_589;
		word32 s2_588;
		word32 s6_590;
		word32 s7_591;
		gen_prov_ack_send(ra_282, s1_283, a0_297, s5_289, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg28, dwArg38, dwArg40, dwArg44, dwArg5C, dwArg78, dwArg84, dwArg8C, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, dwArg0158, dwArg0178, out s0_585, out s1_586, out a3_587, out s2_588, out s5_589, out s6_590, out s7_591, out mstatus_592);
		return;
	}
	if ((word32) g_b42014584 != a1_17)
	{
		word32 s11_610;
		word32 t4_611;
		word32 s9_608;
		word32 s10_609;
		word32 s7_606;
		word32 s8_607;
		word32 s5_604;
		word32 s6_605;
		word32 s3_602;
		word32 s4_603;
		word32 a7_600;
		word32 s2_601;
		word32 a4_598;
		word32 a5_599;
		word32 a2_596;
		word32 a3_597;
		word32 a0_594;
		word32 a1_595;
		word32 s1_593;
		printf(ra, &g_t230B92DC, a1, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_593, out a0_594, out a1_595, out a2_596, out a3_597, out a4_598, out a5_599, out a7_600, out s2_601, out s3_602, out s4_603, out s5_604, out s6_605, out s7_606, out s8_607, out s9_608, out s10_609, out s11_610, out t4_611);
		return;
	}
	Eq_2 a3_159;
	Eq_2 s8_172;
	Eq_2 s7_171;
	Eq_2 s6_170;
	Eq_2 s5_169;
	Eq_2 ra_162;
	uint32 s1_25 = (word32) a0->b0005;
	uint32 a5_26 = (word32) g_b42014587;
	if (a5_26 >= s1_25 >> 2)
	{
		if (a5_26 == s1_25 >> 2)
		{
			uint32 a5_35 = a5_26 + ~0x13 + (word32) (*((word32) g_t4201458C + 4));
			a1_17 = a5_35 & 0x00FF;
			if ((a5_35 & 0x00FF) != (word32) (*((word32) a1 + 4)))
			{
				word32 a4_630;
				word32 s2_633;
				word32 a7_632;
				word32 s3_634;
				word32 s4_635;
				word32 s10_637;
				word32 s9_636;
				word32 t4_639;
				word32 s11_638;
				word32 a5_631;
				word32 a1_628;
				word32 a2_629;
				word32 s1_626;
				word32 a0_627;
				ra_162 = printf(ra, &g_t230B9324, a1, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_626, out a0_627, out a1_628, out a2_629, out a3_159, out a4_630, out a5_631, out a7_632, out s2_633, out s3_634, out s4_635, out s5_169, out s6_170, out s7_171, out s8_172, out s9_636, out s10_637, out s11_638, out t4_639);
l230442C4:
				prov_send_fail_msg(ra_162, s0, 0x02, a3_159, s5_169, s6_170, s7_171, s8_172, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108);
				return;
			}
		}
		if ((a4_12 >> (s1_25 >> 2) & 0x01) != 0x00)
		{
			Eq_2 a4_54;
			Eq_2 a3_59;
			word32 a1_640;
			word32 a2_641;
			word32 a5_642;
			word32 a6_643;
			word32 a7_644;
			memcpy((s1_25 >> 2) + 0x41, a1_17, (word32) *((word32) *a1_17 + 4), out a1_640, out a2_641, out a3_59, out a4_54, out a5_642, out a6_643, out a7_644);
			ui32 a1_71 = ~(0x01 << (s1_25 >> 2)) & (word32) g_b42014586;
			g_b42014586 = (byte) a1_71;
			if (a1_71 != 0x00)
				return;
			prov_msg_recv(ra, s1_25 >> 2, a3_59, a4_54, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg78, dwArg84, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
		}
		else
		{
			word32 s1_645;
			word32 a0_646;
			word32 a1_647;
			word32 a2_648;
			word32 a3_649;
			word32 a4_650;
			word32 a5_651;
			word32 a7_652;
			word32 s2_653;
			word32 s3_654;
			word32 s4_655;
			word32 s5_656;
			word32 s6_657;
			word32 s7_658;
			word32 s8_659;
			word32 s9_660;
			word32 s10_661;
			word32 s11_662;
			word32 t4_663;
			printf(ra, &g_t230B9348, a1, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_645, out a0_646, out a1_647, out a2_648, out a3_649, out a4_650, out a5_651, out a7_652, out s2_653, out s3_654, out s4_655, out s5_656, out s6_657, out s7_658, out s8_659, out s9_660, out s10_661, out s11_662, out t4_663);
		}
	}
	else
	{
		word32 s11_624;
		word32 t4_625;
		word32 s9_622;
		word32 s10_623;
		word32 s3_620;
		word32 s4_621;
		word32 a7_618;
		word32 s2_619;
		word32 a4_616;
		word32 a5_617;
		word32 a1_614;
		word32 a2_615;
		word32 s1_612;
		word32 a0_613;
		ra_162 = printf(ra, &g_t230B9308, a1, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_612, out a0_613, out a1_614, out a2_615, out a3_159, out a4_616, out a5_617, out a7_618, out s2_619, out s3_620, out s4_621, out s5_169, out s6_170, out s7_171, out s8_172, out s9_622, out s10_623, out s11_624, out t4_625);
		goto l230442C4;
	}
}

