pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23044368: void gen_prov_start(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack word32 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178)
void gen_prov_start(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, word32 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0178)
{
	if ((word32) g_b42014586 != 0x00)
	{
		word32 t4_544;
		word32 s11_543;
		word32 s10_542;
		word32 s8_540;
		word32 s9_541;
		word32 s6_538;
		word32 s7_539;
		word32 s4_536;
		word32 s5_537;
		word32 s2_534;
		word32 s3_535;
		word32 s1_526;
		word32 a7_533;
		word32 a0_527;
		word32 a1_528;
		word32 a2_529;
		word32 a3_530;
		word32 a4_531;
		word32 a5_532;
		printf(ra, &g_t230B93E4, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_526, out a0_527, out a1_528, out a2_529, out a3_530, out a4_531, out a5_532, out a7_533, out s2_534, out s3_535, out s4_536, out s5_537, out s6_538, out s7_539, out s8_540, out s9_541, out s10_542, out s11_543, out t4_544);
		return;
	}
	struct Eq_193726 * a5_21 = (word32) *((word32) a0 + 4);
	if ((word32) g_b42014585 == a5_21)
	{
		Eq_2 s1_241;
		Eq_2 s5_247;
		word32 t4_567;
		word32 s11_566;
		word32 s10_565;
		word32 s9_564;
		word32 s8_563;
		word32 s7_562;
		word32 s6_561;
		word32 s4_560;
		word32 s3_559;
		word32 s2_558;
		word32 a7_557;
		word32 a5_556;
		word32 a4_555;
		word32 a3_554;
		word32 a2_553;
		word32 a1_552;
		word32 a0_551;
		Eq_2 ra_240 = printf(ra, &g_t230B92CC, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_241, out a0_551, out a1_552, out a2_553, out a3_554, out a4_555, out a5_556, out a7_557, out s2_558, out s3_559, out s4_560, out s5_247, out s6_561, out s7_562, out s8_563, out s9_564, out s10_565, out s11_566, out t4_567);
		Eq_2 a0_255 = (word32) *((word32) s1_241 + 4);
		word32 s0_603;
		word32 s1_604;
		word32 a3_605;
		word32 s2_606;
		word32 s5_607;
		word32 s6_608;
		word32 s7_609;
		word32 mstatus_610;
		gen_prov_ack_send(ra_240, s1_241, a0_255, s5_247, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg28, dwArg38, dwArg40, dwArg44, dwArg5C, dwArg78, dwArg84, dwArg8C, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, dwArg0158, dwArg0178, out s0_603, out s1_604, out a3_605, out s2_606, out s5_607, out s6_608, out s7_609, out mstatus_610);
		return;
	}
	Eq_2 a3_137;
	Eq_2 s7_149;
	Eq_2 s6_148;
	Eq_2 s5_147;
	Eq_2 ra_140;
	struct Eq_274 * a0_129;
	word32 a5_547;
	word32 a4_546;
	word32 a1_545;
	*((word32) g_t4201458C + 4) = (word16) net_buf_simple_pull_be16(a5_21, out a1_545, out a4_546, out a5_547);
	Eq_2 a5_33 = (word32) *((word32) a0 + 4);
	g_b42014584 = (byte) a5_33;
	word32 a5_550;
	word32 a2_549;
	word32 a1_548;
	Eq_2 a0_36 = net_buf_simple_pull_u8(a5_33, out a1_548, out a2_549, out a5_550);
	Eq_2 a3_40 = g_t4201458C;
	g_b42014588 = (byte) a0_36;
	up32 a1_42 = (word32) *((word32) a3_40 + 4);
	if (a1_42 == 0x00)
		a0_129 = (struct Eq_274 *) &g_t230B9414;
	else
	{
		if ((word32) *((word32) a3_40 + 6) < a1_42)
		{
			word32 t4_582;
			word32 s11_581;
			word32 s10_580;
			word32 s9_579;
			word32 s8_578;
			word32 s4_577;
			word32 s3_576;
			word32 s2_575;
			word32 a7_574;
			word32 a5_573;
			word32 a4_572;
			word32 a2_571;
			word32 a1_570;
			word32 a0_569;
			word32 s1_568;
			ra_140 = printf(ra, &g_t230B943C, a3_40, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_568, out a0_569, out a1_570, out a2_571, out a3_137, out a4_572, out a5_573, out a7_574, out s2_575, out s3_576, out s4_577, out s5_147, out s6_148, out s7_149, out s8_578, out s9_579, out s10_580, out s11_581, out t4_582);
			goto l2304441C;
		}
		uint32 a5_44 = (word32) *((word32) a0 + 5);
		if (a5_44 >> 2 == 0x00 || a1_42 > 0x14)
		{
			g_b42014586 = (byte) ((0x01 << (a5_44 >> 2) + 0x01) + ~0x00);
			g_b42014587 = (byte) ((word32) *((word32) a0 + 5) >> 2);
			word32 a5_585;
			word32 a6_586;
			word32 a7_587;
			Eq_2 a4_64;
			Eq_2 a3_69;
			word32 a2_584;
			word32 a1_583;
			memcpy(a0_36, *a1, (word32) *((word32) a1 + 4), out a1_583, out a2_584, out a3_69, out a4_64, out a5_585, out a6_586, out a7_587);
			ui32 a5_77 = (word32) g_b42014586;
			g_b42014586 = (byte) (a5_77 & 0x00FE);
			if ((a5_77 & 0x00FE) != 0x00)
				return;
			prov_msg_recv(ra, a0, a3_69, a4_64, a1, 0x42014460, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg70, dwArg74, dwArg78, dwArg84, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
			return;
		}
		a0_129 = (struct Eq_274 *) &g_t230B9464;
	}
	word32 s1_588;
	word32 a0_589;
	word32 a1_590;
	word32 a2_591;
	word32 a4_592;
	word32 a5_593;
	word32 a7_594;
	word32 s2_595;
	word32 s3_596;
	word32 s4_597;
	word32 s8_598;
	word32 s9_599;
	word32 s10_600;
	word32 s11_601;
	word32 t4_602;
	ra_140 = printf(ra, a0_129, a3_40, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_588, out a0_589, out a1_590, out a2_591, out a3_137, out a4_592, out a5_593, out a7_594, out s2_595, out s3_596, out s4_597, out s5_147, out s6_148, out s7_149, out s8_598, out s9_599, out s10_600, out s11_601, out t4_602);
l2304441C:
	prov_send_fail_msg(ra_140, s1, 0x02, a3_137, s5_147, s6_148, s7_149, s4, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, s1, ra, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108);
}

// 230444A2: void send_pub_key(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8)
void send_pub_key(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8)
{
	struct Eq_274 * a0_155;
	if (a0 == 0x00)
	{
		a0_155 = (struct Eq_274 *) &g_t230B99A8;
		goto l230444C6;
	}
	word32 a4_395;
	sys_memcpy_swap.constprop.16(0x42014468, a0, out a4_395);
	s0.u0 = 0x42014000;
	Eq_2 a5_32;
	if (bt_pub_key_get(out a5_32) == 0x00)
	{
		a0_155 = (struct Eq_274 *) &g_t230B99C4;
l230444C6:
		Eq_2 a3_169;
		Eq_2 s5_179;
		Eq_2 s6_180;
		Eq_2 s7_181;
		Eq_2 s8_182;
		word32 s1_416;
		word32 a1_418;
		word32 a0_417;
		word32 a4_420;
		word32 a2_419;
		word32 a7_422;
		word32 a5_421;
		word32 s3_424;
		word32 s2_423;
		word32 s9_426;
		word32 s4_425;
		word32 s10_427;
		word32 s11_428;
		word32 t4_429;
		prov_send_fail_msg(printf(ra, a0_155, a3, 0x00460000, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_416, out a0_417, out a1_418, out a2_419, out a3_169, out a4_420, out a5_421, out a7_422, out s2_423, out s3_424, out s4_425, out s5_179, out s6_180, out s7_181, out s8_182, out s9_426, out s10_427, out s11_428, out t4_429), s0, 0x07, a3_169, s5_179, s6_180, s7_181, s8_182, mstatus, dwLoc80, dwLoc7C, 0x00460000, dwLoc74, dwLoc70, dwLoc6C, dwLoc68, dwLoc64, dwLoc60, s2, dwLoc40, dwLoc3C, dwLoc38, dwLoc34, dwLoc18, dwLoc14, dwLoc08, fp + -0x0068, dwArg0C, dwArg18, dwArg28, s1, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88);
		return;
	}
	Eq_2 a4_40;
	word32 a5_396;
	Eq_2 s1_42 = prov_buf_init(fp + -116, 0x03, a5_32, out a4_40, out a5_396);
	Eq_2 a4_52;
	word32 a1_397;
	word32 a5_398;
	sys_memcpy_swap.constprop.16(net_buf_simple_add(fp + -116, 32, a4_40, out a1_397, out a5_398), s1_42, out a4_52);
	Eq_2 a4_68;
	Eq_2 a3_73;
	word32 a6_405;
	word32 a7_406;
	word32 a2_403;
	word32 a5_404;
	word32 a4_401;
	word32 a1_402;
	word32 a1_399;
	word32 a5_400;
	memcpy(0x4201452D, sys_memcpy_swap.constprop.16(net_buf_simple_add(fp + -116, 32, a4_52, out a1_399, out a5_400), (word32) s1_42 + 32, out a4_401) + 0x01, 64, out a1_402, out a2_403, out a3_73, out a4_68, out a5_404, out a6_405, out a7_406);
	word32 a0_87;
	Eq_2 a3_90;
	word32 s0_97;
	struct Eq_231326 * s3_102;
	word32 a4_408;
	word32 s1_407;
	word32 s4_410;
	word32 s2_409;
	word32 s6_412;
	word32 s5_411;
	word32 s8_414;
	word32 s7_413;
	word32 mstatus_415;
	Eq_2 ra_96 = prov_send(ra, a3_73, a4_68, s5, s6, s7, s8, mstatus, dwLoc80, dwLoc7C, 0x00460000, dwLoc6C, dwLoc68, dwLoc64, dwLoc58, dwLoc50, dwLoc4C, s2, s0, dwLoc40, dwLoc3C, dwLoc38, dwLoc34, dwLoc30, dwLoc18, dwLoc10, dwLoc08, dwLoc04, fp + -0x0068, dwArg0C, dwArg18, dwArg1C, dwArg28, s1, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, out s0_97, out s1_407, out a0_87, out a3_90, out a4_408, out s2_409, out s3_102, out s4_410, out s5_411, out s6_412, out s7_413, out s8_414, out mstatus_415);
	if (a0_87 != 0x00)
	{
		word32 s1_430;
		word32 a3_434;
		word32 a1_432;
		word32 a0_431;
		word32 a4_435;
		word32 a2_433;
		word32 a5_436;
		word32 a7_437;
		word32 s2_438;
		word32 s3_439;
		word32 s4_440;
		word32 s5_441;
		word32 s6_442;
		word32 s7_443;
		word32 s8_444;
		word32 s9_445;
		word32 s10_446;
		word32 s11_447;
		word32 t4_448;
		printf(ra_96, &g_t230B99E0, a3_90, 0x00460000, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_430, out a0_431, out a1_432, out a2_433, out a3_434, out a4_435, out a5_436, out a7_437, out s2_438, out s3_439, out s4_440, out s5_441, out s6_442, out s7_443, out s8_444, out s9_445, out s10_446, out s11_447, out t4_448);
		return;
	}
	int32 a5_124;
	if ((atomic_get(s0_97 + 1120) >> 2 & 0x01) == 0x00)
	{
		a5_124 = 0x05;
		if ((atomic_get(s0_97 + 1120) >> 3 & 0x01) == 0x00)
		{
l23044578:
			s3_102->b0028 = (byte) a5_124;
			return;
		}
	}
	a5_124 = 0x00FF;
	goto l23044578;
}

