pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304457E: void gen_prov_ctl(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_231497) a0, Register (ptr32 Eq_231498) a1, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void gen_prov_ctl(Eq_2 ra, Eq_2 s1, struct Eq_231497 * a0, struct Eq_231498 * a1, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	uint32 a5_5 = (word32) a0->b0005;
	if (a5_5 >> 2 == 0x01)
		atomic_get(0x42014460);
	else
	{
		struct Eq_274 * a0_207;
		struct Eq_231552 * sp_11 = fp + ~0x1F;
		if (a5_5 >> 2 != 0x00)
		{
			if (a5_5 >> 2 == 0x02)
			{
				if ((atomic_get(0x42014460) >> 1 & 0x01) == 0x00)
					return;
				reset_adv_link(ra, s1, a3, 0x02, mstatus, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg60, s3, s1, ra, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
				return;
			}
			a0_207 = (struct Eq_274 *) &g_t230B93C4;
		}
		else
		{
			Eq_2 a1_27 = (word32) a1->w0004;
			if (a1_27 > 0x0F)
			{
				Eq_2 s0_29 = 0x42014000;
				struct Eq_231624 * s4_35 = &g_t42014460;
				if ((atomic_get(0x42014460) >> 1 & 0x01) == 0x00)
				{
					word32 a1_46;
					word32 a2_488;
					word32 a5_489;
					Eq_2 a4_45;
					Eq_2 a3_44;
					if (memcmp(a1->t0000, a1_27, 0x10, out a1_46, out a2_488, out a3_44, out a4_45, out a5_489) == 0x00)
					{
						Eq_2 a5_49 = *((word32) g_t4200F438 + 40);
						if (a5_49 != 0x00)
						{
							word32 s8_62;
							word32 t3_63;
							word32 a6_64;
							word32 a2_65;
							word32 s11_304;
							word32 s10_303;
							word32 a7_302;
							word32 s5_305;
							word32 s6_306;
							word32 s7_307;
							word32 s9_308;
							word32 t0_309;
							word32 t1_310;
							word32 t4_311;
							word32 t5_312;
							word32 t6_313;
							word32 tp_314;
							a5_49();
						}
						s4_35->t0120 = a5_49;
						Eq_2 a3_82;
						Eq_2 a4_83;
						word32 a0_514;
						word32 a1_515;
						word32 a2_516;
						word32 a5_517;
						word32 s4_518;
						word32 s8_519;
						atomic_or(s0_29, 0x02, a3_44, a4_45, mstatus, out a0_514, out a1_515, out a2_516, out a3_82, out a4_83, out a5_517, out s4_518, out s8_519);
						struct Eq_231750 * a5_92 = *((word32) a4_83 + 8);
						a5_92->w0004 = 0x00;
						*a4_83 = a5_92;
						struct Eq_231761 * s4_114;
						word32 s0_520;
						word32 a3_521;
						word32 a4_522;
						word32 mstatus_523;
						bearer_ctl_send(ra, 0x01, 0x00, a3_82, a4_83, mstatus, sp_11->t0000, sp_11->t0004, sp_11->t0028, sp_11->t0030, sp_11->t0034, sp_11->t0038, sp_11->t004C, sp_11->t0058, sp_11->t0068, sp_11->t0078, sp_11->t007C, sp_11->t0098, sp_11->t00A8, sp_11->t00B8, sp_11->t00D8, sp_11->t00E8, sp_11->t00F8, sp_11->t0118, sp_11->t0128, sp_11->t0138, out s0_520, out a3_521, out a4_522, out s4_114, out mstatus_523);
						s4_114->b0028 = 0x00;
					}
					return;
				}
				else
				{
					Eq_2 a4_128 = g_t42014580;
					if (a4_128 != 0x0F || (word32) g_b42014488 != 0x00)
					{
						word32 s1_495;
						word32 a0_496;
						word32 a1_497;
						word32 a2_498;
						word32 a3_499;
						word32 a4_500;
						word32 a5_501;
						word32 a7_502;
						word32 s2_503;
						word32 s3_504;
						word32 s4_505;
						word32 s5_506;
						word32 s6_507;
						word32 s7_508;
						word32 s8_509;
						word32 s9_510;
						word32 s10_511;
						word32 s11_512;
						word32 t4_513;
						printf(ra, &g_t230B9398, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_495, out a0_496, out a1_497, out a2_498, out a3_499, out a4_500, out a5_501, out a7_502, out s2_503, out s3_504, out s4_505, out s5_506, out s6_507, out s7_508, out s8_509, out s9_510, out s10_511, out s11_512, out t4_513);
						return;
					}
					else
					{
						word32 s0_490;
						word32 a3_491;
						word32 a4_492;
						word32 s4_493;
						word32 mstatus_494;
						bearer_ctl_send(ra, 0x01, 0x00, a3, a4_128, mstatus, dwArg00, dwArg04, dwArg28, dwArg30, dwArg34, dwArg38, dwArg4C, dwArg58, s1, dwArg78, dwArg7C, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, dwArg0138, out s0_490, out a3_491, out a4_492, out s4_493, out mstatus_494);
						return;
					}
				}
			}
			a0_207 = (struct Eq_274 *) &g_t230B936C;
		}
		word32 a1_471;
		word32 a2_472;
		word32 a4_474;
		word32 a3_473;
		word32 a7_476;
		word32 a5_475;
		word32 s3_478;
		word32 s2_477;
		word32 s5_480;
		word32 s4_479;
		word32 s1_469;
		word32 a0_470;
		word32 s6_481;
		word32 s7_482;
		word32 s8_483;
		word32 s9_484;
		word32 s10_485;
		word32 s11_486;
		word32 t4_487;
		printf(ra, a0_207, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_469, out a0_470, out a1_471, out a2_472, out a3_473, out a4_474, out a5_475, out a7_476, out s2_477, out s3_478, out s4_479, out s5_480, out s6_481, out s7_482, out s8_483, out s9_484, out s10_485, out s11_486, out t4_487);
	}
}

// 230446C0: Register Eq_2 bt_mesh_input_number(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Register out ptr32 a0Out, Register out Eq_2 a3Out)
// Called from:
//      blemesh_input_num
Eq_2 bt_mesh_input_number(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, ptr32 & a0Out, union Eq_2 & a3Out)
{
	ptr32 a0_113;
	ui32 a0_19;
	Eq_2 s8_27;
	word32 a1_153;
	word32 a2_154;
	word32 a4_155;
	word32 a5_156;
	word32 s4_157;
	Eq_2 a3_115;
	Eq_2 s1_25 = atomic_and(a0, ~0x04, a3, a4, mstatus, out a0_19, out a1_153, out a2_154, out a3_115, out a4_155, out a5_156, out s4_157, out s8_27);
	if ((a0_19 & 0x04) != 0x00)
	{
		((word32) s1_25 + 89)->u0 = (byte) (a0 >> 0x10);
		*((word32) s1_25 + 88) = (byte) (a0 >> 0x18);
		*((word32) s1_25 + 90) = (word16) ((word32) (word16) a0 >> 8 | a0 << 0x08);
		ra = send_input_complete(ra, a3_115, s5, s6, s7, s8_27, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out a3_115);
		a0_113 = 0x00;
	}
	else
		a0_113 = ~0x15;
	a0Out = a0_113;
	a3Out = a3_115;
	return ra;
}

// 23044714: Register Eq_2 bt_mesh_input_string(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      blemesh_input_str
Eq_2 bt_mesh_input_string(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, ptr32 & a0Out, ptr32 & a3Out)
{
	ptr32 a0_117;
	ui32 a0_19;
	Eq_2 s8_27;
	word32 a1_157;
	word32 a2_158;
	word32 a4_159;
	word32 a5_160;
	word32 s4_161;
	ptr32 a3_119;
	Eq_2 s1_25 = atomic_and(0x42014460, ~0x08, a3, a4, mstatus, out a0_19, out a1_157, out a2_158, out a3_119, out a4_159, out a5_160, out s4_161, out s8_27);
	if ((a0_19 & 0x08) != 0x00)
	{
		Eq_2 a3_39;
		word32 a2_162;
		word32 a4_163;
		word32 a5_164;
		strncpy(0x420144AC, s1_25, (word32) *((word32) g_t4200F438 + 20), out a2_162, out a3_39, out a4_163, out a5_164);
		ra = send_input_complete(ra, a3_39, s5, s6, s7, s8_27, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out a3_119);
		a0_117 = 0x00;
	}
	else
		a0_117 = ~0x15;
	a0Out = a0_117;
	a3Out = a3_119;
	return ra;
}

// 2304475E: Register (ptr32 Eq_227468) bt_mesh_pb_gatt_recv(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_227468) a0, Register Eq_2 a1, Register Eq_2 a3, Register (ptr32 Eq_227468) a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
// Called from:
//      proxy_complete_pdu
struct Eq_227468 * bt_mesh_pb_gatt_recv(Eq_2 ra, Eq_2 s0, struct Eq_227468 * a0, Eq_2 a1, Eq_2 a3, struct Eq_227468 * a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	struct Eq_227468 * a5_111;
	struct Eq_232002 * s1_8 = a5->ptr0004;
	if (a5 != a0)
	{
		word32 t4_382;
		word32 s11_381;
		word32 s10_380;
		word32 s9_379;
		word32 s8_378;
		word32 s7_377;
		word32 s6_376;
		word32 s3_373;
		word32 s4_374;
		word32 s5_375;
		word32 a3_369;
		word32 a4_370;
		word32 s2_372;
		word32 a7_371;
		word32 s1_365;
		word32 a0_366;
		word32 a2_368;
		word32 a1_367;
		printf(ra, &g_t230B9238, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_365, out a0_366, out a1_367, out a2_368, out a3_369, out a4_370, out a5_111, out a7_371, out s2_372, out s3_373, out s4_374, out s5_375, out s6_376, out s7_377, out s8_378, out s9_379, out s10_380, out s11_381, out t4_382);
		return a5_111;
	}
	struct Eq_274 * a0_137;
	Eq_2 a5_15 = (word32) *((word32) a1 + 4);
	if (a5_15 != 0x00)
	{
		word32 a5_385;
		word32 a2_384;
		word32 a1_383;
		Eq_2 a0_18 = net_buf_simple_pull_u8(a5_15, out a1_383, out a2_384, out a5_385);
		if (a0_18 != 0x09)
		{
			Eq_2 a2_23 = (word32) s1_8->b0028;
			if (a2_23 != a0_18)
			{
				Eq_2 a3_87;
				Eq_2 s5_97;
				Eq_2 s6_98;
				Eq_2 s7_99;
				Eq_2 s8_100;
				word32 a5_391;
				word32 a7_392;
				word32 s2_393;
				word32 s3_394;
				word32 s4_395;
				word32 s9_396;
				word32 s10_397;
				word32 s11_398;
				word32 t4_399;
				word32 a4_390;
				word32 a2_389;
				word32 a1_388;
				word32 a0_387;
				word32 s1_386;
				a5_111 = prov_send_fail_msg(printf(ra, &g_t230B9720, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_386, out a0_387, out a1_388, out a2_389, out a3_87, out a4_390, out a5_391, out a7_392, out s2_393, out s3_394, out s4_395, out s5_97, out s6_98, out s7_99, out s8_100, out s9_396, out s10_397, out s11_398, out t4_399), a1, 0x03, a3_87, s5_97, s6_98, s7_99, s8_100, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8);
				return a5_111;
			}
			if (a2_23 > 0x09)
			{
				a0_137 = (struct Eq_274 *) &g_t230B9744;
l230447A0:
				word32 s1_400;
				word32 a0_401;
				word32 a1_402;
				word32 a2_403;
				word32 a3_404;
				word32 a4_405;
				word32 a7_406;
				word32 s2_407;
				word32 s3_408;
				word32 s4_409;
				word32 s5_410;
				word32 s6_411;
				word32 s7_412;
				word32 s8_413;
				word32 s9_414;
				word32 s10_415;
				word32 s11_416;
				word32 t4_417;
				printf(ra, a0_137, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_400, out a0_401, out a1_402, out a2_403, out a3_404, out a4_405, out a5_111, out a7_406, out s2_407, out s3_408, out s4_409, out s5_410, out s6_411, out s7_412, out s8_413, out s9_414, out s10_415, out s11_416, out t4_417);
				return a5_111;
			}
		}
		struct Eq_232068 * a5_28 = (a0_18 << 0x03) + 587961972;
		word32 a1_31 = (word32) *((word32) a1 + 4);
		if ((word32) a5_28->w0004 == a1_31)
		{
			<anonymous> * a5_34 = a5_28->ptr0000;
			word32 a6_219;
			word32 t1_220;
			word32 t5_221;
			word32 t6_222;
			a5_34();
			return a5_111;
		}
		else
		{
			word32 s1_418;
			word32 a0_419;
			word32 a1_420;
			word32 a2_421;
			word32 a3_422;
			word32 a4_423;
			word32 a7_424;
			word32 s2_425;
			word32 s3_426;
			word32 s4_427;
			word32 s5_428;
			word32 s6_429;
			word32 s7_430;
			word32 s8_431;
			word32 s9_432;
			word32 s10_433;
			word32 s11_434;
			word32 t4_435;
			printf(ra, &g_t230B976C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_418, out a0_419, out a1_420, out a2_421, out a3_422, out a4_423, out a5_111, out a7_424, out s2_425, out s3_426, out s4_427, out s5_428, out s6_429, out s7_430, out s8_431, out s9_432, out s10_433, out s11_434, out t4_435);
			return a5_111;
		}
	}
	else
	{
		a0_137 = (struct Eq_274 *) &g_t230B925C;
		goto l230447A0;
	}
}

// 23044816: void bt_mesh_pb_gatt_open(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg38)
// Called from:
//      prov_ccc_write
void bt_mesh_pb_gatt_open(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, word32 dwArg38)
{
	ui32 a0_21;
	Eq_2 a3_24;
	Eq_2 a4_25;
	word32 s4_95;
	word32 a5_94;
	word32 a2_93;
	word32 a1_92;
	word32 s8_96;
	atomic_or(s0, 0x02, a3, a4, mstatus, out a0_21, out a1_92, out a2_93, out a3_24, out a4_25, out a5_94, out s4_95, out s8_96);
	if ((a0_21 & 2) == 0x00)
	{
		word32 a3_35;
		word32 a4_36;
		struct Eq_232257 * s1_38 = bt_conn_ref(a0, a3_24, a4_25, mstatus, out a3_35, out a4_36);
		Eq_2 a5_41 = g_t4200F438;
		s1_38->b0028 = 0x00;
		*((word32) a0 + 4) = s1_38;
		Eq_2 a5_44 = *((word32) a5_41 + 40);
		if (a5_44 != 0x00)
			a5_44();
	}
	0x00 = dwArg38;
}

// 23044868: Register Eq_2 bt_mesh_pb_gatt_close(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      protocol_timeout
//      proxy_disconnected
//      bt_mesh_proxy_prov_disable
Eq_2 bt_mesh_pb_gatt_close(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	if (g_t42014464 != a0)
	{
		ptr32 a5_14;
		ptr32 a3_18;
		ptr32 a4_19;
		ptr32 s1_22;
		ptr32 s2_25;
		ptr32 s3_26;
		ptr32 s5_28;
		word32 t4_235;
		word32 s11_234;
		word32 s10_233;
		word32 s9_232;
		word32 s8_231;
		word32 s7_230;
		word32 s6_229;
		word32 s4_228;
		word32 a7_227;
		word32 a2_226;
		word32 a1_225;
		word32 a0_224;
		Eq_2 ra_21 = printf(ra, &g_t230B9228, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_22, out a0_224, out a1_225, out a2_226, out a3_18, out a4_19, out a5_14, out a7_227, out s2_25, out s3_26, out s4_228, out s5_28, out s6_229, out s7_230, out s8_231, out s9_232, out s10_233, out s11_234, out t4_235);
		s1Out = s1_22;
		a0Out.u0 = -57;
		a3Out = a3_18;
		a4Out = a4_19;
		a5Out = a5_14;
		s2Out = s2_25;
		s3Out = s3_26;
		s5Out = s5_28;
		mstatusOut = mstatus;
		return ra_21;
	}
	else
	{
		Eq_2 a5_40 = *((word32) g_t4200F438 + 44);
		if (a5_40 != 0x00)
		{
			word32 tp_50;
			word32 a6_115;
			word32 t1_116;
			word32 t5_117;
			word32 t6_118;
			a5_40();
		}
		ptr32 a3_81;
		ptr32 a4_82;
		ptr32 a5_83;
		ptr32 mstatus_86;
		ptr32 s1_88;
		ptr32 s2_91;
		ptr32 s3_92;
		ptr32 s5_94;
		Eq_2 ra_87 = reset_state(ra, s0, a3, a4, mstatus, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg60, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s1_88, out a3_81, out a4_82, out a5_83, out s2_91, out s3_92, out s5_94, out mstatus_86);
		s1Out = s1_88;
		a0Out = a0;
		a3Out = a3_81;
		a4Out = a4_82;
		a5Out = a5_83;
		s2Out = s2_91;
		s3Out = s3_92;
		s5Out = s5_94;
		mstatusOut = mstatus_86;
		return ra_87;
	}
}

// 230448A6: void protocol_timeout(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void protocol_timeout(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	struct Eq_232451 * a5_8 = *((word32) a0 + 4);
	if (a0 != 0x00)
	{
		word32 s1_185;
		word32 a0_186;
		word32 a3_187;
		word32 a4_188;
		word32 a5_189;
		word32 s2_190;
		word32 s3_191;
		word32 s5_192;
		word32 mstatus_193;
		bt_mesh_pb_gatt_close(ra, s0, a0, a3, a4, mstatus, dwLoc1C, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg14, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s1_185, out a0_186, out a3_187, out a4_188, out a5_189, out s2_190, out s3_191, out s5_192, out mstatus_193);
	}
	else
	{
		a5_8->b0126 = 0x00;
		Eq_2 a3_20;
		Eq_2 a4_21;
		ptr32 mstatus_25;
		Eq_2 s0_27;
		word32 s4_176;
		word32 s1_177;
		word32 a3_178;
		word32 a4_179;
		word32 a5_180;
		word32 s2_181;
		word32 s3_182;
		word32 s5_183;
		word32 mstatus_184;
		reset_state(bearer_ctl_send(ra, 0x02, 0x01, a3, 0x01, mstatus, dwLoc20, dwLoc1C, dwArg08, dwArg10, dwArg14, dwArg18, dwArg2C, dwArg38, dwArg48, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, out s0_27, out a3_20, out a4_21, out s4_176, out mstatus_25), s0_27, a3_20, a4_21, mstatus_25, dwLoc1C, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg14, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s1_177, out a3_178, out a4_179, out a5_180, out s2_181, out s3_182, out s5_183, out mstatus_184);
	}
}

