pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 230448DC: Register Eq_2 bt_mesh_prov_get(Register out ptr32 a5Out)
// Called from:
//      beacon_send
//      bt_mesh_prov_enable
//      bt_mesh_proxy_adv_start
Eq_2 bt_mesh_prov_get(ptr32 & a5Out)
{
	Eq_2 a0_5 = g_t4200F438;
	a5Out = 0x4200F000;
	return a0_5;
}

// 230448E6: Register ui32 bt_prov_active()
// Called from:
//      beacon_send
//      bt_mesh_pb_adv_recv
ui32 bt_prov_active()
{
	return atomic_get(0x42014460) >> 1 & 0x01;
}

// 23044900: Register Eq_2 bt_mesh_pb_adv_recv(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack word32 dwArgC4, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_196081 s6Out, Register out Eq_196082 s7Out, Register out Eq_196083 s8Out, Register out ptr32 s9Out, Register out Eq_196085 s10Out)
// Called from:
//      bt_mesh_scan_cb
Eq_2 bt_mesh_pb_adv_recv(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, word32 dwArgC4, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_196081 & s6Out, union Eq_196082 & s7Out, union Eq_196083 & s8Out, ptr32 & s9Out, union Eq_196085 & s10Out)
{
	Eq_2 a0_116;
	if (bt_prov_active() == 0x00)
	{
		a0_116 = bt_mesh_is_provisioned();
		if (a0_116 != 0x00)
			goto l23044930;
	}
	struct Eq_274 * a0_105;
	if ((word32) *((word32) a0 + 4) <= 0x05)
	{
		a0_105 = (struct Eq_274 *) &g_t230B925C;
		goto l23044924;
	}
	Eq_2 a5_29;
	word32 a1_288;
	dwLoc1C = net_buf_simple_pull_be32(a4, out a1_288, out a5_29);
	Eq_2 a5_36;
	word32 a2_290;
	word32 a1_289;
	net_buf_simple_pull_u8(a5_29, out a1_289, out a2_290, out a5_36);
	word32 a2_292;
	word32 a1_291;
	word32 a5_293;
	byte bLoc13_151 = (byte) net_buf_simple_pull_u8(a5_36, out a1_291, out a2_292, out a5_293);
	Eq_2 a5_48 = atomic_get(0x42014460) >> 1 & 1;
	s2.u0 = 0x42014460;
	a0_116.u0 = 0x42014000;
	if (a5_48 != 0x00)
	{
		a4 = g_t42014580;
		if (a4 != a5_48)
			goto l23044930;
	}
	a4 = (word32) *((word32) a0 + 4);
	if (a4 < (word32) g_a230B92B1[(word32) bLoc13_151 & 0x03])
	{
		a0_105 = (struct Eq_274 *) &g_t230B9208;
l23044924:
		word32 s1_294;
		word32 a1_295;
		word32 a2_296;
		word32 a5_297;
		word32 a7_298;
		word32 s4_299;
		word32 s8_300;
		word32 s11_301;
		word32 t4_302;
		ra = printf(ra, a0_105, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_294, out a0_116, out a1_295, out a2_296, out a3, out a4, out a5_297, out a7_298, out s2, out s3, out s4_299, out s5, out s6, out s7, out s8_300, out s9, out s10, out s11_301, out t4_302);
		goto l23044930;
	}
	a0_116 = atomic_get(0x42014460) >> 1 & 0x01;
	ui32 a5_70 = (word32) bLoc13_151;
	if (a0_116 == 0x00)
	{
		a4 = (word32) g_a230B92B0[a5_70 & 3];
		if (a4 != 0x00)
		{
l23044930:
			a0Out = a0_116;
			a3Out = a3;
			a4Out = a4;
			s2Out = s2;
			s3Out = s3;
			s4Out = dwArg04;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = dwLoc1C;
			s9Out = s9;
			s10Out = s10;
			return ra;
		}
	}
	<anonymous> * a5_77 = (a5_70 & 0x03) << 3;
	word32 s11_161;
	word32 a7_159;
	word32 t0_167;
	word32 t4_168;
	a5_77();
	goto l23044930;
}

// 230449DA: Register Eq_2 bt_mesh_prov_init(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_init
Eq_2 bt_mesh_prov_init(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		ptr32 a3_19;
		ptr32 a4_20;
		word32 s1_191;
		word32 a0_192;
		word32 a1_193;
		word32 a2_194;
		word32 a5_195;
		word32 a7_196;
		word32 s2_197;
		word32 s3_198;
		word32 s4_199;
		word32 s5_200;
		word32 s6_201;
		word32 s7_202;
		word32 s8_203;
		word32 s9_204;
		word32 s10_205;
		word32 s11_206;
		word32 t4_207;
		Eq_2 ra_22 = printf(ra, &g_t230B9288, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_191, out a0_192, out a1_193, out a2_194, out a3_19, out a4_20, out a5_195, out a7_196, out s2_197, out s3_198, out s4_199, out s5_200, out s6_201, out s7_202, out s8_203, out s9_204, out s10_205, out s11_206, out t4_207);
		a0Out = ~0x15;
		a3Out = a3_19;
		a4Out = a4_20;
		mstatusOut = mstatus;
		return ra_22;
	}
	else
	{
		Eq_2 a3_52;
		Eq_2 a4_53;
		word32 a0_208;
		word32 a5_209;
		word32 s2_210;
		word32 s3_211;
		word32 s4_212;
		word32 s5_213;
		g_t4200F438 = k_delayed_work_init(ra, 0x42014460, 0x420145D0, a3, a4, mstatus, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a0_208, out a3_52, out a4_53, out a5_209, out s2_210, out s3_211, out s4_212, out s5_213);
		ptr32 a0_69;
		Eq_2 a3_72;
		Eq_2 a4_73;
		word32 a5_214;
		word32 s2_215;
		word32 s3_216;
		word32 s4_217;
		word32 s5_218;
		k_delayed_work_init(ra, 0x42014460, 0x420145A8, a3_52, a4_53, mstatus, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a0_69, out a3_72, out a4_73, out a5_214, out s2_215, out s3_216, out s4_217, out s5_218);
		ptr32 a3_90;
		ptr32 a4_91;
		ptr32 mstatus_95;
		word32 s1_219;
		word32 a5_220;
		word32 s2_221;
		word32 s3_222;
		word32 s5_223;
		Eq_2 ra_96 = reset_state(ra, s0, a3_72, a4_73, mstatus, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg60, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s1_219, out a3_90, out a4_91, out a5_220, out s2_221, out s3_222, out s5_223, out mstatus_95);
		a0Out = a0_69;
		a3Out = a3_90;
		a4Out = a4_91;
		mstatusOut = mstatus_95;
		return ra_96;
	}
}

// 23044A3A: void bt_mesh_prov_complete()
// Called from:
//      bt_mesh_net_start
void bt_mesh_prov_complete()
{
	Eq_2 t1_6 = *((word32) g_t4200F438 + 48);
	if (t1_6 == 0x00)
		return;
	t1_6();
}

// 23044A4E: void bt_mesh_prov_reset()
// Called from:
//      bt_mesh_reset
void bt_mesh_prov_reset()
{
	Eq_2 t1_6 = *((word32) g_t4200F438 + 52);
	if (t1_6 == 0x00)
		return;
	t1_6();
}

