pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23044A62: void prov_ccc_read()
// Called from:
//      proxy_ccc_read
void prov_ccc_read()
{
	bt_gatt_attr_read(a2, a3, a4, a5, a6);
}

// 23044A6A: void proxy_ccc_read()
void proxy_ccc_read()
{
	prov_ccc_read();
}

// 23044A6E: void proxy_sar_timeout(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_232812) a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
void proxy_sar_timeout(Eq_2 ra, Eq_2 s0, struct Eq_232812 * a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	Eq_2 a3_18;
	Eq_2 s1_22;
	Eq_2 s2_25;
	Eq_2 s3_26;
	word32 a0_158;
	word32 a1_159;
	word32 a2_160;
	word32 a4_161;
	word32 a5_162;
	word32 a7_163;
	word32 s4_164;
	word32 s5_165;
	word32 s6_166;
	word32 s7_167;
	word32 s8_168;
	word32 s9_169;
	word32 s10_170;
	word32 s11_171;
	word32 t4_172;
	Eq_2 ra_21 = printf(ra, &g_t230B9DD4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_22, out a0_158, out a1_159, out a2_160, out a3_18, out a4_161, out a5_162, out a7_163, out s2_25, out s3_26, out s4_164, out s5_165, out s6_166, out s7_167, out s8_168, out s9_169, out s10_170, out s11_171, out t4_172);
	Eq_2 a0_35 = a0->tFFFFFFEC;
	if (a0_35 == 0x00)
		return;
	word32 s0_173;
	word32 s1_174;
	word32 a0_175;
	word32 a3_176;
	word32 a4_177;
	word32 a5_178;
	word32 s2_179;
	word32 s3_180;
	word32 s4_181;
	word32 s5_182;
	word32 mstatus_183;
	bt_conn_disconnect(ra_21, s0, s1_22, a0_35, 0x13, a3_18, s2_25, s3_26, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg60, ra, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg8C, dwArg94, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, out s0_173, out s1_174, out a0_175, out a3_176, out a4_177, out a5_178, out s2_179, out s3_180, out s4_181, out s5_182, out mstatus_183);
}

// 23044A9C: Register Eq_2 find_client.part.0(Register Eq_2 a0, Register Eq_2 a3, Register out Eq_2 a4Out)
// Called from:
//      prov_ccc_write
//      proxy_ccc_write
//      proxy_recv
//      bt_mesh_proxy_send
Eq_2 find_client.part.0(Eq_2 a0, Eq_2 a3, union Eq_2 & a4Out)
{
	Eq_2 a5_11;
	word32 a5_12;
	Eq_2 a4_10 = 0x4200DAB0;
	if (a0 != g_t4200DAB0)
	{
		a4_10 = *((word32) a3 + 0x0044);
		a5_11.u0 = 0x00;
		if (a0 != a3)
			goto l23044AC0;
		a5_12 = 0x01;
	}
	else
		a5_12 = 0x00;
	a5_11 = (word32) a4_10 + (a5_12 + 0x0044);
l23044AC0:
	a4Out = a4_10;
	return a5_11;
}

// 23044AC8: void prov_ccc_write(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_233026) a2, Register Eq_2 a3, Register (ptr32 word16) a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack word32 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void prov_ccc_write(Eq_2 ra, Eq_2 a0, struct Eq_233026 * a2, Eq_2 a3, word16 * a4, ptr32 mstatus, Eq_2 dwArg18, word32 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	if (a3 == 0x02)
	{
		ui32 a1_19 = (word32) a2->b0001 << 8 | (word32) a2->b0000;
		*a4 = (word16) a1_19;
		if (a1_19 != 0x01)
		{
			word32 s1_131;
			word32 a0_132;
			word32 a1_133;
			word32 a2_134;
			word32 a3_135;
			word32 a4_136;
			word32 a5_137;
			word32 a7_138;
			word32 s2_139;
			word32 s3_140;
			word32 s4_141;
			word32 s5_142;
			word32 s6_143;
			word32 s7_144;
			word32 s8_145;
			word32 s9_146;
			word32 s10_147;
			word32 s11_148;
			word32 t4_149;
			printf(ra, &g_t230B9B54, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_131, out a0_132, out a1_133, out a2_134, out a3_135, out a4_136, out a5_137, out a7_138, out s2_139, out s3_140, out s4_141, out s5_142, out s6_143, out s7_144, out s8_145, out s9_146, out s10_147, out s11_148, out t4_149);
		}
		else
		{
			Eq_2 a4_25;
			Eq_2 a0_24 = find_client.part.0(a0, a3, out a4_25);
			if ((word32) *((word32) a0_24 + 6) == 0x00)
			{
				*((word32) a0_24 + 6) = 0x03;
				bt_mesh_pb_gatt_open(ra, 0x02, a0, a3, a4_25, mstatus, dwArg28);
			}
		}
	}
}

// 23044B26: void proxy_ccc_write(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_233120) a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void proxy_ccc_write(Eq_2 ra, Eq_2 a0, struct Eq_233120 * a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	if (a3 == 0x02)
	{
		Eq_2 a1_15 = (word32) a2->b0001 << 8 | (word32) a2->b0000;
		if (a1_15 != 0x01)
		{
			word32 s1_144;
			word32 a0_145;
			word32 a1_146;
			word32 a2_147;
			word32 a3_148;
			word32 a4_149;
			word32 a5_150;
			word32 a7_151;
			word32 s2_152;
			word32 s3_153;
			word32 s4_154;
			word32 s5_155;
			word32 s6_156;
			word32 s7_157;
			word32 s8_158;
			word32 s9_159;
			word32 s10_160;
			word32 s11_161;
			word32 t4_162;
			printf(ra, &g_t230B9B54, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_144, out a0_145, out a1_146, out a2_147, out a3_148, out a4_149, out a5_150, out a7_151, out s2_152, out s3_153, out s4_154, out s5_155, out s6_156, out s7_157, out s8_158, out s9_159, out s10_160, out s11_161, out t4_162);
		}
		else
		{
			Eq_2 a4_20;
			Eq_2 a0_19 = find_client.part.0(a0, a3, out a4_20);
			if ((word32) *((word32) a0_19 + 6) == 0x00)
			{
				*((word32) a0_19 + 6) = (byte) a1_15;
				word32 s1_163;
				word32 a0_164;
				word32 a1_165;
				word32 a3_166;
				word32 a4_167;
				word32 a5_168;
				word32 s2_169;
				word32 s3_170;
				word32 s4_171;
				word32 s5_172;
				word32 s6_173;
				word32 s8_174;
				k_work_submit((word32) a0_19 + 8, a3, a4_20, mstatus, dwLoc1C, a1_15, dwArgD8, dwArg0118, dwArg0158, out s1_163, out a0_164, out a1_165, out a3_166, out a4_167, out a5_168, out s2_169, out s3_170, out s4_171, out s5_172, out s6_173, out s8_174);
			}
		}
	}
}

// 23044B7A: void filter_add.isra.1(Register (ptr32 uint16) a0, Register Eq_2 a1)
// Called from:
//      proxy_complete_pdu
//      bt_mesh_proxy_addr_add
void filter_add.isra.1(uint16 * a0, Eq_2 a1)
{
	if (a1 != 0x00)
	{
		Eq_2 a5_6 = (word32) *a0;
		if (a1 != a5_6 && a5_6 == 0x00)
			*a0 = (word16) a1;
	}
}

// 23044B8C: Register ptr32 next_sub.part.6(Register out ptr32 a3Out, Register out (ptr32 Eq_233251) s2Out, Register out ptr32 s8Out)
// Called from:
//      bt_mesh_proxy_adv_start
ptr32 next_sub.part.6(ptr32 & a3Out, struct Eq_233251 & s2Out, ptr32 & s8Out)
{
	ptr32 a0_102;
	int32 s0_9 = g_dw4200F444;
	struct Eq_233257 * a4_14 = (s0_9 & 0x01) + 228;
	struct Eq_233262 * s0_13 = s0_9 & 0x01;
	ptr32 a3_103 = (word32) a4_14->w4200D8DC;
	if (a3_103 != 0x0FFFFFFF)
	{
		if ((word32) a4_14->b4200D8E0 == 0x01)
			goto l23044C02;
		word32 a5_124;
		if (bt_mesh_gatt_proxy_get(out a5_124) == 0x01)
			goto l23044C02;
	}
	s0_13 = g_dw4200F444 + 0x01 & 0x01;
	a3_103 = (word32) s0_13->w4200D9C0;
	if (a3_103 == 0x0FFFFFFF)
	{
l23044C32:
		a0_102 = 0x00;
l23044C1C:
		a3Out = a3_103;
		s2Out = (struct Eq_233251 *) &g_dw4200F444;
		s8Out = dwLoc1C;
		return a0_102;
	}
	if ((word32) s0_13->b4200D9C4 == 0x01)
		goto l23044C02;
	word32 a5_125;
	if (bt_mesh_gatt_proxy_get(out a5_125) != 0x01)
		goto l23044C32;
l23044C02:
	g_dw4200F444 = g_dw4200F444 + 0x01 & 0x01;
	a0_102 = (char *) s0_13 + 0x4200D9A4;
	goto l23044C1C;
}

// 23044C36: void proxy_disconnected(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register (ptr32 Eq_233324) a4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void proxy_disconnected(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, struct Eq_233324 * a4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	ptr32 s1_19;
	a4->dwFFFFFFFF = a4->dw0000;
	Eq_2 a5_103 = g_t4200DAB0;
	Eq_2 s0_17 = 0x4200DAB0;
	if (a0 != a5_103)
	{
		s0_17 = *((word32) a5_103 + 0x0044);
		s1_19 = 0x01;
		if (a0 != a5_103)
			goto l23044C64;
	}
	else
		s1_19 = 0x00;
	Eq_2 a4_28 = (word32) ((word32) s0_17 + (s1_19 + 0x0044) + 6);
	if (a4_28 == 0x03)
	{
		word32 s3_286;
		word32 s5_287;
		word32 a5_284;
		word32 s2_285;
		word32 a0_283;
		ra = bt_mesh_pb_gatt_close(ra, s0_17, a0, a3, a4_28, mstatus, s0, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s1_19, out a0_283, out a3, out a4_28, out a5_284, out s2_285, out s3_286, out s5_287, out mstatus);
	}
	union Eq_2 * a0_76;
	Eq_2 a3_78;
	Eq_2 a4_79;
	word32 s8_280;
	word32 s4_278;
	word32 s6_279;
	word32 s2_276;
	word32 s3_277;
	word32 a2_274;
	word32 a5_275;
	word32 a1_273;
	k_delayed_work_cancel((word32) s0_17 + (s1_19 + 88), a3, a4_28, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_76, out a1_273, out a2_274, out a3_78, out a4_79, out a5_275, out s2_276, out s3_277, out s4_278, out s5, out s6_279, out s8_280);
	Eq_2 s0_98 = *a0_76;
	word32 a4_282;
	word32 a3_281;
	bt_conn_unref(s0_98, a3_78, a4_79, mstatus, out a3_281, out a4_282, out a5_103);
	*s0_98 = 0x00;
l23044C64:
	word32 s11_271;
	word32 mstatus_272;
	word32 s7_268;
	word32 s8_269;
	word32 s9_270;
	word32 s5_266;
	word32 s6_267;
	word32 s2_263;
	word32 s3_264;
	word32 s4_265;
	word32 a5_262;
	word32 a3_260;
	word32 a4_261;
	word32 s0_257;
	word32 s1_258;
	word32 a0_259;
	bt_mesh_adv_update(ra, a5_103, s5, mstatus, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg88, dwArgC8, dwArgE8, dwArg0118, dwArg0128, dwArg0168, out s0_257, out s1_258, out a0_259, out a3_260, out a4_261, out a5_262, out s2_263, out s3_264, out s4_265, out s5_266, out s6_267, out s7_268, out s8_269, out s9_270, out s11_271, out mstatus_272);
}

