pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23044CAA: void proxy_connected(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register (ptr32 Eq_233490) a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void proxy_connected(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, struct Eq_233490 * a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	a5->dw0001 = a5->dw0000;
	g_b4200F44B = 0x00;
	Eq_2 a4_19 = 0x01;
	if (a5 <= null)
	{
		word32 s11_250;
		word32 s9_249;
		word32 s8_248;
		word32 s7_247;
		word32 s6_246;
		word32 s5_245;
		word32 s4_244;
		word32 s3_243;
		word32 a5_241;
		word32 s2_242;
		word32 s0_239;
		word32 s1_240;
		ra = bt_mesh_adv_update(ra, &a5->dw0001, s5, mstatus, dwArg10, dwArg14, dwArg38, dwArg5C, s1, dwArgA8, dwArgC8, dwArgF8, dwArg0108, dwArg0148, out s0_239, out s1_240, out a0, out a3, out a4_19, out a5_241, out s2_242, out s3_243, out s4_244, out s5_245, out s6_246, out s7_247, out s8_248, out s9_249, out s11_250, out mstatus);
	}
	word32 s0_58;
	Eq_2 a5_56 = g_t4200DAB0;
	if (a5_56 != 0x00)
	{
		s0_58 = 0x01;
		if (a5_56 != 0x00)
		{
			word32 s1_260;
			word32 a0_261;
			word32 a1_262;
			word32 a2_263;
			word32 a3_264;
			word32 a4_265;
			word32 a5_266;
			word32 a7_267;
			word32 s2_268;
			word32 s3_269;
			word32 s4_270;
			word32 s5_271;
			word32 s6_272;
			word32 s7_273;
			word32 s8_274;
			word32 s9_275;
			word32 s10_276;
			word32 s11_277;
			word32 t4_278;
			printf(ra, &g_t230B9C60, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_260, out a0_261, out a1_262, out a2_263, out a3_264, out a4_265, out a5_266, out a7_267, out s2_268, out s3_269, out s4_270, out s5_271, out s6_272, out s7_273, out s8_274, out s9_275, out s10_276, out s11_277, out t4_278);
			return;
		}
	}
	else
		s0_58 = 0x00;
	word32 s0_63 = s0_58 + 0x0044;
	word32 a3_251;
	word32 a4_252;
	struct Eq_232257 * s1_77 = bt_conn_ref(a0, a3, a4_19, mstatus, out a3_251, out a4_252);
	struct Eq_233572 * s2_81 = s1_77 + s0_63 / 41;
	s2_81->t0000 = a0;
	s2_81->b0006 = 0x00;
	word32 t1_253;
	word32 a0_254;
	word32 a1_255;
	word32 a2_256;
	word32 a3_257;
	word32 a4_258;
	word32 a5_259;
	memset(ra, s1_77 + (s0_63 + 4) / 41, 0x00, 0x02, out t1_253, out a0_254, out a1_255, out a2_256, out a3_257, out a4_258, out a5_259);
	int32 a5_97 = s2_81->dw0040;
	s2_81->w003C = 0x00;
	s2_81->dw0038 = a5_97;
}

// 23044D42: Register Eq_2 proxy_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out (ptr32 Eq_2096) s11Out, Register out ptr32 mstatusOut)
// Called from:
//      proxy_segment_and_send
Eq_2 proxy_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, struct Eq_2096 & s11Out, ptr32 & mstatusOut)
{
	ptr32 a0_180;
	ptr32 a4_184;
	Eq_2 a2_29;
	Eq_2 a4_31;
	Eq_2 ra_33;
	ptr32 a5_185 = (word32) g_b4200F440;
	word16 wLoc1A_112 = SLICE(s0, word16, 16);
	Eq_2 s2_19 = a1;
	Eq_2 s1_192 = a2;
	if (a5_185 == 0x02)
	{
		word32 t1_241;
		word32 a0_242;
		word32 a1_243;
		word32 a3_244;
		word32 a5_245;
		ra_33 = memset(ra, fp + -40, 0x00, 0x18, out t1_241, out a0_242, out a1_243, out a2_29, out a3_244, out a4_31, out a5_245);
	}
	else
	{
		a4_184 = 0x01;
		a0_180 = 0x00;
		if (a5_185 != 0x01)
			goto l23044D82;
		word32 t1_246;
		word32 a0_247;
		word32 a1_248;
		word32 a3_249;
		word32 a5_250;
		ra_33 = memset(ra, fp + -40, 0x00, 0x18, out t1_246, out a0_247, out a1_248, out a2_29, out a3_249, out a4_31, out a5_250);
	}
	word32 s0_251;
	ra = bt_gatt_notify_cb(ra_33, a0, a0, a2_29, a4_31, a1, s11, mstatus, dwLoc30, dwLoc2C, a1, dwLoc24, SEQ(wLoc1A_112, (word16) a2), dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg70, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, out s0_251, out s1_192, out a0_180, out a1, out a3, out a4_184, out a5_185, out s2_19, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out mstatus);
l23044D82:
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_192;
	a0Out = a0_180;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4_184;
	a5Out = a5_185;
	s2Out = s2_19;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

// 23044DAA: Register Eq_2 proxy_segment_and_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg58, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out (ptr32 Eq_2096) s11Out, Register out ptr32 mstatusOut)
// Called from:
//      beacon_send
//      send_filter_status
//      bt_mesh_proxy_send
Eq_2 proxy_segment_and_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg58, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, struct Eq_2096 & s11Out, ptr32 & mstatusOut)
{
	word32 a0_23;
	Eq_2 a4_27;
	struct Eq_2096 * s11_33;
	Eq_2 s3_35;
	ui32 s4_36;
	word32 a3_384;
	word32 s2_385;
	word32 s10_386;
	Eq_2 ra_30 = bt_gatt_get_mtu(ra, a0, a3, s2, dwArg30, dwArg34, dwArg58, dwArg7C, out a0_23, out a3_384, out a4_27, out s2_385, out s3_35, out s4_36, out s10_386, out s11_33);
	uint32 s1_47 = a0_23 + ~0x02 << 0x10;
	if ((word32) *((word32) a2 + 4) >= s1_47 >> 16)
	{
		Eq_2 a1_50 = s4_36 & 63 | 64;
		net_buf_simple_push_u8(a1_50, a4_27);
		ui32 s2_64;
		word32 a0_387;
		word32 a1_388;
		word32 a5_389;
		word32 s8_390;
		Eq_2 s0_116;
		ui32 s4_129;
		ptr32 mstatus_110;
		Eq_2 a4_101;
		ptr32 a3_121;
		struct Eq_2096 * s11_109;
		ptr32 s10_126;
		Eq_2 s1_117;
		Eq_2 s3_106;
		ptr32 s5_130;
		ptr32 s6_131;
		ptr32 s7_132;
		ptr32 s9_134;
		Eq_2 ra_108 = proxy_send(ra_30, *a1_50, s3_35, a1_50, s1_47 >> 16, s11_33, mstatus, dwLoc0C, dwLoc08, dwLoc04, dwArg08, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg48, dwArg50, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_116, out s1_117, out a0_387, out a1_388, out a3_121, out a4_101, out a5_389, out s2_64, out s3_106, out s4_129, out s5_130, out s6_131, out s7_132, out s8_390, out s9_134, out s10_126, out s11_109, out mstatus_110);
		word32 a5_391;
		ptr32 a1_144;
		net_buf_simple_pull(s0_116, s1_117, out a1_144, out a5_391);
		Eq_2 s2_118 = s2_64 | 0x0080;
		while (true)
		{
			ptr32 a5_157 = (word32) *((word32) s0_116 + 4);
			if (a5_157 == 0x00)
				break;
			if (a5_157 + 0x01 < s1_117)
			{
				Eq_2 a1_147 = s4_129 | 0x00C0;
				net_buf_simple_push_u8(a1_147, a4_101);
				word32 s0_397;
				word32 a0_398;
				word32 s4_399;
				word32 s8_400;
				ra_108 = proxy_send(ra_108, *a1_147, s3_106, a1_147, (word32) *((word32) s0_116 + 4), s11_109, mstatus_110, dwLoc0C, dwLoc08, dwLoc04, dwArg08, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg48, dwArg50, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_397, out s1_117, out a0_398, out a1_144, out a3_121, out a4_101, out a5_157, out s2_118, out s3_106, out s4_399, out s5_130, out s6_131, out s7_132, out s8_400, out s9_134, out s10_126, out s11_109, out mstatus_110);
				break;
			}
			net_buf_simple_push_u8(s2_118, a4_101);
			word32 a0_392;
			word32 a1_393;
			word32 a5_394;
			word32 s8_395;
			ra_108 = proxy_send(ra_108, *s2_118, s3_106, s2_118, s1_117, s11_109, mstatus_110, dwLoc0C, dwLoc08, dwLoc04, dwArg08, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg48, dwArg50, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_116, out s1_117, out a0_392, out a1_393, out a3_121, out a4_101, out a5_394, out s2_118, out s3_106, out s4_129, out s5_130, out s6_131, out s7_132, out s8_395, out s9_134, out s10_126, out s11_109, out mstatus_110);
			word32 a5_396;
			net_buf_simple_pull(s0_116, s1_117, out a1_144, out a5_396);
		}
		s0Out = s1;
		s1Out = s1_117;
		a0Out = 0x00;
		a1Out = a1_144;
		a3Out = a3_121;
		a4Out = a4_101;
		a5Out = a5_157;
		s2Out = s2_118;
		s3Out = s3_106;
		s4Out = dwArg04;
		s5Out = s5_130;
		s6Out = s6_131;
		s7Out = s7_132;
		s8Out = s4;
		s9Out = s9_134;
		s10Out = s10_126;
		s11Out = s11_109;
		mstatusOut = mstatus_110;
		return ra_108;
	}
	else
	{
		net_buf_simple_push_u8(s4_36 & 63, a4_27);
		ptr32 a0_207;
		Eq_2 a4_209;
		ptr32 a5_210;
		Eq_2 s0_211;
		Eq_2 s1_212;
		Eq_2 s2_213;
		ptr32 a1_215;
		ptr32 a3_216;
		ptr32 mstatus_219;
		ptr32 s10_221;
		struct Eq_2096 * s11_222;
		Eq_2 s3_223;
		ptr32 s4_224;
		ptr32 s5_225;
		ptr32 s6_226;
		ptr32 s7_227;
		ptr32 s8_228;
		ptr32 s9_229;
		Eq_2 ra_220 = proxy_send(ra_30, s1, s3_35, s4_36 & 63, dwArg48, s11_33, mstatus, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg3C, dwArg48, dwArg58, s1, dwArg70, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_211, out s1_212, out a0_207, out a1_215, out a3_216, out a4_209, out a5_210, out s2_213, out s3_223, out s4_224, out s5_225, out s6_226, out s7_227, out s8_228, out s9_229, out s10_221, out s11_222, out mstatus_219);
		s0Out = s0_211;
		s1Out = s1_212;
		a0Out = a0_207;
		a1Out = a1_215;
		a3Out = a3_216;
		a4Out = a4_209;
		a5Out = a5_210;
		s2Out = s2_213;
		s3Out = s3_223;
		s4Out = s4_224;
		s5Out = s5_225;
		s6Out = s6_226;
		s7Out = s7_227;
		s8Out = s8_228;
		s9Out = s9_229;
		s10Out = s10_221;
		s11Out = s11_222;
		mstatusOut = mstatus_219;
		return ra_220;
	}
}

// 23044E68: Register Eq_2 beacon_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out (ptr32 Eq_234159) s0Out, Register out (ptr32 Eq_234160) s1Out, Register out Eq_234161 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      proxy_send_beacons
//      bt_mesh_proxy_beacon_send
Eq_2 beacon_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, struct Eq_234159 & s0Out, struct Eq_234160 & s1Out, union Eq_234161 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	net_buf_simple_reserve((word32 *) 0x01, fp + -40);
	Eq_2 a3_29;
	Eq_2 s1_35;
	Eq_2 s2_36;
	Eq_234161 a0_50;
	ptr32 a1_51;
	ptr32 a3_53;
	ptr32 a4_54;
	ptr32 a5_55;
	ptr32 mstatus_58;
	struct Eq_234159 * s0_60;
	struct Eq_234160 * s1_61;
	ptr32 s10_62;
	ptr32 s11_63;
	ptr32 s2_64;
	ptr32 s3_65;
	ptr32 s5_67;
	ptr32 s6_68;
	ptr32 s7_69;
	ptr32 s9_71;
	word32 a4_131;
	word32 s4_132;
	word32 s8_133;
	Eq_2 ra_59 = proxy_segment_and_send(ra, s1_35, bt_mesh_beacon_create(a1, fp + -52, fp + -40, out s1_35, out a3_29, out a4_131, out s2_36), fp + -52, a3_29, s2_36, mstatus, 0x00170000, dwLoc2C, dwLoc28, s0, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg08, dwArg10, dwArg18, dwArg30, dwArg38, dwArg3C, fp + -40, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out s0_60, out s1_61, out a0_50, out a1_51, out a3_53, out a4_54, out a5_55, out s2_64, out s3_65, out s4_132, out s5_67, out s6_68, out s7_69, out s8_133, out s9_71, out s10_62, out s11_63, out mstatus_58);
	s0Out = s0_60;
	s1Out = s1_61;
	a0Out = a0_50;
	a1Out = a1_51;
	a3Out = a3_53;
	a4Out = a4_54;
	a5Out = a5_55;
	s2Out = s2_64;
	s3Out = s3_65;
	s4Out = dwArgF4;
	s5Out = s5_67;
	s6Out = s6_68;
	s7Out = s7_69;
	s8Out = dwArgD4;
	s9Out = s9_71;
	s10Out = s10_62;
	s11Out = s11_63;
	mstatusOut = mstatus_58;
	return ra_59;
}

// 23044EA6: void proxy_send_beacons(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8)
void proxy_send_beacons(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8)
{
	Eq_2 s1_16 = a0;
	struct Eq_234274 * s0_17 = &g_t4200D6BC;
	if ((word32) g_w4200D8DC != 0x0FFFFFFF)
	{
		word32 a0_211;
		word32 a1_212;
		word32 a3_213;
		word32 a4_214;
		word32 a5_215;
		word32 s2_216;
		word32 s3_217;
		word32 s4_218;
		word32 s5_219;
		word32 s6_220;
		word32 s7_221;
		word32 s8_222;
		word32 s9_223;
		word32 s10_224;
		word32 s11_225;
		ra = beacon_send(ra, 0x4200D6BC, a0, 0x4200D8C0, mstatus, dwLoc08, dwArg00, dwArg08, dwArg20, dwArg28, dwArg2C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_17, out s1_16, out a0_211, out a1_212, out a3_213, out a4_214, out a5_215, out s2_216, out s3_217, out s4_218, out s5_219, out s6_220, out s7_221, out s8_222, out s9_223, out s10_224, out s11_225, out mstatus);
	}
	if ((word32) s0_17->w0304 == 0x0FFFFFFF)
		return;
	word32 s0_226;
	word32 s1_227;
	word32 a0_228;
	word32 a1_229;
	word32 a3_230;
	word32 a4_231;
	word32 a5_232;
	word32 s2_233;
	word32 s3_234;
	word32 s4_235;
	word32 s5_236;
	word32 s6_237;
	word32 s7_238;
	word32 s8_239;
	word32 s9_240;
	word32 s10_241;
	word32 s11_242;
	word32 mstatus_243;
	beacon_send(ra, s0, s1_16, 0x4200D9A4, mstatus, dwArg08, dwArg10, dwArg18, dwArg30, dwArg38, dwArg3C, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out s0_226, out s1_227, out a0_228, out a1_229, out a3_230, out a4_231, out a5_232, out s2_233, out s3_234, out s4_235, out s5_236, out s6_237, out s7_238, out s8_239, out s9_240, out s10_241, out s11_242, out mstatus_243);
}

