pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23044F06: Register (ptr32 Eq_193726) send_filter_status(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register (ptr32 Eq_193726) a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
// Called from:
//      proxy_complete_pdu
struct Eq_193726 * send_filter_status(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, struct Eq_193726 * a5, Eq_2 s2, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 a1_11 = a5->t0000;
	Eq_2 a5_21;
	word16 wLoc14_178 = (word16) bt_mesh_primary_addr(out a5_21);
	*((word32) a5_21 + 4) = 0x00;
	Eq_2 s0_26 = *((word32) a5_21 + 8);
	*((word32) s0_26 + 4) = 0x00;
	*a5_21 = s0_26;
	net_buf_simple_reserve((word32 *) 0x0A, a5_21);
	word32 a5_293;
	net_buf_simple_add_u8(s0_26, 0x03, a5_21, out a5_293);
	Eq_2 a1_39 = 0x00;
	Eq_2 dwLoc14_219 = SEQ(SLICE(s0, word16, 16), wLoc14_178);
	if ((word32) *((word32) a0 + 6) != 0x01)
		a1_39.u0 = 0x01;
	struct Eq_193726 * a5_109;
	struct Eq_274 * a0_135;
	struct Eq_194075 * a5_47;
	net_buf_simple_add_u8(s0_26, a1_39, 0x01, out a5_47);
	struct Eq_223034 * a5_55;
	word32 a4_294;
	net_buf_simple_add_be16(s0_26, (word32) ((word32) *((word32) a0 + 4) != 0x00), a5_47, out a4_294, out a5_55);
	word32 s7_302;
	word32 s9_303;
	word32 s10_304;
	word32 s11_305;
	Eq_2 a0_71;
	ptr32 mstatus_79;
	Eq_2 s0_81;
	Eq_2 s2_85;
	word32 s6_301;
	word32 s5_300;
	word32 s3_299;
	word32 a5_298;
	word32 a4_297;
	word32 a1_296;
	word32 s1_295;
	Eq_2 a3_107;
	Eq_2 ra_113 = bt_mesh_net_encode(ra, s0_26, a0, s0_26, a3, a5_55, s2, s4, s6, mstatus, dwLoc20, (word32) a1_11 + 4, dwLoc18, dwLoc14_219, dwLoc08, dwArg08, dwArg10, dwArg14, dwArg18, dwArg28, dwArg30, dwArg34, dwArg38, dwArg58, dwArg5C, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, out s0_81, out s1_295, out a0_71, out a1_296, out a3_107, out a4_297, out a5_298, out s2_85, out s3_299, out s5_300, out s6_301, out s7_302, out s9_303, out s10_304, out s11_305, out mstatus_79);
	if (a0_71 != 0x00)
		a0_135 = (struct Eq_274 *) &g_t230B9DE8;
	else
	{
		word32 s0_306;
		word32 a0_104;
		word32 s1_307;
		word32 a1_308;
		word32 a4_309;
		word32 s2_310;
		word32 s3_311;
		word32 s4_312;
		word32 s5_313;
		word32 s6_314;
		word32 s7_315;
		word32 s8_316;
		word32 s9_317;
		word32 s10_318;
		word32 s11_319;
		word32 mstatus_320;
		ra_113 = proxy_segment_and_send(ra_113, *a0_71, a0_71, s0_81, a3_107, s2_85, mstatus_79, dwLoc18, dwLoc0C, dwLoc08, dwLoc04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg30, dwArg38, dwArg50, dwArg58, dwArg5C, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s0_306, out s1_307, out a0_104, out a1_308, out a3_107, out a4_309, out a5_109, out s2_310, out s3_311, out s4_312, out s5_313, out s6_314, out s7_315, out s8_316, out s9_317, out s10_318, out s11_319, out mstatus_320);
		if (a0_104 == 0x00)
			return a5_109;
		a0_135 = (struct Eq_274 *) &g_t230B9E18;
	}
	word32 s1_321;
	word32 a0_322;
	word32 a1_323;
	word32 a2_324;
	word32 a3_325;
	word32 a4_326;
	word32 a7_327;
	word32 s2_328;
	word32 s3_329;
	word32 s4_330;
	word32 s5_331;
	word32 s6_332;
	word32 s7_333;
	word32 s8_334;
	word32 s9_335;
	word32 s10_336;
	word32 s11_337;
	word32 t4_338;
	printf(ra_113, a0_135, a3_107, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_321, out a0_322, out a1_323, out a2_324, out a3_325, out a4_326, out a5_109, out a7_327, out s2_328, out s3_329, out s4_330, out s5_331, out s6_332, out s7_333, out s8_334, out s9_335, out s10_336, out s11_337, out t4_338);
	return a5_109;
}

// 23044FA0: void proxy_complete_pdu(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s8, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138)
// Called from:
//      proxy_recv
void proxy_complete_pdu(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 s8, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0138)
{
	struct Eq_234624 * a5_24;
	Eq_2 s1_13 = (word32) *((word32) a0 + 7);
	if (s1_13 == 0x01)
	{
		word32 mstatus_625;
		word32 s10_624;
		word32 s9_623;
		word32 s8_622;
		word32 a3_614;
		word32 a4_615;
		word32 a0_613;
		word32 s2_616;
		word32 s3_617;
		word32 s5_619;
		word32 s6_620;
		word32 s4_618;
		word32 s7_621;
		bt_mesh_beacon_recv(ra, a0, (word32) a0 + 56, a3, 0x01, s4, s5, mstatus, dwLoc60, dwLoc5C, dwLoc58, dwLoc54, dwLoc48, s2, s0, dwLoc30, dwLoc2C, dwLoc28, dwLoc20, dwLoc1C, dwLoc18, dwLoc0C, dwArg08, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg38, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgE8, out a0_613, out a3_614, out a4_615, out a5_24, out s2_616, out s3_617, out s4_618, out s5_619, out s6_620, out s7_621, out s8_622, out s9_623, out s10_624, out mstatus_625);
		goto l23044FDC;
	}
	if (s1_13 == 0x00)
	{
		word32 s1_627;
		word32 s0_626;
		word32 s10_640;
		word32 mstatus_641;
		word32 s9_639;
		word32 s8_638;
		word32 s3_633;
		word32 s7_637;
		word32 s4_634;
		word32 s6_636;
		word32 s5_635;
		word32 a0_628;
		word32 s2_632;
		word32 a1_629;
		word32 a4_631;
		word32 a3_630;
		bt_mesh_net_recv(ra, a0, s1_13, (word32) a0 + 56, 0x00, 0x02, 0x01, s4, s8, s10, mstatus, dwLoc60, dwLoc5C, dwLoc58, dwLoc54, dwLoc4C, dwLoc48, dwLoc44, s2, dwLoc2C, dwLoc28, dwLoc18, dwLoc14, dwLoc0C, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, out s0_626, out s1_627, out a0_628, out a1_629, out a3_630, out a4_631, out a5_24, out s2_632, out s3_633, out s4_634, out s5_635, out s6_636, out s7_637, out s8_638, out s9_639, out s10_640, out mstatus_641);
		goto l23044FDC;
	}
	struct Eq_274 * a0_222;
	if (s1_13 == 0x02)
	{
		uint16 wLoc5C_446 = (uint16) (fp + -84);
		word32 a0_97;
		Eq_2 s0_103;
		word32 s11_650;
		word32 s10_649;
		word32 s9_648;
		word32 s7_647;
		word32 s5_646;
		word32 s3_645;
		word32 a5_644;
		word32 a4_643;
		word32 a1_642;
		Eq_2 s1_104;
		Eq_2 s2_107;
		Eq_2 s4_109;
		Eq_2 s6_118;
		ra = bt_mesh_net_decode(ra, s1_13, (word32) a0 + 56, 0x03, fp + -52, fp + -96, s10, dwLoc58, dwLoc30, dwLoc2C, dwLoc24, dwArg1C, s1, dwArgF8, dwArg0138, out s0_103, out s1_104, out a0_97, out a1_642, out a3, out a4_643, out a5_644, out s2_107, out s3_645, out s4_109, out s5_646, out s6_118, out s7_647, out s9_648, out s10_649, out s11_650);
		if (a0_97 != 0x00)
		{
			a0_222 = (struct Eq_274 *) &g_t230B9B84;
			goto l23045022;
		}
		word32 a5_670;
		word32 a1_669;
		net_buf_simple_pull(fp + -96, 0x09, out a1_669, out a5_670);
		Eq_2 a5_130 = (word32) wLoc5C_446;
		if (a5_130 == 0x00)
		{
			word32 a0_675;
			word32 s1_674;
			word32 a1_676;
			word32 a2_677;
			word32 a3_678;
			word32 a4_679;
			word32 a7_680;
			word32 s2_681;
			word32 s3_682;
			word32 s4_683;
			word32 s5_684;
			word32 s6_685;
			word32 s7_686;
			word32 s8_687;
			word32 s9_688;
			word32 s10_689;
			word32 s11_690;
			word32 t4_691;
			printf(ra, &g_t230B9BB4, a3, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_674, out a0_675, out a1_676, out a2_677, out a3_678, out a4_679, out a5_24, out a7_680, out s2_681, out s3_682, out s4_683, out s5_684, out s6_685, out s7_686, out s8_687, out s9_688, out s10_689, out s11_690, out t4_691);
		}
		else
		{
			struct Eq_193726 * a5_154;
			word32 a5_673;
			word32 a2_672;
			word32 a1_671;
			Eq_2 a0_132 = net_buf_simple_pull_u8(a5_130, out a1_671, out a2_672, out a5_673);
			if (a0_132 == s2_107)
			{
				s1_104.u0 = 0x01;
				s2_107 = (word32) s0_103 + 4;
				while (true)
				{
					a5_154 = (word32) wLoc5C_446;
					if (a5_154 <= (struct Eq_193726 *) 0x01)
						break;
					word32 a1_692;
					word32 a4_693;
					word32 a5_694;
					filter_add.isra.1((word32) s0_103 + 4, net_buf_simple_pull_be16(a5_154, out a1_692, out a4_693, out a5_694));
				}
			}
			else
			{
				uint16 wLoc5C_566 = (uint16) (fp + -84);
				if ((int32) (byte) a0_132 != 0x00)
				{
					if (a0_132 != s1_104)
					{
						a0_222 = (struct Eq_274 *) &g_t230B9C18;
						goto l23045022;
					}
					s1_104.u0 = 0x01;
					while (true)
					{
						a5_154 = (word32) wLoc5C_566;
						if (a5_154 <= (struct Eq_193726 *) 0x01)
							break;
						word32 a1_695;
						word32 a4_696;
						word32 a5_697;
						Eq_2 a0_229 = net_buf_simple_pull_be16(a5_154, out a1_695, out a4_696, out a5_697);
						if (a0_229 != 0x00 && (word32) (*((word32) s0_103 + 4)) == a0_229)
							((word32) s0_103 + 4)->u2 = 0x00;
					}
				}
				else
				{
					Eq_2 a5_139 = (word32) wLoc5C_446;
					if (a5_139 == 0x00)
					{
						word32 a0_701;
						word32 a1_702;
						word32 a2_703;
						word32 a4_704;
						word32 a7_705;
						word32 s3_706;
						word32 s5_707;
						word32 s7_708;
						word32 s8_709;
						word32 s9_710;
						word32 s10_711;
						word32 s11_712;
						word32 t4_713;
						ra = printf(ra, &g_t230B9BD8, a3, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_104, out a0_701, out a1_702, out a2_703, out a3, out a4_704, out a5_154, out a7_705, out s2_107, out s3_706, out s4_109, out s5_707, out s6_118, out s7_708, out s8_709, out s9_710, out s10_711, out s11_712, out t4_713);
					}
					else
					{
						word32 a1_698;
						word32 a2_699;
						word32 a5_700;
						Eq_2 a0_141 = net_buf_simple_pull_u8(a5_139, out a1_698, out a2_699, out a5_700);
						if (a0_141 != 0x00)
						{
							if (a0_141 != s2_107)
							{
								word32 a0_725;
								word32 a1_726;
								word32 a2_727;
								word32 a4_728;
								word32 a7_729;
								word32 s3_730;
								word32 s5_731;
								word32 s7_732;
								word32 s8_733;
								word32 s9_734;
								word32 s10_735;
								word32 s11_736;
								word32 t4_737;
								ra = printf(ra, &g_t230B9BF8, a3, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_104, out a0_725, out a1_726, out a2_727, out a3, out a4_728, out a5_154, out a7_729, out s2_107, out s3_730, out s4_109, out s5_731, out s6_118, out s7_732, out s8_733, out s9_734, out s10_735, out s11_736, out t4_737);
							}
							else
							{
								word32 t1_719;
								word32 a0_720;
								word32 a1_721;
								word32 a2_722;
								word32 a4_723;
								word32 a5_724;
								ra = memset(ra, (word32) s0_103 + 4, 0x00, 0x02, out t1_719, out a0_720, out a1_721, out a2_722, out a3, out a4_723, out a5_724);
								*((word32) s0_103 + 6) = 0x02;
								a5_154 = (struct Eq_193726 *) 0x02;
							}
						}
						else
						{
							word32 t1_714;
							word32 a0_715;
							word32 a1_716;
							word32 a2_717;
							word32 a4_718;
							ra = memset(ra, (word32) s0_103 + 4, 0x00, 0x02, out t1_714, out a0_715, out a1_716, out a2_717, out a3, out a4_718, out a5_154);
							*((word32) s0_103 + 6) = (byte) s2_107;
						}
					}
				}
			}
			a5_24 = send_filter_status(ra, s0_103, s1_104, s0_103, a3, a5_154, s2_107, s4_109, s6_118, mstatus, dwLoc58, dwLoc50, dwLoc4C, dwLoc48, dwLoc44, s2, dwLoc30, dwLoc2C, dwLoc28, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg3C, s1, dwArg58, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgC8);
		}
l23044FDC:
		struct Eq_234826 * s0_397 = a5_24->ptr0040;
		s0_397->w003C = 0x00;
		a5_24->ptr0038 = s0_397;
	}
	else
	{
		if (s1_13 == 0x03)
		{
			a5_24 = bt_mesh_pb_gatt_recv(ra, a0, *a0, (word32) a0 + 56, a3, (struct Eq_227468 *) 0x03, mstatus, dwLoc60, dwLoc5C, dwLoc58, dwLoc54, dwLoc50, dwLoc48, s2, dwLoc30, dwLoc2C, dwLoc28, dwLoc24, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg18, dwArg1C, dwArg28, dwArg38, s1, ra, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98);
			goto l23044FDC;
		}
		a0_222 = (struct Eq_274 *) &g_t230B9C40;
l23045022:
		word32 t4_668;
		word32 s11_667;
		word32 s10_666;
		word32 s9_665;
		word32 s8_664;
		word32 s7_663;
		word32 s6_662;
		word32 s5_661;
		word32 s4_660;
		word32 s3_659;
		word32 s2_658;
		word32 a7_657;
		word32 a4_656;
		word32 a3_655;
		word32 a2_654;
		word32 a1_653;
		word32 a0_652;
		word32 s1_651;
		printf(ra, a0_222, a3, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_651, out a0_652, out a1_653, out a2_654, out a3_655, out a4_656, out a5_24, out a7_657, out s2_658, out s3_659, out s4_660, out s5_661, out s6_662, out s7_663, out s8_664, out s9_665, out s10_666, out s11_667, out t4_668);
		goto l23044FDC;
	}
}

// 23045110: void proxy_recv(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s8, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0128)
void proxy_recv(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 s8, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0128)
{
	Eq_2 s2_167 = a2;
	word32 a4_22;
	Eq_2 a0_21 = find_client.part.0(a0, a3, out a4_22);
	if (a0_21 == 0x00)
	{
l230451F6:
		0x00 = dwArg0128;
		return;
	}
	struct Eq_274 * a0_108;
	if (a3 == 0x00)
	{
		a0_108 = (struct Eq_274 *) &g_t230B9C80;
		goto l23045136;
	}
	if ((word32) (a4_22 != 0x00) != (word32) (((word32) (*a2) & 63) < ~0x03))
	{
		a0_108 = (struct Eq_274 *) &g_t230B9C98;
		goto l23045136;
	}
	Eq_2 s3_169 = (word32) a0_21 + 56;
	Eq_2 s1_187 = a0_21;
	word32 a4_432;
	if (net_buf_simple_tailroom((word32) a0_21 + 56, out a4_432) < (word32) a3 - 1)
	{
		a0_108 = (struct Eq_274 *) &g_t230B9CC4;
		goto l23045136;
	}
	Eq_2 a4_119;
	Eq_2 s3_124;
	byte * s2_123;
	uint32 a5_41 = (word32) *a2;
	Eq_2 a4_171 = (word32) *((word32) a0_21 + 60);
	a3 = a5_41 >> 0x06;
	if (a5_41 >> 0x06 != 0x02)
	{
		if (a5_41 >> 0x06 == 0x03)
		{
			if (a4_171 == 0x00)
				a0_108 = (struct Eq_274 *) &g_t230B9D84;
			else
			{
				Eq_2 a4_80 = (word32) *((word32) a0_21 + 7);
				if (a4_80 == (a5_41 & 63))
				{
					word32 a0_476;
					word32 a1_477;
					word32 a2_478;
					word32 a3_479;
					word32 a5_480;
					word32 s6_481;
					s1_187 = k_delayed_work_cancel((word32) a0_21 + 20, a5_41 >> 0x06, a4_80, mstatus, dwArg04, dwArg08, dwArg78, dwArg88, dwArgB8, dwArgF8, out a0_476, out a1_477, out a2_478, out a3_479, out a4_171, out a5_480, out s2_167, out s3_169, out s4, out s5, out s6_481, out s8);
					goto l230451B0;
				}
				a0_108 = (struct Eq_274 *) &g_t230B9DA8;
			}
l23045136:
			word32 a2_436;
			word32 a3_437;
			word32 a4_438;
			word32 a5_439;
			word32 a7_440;
			word32 s3_442;
			word32 s2_441;
			word32 s6_445;
			word32 s4_443;
			word32 s5_444;
			word32 s7_446;
			word32 a1_435;
			word32 a0_434;
			word32 s1_433;
			word32 s8_447;
			word32 s9_448;
			word32 s10_449;
			word32 s11_450;
			word32 t4_451;
			printf(ra, a0_108, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_433, out a0_434, out a1_435, out a2_436, out a3_437, out a4_438, out a5_439, out a7_440, out s2_441, out s3_442, out s4_443, out s5_444, out s6_445, out s7_446, out s8_447, out s9_448, out s10_449, out s11_450, out t4_451);
			goto l230451F6;
		}
		if (a5_41 >> 0x06 != 0x01)
		{
			if (a4_171 != 0x00)
			{
				a0_108 = (struct Eq_274 *) &g_t230B9CD8;
				goto l23045136;
			}
			*((word32) a0_21 + 7) = (byte) a5_41;
l230451B0:
			Eq_2 a3_176;
			word32 a1_482;
			word32 a2_483;
			word32 a4_484;
			word32 a5_485;
			net_buf_simple_add_mem(s3_169, (word32) s2_167 + 1, (word32) a3 - 1, a4_171, out a1_482, out a2_483, out a3_176, out a4_484, out a5_485);
			proxy_complete_pdu(ra, a3, s1_187, s1_187, a3_176, s2_167, s4, s5, s8, s10, mstatus, dwLoc30, dwLoc2C, dwLoc28, s2, s0, dwLoc18, dwLoc14, dwLoc08, dwLoc04, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg98, dwArgB8, dwArgC8, dwArg0108);
			goto l230451F6;
		}
		if (a4_171 != 0x00)
		{
			a0_108 = (struct Eq_274 *) &g_t230B9D08;
			goto l23045136;
		}
		struct Eq_235296 * s1_122;
		word32 a0_467;
		word32 a1_468;
		word32 a2_469;
		word32 a3_470;
		word32 a5_471;
		word32 s4_472;
		word32 s5_473;
		word32 s6_474;
		word32 s8_475;
		k_delayed_work_submit(0x04FFFE20, a5_41 >> 0x06, a4_171, mstatus, dwLoc2C, dwLoc28, dwLoc0C, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out s1_122, out a0_467, out a1_468, out a2_469, out a3_470, out a4_119, out a5_471, out s2_123, out s3_124, out s4_472, out s5_473, out s6_474, out s8_475);
		s1_122->b0007 = (byte) ((word32) *s2_123 & 63);
	}
	else
	{
		if (a4_171 == 0x00)
		{
			a0_108 = (struct Eq_274 *) &g_t230B9D34;
			goto l23045136;
		}
		Eq_2 a4_45 = (word32) *((word32) a0_21 + 7);
		if (a4_45 != (a5_41 & 63))
		{
			a0_108 = (struct Eq_274 *) &g_t230B9D58;
			goto l23045136;
		}
		word32 s1_452;
		word32 a0_453;
		word32 a1_454;
		word32 a2_455;
		word32 a3_456;
		word32 a5_457;
		word32 s4_458;
		word32 s5_459;
		word32 s6_460;
		word32 s8_461;
		k_delayed_work_submit(0x04FFFE20, a5_41 >> 0x06, a4_45, mstatus, dwLoc2C, dwLoc28, dwLoc0C, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out s1_452, out a0_453, out a1_454, out a2_455, out a3_456, out a4_119, out a5_457, out s2_123, out s3_124, out s4_458, out s5_459, out s6_460, out s8_461);
	}
	word32 a1_462;
	word32 a2_463;
	word32 a3_464;
	word32 a4_465;
	word32 a5_466;
	net_buf_simple_add_mem(s3_124, s2_123 + 1, (word32) a3 - 1, a4_119, out a1_462, out a2_463, out a3_464, out a4_465, out a5_466);
	goto l230451F6;
}

