pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23045270: Register Eq_2 bt_mesh_proxy_beacon_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      net_key_add
//      bt_mesh_net_sec_update
//      bt_mesh_proxy_beacon_send
Eq_2 bt_mesh_proxy_beacon_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg30, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s2_110 = a0;
	Eq_2 s1_114 = 0x4200D6BC;
	ptr32 s0_22 = 0x0FFFFFFF;
	word32 s4_146 = 0x4200E000;
	Eq_2 s3_225 = 0x4200D9A4;
	do
	{
		ptr32 a5_194;
		if (s2_110 != 0x00)
		{
			a5_194 = 0x4200E000;
			a0 = g_t4200DAB0;
			if (a0 != 0x00)
			{
				word32 s0_404;
				word32 s4_405;
				word32 s8_406;
				ra = beacon_send(ra, 0x4200DAB0, s1_114, s2_110, mstatus, s2, dwLoc10, dwLoc08, dwArg10, dwArg18, dwArg1C, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, out s0_404, out s1_114, out a0, out a1, out a3, out a4, out a5_194, out s2_110, out s3_225, out s4_405, out s5, out s6, out s7, out s8_406, out s9, out s10, out s11, out mstatus);
			}
			if (a0 == 0x00)
				break;
			Eq_2 a0_117;
			ptr32 a1_118;
			ptr32 a3_120;
			ptr32 a4_121;
			ptr32 a5_122;
			ptr32 mstatus_125;
			Eq_2 s0_127;
			Eq_2 s1_128;
			ptr32 s10_129;
			ptr32 s11_130;
			Eq_2 s2_131;
			Eq_2 s3_132;
			ptr32 s4_133;
			ptr32 s5_134;
			ptr32 s6_135;
			ptr32 s7_136;
			ptr32 s8_137;
			ptr32 s9_138;
			Eq_2 ra_126 = beacon_send(ra, s1, s1_114, s2_110, mstatus, dwArg08, dwArg10, dwArg18, dwArg30, dwArg38, dwArg3C, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out s0_127, out s1_128, out a0_117, out a1_118, out a3_120, out a4_121, out a5_122, out s2_131, out s3_132, out s4_133, out s5_134, out s6_135, out s7_136, out s8_137, out s9_138, out s10_129, out s11_130, out mstatus_125);
			s0Out = s0_127;
			s1Out = s1_128;
			a0Out = a0_117;
			a1Out = a1_118;
			a3Out = a3_120;
			a4Out = a4_121;
			a5Out = a5_122;
			s2Out = s2_131;
			s3Out = s3_132;
			s4Out = s4_133;
			s5Out = s5_134;
			s6Out = s6_135;
			s7Out = s7_136;
			s8Out = s8_137;
			s9Out = s9_138;
			s10Out = s10_129;
			s11Out = s11_130;
			mstatusOut = mstatus_125;
			return ra_126;
		}
		if ((word32) *((word32) s1_114 + 544) != s0_22)
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg8 = <invalid>;
			Eq_2 stackArg16 = <invalid>;
			Eq_2 stackArg24 = <invalid>;
			Eq_2 stackArg28 = <invalid>;
			Eq_2 stackArg48 = <invalid>;
			Eq_2 stackArg56 = <invalid>;
			Eq_2 stackArg60 = <invalid>;
			Eq_2 stackArg72 = <invalid>;
			Eq_2 stackArg88 = <invalid>;
			Eq_2 stackArg120 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg152 = <invalid>;
			Eq_2 stackArg168 = <invalid>;
			Eq_2 stackArg184 = <invalid>;
			Eq_2 stackArg200 = <invalid>;
			Eq_2 stackArg232 = <invalid>;
			word32 a5_423;
			word32 s8_425;
			word32 mstatus_426;
			word32 s2_424;
			ra = bt_mesh_proxy_beacon_send(ra, s1_114, s4_146 + -0x0740, s2_110, mstatus, stackArg8, stackArg16, stackArg24, stackArg28, stackArg48, stackArg56, stackArg60, stackArg72, stackArg88, stackArg120, stackArg136, stackArg152, stackArg168, stackArg184, stackArg200, stackArg232, out s0_22, out s1_114, out a0, out a1, out a3, out a4, out a5_423, out s2_424, out s3_225, out s4_146, out s5, out s6, out s7, out s8_425, out s9, out s10, out s11, out mstatus_426);
		}
		a5_194 = (word32) *((word32) s1_114 + 772);
		s2_110 = s3_225;
	} while (a5_194 != s0_22);
	s0Out = s1;
	s1Out = s1_114;
	a0Out = a0;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_194;
	s2Out = s2_110;
	s3Out = s3_225;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s4;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

// 230452F0: Register word32 bt_mesh_proxy_identity_start(Register Eq_2 a0)
// Called from:
//      node_identity_set
//      bt_mesh_proxy_identity_enable
word32 bt_mesh_proxy_identity_start(Eq_2 a0)
{
	((word32) a0 + 32)->u0 = 0x01;
	word32 a1_32;
	word32 a2_33;
	word32 a5_34;
	k_uptime_get_32(out a1_32, out a2_33, out a5_34)->t0024 = a0;
	g_dw4200F444 = (a0 - &g_t4200D8C0 >> 2) + 0xB823EE09;
	return 0x4200F000;
}

// 2304532C: void bt_mesh_proxy_identity_stop(Register Eq_2 a0)
// Called from:
//      node_identity_set
//      gatt_proxy_set
void bt_mesh_proxy_identity_stop(Eq_2 a0)
{
	((word32) a0 + 32)->u0 = 0x00;
	((word32) a0 + 36)->u0 = 0x00;
}

// 23045336: void bt_mesh_proxy_identity_enable(Register Eq_2 ra, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
// Called from:
//      prov_data
void bt_mesh_proxy_identity_enable(Eq_2 ra, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	if (bt_mesh_is_provisioned() == 0x00)
		return;
	Eq_2 a5_17 = 0x00;
	if ((word32) g_w4200D8DC != 0x0FFFFFFF && (word32) g_b4200D8E0 != 0x02)
	{
		bt_mesh_proxy_identity_start(0x4200D8C0);
		a5_17.u0 = 0x01;
	}
	if ((word32) g_w4200D9C0 != 0x0FFFFFFF && (word32) g_b4200D9C4 != 0x02)
		a5_17 = bt_mesh_proxy_identity_start(0x4200D9A4);
	else if (a5_17 == 0x00)
		return;
	word32 s11_250;
	word32 mstatus_251;
	word32 s8_248;
	word32 s9_249;
	word32 s6_246;
	word32 s7_247;
	word32 s4_244;
	word32 s5_245;
	word32 s2_242;
	word32 s3_243;
	word32 a4_240;
	word32 a5_241;
	word32 a0_238;
	word32 a3_239;
	word32 s0_236;
	word32 s1_237;
	bt_mesh_adv_update(ra, a5_17, s5, mstatus, dwArg20, dwArg24, dwArg48, dwArg6C, dwArg78, dwArgB8, dwArgD8, dwArg0108, dwArg0118, dwArg0158, out s0_236, out s1_237, out a0_238, out a3_239, out a4_240, out a5_241, out s2_242, out s3_243, out s4_244, out s5_245, out s6_246, out s7_247, out s8_248, out s9_249, out s11_250, out mstatus_251);
}

// 230453AC: Register ptr32 bt_mesh_proxy_get_buf(Register (ptr32 Eq_227123) a5)
// Called from:
//      bt_mesh_pb_gatt_close
ptr32 bt_mesh_proxy_get_buf(struct Eq_227123 * a5)
{
	struct Eq_235639 * a0_6 = a5->ptr0040;
	a0_6->w003C = 0x00;
	a5->ptr0000 = (char *) a0_6 + 56;
	return (char *) a0_6 + 56;
}

// 230453C2: Register Eq_2 bt_mesh_proxy_prov_enable(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register word32 s6, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out Eq_2 a3Out, Register out Eq_2 a5Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_provision
//      bt_mesh_prov_enable
Eq_2 bt_mesh_proxy_prov_enable(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s5, word32 s6, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, ptr32 & s1Out, union Eq_2 & a3Out, union Eq_2 & a5Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 a5_108 = (word32) g_b4200F440;
	ptr32 s1_119 = 0x01;
	if (a5_108 != 0x01 && a5_108 == 0x00)
	{
		byte * s0_35;
		ra = bt_gatt_service_register(ra, 0x4200F440, a3, a4, s4, s5, s6, s11, mstatus, s0, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg58, dwArg60, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0118, out s0_35, out s1_119, out a3, out s5, out mstatus);
		g_b4200F44A = (byte) s1_119;
		Eq_2 a4_58 = g_t4200DAB0;
		*s0_35 = (byte) s1_119;
		if (a4_58 != 0x00)
		{
			g_b4200DAB6 = 0x03;
			a4_58.u0 = 0x03;
		}
		a5_108 = *((word32) a4_58 + 0x0044);
		if (a4_58 != 0x00)
			*((word32) a5_108 + 74) = 0x03;
	}
	s1Out = s1_119;
	a3Out = a3;
	a5Out = a5_108;
	s5Out = s5;
	mstatusOut = mstatus;
	return ra;
}

// 23045426: Register Eq_2 bt_mesh_proxy_prov_disable(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out Eq_2 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_provision
//      bt_mesh_prov_disable
Eq_2 bt_mesh_proxy_prov_disable(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, union Eq_2 & s1Out, ptr32 & a3Out, union Eq_2 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	word32 a5_12 = (word32) g_b4200F440;
	if (a5_12 != 0x00)
	{
		s1 = a0;
		if (a5_12 == 0x01)
		{
			Eq_2 ra_115;
			word32 a2_395;
			Eq_2 a3_116;
			Eq_2 s2_149;
			Eq_2 s3_150;
			Eq_2 a5_113;
			Eq_2 s5_133;
			Eq_2 s1_114 = bt_gatt_service_unregister(0x4200F440, a0, 0x4200DBCC, s2, mstatus, dwArg38, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out a2_395, out a3_116, out a5_113, out s2_149, out s3_150, out s5_133);
			g_b4200F440 = 0x00;
			Eq_2 a0_109 = g_t4200DAB0;
			ra_115 = ra;
			if (a0_109 != 0x00)
			{
				Eq_2 a4_48 = (word32) g_b4200DAB6;
				a5_113.u0 = 0x03;
				ra_115 = ra;
				if (a4_48 == 0x03)
				{
					if (s1_114 == 0x00)
					{
						word32 a4_399;
						ra_115 = bt_mesh_pb_gatt_close(ra, 0x4200DAB0, a0_109, a3_116, a4_48, mstatus, s0, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s1_114, out a0_109, out a3_116, out a4_399, out a5_113, out s2_149, out s3_150, out s5_133, out mstatus);
						g_b4200DAB6 = 0x00;
					}
					else
					{
						word32 s4_398;
						word32 a4_397;
						word32 s0_396;
						ra_115 = bt_conn_disconnect(ra, 0x4200DAB0, s1_114, a0_109, 0x13, a3_116, s2_149, s3_150, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg64, dwArg68, dwArg6C, ra, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, out s0_396, out s1_114, out a0_109, out a3_116, out a4_397, out a5_113, out s2_149, out s3_150, out s4_398, out s5_133, out mstatus);
					}
				}
			}
			Eq_2 s0_111 = *((word32) a0_109 + 0x0044);
			if (a0_109 != 0x00)
			{
				Eq_2 a4_112 = (word32) *((word32) s0_111 + 74);
				a5_113.u0 = 0x03;
				if (a4_112 == 0x03)
				{
					if (s1_114 != 0x00)
					{
						word32 s0_416;
						word32 s1_417;
						word32 a0_418;
						word32 a3_419;
						word32 a4_420;
						word32 s2_421;
						word32 s3_422;
						word32 s4_423;
						ra_115 = bt_conn_disconnect(ra_115, s0_111, s1_114, a0_109, 0x13, a3_116, s2_149, s3_150, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg64, dwArg68, dwArg6C, ra, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, out s0_416, out s1_417, out a0_418, out a3_419, out a4_420, out a5_113, out s2_421, out s3_422, out s4_423, out s5_133, out mstatus);
					}
					else
					{
						word32 s1_410;
						word32 a0_411;
						word32 a3_412;
						word32 a4_413;
						word32 s2_414;
						word32 s3_415;
						ra_115 = bt_mesh_pb_gatt_close(ra_115, s0_111, a0_109, a3_116, a4_112, mstatus, s0, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s1_410, out a0_411, out a3_412, out a4_413, out a5_113, out s2_414, out s3_415, out s5_133, out mstatus);
						*((word32) s0_111 + 74) = 0x00;
					}
				}
			}
			word32 s11_409;
			word32 s9_408;
			word32 s8_407;
			word32 s7_406;
			word32 s6_405;
			word32 s3_404;
			word32 a5_403;
			word32 a4_402;
			word32 a0_401;
			word32 s0_400;
			ra = bt_mesh_adv_update(ra_115, a5_113, s5_133, mstatus, dwArg20, dwArg24, dwArg48, dwArg6C, dwArg78, dwArgB8, dwArgD8, dwArg0108, dwArg0118, dwArg0158, out s0_400, out s1, out a0_401, out a3, out a4_402, out a5_403, out s2, out s3_404, out s4, out s5, out s6_405, out s7_406, out s8_407, out s9_408, out s11_409, out mstatus);
		}
	}
	s1Out = s1;
	a3Out = a3;
	s2Out = s2;
	s4Out = s4;
	s5Out = s5;
	mstatusOut = mstatus;
	return ra;
}

// 230454B6: Register Eq_2 bt_mesh_proxy_gatt_enable(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register word32 s6, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Register out Eq_2 a5Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_net_start
Eq_2 bt_mesh_proxy_gatt_enable(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s5, word32 s6, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, union Eq_2 & a5Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 a5_106 = (word32) g_b4200F440;
	if (a5_106 != 0x02 && a5_106 == 0x00)
	{
		byte * s0_35;
		word32 s1_36;
		word32 a3_174;
		ra = bt_gatt_service_register(ra, 0x4200F440, a3, a4, s4, s5, s6, s11, mstatus, s0, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg58, dwArg60, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0118, out s0_35, out s1_36, out a3_174, out s5, out mstatus);
		Eq_2 a4_56 = g_t4200DAB0;
		*s0_35 = (byte) s1_36;
		if (a4_56 != 0x00)
		{
			g_b4200DAB6 = 0x01;
			a4_56.u0 = 0x01;
		}
		a5_106 = *((word32) a4_56 + 0x0044);
		if (a4_56 != 0x00)
			*((word32) a5_106 + 74) = 0x01;
	}
	a5Out = a5_106;
	s5Out = s5;
	mstatusOut = mstatus;
	return ra;
}

