pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23045512: Register Eq_2 bt_mesh_proxy_gatt_disconnect(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_211879 a5Out, Register out Eq_2 s2Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      gatt_proxy_set
//      bt_mesh_proxy_gatt_disable
Eq_2 bt_mesh_proxy_gatt_disconnect(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_211879 & a5Out, union Eq_2 & s2Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 ra_37;
	Eq_2 a0_22 = g_t4200DAB0;
	ra_37 = ra;
	if (a0_22 != 0x00)
	{
		a5 = (word32) g_b4200DAB6 + ~0x00 & 0x00FF;
		ra_37 = ra;
		if (a5 <= 0x01)
		{
			g_b4200DAB6 = 0x00;
			word32 s4_315;
			word32 a4_314;
			word32 s0_313;
			ra_37 = bt_conn_disconnect(ra, 0x4200DAB0, s1, a0_22, 0x13, a3, s2, s3, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg64, dwArg68, dwArg6C, ra, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, out s0_313, out s1, out a0_22, out a3, out a4_314, out a5, out s2, out s3, out s4_315, out s5, out mstatus);
		}
	}
	Eq_2 s0_53 = *((word32) a0_22 + 0x0044);
	if (a0_22 != 0x00)
	{
		a5 = (word32) *((word32) s0_53 + 74) + ~0x00 & 0x00FF;
		if (a5 <= 0x01)
		{
			*((word32) s0_53 + 74) = 0x00;
			Eq_211879 a5_78;
			Eq_2 s1_80;
			Eq_2 s0_84;
			Eq_2 s2_85;
			ptr32 mstatus_89;
			ptr32 s5_92;
			word32 a4_318;
			word32 s3_319;
			word32 s4_320;
			word32 a3_317;
			word32 a0_316;
			Eq_2 ra_90 = bt_conn_disconnect(ra_37, s0, s1, a0_22, 0x13, a3, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg60, ra, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg8C, dwArg94, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, out s0_84, out s1_80, out a0_316, out a3_317, out a4_318, out a5_78, out s2_85, out s3_319, out s4_320, out s5_92, out mstatus_89);
			s0Out = s0_84;
			s1Out = s1_80;
			a5Out = a5_78;
			s2Out = s2_85;
			s5Out = s5_92;
			mstatusOut = mstatus_89;
			return ra_90;
		}
	}
	s0Out = s0;
	s1Out = s1;
	a5Out = a5;
	s2Out = s2;
	s5Out = s5;
	mstatusOut = mstatus;
	return ra_37;
}

// 2304556C: Register Eq_2 bt_mesh_proxy_gatt_disable(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_reset
Eq_2 bt_mesh_proxy_gatt_disable(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & mstatusOut)
{
	word32 a5_8 = (word32) g_b4200F440;
	if (a5_8 != 0x00 && a5_8 == 0x02)
	{
		Eq_2 s0_29;
		Eq_2 s1_30;
		Eq_2 s2_33;
		word32 a5_181;
		word32 s5_182;
		ra = bt_mesh_proxy_gatt_disconnect(ra, 0x4200F440, s1, a3, s2, s3, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg6C, ra, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, out s0_29, out s1_30, out a5_181, out s2_33, out s5_182, out mstatus);
		word32 a2_183;
		word32 a3_184;
		word32 a5_185;
		word32 s5_186;
		bt_gatt_service_unregister(s0_29, s1_30, 0x4200DC64, s2_33, mstatus, dwArg38, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out a2_183, out a3_184, out a5_185, out s2, out s3, out s5_186);
		*s0_29 = 0x00;
	}
	s2Out = s2;
	s3Out = s3;
	mstatusOut = mstatus;
	return ra;
}

// 230455AA: void bt_mesh_proxy_addr_add(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      bt_mesh_net_recv
void bt_mesh_proxy_addr_add(Eq_2 a0, Eq_2 a1)
{
	word32 a4_5 = (word32) *((word32) a0 - 50);
	if (a4_5 != 0x01)
	{
		if (a4_5 != 0x02)
			return;
		if (a1 == 0x00)
			return;
		if ((word32) *((word32) a0 - 52) != a1)
			return;
		*((word32) a0 + 4044) = 0x00;
	}
	else
		filter_add.isra.1((word32) a0 - 52, a1);
}

// 230455D6: Register Eq_2 bt_mesh_proxy_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_226188 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      prov_send
//      bt_mesh_proxy_relay
Eq_2 bt_mesh_proxy_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_226188 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 s9_107;
	ptr32 s7_105;
	ptr32 s6_104;
	ptr32 s5_103;
	ptr32 s4_102;
	ptr32 s3_101;
	ptr32 s2_100;
	ptr32 s11_180;
	ptr32 s10_178;
	ptr32 s1_176;
	Eq_2 ra_172;
	ptr32 a5_163;
	ptr32 a4_161;
	ptr32 a3_159;
	ptr32 a1_155;
	Eq_226188 a0_110;
	word32 a4_232;
	Eq_2 a0_15 = find_client.part.0(a0, a3, out a4_232);
	if (a0_15 == 0x00)
	{
		word32 a0_233;
		word32 a2_234;
		word32 a7_235;
		word32 s8_236;
		word32 t4_237;
		ra_172 = printf(ra, &g_t230B9AD0, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_176, out a0_233, out a1_155, out a2_234, out a3_159, out a4_161, out a5_163, out a7_235, out s2_100, out s3_101, out s4_102, out s5_103, out s6_104, out s7_105, out s8_236, out s9_107, out s10_178, out s11_180, out t4_237);
		a0_110.u0 = -57;
	}
	else
	{
		if ((word32) ((word32) *((word32) a0_15 + 6) < ~0x03) == (word32) (a1 < -4))
		{
			Eq_226188 a0_32;
			ptr32 a1_33;
			ptr32 a3_35;
			ptr32 a4_36;
			ptr32 a5_37;
			ptr32 mstatus_40;
			Eq_2 s0_42;
			ptr32 s1_43;
			ptr32 s10_44;
			ptr32 s11_45;
			ptr32 s2_46;
			ptr32 s3_47;
			ptr32 s4_48;
			ptr32 s5_49;
			ptr32 s6_50;
			ptr32 s7_51;
			ptr32 s8_52;
			ptr32 s9_53;
			Eq_2 ra_41 = proxy_segment_and_send(ra, s1, a1, dwArg44, a3, s2, mstatus, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg50, dwArg58, dwArg70, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s0_42, out s1_43, out a0_32, out a1_33, out a3_35, out a4_36, out a5_37, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_44, out s11_45, out mstatus_40);
			s0Out = s0_42;
			s1Out = s1_43;
			a0Out = a0_32;
			a1Out = a1_33;
			a3Out = a3_35;
			a4Out = a4_36;
			a5Out = a5_37;
			s2Out = s2_46;
			s3Out = s3_47;
			s4Out = s4_48;
			s5Out = s5_49;
			s6Out = s6_50;
			s7Out = s7_51;
			s8Out = s8_52;
			s9Out = s9_53;
			s10Out = s10_44;
			s11Out = s11_45;
			mstatusOut = mstatus_40;
			return ra_41;
		}
		word32 a0_238;
		word32 a2_239;
		word32 a7_240;
		word32 s8_241;
		word32 t4_242;
		ra_172 = printf(ra, &g_t230B9AE8, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_176, out a0_238, out a1_155, out a2_239, out a3_159, out a4_161, out a5_163, out a7_240, out s2_100, out s3_101, out s4_102, out s5_103, out s6_104, out s7_105, out s8_241, out s9_107, out s10_178, out s11_180, out t4_242);
		a0_110.u0 = ~0x15;
	}
	s0Out = a1;
	s1Out = s1_176;
	a0Out = a0_110;
	a1Out = a1_155;
	a3Out = a3_159;
	a4Out = a4_161;
	a5Out = a5_163;
	s2Out = s2_100;
	s3Out = s3_101;
	s4Out = s4_102;
	s5Out = s5_103;
	s6Out = s6_104;
	s7Out = s7_105;
	s8Out = a2;
	s9Out = s9_107;
	s10Out = s10_178;
	s11Out = s11_180;
	mstatusOut = mstatus;
	return ra_172;
}

// 23045636: Register Eq_2 bt_mesh_proxy_relay(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_net_resend
//      bt_mesh_net_recv
//      bt_mesh_ctl_send
Eq_2 bt_mesh_proxy_relay(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s1_129 = a0;
	Eq_2 s2_128 = a1;
	ptr32 s3_112 = 0x4200DB38;
	ptr32 a0_109 = 0x00;
	ptr32 s4_125 = 0x00200000;
	Eq_2 s5_126 = 0x01;
	Eq_2 s6_127 = 0x02;
	do
	{
		Eq_2 a5_289 = fp + -64;
		struct Eq_236267 * s0_110 = dwLoc40;
		if (fp != ~0x3F)
		{
			a5_289 = (word32) dwLoc40->b0006;
			if (a5_289 == s5_126)
			{
				a5_289 = (word32) dwLoc40->w0004;
				if (a5_289 != s2_128)
					goto l2304567E;
				goto l230456A6;
			}
			if (a5_289 == s6_127)
			{
				a5_289 = (word32) dwLoc40->w0004;
				if (a5_289 != s2_128)
				{
l230456A6:
					Eq_2 a1_49 = net_buf_simple_reserve((word32 *) 0x01, a5_289);
					Eq_2 a3_61;
					word32 a1_337;
					word32 s8_343;
					word32 a5_340;
					word32 a0_341;
					word32 a3_342;
					word32 a2_338;
					word32 a4_339;
					ra = bt_mesh_proxy_send(ra, *a1_49, net_buf_simple_add_mem(fp + -76, a1_49, (word32) *((word32) s1_129 + 4), a4, out a1_337, out a2_338, out a3_61, out a4_339, out a5_340), 0x00, a3_61, s2_128, mstatus, dwLoc48, dwLoc3C, s6, s4, dwLoc28, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg20, dwArg28, dwArg2C, dwArg38, s5, s3, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_110, out s1_129, out a0_341, out a1, out a3_342, out a4, out a5_289, out s2_128, out s3_112, out s4_125, out s5_126, out s6_127, out s7, out s8_343, out s9, out s10, out s11, out mstatus);
					a0_109 = 0x01;
				}
			}
		}
l2304567E:
		ptr32 s0_111 = &s0_110->b0006 + 62;
	} while (s0_111 != s3_112);
	s0Out = s0_111;
	s1Out = s4_125;
	a0Out = a0_109;
	a1Out = a1;
	a3Out = s2;
	a4Out = a4;
	a5Out = a5_289;
	s2Out = s2_128;
	s3Out = s3_112;
	s4Out = dwArg0168;
	s5Out = s5_126;
	s6Out = s6_127;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return dwLoc08;
}

