pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 230456C8: Register Eq_2 bt_mesh_proxy_adv_start(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack word32 dwArgCC, Stack ptr32 dwArg0124, Stack word32 dwArg0198, Register out ptr32 s0Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_195174 a4Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      adv_thread
Eq_2 bt_mesh_proxy_adv_start(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 s7, Eq_2 s8, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, word32 dwArgCC, ptr32 dwArg0124, word32 dwArg0198, ptr32 & s0Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_195174 & a4Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 s1_244;
	word16 wLoc34_983 = (word16) s8;
	if ((word32) g_b4200F440 == 0x00)
	{
l230456EA:
		s1_244.u0 = ~0x00;
		goto l230457DC;
	}
	if (bt_mesh_is_provisioned() != 0x00)
	{
l23045804:
		if (bt_mesh_is_provisioned() != 0x00)
		{
			Eq_2 s2_230 = s2_224 + -912;
			word32 s2_224;
			word32 s8_1218;
			Eq_2 s0_231 = next_sub.part.6(out a3, out s2_224, out s8_1218);
			struct Eq_236610 * s6_232 = &g_t4200F000;
			Eq_2 s7_233 = 0x0EFFFA5F;
			s5 = s2_224 + -901;
			Eq_2 s8_235 = 0x230BA000;
			word32 s9_236 = 0x230CC000;
			while (true)
			{
				a4 = s6_232->t043C;
				if (a4 == 0x02)
					break;
				if (s0_231 == 0x00)
				{
					word32 a2_1222;
					word32 s4_1227;
					word32 s10_1232;
					word32 s11_1233;
					word32 t4_1234;
					word32 s7_1229;
					word32 s9_1231;
					word32 s8_1230;
					word32 s6_1228;
					word32 s3_1226;
					word32 a7_1224;
					word32 s2_1225;
					word32 s1_1219;
					word32 a0_1220;
					word32 a5_1223;
					word32 a1_1221;
					ra = printf(ra, &g_t230B9A28, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1219, out a0_1220, out a1_1221, out a2_1222, out a3, out a4, out a5_1223, out a7_1224, out s2_1225, out s3_1226, out s4_1227, out s5, out s6_1228, out s7_1229, out s8_1230, out s9_1231, out s10_1232, out s11_1233, out t4_1234);
					break;
				}
				Eq_2 dwLoc34_790;
				word32 s3_242 = (word32) *((word32) s0_231 + 32);
				s1_244.u0 = ~0x00;
				if (s3_242 == 0x01)
				{
					struct Eq_64398 * a2_247;
					struct Eq_236676 * a5_248;
					word32 a1_1235;
					struct Eq_192645 * a0_245 = k_uptime_get_32(out a1_1235, out a2_247, out a5_248);
					s0_231 = a5_248->t0024;
					if (s7_233 >= a0_245 - a5_248)
					{
						*((word32) s2_230 + 2) = (byte) s3_242;
						word32 a0_263;
						word32 a1_1236;
						word32 a5_1238;
						word32 s4_1239;
						word32 a4_1237;
						s1_244 = bt_rand(s5, 0x08, a2_247, out a0_263, out a1_1236, out a3, out a4_1237, out a5_1238, out s4_1239, out s8_235);
						if (a0_263 == 0x00)
						{
							word32 a0_1241;
							word32 a5_1246;
							word32 a2_1243;
							word32 a4_1245;
							word32 a3_1244;
							word32 a1_1242;
							word32 t1_1240;
							Eq_2 ra_285 = memset(ra, fp + -64, 0x00, 0x06, out t1_1240, out a0_1241, out a1_1242, out a2_1243, out a3_1244, out a4_1245, out a5_1246);
							word32 a3_1249;
							word32 a4_1250;
							word32 a6_1252;
							word32 a7_1253;
							word32 a5_1251;
							word32 a1_1247;
							word32 a2_1248;
							memcpy(fp + -58, s5, 0x08, out a1_1247, out a2_1248, out a3_1249, out a4_1250, out a5_1251, out a6_1252, out a7_1253);
							word32 a5_1254;
							Eq_2 a0_304 = bt_mesh_primary_addr(out a5_1254);
							word32 a0_317;
							word32 s10_1260;
							word32 s4_1259;
							word32 s3_1258;
							word32 a5_1257;
							word32 a4_1256;
							word32 a1_1255;
							ra = bt_encrypt_be(ra_285, (word32) s0_231 + ((word32) (*((word32) s0_231 + 30)) + 0x5A), out s0_231, out s1_244, out a0_317, out a1_1255, out a3, out a4_1256, out a5_1257, out s2_230, out s3_1258, out s4_1259, out s5, out s6_232, out s8_235, out s10_1260);
							dwLoc34_790 = SEQ((word16) (a0_304 >> 8 | a0_304 << 0x08), wLoc34_983);
							if (a0_317 == 0x00)
							{
								word32 a7_1267;
								word32 a6_1266;
								word32 a5_1265;
								word32 a4_1264;
								word32 a3_1263;
								word32 a2_1262;
								word32 a1_1261;
								memcpy((word32) s2_230 + 3, fp + -56, 0x08, out a1_1261, out a2_1262, out a3_1263, out a4_1264, out a5_1265, out a6_1266, out a7_1267);
								word32 a0_365;
								word32 s3_380;
								word32 a4_1269;
								word32 a1_1268;
								ra = bt_le_adv_start(ra, s0_231, s9_236 + -0x05F8, 0x00, s2_230, s5, s7_233, s8_235, mstatus, dwLoc3C, dwLoc38, dwLoc34_790, s2, dwLoc1C, dwLoc18, dwLoc14, dwLoc08, dwLoc04, dwArg18, dwArg28, dwArg38, s9, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArg0124, out s0_231, out s1_244, out a0_365, out a1_1268, out a3, out a4_1269, out s2_230, out s3_380, out s5, out s6_232, out s7_233, out s8_235, out s9_236, out mstatus);
								if (a0_365 != 0x00)
								{
									word32 t4_1280;
									word32 s11_1279;
									word32 s10_1278;
									word32 s4_1277;
									word32 s3_1276;
									word32 a7_1275;
									word32 a5_1274;
									word32 a4_1273;
									word32 a2_1272;
									word32 a1_1271;
									word32 a0_1270;
									ra = printf(ra, &g_t230B9A48, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_244, out a0_1270, out a1_1271, out a2_1272, out a3, out a4_1273, out a5_1274, out a7_1275, out s2_230, out s3_1276, out s4_1277, out s5, out s6_232, out s7_233, out s8_235, out s9_236, out s10_1278, out s11_1279, out t4_1280);
								}
								else
									g_b4200F44B = (byte) s3_380;
							}
						}
					}
					else
					{
						((word32) s0_231 + 32)->u0 = 0x00;
						((word32) s0_231 + 36)->u0 = 0x00;
					}
				}
				if ((word32) *((word32) s0_231 + 32) != 0x00)
				{
l2304594A:
					word32 s2_543 = 0x00;
					if ((word32) g_w4200D8DC != 0x0FFFFFFF)
					{
						if ((word32) g_b4200D8E0 != 0x01)
						{
							word32 a5_1313;
							if (bt_mesh_gatt_proxy_get(out a5_1313) == 0x01)
								goto l23045976;
						}
						else
						{
l23045976:
							s2_543 = 0x01;
						}
					}
					a4 = (word32) g_w4200D9C0;
					if (a4 == 0x0FFFFFFF)
						goto l230457DC;
					if ((word32) g_b4200D9C4 != 0x01)
					{
						word32 a5_1314;
						if (bt_mesh_gatt_proxy_get(out a5_1314) != 0x01)
							goto l230457DC;
					}
					if (s2_543 != 0x00 && s1_244 > 0x02000710)
						s1_244.u0 = 0x02000710;
					goto l230457DC;
				}
				word32 a5_1281;
				if (bt_mesh_gatt_proxy_get(out a5_1281) == 0x01)
				{
					word32 a1_442 = (word32) *((word32) s0_231 + 30);
					g_b4200DC72 = 0x00;
					word32 a5_1286;
					word32 a7_1288;
					word32 a6_1287;
					word32 a4_1285;
					word32 a2_1283;
					word32 a3_1284;
					word32 a1_1282;
					memcpy(0x4200DC73, (word32) s0_231 + (a1_442 + 0x00AA), 0x08, out a1_1282, out a2_1283, out a3_1284, out a4_1285, out a5_1286, out a6_1287, out a7_1288);
					word32 a0_480;
					word32 s3_495;
					word32 s9_1296;
					word32 a4_1291;
					word32 s8_1295;
					word32 s6_1293;
					word32 s7_1294;
					word32 s2_1292;
					word32 a1_1290;
					word32 s0_1289;
					ra = bt_le_adv_start(ra, s0_231, 0x230CBA10, 0x00, s2_230, s5, s7_233, s8_235, mstatus, dwLoc3C, dwLoc38, dwLoc34_790, s2, dwLoc1C, dwLoc18, dwLoc14, dwLoc08, dwLoc04, dwArg18, dwArg28, dwArg38, s9, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArg0124, out s0_1289, out s1_244, out a0_480, out a1_1290, out a3, out a4_1291, out s2_1292, out s3_495, out s5, out s6_1293, out s7_1294, out s8_1295, out s9_1296, out mstatus);
					if (a0_480 != 0x00)
					{
						word32 s11_1311;
						word32 t4_1312;
						word32 s6_1306;
						word32 s10_1310;
						word32 s8_1308;
						word32 s9_1309;
						word32 s7_1307;
						word32 a5_1301;
						word32 s4_1305;
						word32 s2_1303;
						word32 s3_1304;
						word32 a7_1302;
						word32 a4_1300;
						word32 a1_1298;
						word32 a2_1299;
						word32 a0_1297;
						ra = printf(ra, &g_t230B9A78, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_244, out a0_1297, out a1_1298, out a2_1299, out a3, out a4_1300, out a5_1301, out a7_1302, out s2_1303, out s3_1304, out s4_1305, out s5, out s6_1306, out s7_1307, out s8_1308, out s9_1309, out s10_1310, out s11_1311, out t4_1312);
					}
					else
						g_b4200F44B = (byte) s3_495;
					goto l2304594A;
				}
				s0_231 = next_sub.part.6(out a3, out s2_230, out s8_235);
			}
		}
		goto l230456EA;
	}
	Eq_2 s0_147;
	if ((word32) g_b4200F44A == 0x00)
		s0_147.u0 = 0x230CBA10;
	else
		s0_147.u0 = 588036616;
	Eq_2 s8_112;
	up32 a0_116;
	ui32 a4_117;
	word32 a5_1205;
	Eq_2 a0_38 = bt_mesh_prov_get(out a5_1205);
	Eq_2 a0_41 = bt_get_name();
	word32 a2_1207;
	word32 a1_1206;
	word32 a5_1210;
	word32 a4_1209;
	word32 a3_1208;
	Eq_2 a0_43 = strlen(a0_41, out a1_1206, out a2_1207, out a3_1208, out a4_1209, out a5_1210);
	word32 a1_1211;
	word32 a4_1214;
	word32 a3_1213;
	word32 a2_1212;
	word32 a6_1216;
	word32 a5_1215;
	word32 a7_1217;
	memcpy(0x4200DBDA, *a0_38, 0x10, out a1_1211, out a2_1212, out a3_1213, out a4_1214, out a5_1215, out a6_1216, out a7_1217);
	uint32 a5_69 = (word32) *((word32) a0_38 + 8);
	g_w4200DBEA = (word16) (a5_69 >> 8 | a5_69 << 0x08);
	Eq_2 s2_106 = a0_38;
	Eq_2 s5_109 = a0_41;
	Eq_2 s4_108 = a0_43;
	Eq_2 a0_74 = *((word32) a0_38 + 4);
	s8_112 = s8;
	if (a0_74 != 0x00)
	{
		Eq_2 a3_76;
		word32 a1_1179;
		word32 a4_1181;
		word32 a2_1180;
		word32 a5_1182;
		Eq_2 a0_75 = strlen(a0_74, out a1_1179, out a2_1180, out a3_76, out a4_1181, out a5_1182);
		if (a0_75 <= 0x1D)
		{
			a0_116 = 0x1D - a0_75;
			a4_117 = 0x01;
			s8_112 = s8;
			s8_112 = s8;
			if (a0_116 <= 0x02)
				goto l230457AE;
l2304578E:
			if (s4_108 != 0x00)
			{
				Eq_2 a0_123 = a0_116 + ~0x01;
				struct Eq_236497 * a5_126 = (a4_117 << 0x03) + (fp + -64);
				if (a0_123 < s4_108)
				{
					a5_126->b0000 = 0x08;
					a5_126->b0001 = (byte) a0_123;
				}
				else
				{
					a5_126->b0000 = 0x09;
					a5_126->b0001 = (byte) s4_108;
				}
				a5_126->t0004 = s5_109;
			}
l230457AE:
			word32 a0_180;
			byte * s1_191;
			word32 s2_1199;
			word32 s0_1197;
			word32 a1_1198;
			word32 s3_1200;
			word32 s6_1201;
			word32 s7_1202;
			word32 s9_1204;
			word32 s8_1203;
			ra = bt_le_adv_start(ra, s0_147, s0_147, fp + -64, s2_106, s5_109, s7, s8_112, mstatus, dwLoc3C, dwLoc38, s8, s2, dwLoc1C, dwLoc18, dwLoc14, dwLoc08, dwLoc04, dwArg18, dwArg28, dwArg38, s9, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArg0124, out s0_1197, out s1_191, out a0_180, out a1_1198, out a3, out a4, out s2_1199, out s3_1200, out s5, out s6_1201, out s7_1202, out s8_1203, out s9_1204, out mstatus);
			if (a0_180 == 0x00)
			{
				g_b4200F44B = 0x01;
				a4.u0 = 0x01;
				if ((word32) *s1_191 != 0x00)
				{
					*s1_191 = 0x00;
					s1_244.u0 = 0x0EFFFA60;
l230457DC:
					0x00 = dwArg0198;
					s0Out = dwArg0158;
					a0Out = s1_244;
					a3Out = a3;
					a4Out = a4;
					s5Out = s5;
					mstatusOut = mstatus;
					return ra;
				}
			}
			goto l23045804;
		}
		word32 s1_1183;
		word32 a0_1184;
		word32 a2_1186;
		word32 a3_1187;
		word32 a1_1185;
		word32 a4_1188;
		word32 a7_1190;
		word32 s9_1193;
		word32 s3_1191;
		word32 a5_1189;
		word32 s6_1192;
		word32 s10_1194;
		word32 t4_1196;
		word32 s11_1195;
		ra = printf(ra, &g_t230B99FC, a3_76, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1183, out a0_1184, out a1_1185, out a2_1186, out a3_1187, out a4_1188, out a5_1189, out a7_1190, out s2_106, out s3_1191, out s4_108, out s5_109, out s6_1192, out s7, out s8_112, out s9_1193, out s10_1194, out s11_1195, out t4_1196);
	}
	a0_116 = 0x1F;
	a4_117 = 0x00;
	goto l2304578E;
}

// 230459D0: Register Eq_2 bt_mesh_proxy_adv_stop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 a1Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      adv_thread
Eq_2 bt_mesh_proxy_adv_stop(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & a1Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	if ((word32) g_b4200F44B != 0x00)
	{
		Eq_2 a3_16;
		ptr32 a0_41;
		word32 a4_196;
		word32 a5_197;
		word32 s3_198;
		word32 s4_199;
		word32 s6_200;
		ra = bt_le_adv_stop(ra, 0x4200F44B, a3, a4, mstatus, dwLoc10, s0, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg54, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s1, out a0_41, out a3_16, out a4_196, out a5_197, out s2, out s3_198, out s4_199, out s5, out s6_200, out s7, out s8, out s9, out mstatus);
		a1 = a0_41;
		if (a0_41 != 0x00)
		{
			ptr32 a1_57;
			ptr32 s1_63;
			ptr32 s2_66;
			ptr32 s5_69;
			ptr32 s7_71;
			ptr32 s8_72;
			ptr32 s9_73;
			word32 a0_201;
			word32 a2_202;
			word32 a3_203;
			word32 a4_204;
			word32 a5_205;
			word32 a7_206;
			word32 s3_207;
			word32 s4_208;
			word32 s6_209;
			word32 s10_210;
			word32 s11_211;
			word32 t4_212;
			Eq_2 ra_62 = printf(ra, &g_t230B9AA8, a3_16, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_63, out a0_201, out a1_57, out a2_202, out a3_203, out a4_204, out a5_205, out a7_206, out s2_66, out s3_207, out s4_208, out s5_69, out s6_209, out s7_71, out s8_72, out s9_73, out s10_210, out s11_211, out t4_212);
			s1Out = s1_63;
			a1Out = a1_57;
			s2Out = s2_66;
			s5Out = s5_69;
			s7Out = s7_71;
			s8Out = s8_72;
			s9Out = s9_73;
			mstatusOut = mstatus;
			return ra_62;
		}
		g_b4200F44B = 0x00;
	}
	s1Out = s1;
	a1Out = a1;
	s2Out = s2;
	s5Out = s5;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	mstatusOut = mstatus;
	return ra;
}

