pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23045A0A: Register word32 bt_mesh_proxy_init(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Register out ptr32 a3Out)
// Called from:
//      bt_mesh_init
word32 bt_mesh_proxy_init(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0108, ptr32 & a3Out)
{
	g_w4200DAEE = 0x44;
	g_dw42014638 = 0x4200DAB0;
	Eq_2 a3_30;
	Eq_2 a4_31;
	word32 s3_36;
	word32 a0_87;
	word32 a5_88;
	word32 s2_89;
	word32 s4_90;
	word32 s5_91;
	Eq_2 s1_34 = k_delayed_work_init(ra, 0x4200DAB0, 0x4200DAC4, a3, a4, mstatus, dwArg74, dwArgA8, dwArgC8, dwArg0108, out a0_87, out a3_30, out a4_31, out a5_88, out s2_89, out s3_36, out s4_90, out s5_91);
	g_w4200DB32 = (word16) s3_36;
	g_dw4200DB34 = (word32) s1_34 + 0x0044;
	ptr32 a3_50;
	Eq_2 a4_51;
	word32 a0_92;
	word32 a5_93;
	word32 s2_94;
	word32 s3_95;
	word32 s4_96;
	word32 s5_97;
	k_delayed_work_init(ra, 0x4200DAB0, 0x4200DB08, a3_30, a4_31, mstatus, dwArg74, dwArgA8, dwArgC8, dwArg0108, out a0_92, out a3_50, out a4_51, out a5_93, out s2_94, out s3_95, out s4_96, out s5_97);
	bt_conn_cb_register(&g_dw4200DB38, a4_51);
	a3Out = a3_50;
	return 0x4200DAB0;
}

// 23045A74: Register Eq_2 send_cb_finalize(Register Eq_2 ra, Register Eq_237183 s0, Register word32 a0, Register Eq_2 a1, Register (ptr32 code) a5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Register out Eq_237183 s0Out, Register out (ptr32 code) a5Out)
// Called from:
//      bt_mesh_trans_send
Eq_2 send_cb_finalize(Eq_2 ra, Eq_237183 s0, word32 a0, Eq_2 a1, <anonymous> * a5, Eq_2 dwArg10, Eq_2 dwArg14, union Eq_237183 & s0Out, <anonymous> & a5Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		a5Out = a5;
		return ra;
	}
	else
	{
		struct Eq_237193 * a0_12 = *a5;
		Eq_2 s1_14 = a1;
		struct Eq_237193 * s0_15 = a0_12;
		if (a5 != null)
		{
			word32 t1_27;
			word32 tp_28;
			a5();
		}
		<anonymous> * t1_31 = s0_15->ptr0004;
		if (t1_31 == null)
		{
			s0Out = s0;
			a5Out = a5;
			return ra;
		}
		else
		{
			Eq_237183 s0_48;
			Eq_2 ra_50;
			<anonymous> * a5_51;
			word32 t1_54;
			t1_31();
			s0Out = s0_48;
			a5Out = a5_51;
			return ra_50;
		}
	}
}

// 23045AB0: void seg_first_send_start(Register (ptr32 Eq_237213) a5)
void seg_first_send_start(struct Eq_237213 * a5)
{
	word32 a2_5 = a5->dw0030;
	if (a5 == null)
		return;
	<anonymous> * t1_6 = a5->ptr0000;
	if (t1_6 == null)
		return;
	word32 t1_11;
	t1_6();
}

// 23045AC2: Register Eq_2 is_replay(Register Eq_2 ra, Register Eq_2 a0, Register Eq_221871 a1, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 s1Out, Register out (ptr32 Eq_237236) a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_237236) a4Out, Register out (ptr32 Eq_237239) a5Out, Register out ptr32 s3Out, Register out (ptr32 Eq_237241) s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out (ptr32 Eq_237244) s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s11Out)
// Called from:
//      bt_mesh_trans_recv
Eq_2 is_replay(Eq_2 ra, Eq_2 a0, Eq_221871 a1, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & s1Out, struct Eq_237236 & a0Out, ptr32 & a3Out, struct Eq_237236 & a4Out, struct Eq_237239 & a5Out, ptr32 & s3Out, struct Eq_237241 & s4Out, ptr32 & s5Out, ptr32 & s6Out, struct Eq_237244 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s11Out)
{
	struct Eq_237236 * a4_105;
	ui32 a6_5 = (word32) *((word32) a0 + 32);
	struct Eq_237239 * a5_100 = (struct Eq_237239 *) 0x10;
	if ((a6_5 & 48) != 0x10)
	{
		a5_100 = a6_5 & 64;
		a4_105 = null;
		if ((a6_5 & 64) != 0x00)
		{
			struct Eq_237277 * a2_11 = g_a4200DA88;
			a5_100 = null;
			a3 = 0x05;
			do
			{
				a4_105 = (word32) a2_11->t0000;
				if (a4_105 == null)
				{
					if (a1 != 0x00)
					{
						a2_11->t0000.u2 = a1;
						goto l23045AEE;
					}
					a3 = (word32) *((word32) a0 + 8);
					a5_100 = (a5_100 + 0x0078 << 3) + 0x4200D6BC;
					a5_100[0x0C] = (struct Eq_237239) (word16) a3;
					a4_105 = (struct Eq_237236 *) &g_t4200D6BC;
					goto l23045B0A;
				}
				struct Eq_237236 * a7_18 = (word32) *((word32) a0 + 8);
				if (a4_105 == a7_18)
				{
					a5_100 += 0x0078;
					a4_105 = (word32) g_a4200D6CA[a5_100];
					a3 = 0x4200D6BC;
					if ((a6_5 & 1) == 0x00)
					{
						if (a4_105 == null)
						{
l23045B4A:
							a4_105 = (struct Eq_237236 *) 0x01;
							if (g_a4200D6CC[a5_100] >= *((word32) a0 + 28))
								goto l23045AEE;
						}
						if (a1 != 0x00)
						{
							a2_11->t0000.u2 = a1;
							goto l23045B62;
						}
						a5_100 = (a5_100 << 3) + 0x4200D6BC;
						a5_100[0x0C] = (struct Eq_237239) (word16) a7_18;
l23045B0A:
						a4_105->ptr0010 = a5_100;
						a5_100[0x0E] = (struct Eq_237239) (byte) (a4_105 & 0x01);
						goto l23045B62;
					}
					else
					{
						if (a4_105 == null)
						{
							a4_105 = (struct Eq_237236 *) 0x01;
							goto l23045AEE;
						}
						goto l23045B4A;
					}
				}
				++a5_100;
				++a2_11;
			} while (a5_100 != (struct Eq_237239 *) 0x05);
			struct Eq_237239 * a5_31;
			ptr32 a3_35;
			ptr32 s1_39;
			ptr32 s11_41;
			ptr32 s3_43;
			struct Eq_237241 * s4_44;
			ptr32 s5_45;
			ptr32 s6_46;
			struct Eq_237244 * s7_47;
			ptr32 s8_48;
			ptr32 s9_49;
			word32 s10_304;
			word32 t4_305;
			word32 a0_298;
			word32 s2_303;
			word32 a1_299;
			word32 a4_301;
			word32 a7_302;
			word32 a2_300;
			Eq_2 ra_38 = printf(ra, &g_t230BA340, 0x05, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_39, out a0_298, out a1_299, out a2_300, out a3_35, out a4_301, out a5_31, out a7_302, out s2_303, out s3_43, out s4_44, out s5_45, out s6_46, out s7_47, out s8_48, out s9_49, out s10_304, out s11_41, out t4_305);
			s1Out = s1_39;
			a0Out = (struct Eq_237236 *) 0x01;
			a3Out = a3_35;
			a4Out = (struct Eq_237236 *) 0x01;
			a5Out = a5_31;
			s3Out = s3_43;
			s4Out = s4_44;
			s5Out = s5_45;
			s6Out = s6_46;
			s7Out = s7_47;
			s8Out = s8_48;
			s9Out = s9_49;
			s11Out = s11_41;
			return ra_38;
		}
	}
	else
	{
l23045B62:
		a4_105 = null;
	}
l23045AEE:
	s1Out = s1;
	a0Out = a4_105;
	a3Out = a3;
	a4Out = a4_105;
	a5Out = a5_100;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s11Out = s11;
	return ra;
}

// 23045B92: void seg_sent(Register (ptr32 Eq_237413) a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void seg_sent(struct Eq_237413 * a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a4_5 = (int32) a1->w0028;
	Eq_2 a5_10 = 50;
	if (a4_5 > 0x00)
		a5_10 = (word32) a1->b002C + 450;
	word32 s8_85;
	word32 s6_84;
	word32 s5_83;
	word32 s4_82;
	word32 s3_81;
	word32 s2_80;
	word32 a5_79;
	word32 a4_78;
	word32 a3_77;
	word32 a2_76;
	word32 a1_75;
	word32 a0_74;
	word32 s1_73;
	k_delayed_work_submit(a5_10, a3, a4_5, mstatus, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_73, out a0_74, out a1_75, out a2_76, out a3_77, out a4_78, out a5_79, out s2_80, out s3_81, out s4_82, out s5_83, out s6_84, out s8_85);
}

// 23045BB4: Register Eq_2 ack_timeout(Register Eq_2 a0, Register out ptr32 a4Out)
// Called from:
//      seg_ack
//      bt_mesh_trans_recv
Eq_2 ack_timeout(Eq_2 a0, ptr32 & a4Out)
{
	Eq_2 s0_11 = (word32) *((word32) a0 + 18);
	if (s0_11 == 0x00FF)
	{
		word32 a5_59;
		a0 = bt_mesh_default_ttl_get(out a5_59);
		s0_11 = a0;
	}
	ptr32 a4_21;
	ui32 a5_22;
	Eq_2 a0_34 = (a5_22 & 0x1F) + 0x01 - __popcountsi2(a0, out a4_21, out a5_22) + 100 + ((word32) s0_11 + 200);
	if (a0_34 < 400)
		a0_34.u0 = 400;
	a4Out = a4_21;
	return a0_34;
}

