pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23045C0C: Register Eq_2 sdu_recv(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register word32 s11, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_237526 a4Out, Register out Eq_237527 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out (ptr32 Eq_237530) s7Out, Register out ptr32 s9Out)
// Called from:
//      bt_mesh_trans_recv
Eq_2 sdu_recv(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, word32 s11, Eq_2 dwArg1C, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_237526 & a4Out, union Eq_237527 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, struct Eq_237530 & s7Out, ptr32 & s9Out)
{
	word16 wLocAE_472 = SLICE(dwLocB0, word16, 16);
	Eq_2 s3_313 = a4;
	Eq_2 s0_114 = a0;
	ptr32 s9_319 = a1;
	Eq_2 s5_101 = a2;
	Eq_2 s4_155 = a3;
	int32 a4_46 = (word32) *((word32) a4 + 4);
	int32 a5_47 = 0x05;
	if (a3 != 0x00)
		a5_47 = 0x09;
	struct Eq_274 * a0_237;
	if (a4_46 < a5_47)
	{
		a0_237 = (struct Eq_274 *) &g_t230BA350;
		goto l23045C56;
	}
	if (((word32) *((word32) a0 + 32) & 64) == 0x00)
		goto l23045D8E;
	word32 a0_56 = (word32) *((word32) a0 + 0x0A);
	ui32 s7_163 = 0x00;
	if ((a0_56 ^ 0x08000000) < 0x04000000)
	{
		ui32 a0_64;
		word32 s1_810;
		word32 s2_811;
		word32 s6_812;
		word32 s7_813;
		word32 s9_814;
		word32 s10_815;
		word32 s11_816;
		ra = bt_mesh_label_uuid_get(ra, a0_56, a3, dwLocB8, s2, s0, dwLoc48, dwLoc24, out s1_810, out a0_64, out a3, out s2_811, out s3_313, out s4_155, out s5_101, out s6_812, out s7_813, out s9_814, out s10_815, out s11_816);
		s7_163 = a0_64;
	}
	word32 a5_90 = (word32) *((word32) s3_313 + 4);
	word32 a4_91 = 0x08;
	if (s4_155 == 0x00)
		a4_91 = 0x04;
	Eq_2 s5_183;
	Eq_2 s2_195;
	union Eq_193637 * a5_199;
	((word32) s3_313 + 4)->u2 = (word16) (a5_90 - a4_91);
	uint32 a5_103 = s5_101 >> 0x06;
	struct Eq_237623 * a5_105 = a5_103 & 0x01;
	if ((a5_103 & 0x01) == 0x00)
	{
		word32 s11_819;
		word32 s6_817;
		word32 s8_818;
		ra = bt_mesh_app_decrypt(0x4200D860, s4_155, s7_163, dwLoc68, dwLoc4C, dwLoc2C, out s0_114, out a3, out s5_183, out s6_817, out s8_818, out s11_819);
		s2_195.u0 = 0x4200D860;
		a5_199 = (union Eq_193637 *) ~0x01;
		if (true)
		{
			a0_237 = (struct Eq_274 *) &g_t230BA368;
			goto l23045C56;
		}
		goto l23045D82;
	}
	struct Eq_237630 * s1_107 = &g_t4200D6BC;
	word32 s6_108 = 0x00;
	struct Eq_237623 * s5_109 = s5_101 & 63;
	word32 s10_111 = 0x01;
l23045CF2:
	s0_114 = a5_105->dw0000;
	a5_105 = (word32) a5_105->w001C;
	if ((word32) s1_107->w01B4 != a5_105)
	{
l23045D5E:
		s1_107 = (struct Eq_237630 *) ((char *) s1_107 + 40);
		if (s6_108 == s10_111)
		{
			a0_237 = (struct Eq_274 *) &g_t230BA3B0;
l23045C56:
			word32 a0_821;
			word32 s1_820;
			word32 a1_822;
			word32 a2_823;
			word32 s10_831;
			word32 t4_833;
			word32 s11_832;
			word32 s8_830;
			word32 s5_828;
			word32 s6_829;
			word32 a4_824;
			word32 a7_826;
			word32 a5_825;
			word32 s2_827;
			ra = printf(ra, a0_237, a3, dwLocC8, dwLocA8, dwLoc60, dwLoc5C, dwLoc38, dwLoc14, out s1_820, out a0_821, out a1_822, out a2_823, out a3, out a4_824, out a5_825, out a7_826, out s2_827, out s3_313, out s4_155, out s5_828, out s6_829, out s7, out s8_830, out s9_319, out s10_831, out s11_832, out t4_833);
l23045D8E:
			s0Out = s0_114;
			a0Out = dwArg4C;
			a1Out = dwLocCC;
			a3Out = a3;
			a4Out = dwArg0128;
			s2Out = dwArg0108;
			s3Out = s3_313;
			s4Out = s4_155;
			s7Out = s7;
			s9Out = s9_319;
			return ra;
		}
		s6_108 = 0x01;
		goto l23045CF2;
	}
	struct Eq_237719 * a0_121;
	if (((word32) *((word32) s0_114 + 32) & 0x02) != 0x00)
	{
		a0_121 = (struct Eq_237719 *) (&s1_107->b01B8 + 18);
		if ((word32) s1_107->b01B8 != 0x00)
		{
l23045D16:
			a5_105 = (word32) a0_121->b0000;
			if (a5_105 == s5_109)
			{
				Eq_2 a0_166 = &a0_121->b0000 + 1;
				Eq_2 a3_170;
				word32 s11_179;
				ptr32 s6_184;
				int32 s8_186;
				ra = bt_mesh_app_decrypt(a0_166, s4_155, s7_163, dwLoc68, dwLoc4C, dwLoc2C, out s0_114, out a3_170, out s5_183, out s6_184, out s8_186, out s11_179);
				s2_195 = a0_166;
				dwLocB0 = SEQ(wLocAE_472, 0x00);
				if (a0_166 == 0x00)
				{
					a5_199 = (word32) (s6_184 + 40 + s8_186)->w01B6;
l23045D82:
					*((word32) s0_114 + 6) = (word16) a5_199;
					ra = bt_mesh_model_recv(ra, s0_114, a5_199, s2_195, s5_183, dwLocC8, dwLocB4, dwLocB0, dwLocAC, dwLocA8, dwLoc64, dwLoc60, dwLoc5C, dwLoc38, dwLoc14, s11, dwArg1C, dwArg3C, dwArg58, dwArg78, dwArg98, dwArgB8, dwArgD8, out s0_114, out a3, out s3_313, out s4_155, out s7, out s9_319);
					goto l23045D8E;
				}
				word32 s8_841;
				word32 s11_843;
				word32 t4_844;
				word32 s9_842;
				word32 s3_840;
				word32 a7_838;
				word32 s2_839;
				word32 a0_834;
				word32 a2_836;
				word32 a1_835;
				word32 a4_837;
				ra = printf(ra, s11_179 + 0x0388, a3_170, dwLocC8, dwLocA8, dwLoc60, dwLoc5C, dwLoc38, dwLoc14, out s1_107, out a0_834, out a1_835, out a2_836, out a3, out a4_837, out a5_105, out a7_838, out s2_839, out s3_840, out s4_155, out s5_109, out s6_108, out s7_163, out s8_841, out s9_842, out s10_111, out s11_843, out t4_844);
			}
			goto l23045D5E;
		}
	}
	a0_121 = (struct Eq_237719 *) (s1_107 + 1);
	goto l23045D16;
}

// 23045DAE: void seg_send_start(Register word32 a1, Register (ptr32 Eq_237818) a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void seg_send_start(word32 a1, struct Eq_237818 * a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if (a1 == 0x00)
		return;
	Eq_2 a1_11 = 50;
	if ((int32) a2->w0028 > 0x00)
		a1_11 = (word32) a2->b002C + 450;
	word32 s1_117;
	word32 a0_118;
	word32 a1_119;
	word32 a2_120;
	word32 a3_121;
	word32 a4_122;
	word32 a5_123;
	word32 s2_124;
	word32 s3_125;
	word32 s4_126;
	word32 s5_127;
	word32 s6_128;
	word32 s8_129;
	k_delayed_work_submit(a1_11, a3, a4, mstatus, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_117, out a0_118, out a1_119, out a2_120, out a3_121, out a4_122, out a5_123, out s2_124, out s3_125, out s4_126, out s5_127, out s6_128, out s8_129);
}

// 23045DD2: Register Eq_2 seg_rx_reset(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_237909 a4Out, Register out (ptr32 Eq_237910) a5Out, Register out Eq_237911 s2Out, Register out (ptr32 Eq_237912) s3Out, Register out (ptr32 Eq_237913) s4Out, Register out Eq_237914 s5Out, Register out Eq_237915 s6Out)
// Called from:
//      seg_ack
//      bt_mesh_trans_recv
//      bt_mesh_rx_reset
Eq_2 seg_rx_reset(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_237909 & a4Out, struct Eq_237910 & a5Out, union Eq_237911 & s2Out, struct Eq_237912 & s3Out, struct Eq_237913 & s4Out, union Eq_237914 & s5Out, union Eq_237915 & s6Out)
{
	ui32 a2_19;
	word32 s8_225;
	word32 a5_224;
	word32 a0_223;
	Eq_2 a3_165;
	ptr32 a1_163;
	Eq_237909 a4_167;
	Eq_237911 s2_185;
	struct Eq_237912 * s3_187;
	struct Eq_237913 * s4_189;
	Eq_237914 s5_191;
	Eq_237915 s6_100;
	Eq_2 s1_114 = k_delayed_work_cancel((word32) a0 + 32, a3, a4, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_223, out a1_163, out a2_19, out a3_165, out a4_167, out a5_224, out s2_185, out s3_187, out s4_189, out s5_191, out s6_100, out s8_225);
	Eq_2 s0_109 = a0;
	if ((int32) *((word32) a0 + 16) < 0x00)
	{
		struct Eq_237967 * a5_49;
		word32 a0_46 = __ashldi3(0x01, 0x00, (a2_19 & 0x1F) + 0x01, out a1_163, out a4_167, out a5_49);
		s0_109 = a5_49->t0018;
		if (a5_49 != a0_46 + ~0x00)
		{
			struct Eq_237993 * a0_54;
			Eq_2 s1_63;
			Eq_2 s2_66;
			word32 s6_235;
			word32 s7_236;
			word32 s8_237;
			word32 s5_234;
			word32 s4_233;
			word32 s3_232;
			word32 a7_231;
			word32 a5_230;
			word32 a4_229;
			word32 a3_228;
			word32 a2_227;
			word32 a1_226;
			word32 s9_238;
			word32 s10_239;
			word32 s11_240;
			word32 t4_241;
			s0_109 = bt_mesh_friend_clear_incomplete(printf(ra, &g_t230BA3E4, a3_165, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_63, out a0_54, out a1_226, out a2_227, out a3_228, out a4_229, out a5_230, out a7_231, out s2_66, out s3_232, out s4_233, out s5_234, out s6_235, out s7_236, out s8_237, out s9_238, out s10_239, out s11_240, out t4_241), s1_63, a0_54, (word32) *((word32) s0_109 + 20), (word32) *((word32) s0_109 + 22), a0_54->dw0000 + 8, s2_66, mstatus, dwLoc08, dwArg38, dwArg40, dwArg44, dwArg64, dwArg68, dwArg78, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_114, out a1_163, out a3_165, out a4_167, out s2_185, out s3_187, out s4_189, out s5_191, out s6_100);
		}
	}
	ui32 a5_111 = (word32) *((word32) s0_109 + 16);
	((word32) s0_109 + 16)->u0 = (byte) (a5_111 & -65);
	struct Eq_237910 * a5_112 = a5_111 & -65;
	if (s1_114 != 0x00)
	{
		*(union Eq_2 *) 8 = s0_109;
		((word32) s0_109 + 0x0C)->u0 = 0x00;
		*s0_109 = 0x00;
		*((word32) s0_109 + 20) = 0x00;
		a5_112 = null;
	}
	a1Out = a1_163;
	a3Out = a3_165;
	a4Out = a4_167;
	a5Out = a5_112;
	s2Out = s2_185;
	s3Out = s3_187;
	s4Out = s4_189;
	s5Out = s5_191;
	s6Out = s6_100;
	return s1_114;
}

// 23045E4C: Register Eq_2 seg_tx_reset(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_238150 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out (ptr32 Eq_238155) s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      seg_tx_complete
//      bt_mesh_trans_send
//      bt_mesh_tx_reset
Eq_2 seg_tx_reset(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s0Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_238150 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, struct Eq_238155 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	word32 a2_401;
	word32 a5_402;
	Eq_2 a4_100;
	Eq_2 a3_101;
	ptr32 s8_111;
	struct Eq_238155 * s6_135;
	ptr32 s5_134;
	ptr32 s4_110;
	ptr32 s3_132;
	Eq_2 s2_122;
	Eq_2 a1_104;
	Eq_2 a0_113;
	k_delayed_work_cancel((word32) a0 + 56, a3, a4, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_113, out a1_104, out a2_401, out a3_101, out a4_100, out a5_402, out s2_122, out s3_132, out s4_110, out s5_134, out s6_135, out s8_111);
	*(union Eq_2 *) 32 = a0;
	Eq_238150 a5_108 = (word32) *((word32) a0 + 43);
	((word32) a0 + 48)->u0 = 0x00;
	((word32) a0 + 52)->u0 = 0x00;
	((word32) a0 + 36)->u0 = 0x00;
	*a0 = 0x00;
	((word32) a0 + 40)->u0 = 0x00;
	Eq_2 s0_69 = a0;
	if (a5_108 != 0x00)
	{
		s2_122.u0 = 0x00;
		do
		{
			Eq_2 s1_53 = *a0_113;
			if (a0_113 != 0x00)
			{
				word32 * s1_70;
				word32 a2_403;
				word32 a5_404;
				word32 s4_405;
				word32 s8_406;
				ra = net_buf_unref(ra, s1_53, a0_113, a1_104, a4_100, mstatus, s2, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_69, out s1_70, out a0_113, out a1_104, out a2_403, out a3_101, out a4_100, out a5_404, out s2_122, out s3_132, out s4_405, out s5_134, out s6_135, out s8_406, out mstatus);
				*s1_70 = 0x00;
			}
			s2_122 = (byte) s2_122.u0 + 1;
		} while (((word32) *((word32) s0_69 + 42) & 0x1F) >= s2_122);
		*((word32) s0_69 + 43) = 0x00;
		ui32 a0_103;
		word32 a2_407;
		atomic_and(s0_69, -33, a3_101, a4_100, mstatus, out a0_103, out a1_104, out a2_407, out a3_101, out a4_100, out a5_108, out s4_110, out s8_111);
		a0_113 = a0_103 & 32;
		if ((a0_103 & 32) != 0x00)
		{
			Eq_2 s1_121;
			ra = bt_mesh_net_iv_update(ra, s0_69, g_t4200D6BC, 0x00, a3_101, mstatus, dwArg04, dwArg08, dwArg18, dwArg28, dwArg50, dwArg54, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s1_121, out a0_113, out a1_104, out a3_101, out a4_100, out a5_108, out s2_122, out s3_132, out s4_110, out s5_134, out s6_135, out s7, out s8_111, out s9, out s11);
			if (a0_113 != 0x00)
			{
				0x00 = (int8) dwArg38;
				Eq_2 a0_157;
				Eq_2 a3_159;
				Eq_2 a4_160;
				Eq_238150 a5_161;
				Eq_2 a1_162;
				ptr32 mstatus_165;
				Eq_2 s0_167;
				ptr32 s11_170;
				Eq_2 s2_171;
				ptr32 s3_172;
				ptr32 s4_173;
				ptr32 s5_174;
				struct Eq_238155 * s6_175;
				ptr32 s7_176;
				ptr32 s8_177;
				ptr32 s9_178;
				word32 s1_408;
				word32 s10_409;
				Eq_2 ra_166 = bt_mesh_net_sec_update(ra, s1_121, 0x00, s2_122, mstatus, dwArg08, dwArg10, dwArg18, dwArg1C, dwArg30, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out s0_167, out s1_408, out a0_157, out a1_162, out a3_159, out a4_160, out a5_161, out s2_171, out s3_172, out s4_173, out s5_174, out s6_175, out s7_176, out s8_177, out s9_178, out s10_409, out s11_170, out mstatus_165);
				s0Out = s0_167;
				a0Out = a0_157;
				a1Out = a1_162;
				a3Out = a3_159;
				a4Out = a4_160;
				a5Out = a5_161;
				s2Out = s2_171;
				s3Out = s3_172;
				s4Out = s4_173;
				s5Out = s5_174;
				s6Out = s6_175;
				s7Out = s7_176;
				s8Out = s8_177;
				s9Out = s9_178;
				s11Out = s11_170;
				mstatusOut = mstatus_165;
				return ra_166;
			}
		}
	}
	0x00 = (int8) dwArg38;
	s0Out = s0;
	a0Out = a0_113;
	a1Out = a1_104;
	a3Out = a3_101;
	a4Out = a4_100;
	a5Out = a5_108;
	s2Out = s2_122;
	s3Out = s3_132;
	s4Out = s4_110;
	s5Out = s5_134;
	s6Out = s6_135;
	s7Out = s7;
	s8Out = s8_111;
	s9Out = s9;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

// 23045EE6: Register Eq_2 seg_tx_complete(Register Eq_2 ra, Register Eq_2 s0, Register int32 a1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_238357) a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_238391 a1Out, Register out (ptr32 Eq_238392) a3Out, Register out Eq_238393 a4Out, Register out Eq_238394 s3Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      seg_tx_send_unacked
//      ctl_recv
Eq_2 seg_tx_complete(Eq_2 ra, Eq_2 s0, int32 a1, Eq_2 a3, Eq_2 a4, struct Eq_238357 * a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_238391 & a1Out, struct Eq_238392 & a3Out, union Eq_238393 & a4Out, union Eq_238394 & s3Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 s0_10 = a5->t0030;
	if (a5 != null)
	{
		<anonymous> * a5_11 = a5->ptr0004;
		if (a5_11 != null)
			a5_11();
	}
	Eq_238391 a1_39;
	struct Eq_238392 * a3_41;
	Eq_238393 a4_42;
	Eq_238394 s3_48;
	ptr32 s7_63;
	ptr32 s9_64;
	ptr32 mstatus_65;
	word32 s11_170;
	word32 s8_169;
	word32 s6_168;
	word32 s5_167;
	word32 s4_166;
	word32 s2_165;
	word32 a5_164;
	word32 a0_163;
	word32 s0_162;
	Eq_2 ra_60 = seg_tx_reset(ra, s0, s0_10, a3, a4, s2, mstatus, dwArg04, dwArg08, dwArg10, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg30, dwArg38, dwArg3C, dwArg48, dwArg50, dwArg54, dwArg58, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, out s0_162, out a0_163, out a1_39, out a3_41, out a4_42, out a5_164, out s2_165, out s3_48, out s4_166, out s5_167, out s6_168, out s7_63, out s8_169, out s9_64, out s11_170, out mstatus_65);
	a1Out = a1_39;
	a3Out = a3_41;
	a4Out = a4_42;
	s3Out = s3_48;
	s7Out = s7_63;
	s9Out = s9_64;
	mstatusOut = mstatus_65;
	return ra_60;
}

