pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23045F08: Register Eq_2 seg_tx_send_unacked(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register uint32 a2, Register (ptr32 Eq_238357) a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_238490 a1Out, Register out Eq_2 a3Out, Register out Eq_238492 a4Out, Register out Eq_238493 s3Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      seg_retransmit
//      ctl_recv
Eq_2 seg_tx_send_unacked(Eq_2 ra, Eq_2 s1, Eq_2 a0, uint32 a2, struct Eq_238357 * a5, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_238490 & a1Out, union Eq_2 & a3Out, union Eq_238492 & a4Out, union Eq_238493 & s3Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 s0_141 = a0;
	int32 * s2_16 = (word32) a0 + 4;
	int32 s1_17 = 0x00;
	Eq_238493 s3_18 = 0x230CC000;
	ra_198 = ra;
	do
	{
		Eq_2 ra_198;
		Eq_238490 a1_21 = *s2_16;
		if (a1_21 != 0x00)
		{
			ui32 a4_24 = (word32) a5->b0008;
			a1_21 = a5->t0014;
			a4 = a4_24 & 0x04;
			if ((a4_24 & 0x04) != 0x00)
				goto l23045F84;
			Eq_2 a3_123;
			Eq_2 a4_124;
			Eq_2 s2_105;
			int32 a1_115;
			struct Eq_238357 * a5_119;
			Eq_2 ra_101;
			word32 a4_26 = (word32) a5->b000A;
			a5->b000A = (byte) (a4_26 + -1);
			if (a4_26 == 0x00)
			{
				word32 t4_443;
				word32 s11_442;
				word32 s8_439;
				word32 s9_440;
				word32 s10_441;
				word32 s7_438;
				word32 s6_437;
				word32 s5_436;
				word32 s4_435;
				word32 s3_434;
				word32 a7_433;
				word32 a2_432;
				word32 a1_431;
				word32 a0_430;
				word32 s1_429;
				ra_101 = printf(ra_198, &g_t230BA414, a4_26 + -1, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_429, out a0_430, out a1_431, out a2_432, out a3_123, out a4_124, out a5_119, out a7_433, out s2_105, out s3_434, out s4_435, out s5_436, out s6_437, out s7_438, out s8_439, out s9_440, out s10_441, out s11_442, out t4_443);
				a1_115 = -60;
			}
			else
			{
				ra_198 = bt_mesh_net_resend(ra_198, *a0, a0, a2 >> 21 & 0x01, s2_16, s4, s5, s6, s8, mstatus, s2, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg18, dwArg20, dwArg24, dwArg28, dwArg48, dwArg4C, dwArg58, s1, ra, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArg0108, dwArg0118, out s0_141, out s1_17, out a0, out a1_21, out a2, out a3, out a4, out s2_16, out s3_18, out s4, out s5, out s6, out s7, out s8, out s9, out mstatus);
				if (a0 == 0x00)
					goto l23045F84;
				word32 t4_458;
				word32 s11_457;
				word32 s10_456;
				word32 s9_455;
				word32 s7_453;
				word32 s8_454;
				word32 s5_451;
				word32 s6_452;
				word32 s3_449;
				word32 s4_450;
				word32 a2_447;
				word32 a7_448;
				word32 a1_446;
				word32 a0_445;
				word32 s1_444;
				ra_101 = printf(ra_198, &g_t230BA438, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_444, out a0_445, out a1_446, out a2_447, out a3_123, out a4_124, out a5_119, out a7_448, out s2_105, out s3_449, out s4_450, out s5_451, out s6_452, out s7_453, out s8_454, out s9_455, out s10_456, out s11_457, out t4_458);
				a1_115 = ~0x04;
			}
			Eq_238490 a1_159;
			Eq_2 a3_161;
			Eq_238492 a4_162;
			ptr32 mstatus_166;
			Eq_238493 s3_173;
			ptr32 s7_177;
			ptr32 s9_179;
			Eq_2 ra_167 = seg_tx_complete(ra_101, s0_141, a1_115, a3_123, a4_124, a5_119, s2_105, mstatus, dwArg04, dwArg08, dwArg10, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg30, dwArg38, dwArg3C, dwArg48, dwArg50, dwArg54, dwArg58, s1, dwArg78, dwArg88, dwArg94, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, out a1_159, out a3_161, out a4_162, out s3_173, out s7_177, out s9_179, out mstatus_166);
			a1Out = a1_159;
			a3Out = a3_161;
			a4Out = a4_162;
			s3Out = s3_173;
			s7Out = s7_177;
			s9Out = s9_179;
			mstatusOut = mstatus_166;
			return ra_167;
		}
l23045F84:
		ui32 a5_77 = (word32) *((word32) s0_141 + 42);
		++s1_17;
		++s2_16;
		a5 = a5_77 & 0x1F;
	} while ((a5_77 & 0x1F) >= s1_17);
	a1Out = a1_21;
	a3Out = a3;
	a4Out = a4;
	s3Out = s3_18;
	s7Out = s7;
	s9Out = s9;
	mstatusOut = mstatus;
	return ra_198;
}

// 23045FA0: void seg_retransmit(Register Eq_2 ra, Register Eq_2 s1, Register word32 a0, Register uint32 a2, Register (ptr32 Eq_238357) a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void seg_retransmit(Eq_2 ra, Eq_2 s1, word32 a0, uint32 a2, struct Eq_238357 * a5, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	word32 a1_78;
	word32 a3_79;
	word32 a4_80;
	word32 s3_81;
	word32 s7_82;
	word32 s9_83;
	word32 mstatus_84;
	seg_tx_send_unacked(ra, s1, a0 + -56, a2, a5, s2, s4, s5, s6, s8, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg30, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg78, dwArg88, dwArg94, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, out a1_78, out a3_79, out a4_80, out s3_81, out s7_82, out s9_83, out mstatus_84);
}

