pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23045FA8: Register Eq_2 ctl_recv(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out Eq_238808 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_trans_recv
Eq_2 ctl_recv(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, union Eq_2 & s0Out, ptr32 & a0Out, union Eq_238808 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a0_1360;
	Eq_2 a4_1369;
	struct Eq_274 * a0_248;
	Eq_238808 a1_1362 = a1 & 0x007F;
	if ((a1 & 0x007F) != 0x00)
	{
		if ((a1 & 0x007F) != 0x0A)
		{
			a4_1369 = (word32) *((word32) a0 + 32);
			if ((a4_1369 & 64) != 0x00)
			{
				a3.u0 = 0x4200D6BC;
				if ((g_t4200D7F0 >> 4 & 0x01) != 0x00)
					goto l230462AE;
				ui32 a5_419 = (a1 & 0x007F) + -1;
				if ((a5_419 & 0x00FF) > 0x07)
					goto l230462AE;
				Eq_2 a5_426 = *((char *) g_a230B9E44 + (a5_419 & 0x00FF) * 0x04);
				switch (a5_426)
				{
				case 0x00:
					0x00 = (int8) dwArg0128;
					ptr32 a0_894;
					Eq_238808 a1_895;
					Eq_2 a3_897;
					Eq_2 a4_898;
					Eq_2 s3_904;
					Eq_2 s4_905;
					ptr32 mstatus_916;
					Eq_2 s7_920;
					ptr32 s9_921;
					Eq_2 ra_917 = bt_mesh_friend_poll(ra, s4, a2, 0x4200D6BC, s2, mstatus, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg38, s5, s1, ra, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0168, out a0_894, out a1_895, out a3_897, out a4_898, out s3_904, out s4_905, out s7_920, out s9_921, out mstatus_916);
					s0Out = s4;
					a0Out = a0_894;
					a1Out = a1_895;
					a3Out = a3_897;
					a4Out = a4_898;
					s3Out = s3_904;
					s4Out = s4_905;
					s7Out = s7_920;
					s9Out = s9_921;
					mstatusOut = mstatus_916;
					return ra_917;
				case 0x01:
				case 0x03:
l230462AE:
					if ((a1 & 0x007F) != 0x04)
					{
						if ((word32) *((word32) a0 + 8) == (word32) g_w4200D7E8)
						{
							if ((a1 & 0x007F) == 0x06)
							{
								0x00 = (int8) dwArg0128;
								ptr32 a0_815;
								Eq_238808 a1_816;
								Eq_2 a3_818;
								Eq_2 a4_819;
								Eq_2 s3_827;
								Eq_2 s4_828;
								Eq_2 s7_831;
								ptr32 s9_833;
								ptr32 mstatus_839;
								Eq_2 ra_822 = bt_mesh_lpn_friend_clear_cfm(ra, s4, a2, 0x4200D6BC, s2, s3, dwArg78, s5, s6, s7, s5, mstatus, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg38, dwArg48, s5, s1, ra, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out a0_815, out a1_816, out a3_818, out a4_819, out s3_827, out s4_828, out s7_831, out s9_833, out mstatus_839);
								s0Out = s4;
								a0Out = a0_815;
								a1Out = a1_816;
								a3Out = a3_818;
								a4Out = a4_819;
								s3Out = s3_827;
								s4Out = s4_828;
								s7Out = s7_831;
								s9Out = s9_833;
								mstatusOut = mstatus_839;
								return ra_822;
							}
							if ((a4_1369 & 0x04) == 0x00)
							{
								a0_248 = (struct Eq_274 *) &g_t230BA2CC;
								goto l23046020;
							}
							if ((a1 & 0x007F) == 0x02)
							{
								0x00 = (int8) dwArg0128;
								ptr32 a0_657;
								Eq_238808 a1_658;
								Eq_2 a3_660;
								Eq_2 a4_661;
								ptr32 mstatus_665;
								Eq_2 s0_667;
								Eq_2 s3_672;
								Eq_2 s4_673;
								Eq_2 s7_676;
								ptr32 s9_678;
								Eq_2 ra_666 = bt_mesh_lpn_friend_update(ra, a2, a0, a2, 0x4200D6BC, s2, s3, dwArg78, s5, s6, s7, s5, mstatus, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg2C, dwArg38, dwArg48, dwArg50, s7, s5, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0158, out s0_667, out a0_657, out a1_658, out a3_660, out a4_661, out s3_672, out s4_673, out s7_676, out s9_678, out mstatus_665);
								s0Out = s0_667;
								a0Out = a0_657;
								a1Out = a1_658;
								a3Out = a3_660;
								a4Out = a4_661;
								s3Out = s3_672;
								s4Out = s4_673;
								s7Out = s7_676;
								s9Out = s9_678;
								mstatusOut = mstatus_665;
								return ra_666;
							}
							if ((a1 & 0x007F) == 0x09)
							{
								0x00 = (int8) dwArg0128;
								ptr32 a0_699;
								Eq_238808 a1_700;
								Eq_2 a3_702;
								Eq_2 a4_703;
								Eq_2 s0_708;
								Eq_2 s3_713;
								Eq_2 s4_714;
								Eq_2 s7_717;
								ptr32 s9_719;
								ptr32 mstatus_723;
								Eq_2 ra_707 = bt_mesh_lpn_friend_sub_cfm(ra, s4, a2, a2, 0x4200D6BC, s2, dwArg78, mstatus, dwArg04, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg50, s7, s5, dwArg78, dwArg7C, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s0_708, out a0_699, out a1_700, out a3_702, out a4_703, out s3_713, out s4_714, out s7_717, out s9_719, out mstatus_723);
								s0Out = s0_708;
								a0Out = a0_699;
								a1Out = a1_700;
								a3Out = a3_702;
								a4Out = a4_703;
								s3Out = s3_713;
								s4Out = s4_714;
								s7Out = s7_717;
								s9Out = s9_719;
								mstatusOut = mstatus_723;
								return ra_707;
							}
						}
						word32 a5_1474;
						word32 s10_1481;
						word32 s11_1482;
						word32 t4_1483;
						word32 s8_1480;
						word32 s2_1476;
						word32 s5_1478;
						word32 s6_1479;
						word32 s4_1477;
						word32 s1_1471;
						word32 a0_1472;
						word32 a2_1473;
						word32 a7_1475;
						ra = printf(ra, &g_t230BA2FC, 0x4200D6BC, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_1471, out a0_1472, out a1_1362, out a2_1473, out a3, out a4_1369, out a5_1474, out a7_1475, out s2_1476, out s3, out s4_1477, out s5_1478, out s6_1479, out s7, out s8_1480, out s9, out s10_1481, out s11_1482, out t4_1483);
						a0_1360 = ~0x01;
						goto l23046026;
					}
					else
					{
						0x00 = (int8) dwArg0128;
						Eq_238808 a1_855;
						Eq_2 a3_857;
						Eq_2 a4_858;
						ptr32 mstatus_862;
						Eq_2 s3_868;
						Eq_2 s4_869;
						Eq_2 s7_872;
						ptr32 s9_874;
						ptr32 a0_882;
						Eq_2 ra_863 = bt_mesh_lpn_friend_offer(ra, s4, a2, a0, a2, s2, s7, mstatus, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg48, s5, s1, ra, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out a0_882, out a1_855, out a3_857, out a4_858, out s3_868, out s4_869, out s7_872, out s9_874, out mstatus_862);
						s0Out = s4;
						a0Out = a0_882;
						a1Out = a1_855;
						a3Out = a3_857;
						a4Out = a4_858;
						s3Out = s3_868;
						s4Out = s4_869;
						s7Out = s7_872;
						s9Out = s9_874;
						mstatusOut = mstatus_862;
						return ra_863;
					}
				case 0x02:
					0x00 = (int8) dwArg0128;
					ptr32 a0_596;
					Eq_238808 a1_597;
					Eq_2 a3_599;
					Eq_2 a4_600;
					Eq_2 s3_609;
					Eq_2 s4_610;
					Eq_2 s7_613;
					ptr32 s9_615;
					ptr32 mstatus_619;
					Eq_2 s0_620;
					Eq_2 ra_604 = bt_mesh_friend_req(ra, a2, a0, a2, 0x4200D6BC, s2, s3, dwArg78, s5, s6, s7, s5, mstatus, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg48, ra, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_620, out a0_596, out a1_597, out a3_599, out a4_600, out s3_609, out s4_610, out s7_613, out s9_615, out mstatus_619);
					s0Out = s0_620;
					a0Out = a0_596;
					a1Out = a1_597;
					a3Out = a3_599;
					a4Out = a4_600;
					s3Out = s3_609;
					s4Out = s4_610;
					s7Out = s7_613;
					s9Out = s9_615;
					mstatusOut = mstatus_619;
					return ra_604;
				case 0x04:
					0x00 = (int8) dwArg0128;
					ptr32 a0_556;
					Eq_238808 a1_557;
					Eq_2 a3_559;
					Eq_2 a4_560;
					ptr32 mstatus_564;
					Eq_2 s0_566;
					Eq_2 s3_571;
					Eq_2 s4_572;
					Eq_2 s7_575;
					ptr32 s9_577;
					Eq_2 ra_565 = bt_mesh_friend_clear(ra, s4, a2, 0x4200D6BC, a5_426, s2, s3, dwArg78, s5, s6, s7, mstatus, dwArg00, dwArg04, dwArg08, dwArg18, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_566, out a0_556, out a1_557, out a3_559, out a4_560, out s3_571, out s4_572, out s7_575, out s9_577, out mstatus_564);
					s0Out = s0_566;
					a0Out = a0_556;
					a1Out = a1_557;
					a3Out = a3_559;
					a4Out = a4_560;
					s3Out = s3_571;
					s4Out = s4_572;
					s7Out = s7_575;
					s9Out = s9_577;
					mstatusOut = mstatus_564;
					return ra_565;
				case 0x05:
					0x00 = (int8) dwArg0128;
					ptr32 a0_518;
					Eq_238808 a1_519;
					Eq_2 a3_521;
					Eq_2 a4_522;
					Eq_2 s3_528;
					Eq_2 s4_529;
					Eq_2 s7_543;
					ptr32 s9_544;
					Eq_2 ra_540 = bt_mesh_friend_clear_cfm(ra, a0, a2, a4_1369, mstatus, dwArg18, dwArg24, dwArg28, s1, ra, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgD8, dwArg0118, out a0_518, out a1_519, out a3_521, out a4_522, out s3_528, out s4_529, out s7_543, out s9_544);
					s0Out = s4;
					a0Out = a0_518;
					a1Out = a1_519;
					a3Out = a3_521;
					a4Out = a4_522;
					s3Out = s3_528;
					s4Out = s4_529;
					s7Out = s7_543;
					s9Out = s9_544;
					mstatusOut = mstatus;
					return ra_540;
				case 0x06:
					0x00 = (int8) dwArg0128;
					ptr32 a0_478;
					Eq_238808 a1_479;
					Eq_2 a3_481;
					Eq_2 a4_482;
					ptr32 mstatus_486;
					Eq_2 s0_488;
					Eq_2 s3_493;
					Eq_2 s4_494;
					Eq_2 s7_497;
					ptr32 s9_499;
					Eq_2 ra_487 = bt_mesh_friend_sub_add(ra, a2, a2, 0x4200D6BC, s2, s3, dwArg78, mstatus, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg50, s7, s5, dwArg78, dwArg7C, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_488, out a0_478, out a1_479, out a3_481, out a4_482, out s3_493, out s4_494, out s7_497, out s9_499, out mstatus_486);
					s0Out = s0_488;
					a0Out = a0_478;
					a1Out = a1_479;
					a3Out = a3_481;
					a4Out = a4_482;
					s3Out = s3_493;
					s4Out = s4_494;
					s7Out = s7_497;
					s9Out = s9_499;
					mstatusOut = mstatus_486;
					return ra_487;
				case 0x07:
					0x00 = (int8) dwArg0128;
					ptr32 a0_438;
					Eq_238808 a1_439;
					Eq_2 a3_441;
					Eq_2 a4_442;
					ptr32 mstatus_446;
					Eq_2 s0_448;
					Eq_2 s3_453;
					Eq_2 s4_454;
					Eq_2 s7_457;
					ptr32 s9_459;
					Eq_2 ra_447 = bt_mesh_friend_sub_rem(ra, a2, a2, 0x4200D6BC, s2, mstatus, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg50, s7, s5, ra, dwArg78, dwArg7C, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_448, out a0_438, out a1_439, out a3_441, out a4_442, out s3_453, out s4_454, out s7_457, out s9_459, out mstatus_446);
					s0Out = s0_448;
					a0Out = a0_438;
					a1Out = a1_439;
					a3Out = a3_441;
					a4Out = a4_442;
					s3Out = s3_453;
					s4Out = s4_454;
					s7Out = s7_457;
					s9Out = s9_459;
					mstatusOut = mstatus_446;
					return ra_447;
				}
			}
			goto l23046082;
		}
		if ((word32) *((word32) a2 + 4) <= 0x02)
		{
			a0_248 = (struct Eq_274 *) &g_t230BA278;
l23046020:
			word32 t4_1517;
			word32 s10_1515;
			word32 s11_1516;
			word32 s6_1513;
			word32 s8_1514;
			word32 s4_1511;
			word32 s5_1512;
			word32 s2_1510;
			word32 a7_1509;
			word32 a5_1508;
			word32 a2_1507;
			word32 a0_1506;
			word32 s1_1505;
			ra = printf(ra, a0_248, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_1505, out a0_1506, out a1_1362, out a2_1507, out a3, out a4_1369, out a5_1508, out a7_1509, out s2_1510, out s3, out s4_1511, out s5_1512, out s6_1513, out s7, out s8_1514, out s9, out s10_1515, out s11_1516, out t4_1517);
			a0_1360 = ~0x15;
l23046026:
			0x00 = (int8) dwArg0128;
			s0Out = s4;
			a0Out = a0_1360;
			a1Out = a1_1362;
			a3Out = a3;
			a4Out = a4_1369;
			s3Out = s3;
			s4Out = dwArg78;
			s7Out = s7;
			s9Out = s9;
			mstatusOut = mstatus;
			return ra;
		}
		Eq_2 a5_337 = (word32) g_w4200F44E;
		if ((word32) *((word32) a0 + 0x0A) != a5_337)
		{
			word32 t4_1539;
			word32 s11_1538;
			word32 s10_1537;
			word32 s8_1536;
			word32 s6_1535;
			word32 s5_1534;
			word32 s4_1533;
			word32 s2_1532;
			word32 a7_1531;
			word32 a5_1530;
			word32 a2_1529;
			word32 a0_1528;
			word32 s1_1527;
			ra = printf(ra, &g_t230BA298, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_1527, out a0_1528, out a1_1362, out a2_1529, out a3, out a4_1369, out a5_1530, out a7_1531, out s2_1532, out s3, out s4_1533, out s5_1534, out s6_1535, out s7, out s8_1536, out s9, out s10_1537, out s11_1538, out t4_1539);
		}
		else
		{
			struct Eq_193726 * a5_342;
			word32 a5_1526;
			word32 a4_1525;
			word32 a1_1524;
			word32 a2_1523;
			word32 a1_1522;
			ra = bt_mesh_heartbeat(ra, (word32) *((word32) a0 + 8), (word32) *((word32) a0 + 0x0A), 0x01 - (word32) (*((word32) a0 + 0x0D)) + (net_buf_simple_pull_u8(a5_337, out a1_1522, out a2_1523, out a5_342) & 0x007F) & 0x00FF, net_buf_simple_pull_be16(a5_342, out a1_1524, out a4_1525, out a5_1526), dwLoc30, s8, s6, dwLoc08, dwArg40, dwArg44, s7, dwArg68, dwArg8C, out a1_1362, out a3, out a4_1369, out s3, out s7, out s9);
		}
		goto l23046082;
	}
	if ((word32) *((word32) a2 + 4) <= 0x05)
	{
		a0_248 = (struct Eq_274 *) &g_t230BA22C;
		goto l23046020;
	}
	Eq_2 a4_38;
	word32 a5_1469;
	Eq_2 a0_35 = net_buf_simple_pull_be16((struct Eq_193726 *) 0x05, out a1_1362, out a4_38, out a5_1469);
	s3 = (word32) (word16) (a0_35 >> 0x02) & 0x01FFFFFF;
	int32 a5_46 = (int32) *((word32) a0 + 32);
	if (a5_46 < 0x00)
	{
		Eq_238990 a5_324 = g_t4200D6BC - (a5_46 & 1);
		*a3.u0 = a5_324 << 24 | s3;
		*((byte) a3.u0 + 4) = a5_324 >> 0x08;
		a4_1369 = a5_324 >> 0x08;
		goto l23046082;
	}
	struct Eq_238971 * a1_50;
	word32 a5_1470;
	Eq_196083 a0_49 = net_buf_simple_pull_be32(a4_38, out a1_50, out a5_1470);
	Eq_2 a0_56 = (word32) *((word32) a0 + 8);
	uint32 a4_58 = a0_35 >> 0x0F << 0x10;
	word32 s2_61 = 0x00;
	while (true)
	{
		struct Eq_239272 * a5_67 = a1_50->ptr0020;
		Eq_239003 a6_68 = a5_67->t0024;
		a3 = a1_50 & 0x01FFFFFF;
		if ((a1_50 & 0x01FFFFFF) == s3)
		{
			a3 = (word32) a5_67->w0028;
			if (a3 == a0_56)
			{
l230460E2:
				Eq_2 ra_165;
				Eq_2 a3_155;
				Eq_2 a4_156;
				Eq_2 s2_209;
				int32 a1_212;
				struct Eq_238357 * a5_211;
				*a3 = a1_50;
				*((word32) a3 + 4) = a6_68;
				Eq_2 s0_203 = s2_61 + 96;
				if (a0_49 == 0x00)
				{
					word32 s9_1495;
					word32 s10_1496;
					word32 t4_1498;
					word32 s11_1497;
					word32 a0_1485;
					word32 s5_1491;
					word32 s6_1492;
					word32 s7_1493;
					word32 s8_1494;
					word32 s4_1490;
					word32 a1_1486;
					word32 a7_1488;
					word32 s3_1489;
					word32 a2_1487;
					word32 s1_1484;
					ra_165 = printf(ra, &g_t230BA244, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_1484, out a0_1485, out a1_1486, out a2_1487, out a3_155, out a4_156, out a5_211, out a7_1488, out s2_209, out s3_1489, out s4_1490, out s5_1491, out s6_1492, out s7_1493, out s8_1494, out s9_1495, out s10_1496, out s11_1497, out t4_1498);
					a1_212 = -72;
				}
				else
				{
					Eq_2 a4_111;
					if (((word32) *((word32) s0_203 + 1107380098) & 0x1F) < find_msb_set(a0_49, out a3, out a4_111) + ~0x00)
					{
						a0_248 = (struct Eq_274 *) &g_t230BA254;
						goto l23046020;
					}
					Eq_2 s5_140;
					word32 a4_1501;
					word32 a5_1502;
					word32 s3_1503;
					word32 s8_1504;
					word32 a3_1500;
					word32 a0_1499;
					Eq_2 s4_139;
					word32 s2_133;
					uint32 a2_128;
					Eq_2 s6_141;
					Eq_2 a1_135;
					Eq_2 s1_132 = k_delayed_work_cancel((word32) s0_203 + 1107380112, a3, a4_111, mstatus, dwArg04, dwArg08, dwArg78, dwArg88, dwArgB8, dwArgF8, out a0_1499, out a1_135, out a2_128, out a3_1500, out a4_1501, out a5_1502, out s2_133, out s3_1503, out s4_139, out s5_140, out s6_141, out s8_1504);
					Eq_2 s8_150 = 0x01;
					ra_165 = ra;
					s5_184 = s5_140;
					while (true)
					{
						Eq_2 s5_184;
						word32 a0_153 = find_lsb_set(s4_139, out a3_155, out a4_156);
						if (a0_153 == 0x00)
							break;
						word32 s0_157 = a0_153 + -1;
						word32 a0_164 = Mem163[(s6_141 + (a0_153 + -1) << 2) + s1_132 + 4:int32];
						if (a0_164 != 0x00)
						{
							struct Eq_239632 * s3_182;
							word32 a5_1521;
							word32 a3_1519;
							word32 a4_1520;
							word32 a0_1518;
							ra_165 = net_buf_unref(ra_165, s1_132, a0_164, a1_135, a4_156, mstatus, dwLoc30, s8, s6, dwLoc08, dwArg48, s7, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_157, out s1_132, out a0_1518, out a1_135, out a2_128, out a3_1519, out a4_1520, out a5_1521, out s2_133, out s3_182, out s4_139, out s5_184, out s6_141, out s8_150, out mstatus);
							word32 a5_195 = (word32) *((word32) s5_140 + 43);
							s3_182->dw0004 = 0x00;
							*((word32) s5_140 + 43) = (byte) (a5_195 + ~0x00);
						}
						s0_203 = ~(s8_150 << s0_157);
						s4_139 &= s0_203;
					}
					s2_209 = s2_133 + 96;
					word32 s1_210 = s1_132 + s2_209;
					a5_211 = (word32) *((word32) s1_210 + 43);
					if (a5_211 != null)
					{
						ra = seg_tx_send_unacked(ra_165, s1_210, s5_184, a2_128, a5_211, s2_209, s4_139, s5_184, s6_141, s8_150, mstatus, dwLoc30, s8, s6, s2, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg08, dwArg0C, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg48, s5, ra, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, out a1_1362, out a3, out a4_1369, out s3, out s7, out s9, out mstatus);
						goto l23046082;
					}
					a1_212 = 0x00;
				}
				ra = seg_tx_complete(ra_165, s0_203, a1_212, a3_155, a4_156, a5_211, s2_209, mstatus, s8, s6, s2, dwLoc18, dwLoc14, dwLoc0C, dwLoc08, dwArg00, dwArg08, dwArg0C, dwArg18, dwArg20, dwArg24, dwArg28, dwArg38, dwArg48, s5, ra, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, out a1_1362, out a3, out a4_1369, out s3, out s7, out s9, out mstatus);
l23046082:
				a0_1360 = 0x00;
				goto l23046026;
			}
			if (a4_58 >> 16 != 0x00)
			{
				struct Eq_239300 * a3_77 = s2_61 + 96;
				a3 = (char *) a3_77 + 1107380056;
				if ((word32) a5_67->b002B == ((word32) a3_77->w42014782 & 0x1F) + 0x01)
				{
					a3_77->w42014780 = (word16) a0_56;
					goto l230460E2;
				}
			}
		}
		if (s2_61 == 0x01)
		{
			a0_248 = (struct Eq_274 *) &g_t230BA31C;
			goto l23046020;
		}
		s2_61 = 0x01;
	}
}

// 23046372: void bt_mesh_set_hb_sub_dst(Register word32 a0)
// Called from:
//      heartbeat_sub_set
//      bt_mesh_cfg_reset
void bt_mesh_set_hb_sub_dst(word32 a0)
{
	g_w4200F44E = (word16) a0;
}

// 2304637C: Register word32 bt_mesh_tx_in_progress()
// Called from:
//      poll_timeout.constprop.4
//      bt_mesh_net_iv_update
word32 bt_mesh_tx_in_progress()
{
	return (word32) (((word32) g_a42014783[0] | (word32) g_b420147E3) != 0x00);
}

// 23046394: Register ptr32 bt_mesh_app_key_find(Register ptr32 a0, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      bt_mesh_model_publish
//      mod_publish
//      _mod_pub_set.isra.1
//      app_key_set
//      app_key_del
//      bt_mesh_trans_send
ptr32 bt_mesh_app_key_find(ptr32 a0, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a5_13;
	ptr32 a3_18 = 0x4200D6BC;
	ptr32 a4_20 = 0x4200D6BC;
	if ((word32) g_w4200D870 != 0x0FFFFFFF && (word32) g_w4200D872 == a0)
		a5_13 = 0x4200D870;
	else
	{
		a3_18 = 0x0FFFFFFF;
		a5_13 = 0x00;
		if ((word32) g_w4200D898 != 0x0FFFFFFF)
		{
			a4_20 = (word32) g_w4200D89A;
			if (a4_20 == a0)
				a5_13 = 0x4200D898;
		}
	}
	a3Out = a3_18;
	a4Out = a4_20;
	a5Out = a5_13;
	return a5_13;
}

