pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 230463E0: Register Eq_2 bt_mesh_trans_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0164, Stack Eq_2 dwArg0184, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_184252 a5Out, Register out Eq_2 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      blemesh_seg_send
//      model_send
//      mod_publish
Eq_2 bt_mesh_trans_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0124, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0164, Eq_2 dwArg0184, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_184252 & a5Out, union Eq_2 & s2Out, ptr32 & mstatusOut)
{
	Eq_2 a4_1017;
	Eq_184252 a5_1073;
	Eq_2 s2_1077;
	Eq_2 s0_1023;
	struct Eq_274 * a0_1310;
	Eq_2 s10_134 = a0;
	word32 a4_2807;
	if (net_buf_simple_tailroom(a1, out a4_2807) <= 0x03)
	{
		a0_1310 = (struct Eq_274 *) &g_t230BA0F4;
		goto l23046418;
	}
	if ((word32) *((word32) a1 + 4) > 11)
		((word32) *((word32) a0 + 4) + 0x0A)->u0 = 0x01;
	s2_1077 = *((word32) a0 + 4);
	ptr32 a0_53 = (word32) *((word32) s2_1077 + 2);
	if (a0_53 == 0x0FFFFFFE)
		*((word32) a0 + 11) = (byte) ((word32) *((word32) a0 + 11) & 0x03);
	else
	{
		word32 a3_2808;
		Eq_2 a0_54 = bt_mesh_app_key_find(a0_53, out a3_2808, out a4_1017, out a5_1073);
		if (a0_54 == 0x00)
			goto l2304641C;
		ui32 a4_67;
		ui32 a5_62 = (word32) *((word32) a0 + 11);
		if ((word32) *((word32) *a0 + 31) == 0x02 && (word32) (*((word32) a0_54 + 4)) != 0x00)
			a4_67 = (word32) *((word32) a0_54 + 22);
		else
			a4_67 = (word32) *((word32) a0_54 + 5);
		*((word32) a0 + 11) = (byte) (a5_62 & 0x03 | a4_67 << 2);
	}
	ui32 a0_103 = (word32) *((word32) s2_1077 + 0x0A);
	if (a0_103 != 0x00)
	{
		word32 a4_2809;
		a0_103 = (word32) (net_buf_simple_tailroom(a1, out a4_2809) < 8) ^ 1;
	}
	Eq_2 ra_132;
	Eq_2 a5_108 = *((word32) a0 + 4);
	*((word32) a0 + 11) = (byte) ((a0_103 & 0x01) << 1 | (word32) (*((word32) a0 + 11)) & ~0x02);
	word32 a0_111 = (word32) *((word32) a5_108 + 4);
	Eq_2 a4_113 = 0x00;
	ra_132 = ra;
	if ((a0_111 ^ 0x08000000) < 0x04000000)
	{
		Eq_2 a0_125;
		word32 s1_2810;
		word32 a3_2811;
		word32 s2_2812;
		word32 s3_2813;
		word32 s4_2814;
		word32 s5_2815;
		word32 s6_2816;
		word32 s9_2818;
		word32 s7_2817;
		word32 s11_2819;
		ra_132 = bt_mesh_label_uuid_get(ra, a0_111, 0x04000000, dwLoc58, dwLoc10, dwLoc0C, dwArg18, s3, out s1_2810, out a0_125, out a3_2811, out s2_2812, out s3_2813, out s4_2814, out s5_2815, out s6_2816, out s7_2817, out s9_2818, out s10_134, out s11_2819);
		a4_113 = a0_125;
	}
	Eq_2 a2_164 = *((word32) s10_134 + 8) >> 25 & 0x01;
	Eq_2 a6_155 = (word32) *((word32) *((word32) s10_134 + 4) + 4);
	Eq_2 a7_158 = g_t4200D6C0;
	Eq_2 a5_160 = (word32) *((word32) s10_134 + 8);
	Eq_2 s2_166 = g_t4200D6BC;
	int32 a0_177 = atomic_get(0x4200D6C4) >> 2 & 0x01;
	0x00 = (int8) dwArg0124;
	Eq_2 dwLoc60_1421 = a2_164;
	dwLoc64 = a6_155;
	Eq_2 s2_183 = s2_166 - a0_177;
	struct Eq_240098 * s1_199;
	word32 s11_201;
	word32 s3_203;
	Eq_2 s5_205;
	struct Eq_240102 * s6_206;
	Eq_2 s10_1025;
	ra = bt_mesh_app_encrypt(ra_132, dwArg0164, a2_164, a4_113, a7_158, dwArg24, ra, dwArgB8, out s1_199, out a3, out a4_1017, out a5_1073, out s2_1077, out s3_203, out s5_205, out s6_206, out s10_1025, out s11_201);
	s0_1023 = dwArg0164;
	if (dwArg0164 == 0x00)
	{
		Eq_2 a5_220 = *((word32) s10_1025 + 4);
		if ((word32) *((word32) a5_220 + 0x0A) == 0x00)
		{
			word32 a0_232;
			Eq_2 a3_235;
			Eq_2 a5_237;
			struct Eq_240161 * s1_243;
			struct Eq_240162 * s10_244;
			Eq_2 s9_253;
			word32 s0_2820;
			word32 s2_2823;
			word32 s5_2826;
			word32 s8_2829;
			word32 a1_2821;
			word32 a4_2822;
			word32 s4_2825;
			word32 s3_2824;
			word32 s6_2827;
			word32 s7_2828;
			word32 s11_2830;
			Eq_2 ra_241 = bt_mesh_adv_create(ra, (word32) *((word32) s10_1025 + 0x0A), 0x00, a5_220, s5_205, mstatus, dwLoc30, dwLoc2C, dwLoc08, dwArg14, a5_160, dwArg28, dwArg68, dwArg88, dwArgB8, out s0_2820, out s1_243, out a0_232, out a1_2821, out a3_235, out a4_2822, out a5_237, out s2_2823, out s3_2824, out s4_2825, out s5_2826, out s6_2827, out s7_2828, out s8_2829, out s9_253, out s10_244, out s11_2830, out mstatus);
			if (a0_232 == 0x00)
			{
				word32 a7_2884;
				word32 s8_2890;
				word32 s9_2891;
				word32 s10_2892;
				word32 s11_2893;
				word32 t4_2894;
				word32 s3_2885;
				word32 s6_2888;
				word32 s7_2889;
				word32 s4_2886;
				word32 s5_2887;
				word32 a2_2882;
				word32 a3_2883;
				word32 a0_2880;
				word32 a1_2881;
				word32 s1_2879;
				printf(ra_241, &g_t230B6700, a3_235, a2, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_2879, out a0_2880, out a1_2881, out a2_2882, out a3_2883, out a4_1017, out a5_1073, out a7_2884, out s2_1077, out s3_2885, out s4_2886, out s5_2887, out s6_2888, out s7_2889, out s8_2890, out s9_2891, out s10_2892, out s11_2893, out t4_2894);
				goto l2304675E;
			}
			net_buf_simple_reserve((word32 *) 0x09, a5_237);
			Eq_2 a1_268 = 0x00;
			if ((word32) *((word32) s10_244->t0004 + 2) != 0x0FFFFFFE)
				a1_268 = s10_244->t0008 >> 26 | 64;
			Eq_2 s6_360;
			Eq_2 a2_338;
			Eq_2 s4_349;
			Eq_2 s3_348;
			Eq_2 s10_358;
			Eq_2 s2_347;
			Eq_2 s11_359;
			word32 a5_2921;
			word32 a1_2922;
			word32 a4_2925;
			word32 a5_2926;
			word32 a2_2923;
			word32 a3_2924;
			net_buf_simple_add_mem(a0_232 + 8, a1_268, (word32) s1_243->w0004, net_buf_simple_add_u8(a0_232 + 8, a1_268, 0x0FFFFFFE, out a5_2921), out a1_2922, out a2_2923, out a3_2924, out a4_2925, out a5_2926);
			word32 a0_310;
			Eq_2 a3_313;
			struct Eq_240750 * a5_315;
			Eq_2 s1_318;
			Eq_2 s2_319;
			Eq_2 s3_320;
			Eq_2 s4_321;
			Eq_2 s6_323;
			Eq_2 s7_324;
			Eq_2 s8_325;
			word32 a4_2927;
			word32 s5_2928;
			Eq_2 s0_317 = bt_mesh_friend_queue_has_space((word32) s10_244->ptr0000->w001C, (word32) s10_244->t0008, (word32) *((word32) s10_244->t0004 + 4), 0x00, 0x01, dwArgB8, out s1_318, out a0_310, out a3_313, out a4_2927, out a5_315, out s2_319, out s3_320, out s4_321, out s5_2928, out s6_323, out s7_324, out s8_325);
			if (a0_310 == 0x00)
			{
				if ((int32) *((word32) s10_244->t0004 + 4) > 0x00)
				{
					Eq_2 a1_493;
					Eq_2 a4_496;
					Eq_2 s1_499;
					Eq_2 s2_502;
					word32 a2_2945;
					word32 a3_2946;
					word32 s3_2965;
					word32 s6_2968;
					word32 s8_2969;
					word32 s4_2966;
					word32 s5_2967;
					word32 s3_2949;
					word32 a2_2963;
					word32 a3_2964;
					word32 s5_2951;
					word32 s6_2952;
					word32 s7_2953;
					word32 s0_2959;
					word32 s1_2960;
					word32 a0_2961;
					word32 a1_2962;
					word32 s8_2954;
					word32 s11_2957;
					word32 t4_2958;
					word32 s9_2955;
					word32 s10_2956;
					word32 s4_2950;
					word32 a7_2948;
					word32 a5_2947;
					word32 a0_2944;
					net_buf_unref(printf(ra_241, &g_t230BA1EC, a3_313, a2, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_499, out a0_2944, out a1_493, out a2_2945, out a3_2946, out a4_496, out a5_2947, out a7_2948, out s2_502, out s3_2949, out s4_2950, out s5_2951, out s6_2952, out s7_2953, out s8_2954, out s9_2955, out s10_2956, out s11_2957, out t4_2958), s1_499, s2_502, a1_493, a4_496, mstatus, s2_183, dwLoc6C, a2, s6, dwArg08, dwArg14, dwArg28, s7, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArg0108, out s0_2959, out s1_2960, out a0_2961, out a1_2962, out a2_2963, out a3_2964, out a4_1017, out a5_1073, out s2_1077, out s3_2965, out s4_2966, out s5_2967, out s6_2968, out s8_2969, out mstatus);
					goto l2304675E;
				}
				word32 s8_2941;
				word32 a3_2935;
				word32 s9_2942;
				word32 s1_2932;
				word32 t4_2943;
				word32 a5_2937;
				word32 a7_2938;
				word32 s5_2939;
				word32 s7_2940;
				word32 a4_2936;
				word32 a1_2934;
				word32 a0_2933;
				printf(ra_241, &g_t230BA210, a3_313, a2, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_2932, out a0_2933, out a1_2934, out a2_338, out a3_2935, out a4_2936, out a5_2937, out a7_2938, out s2_347, out s3_348, out s4_349, out s5_2939, out s6_360, out s7_2940, out s8_2941, out s9_2942, out s10_358, out s11_359, out t4_2943);
			}
			else
			{
				word32 a0_336;
				Eq_2 a1_337;
				Eq_2 a4_340;
				Eq_2 s1_346;
				word32 s9_2931;
				word32 a5_2929;
				word32 s7_2930;
				Eq_2 ra_344 = bt_mesh_friend_enqueue_tx(ra_241, s0_317, s1_318, 0x00, 0x01, s3_320, a5_315, s2_319, s3_320, s4_321, s6_323, s7_324, s8_325, s9_253, s10_244, mstatus, s2_183, dwLoc6C, a2, a6_155, a2_164, a4_113, dwLoc58, s6, dwLoc18, dwLoc14, dwLoc08, dwArg08, a7_158, dwArg28, s5, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, out s0_317, out s1_346, out a0_336, out a1_337, out a2_338, out a4_340, out a5_2929, out s2_347, out s3_348, out s4_349, out s6_360, out s7_2930, out s9_2931, out s10_358, out s11_359, out mstatus);
				if (a0_336 != 0x00 && (int32) (*((word32) (*((word32) s10_358 + 4)) + 4)) > 0x00)
				{
					word32 a0_368;
					<anonymous> * a5_373;
					Eq_237183 s0_378;
					word32 a3_3019;
					word32 s4_3021;
					word32 s5_3022;
					word32 s6_3023;
					word32 s8_3024;
					word32 s3_3020;
					word32 a1_3017;
					word32 a2_3018;
					word32 s1_3016;
					send_cb_finalize(net_buf_unref(ra_344, s1_346, s2_347, a1_337, a4_340, mstatus, s2_183, dwLoc6C, a2, s6, dwArg08, dwArg14, dwArg28, s7, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArg0108, out s0_378, out s1_3016, out a0_368, out a1_3017, out a2_3018, out a3_3019, out a4_1017, out a5_373, out s2_1077, out s3_3020, out s4_3021, out s5_3022, out s6_3023, out s8_3024, out mstatus), s0_378, a0_368, s11_359, a5_373, a2_164, a4_113, out s0_1023, out a5_1073);
					goto l23046596;
				}
			}
			Eq_2 a0_459;
			Eq_2 a3_462;
			Eq_2 a4_463;
			Eq_184252 a5_464;
			ptr32 mstatus_467;
			Eq_2 s0_469;
			Eq_2 s1_470;
			Eq_2 s2_473;
			word32 s3_3005;
			word32 s4_3006;
			word32 s5_3007;
			word32 s11_3013;
			word32 s6_3008;
			word32 s9_3011;
			word32 s10_3012;
			word32 s7_3009;
			word32 s8_3010;
			word32 a1_3004;
			Eq_2 ra_468 = bt_mesh_net_send(dwLoc24, s0_317, a6_155, s10_358, s2_347, a2_338, s11_359, s2_347, s3_348, s4_349, s6_360, mstatus, dwArg00, dwArg08, dwArg0C, dwArg10, dwArg14, a7_158, dwArg28, s9, s7, s5, dwArg48, dwArg58, dwArg5C, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_469, out s1_470, out a0_459, out a1_3004, out a3_462, out a4_463, out a5_464, out s2_473, out s3_3005, out s4_3006, out s5_3007, out s6_3008, out s7_3009, out s8_3010, out s9_3011, out s10_3012, out s11_3013, out mstatus_467);
			s0Out = s0_469;
			s1Out = s1_470;
			a0Out = a0_459;
			a3Out = a3_462;
			a4Out = a4_463;
			a5Out = a5_464;
			s2Out = s2_473;
			mstatusOut = mstatus_467;
			return ra_468;
		}
		Eq_240206 a1_562 = (word32) s1_199->w0004;
		if (a1_562 == 0x00)
		{
			a0_1310 = (struct Eq_274 *) &g_t230BA120;
l23046418:
			word32 s11_2845;
			word32 s7_2841;
			word32 s3_2837;
			word32 a1_2833;
			word32 s8_2842;
			word32 t4_2846;
			word32 s4_2838;
			word32 a2_2834;
			word32 s10_2844;
			word32 s9_2843;
			word32 s6_2840;
			word32 s5_2839;
			word32 a7_2836;
			word32 a3_2835;
			word32 a0_2832;
			word32 s1_2831;
			printf(ra, a0_1310, a3, a2, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_2831, out a0_2832, out a1_2833, out a2_2834, out a3_2835, out a4_1017, out a5_1073, out a7_2836, out s2_1077, out s3_2837, out s4_2838, out s5_2839, out s6_2840, out s7_2841, out s8_2842, out s9_2843, out s10_2844, out s11_2845, out t4_2846);
l2304641C:
			s0_1023.u0 = ~0x15;
			goto l23046596;
		}
		if (a1_562 > 72)
		{
			word32 s11_2861;
			word32 s7_2857;
			word32 s3_2853;
			word32 a1_2849;
			word32 s4_2854;
			word32 s8_2858;
			word32 a2_2850;
			word32 t4_2862;
			word32 s10_2860;
			word32 s9_2859;
			word32 s6_2856;
			word32 s5_2855;
			word32 a7_2852;
			word32 a3_2851;
			word32 a0_2848;
			word32 s1_2847;
			printf(ra, &g_t230BA140, a3, a2, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_2847, out a0_2848, out a1_2849, out a2_2850, out a3_2851, out a4_1017, out a5_1073, out a7_2852, out s2_1077, out s3_2853, out s4_2854, out s5_2855, out s6_2856, out s7_2857, out s8_2858, out s9_2859, out s10_2860, out s11_2861, out t4_2862);
			s0_1023.u0 = -36;
			goto l23046596;
		}
		word32 s3_593;
		Eq_2 a3_591 = (word32) g_a42014783[0];
		if (a3_591 != 0x00)
		{
			if ((word32) g_b420147E3 != 0x00)
			{
				word32 s10_2876;
				word32 s11_2877;
				word32 t4_2878;
				word32 a2_2866;
				word32 a3_2867;
				word32 a7_2868;
				word32 s3_2869;
				word32 s4_2870;
				word32 s5_2871;
				word32 s6_2872;
				word32 s9_2875;
				word32 s7_2873;
				word32 s8_2874;
				word32 a1_2865;
				word32 s1_2863;
				word32 a0_2864;
				printf(ra, &g_t230BA16C, a3_591, a2, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_2863, out a0_2864, out a1_2865, out a2_2866, out a3_2867, out a4_1017, out a5_1073, out a7_2868, out s2_1077, out s3_2869, out s4_2870, out s5_2871, out s6_2872, out s7_2873, out s8_2874, out s9_2875, out s10_2876, out s11_2877, out t4_2878);
				s0_1023.u0 = ~0x0F;
				goto l23046596;
			}
			s3_593 = 0x01;
		}
		else
			s3_593 = 0x00;
		word32 s5_623 = s3_593 + 96;
		Eq_2 a3_626 = (word32) *((word32) a5_220 + 2);
		dwLoc64.u0 = 0x0080;
		Eq_2 s9_1034 = s5_623 + 0x42014758;
		if (a3_626 != 0x0FFFFFFE)
			dwLoc64 = *((word32) s10_1025 + 8) >> 0x1A | 0x00C0;
		struct Eq_240419 * s4_641 = s3_593 + 96;
		int32 s8_651 = s6_206->dw06BC;
		s4_641->w42014780 = (word16) (word32) *((word32) a5_220 + 4);
		uint32 a5_659 = (word32) s1_199->w0004 + ~0x00 >> 0x0C;
		s4_641->b42014782 = (byte) ((word32) s4_641->b42014782 & ~0x1F | a5_659 & 0x1F);
		s4_641->b42014783 = (byte) ((a5_659 & 0x1F) + 0x01);
		Eq_240463 a0_671 = s8_651 - (atomic_get(s3_203 + 0x06C4) >> 2 & 0x01);
		s4_641->dw42014778 = a0_671 << 24 | s6_206->dw06C0;
		s4_641->dw4201477C = a0_671 >> 0x08;
		struct Eq_240487 * a5_678 = *s10_1025;
		s4_641->ptr42014758 = a5_678;
		ui32 a5_680 = (word32) a5_678->b001E;
		s4_641->dw4201478C = s11_201;
		ui32 a5_688 = (word32) s4_641->b42014782 & -33 | (a5_680 & 0x01) << 0x05;
		s4_641->b42014782 = (byte) a5_688;
		s4_641->dw42014788 = a5_688;
		int32 a5_695 = (word32) *((word32) *((word32) s10_1025 + 4) + 11);
		if (a5_695 == 0x00FF)
		{
			word32 a5_2895;
			s4_641->b42014784 = (byte) bt_mesh_default_ttl_get(out a5_2895);
		}
		else
			s4_641->b42014784 = (byte) a5_695;
		Eq_2 a3_1134;
		Eq_2 a4_1135;
		Eq_2 s2_1141;
		Eq_2 ra_1137;
		Eq_2 s9_1148;
		word32 a0_723;
		struct Eq_240557 * s4_734;
		uint32 s8_738;
		word32 a5_3025;
		word32 s3_1028;
		word32 s2_1027;
		Eq_2 a3_1016;
		Eq_2 s6_1031;
		Eq_2 s7_1032;
		struct Eq_241326 * s1_1024;
		Eq_2 s5_1042;
		s0_1023 = bt_mesh_friend_queue_has_space((word32) *((word32) *((word32) s7 + 1107380056) + 28), (word32) *((word32) s10_1025 + 8), (word32) *((word32) s7 + 0x42014780), a3_626, ((word32) *((word32) s7 + 1107380098) & 0x1F) + 0x01, dwArgB8, out s1_1024, out a0_723, out a3_1016, out a4_1017, out a5_3025, out s2_1027, out s3_1028, out s4_734, out s5_1042, out s6_1031, out s7_1032, out s8_738);
		if (a0_723 == 0x00 && (int32) s4_734->w0028 > 0x00)
		{
			word32 s6_2905;
			word32 a2_2899;
			word32 s7_2906;
			word32 s1_2896;
			word32 s10_2908;
			word32 s8_2907;
			word32 t4_2910;
			word32 s11_2909;
			word32 a5_2900;
			word32 s4_2903;
			word32 s5_2904;
			word32 a7_2901;
			word32 s3_2902;
			word32 a1_2898;
			word32 a0_2897;
			ra_1137 = printf(ra, &g_t230BA19C, a3_1016, a2, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_2896, out a0_2897, out a1_2898, out a2_2899, out a3_1134, out a4_1135, out a5_2900, out a7_2901, out s2_1141, out s3_2902, out s4_2903, out s5_2904, out s6_2905, out s7_2906, out s8_2907, out s9_1148, out s10_2908, out s11_2909, out t4_2910);
l23046758:
			word32 s11_2998;
			word32 s9_2997;
			word32 s7_2995;
			word32 s8_2996;
			word32 s5_2993;
			word32 s6_2994;
			word32 s3_2991;
			word32 s4_2992;
			word32 a1_2989;
			word32 a3_2990;
			word32 a0_2988;
			word32 s0_2987;
			seg_tx_reset(ra_1137, s0_1023, s9_1148, a3_1134, a4_1135, s2_1141, mstatus, dwLoc6C, a2, dwLoc60_1421, dwLoc58, dwLoc54, s8, s6, s2, dwLoc38, dwLoc34, dwLoc28, dwLoc20, dwLoc1C, dwLoc18, dwLoc08, dwArg08, s5_623 + 1107380088, dwArg24, dwArg28, s11, s5, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, out s0_2987, out a0_2988, out a1_2989, out a3_2990, out a4_1017, out a5_1073, out s2_1077, out s3_2991, out s4_2992, out s5_2993, out s6_2994, out s7_2995, out s8_2996, out s9_2997, out s11_2998, out mstatus);
l2304675E:
			s0_1023.u0 = -55;
			goto l23046596;
		}
		Eq_2 a5_781 = s8_738 << 0x1A >> 24;
		dwLoc60_1421 = a5_781;
		Eq_2 s4_1126 = 0x00;
		Eq_2 s8_1033 = s3_1028 + 96 + s2_1027;
		while (true)
		{
			Eq_2 a5_794 = (word32) s1_1024->w0004;
			if (a5_794 == 0x00)
				break;
			Eq_2 a0_803;
			Eq_2 a3_806;
			Eq_2 a5_808;
			struct Eq_240610 * s1_814;
			struct Eq_240162 * s10_815;
			Eq_2 s2_817;
			Eq_2 s3_818;
			uint32 s4_819;
			Eq_2 s6_821;
			Eq_2 s9_824;
			word32 a1_2911;
			word32 a4_2912;
			word32 s8_2915;
			word32 s11_2916;
			word32 s5_2913;
			word32 s7_2914;
			Eq_2 ra_812 = bt_mesh_adv_create(ra, (word32) *((word32) s10_1025 + 0x0A), 0x00, a5_794, s5_1042, mstatus, dwLoc30, dwLoc2C, dwLoc08, dwArg14, s8_738 >> 0x06, dwArg28, dwArg68, dwArg88, dwArgB8, out s0_1023, out s1_814, out a0_803, out a1_2911, out a3_806, out a4_2912, out a5_808, out s2_817, out s3_818, out s4_819, out s5_2913, out s6_821, out s7_2914, out s8_2915, out s9_824, out s10_815, out s11_2916, out mstatus);
			if (a0_803 == 0x00)
			{
				word32 t4_2986;
				word32 s10_2984;
				word32 s11_2985;
				word32 s1_2972;
				word32 a0_2973;
				word32 a1_2974;
				word32 s5_2980;
				word32 s6_2981;
				word32 s7_2982;
				word32 s8_2983;
				word32 a2_2975;
				word32 s3_2978;
				word32 s4_2979;
				word32 a5_2976;
				word32 a7_2977;
				ra_1137 = printf(ra_812, &g_t230BA1D0, a3_806, a2, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_2972, out a0_2973, out a1_2974, out a2_2975, out a3_1134, out a4_1135, out a5_2976, out a7_2977, out s2_1141, out s3_2978, out s4_2979, out s5_2980, out s6_2981, out s7_2982, out s8_2983, out s9_1148, out s10_2984, out s11_2985, out t4_2986);
				goto l23046758;
			}
			word32 a0_833 = *((word32) a5_808 + 20);
			((word32) a5_808 + 0x0A)->u0 = 0x04;
			Eq_2 a5_845;
			net_buf_simple_add_u8(a0_833 + 8, net_buf_simple_reserve((word32 *) 0x09, a5_808), a5_808, out a5_845);
			Eq_2 a5_854;
			net_buf_simple_add_u8(a0_833 + 8, s10_815->t0008 >> 18 & 0x0080 | a5_845, a5_845, out a5_854);
			0x00 = (int8) dwArg0184;
			word32 a5_2970;
			net_buf_simple_add_u8(a0_833 + 8, (s4_819 >> 0x03 | a5_854) & 0x00FF, a5_854, out a5_2970);
			ui32 a5_862 = (word32) *((word32) dwLoc0C + 42);
			word32 a5_2971;
			Eq_2 a4_869 = net_buf_simple_add_u8(a0_833 + 8, (s4_819 << 0x05 | a5_862 & 0x1F) & 0x00FF, a5_862 & 0x1F, out a5_2971);
			Eq_2 a1_871 = (word32) s1_814->w0004;
			if (a1_871 > 0x0C)
				a1_871.u0 = 0x0C;
			uint32 a5_875 = a1_871 << 0x10;
			Eq_2 s1_877 = *a1_871;
			Eq_2 a5_890;
			word32 a3_3001;
			word32 a4_3002;
			word32 a1_2999;
			word32 a2_3000;
			net_buf_simple_add_mem(a0_833 + 8, a1_871, a5_875 >> 16, a4_869, out a1_2999, out a2_3000, out a3_3001, out a4_3002, out a5_890);
			struct Eq_240750 * a5_904;
			word32 a1_3003;
			net_buf_simple_pull(s1_877, a5_890, out a1_3003, out a5_904);
			dwArg24 = a5_875 >> 16;
			ui32 a3_906 = (word32) *((word32) dwLoc0C + 42);
			word32 s4_1029;
			word32 a0_941;
			Eq_2 a1_942;
			Eq_2 a2_943;
			Eq_2 a4_945;
			Eq_2 s1_951;
			Eq_2 s2_952;
			Eq_2 s3_953;
			Eq_2 s4_954;
			ptr32 mstatus_962;
			Eq_2 s6_965;
			word32 a5_3014;
			word32 s11_3015;
			Eq_2 s0_950;
			Eq_2 ra_949 = bt_mesh_friend_enqueue_tx(ra_812, s0_1023, s1_877, dwArg0184, (a3_906 & 0x1F) + 0x01, a0_833 + 8, a5_904, s2_817, s3_818, dwArg14, s6_821, a0_803, dwLoc0C, s9_824, s10_815, mstatus, s2_183, dwLoc6C, a2, dwLoc64, a5_781, 588036632, dwLoc58, s6, dwLoc18, dwLoc14, dwLoc08, dwArg08, s5_623 + 1107380088, dwArg28, s5, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, out s0_950, out s1_951, out a0_941, out a1_942, out a2_943, out a4_945, out a5_3014, out s2_952, out s3_953, out s4_954, out s6_965, out s7_1032, out s9_1034, out s10_1025, out s11_3015, out mstatus_962);
			if (a0_941 != 0x00 && (int32) (*((word32) (*((word32) s10_1025 + 4)) + 4)) > 0x00)
			{
				word32 a5_3029;
				word32 a1_3027;
				word32 a2_3028;
				word32 a0_3026;
				ra = net_buf_unref(ra_949, s1_951, s7_1032, a1_942, a4_945, mstatus_962, s2_183, dwLoc6C, a2, s6, dwArg08, dwArg14, dwArg28, s7, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArg0108, out s0_1023, out s1_1024, out a0_3026, out a1_3027, out a2_3028, out a3_1016, out a4_1017, out a5_3029, out s2_1027, out s3_1028, out s4_1029, out s5_1042, out s6_1031, out s8_1033, out mstatus);
			}
			else
			{
				net_buf_ref(s7_1032);
				*((word32) s7_1032 + 4) = (word32) s2_952 + ((word32) s4_954 + ((word32) s3_953 + 24) << 2);
				if (s4_954 == 0x00)
					s0_950 = dwArg0124;
				Eq_2 a0_1013;
				word32 s11_3033;
				word32 a1_3030;
				word32 a5_3031;
				word32 s5_3032;
				ra = bt_mesh_net_send(ra_949, s0_950, s1_951, s10_1025, s7_1032, a2_943, s9_1034, s2_952, s3_953, s4_954, s6_965, mstatus_962, s2_183, a2, dwLoc64, a5_781, 588036632, dwLoc58, s6, s2, s0, dwLoc38, dwLoc28, dwLoc18, dwLoc14, dwArg08, dwArg0C, dwArg14, s5_623 + 1107380088, dwArg28, s5, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_1023, out s1_1024, out a0_1013, out a1_3030, out a3_1016, out a4_1017, out a5_3031, out s2_1027, out s3_1028, out s4_1029, out s5_3032, out s6_1031, out s7_1032, out s8_1033, out s9_1034, out s10_1025, out s11_3033, out mstatus);
				s5_1042 = a0_1013;
				if (a0_1013 != 0x00)
				{
					Eq_2 a3_1050;
					Eq_2 a4_1051;
					Eq_2 s2_1057;
					Eq_2 s9_1064;
					Eq_2 s5_1080;
					word32 s8_3057;
