pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
					word32 s9_3058;
					word32 s11_3059;
					word32 s7_3056;
					word32 s6_3055;
					word32 s4_3054;
					word32 s3_3053;
					word32 a3_3052;
					word32 a1_3051;
					word32 a0_3035;
					word32 s0_3049;
					word32 a0_3050;
					word32 a2_3037;
					word32 a5_3038;
					word32 a7_3039;
					word32 s8_3045;
					word32 s10_3046;
					word32 s11_3047;
					word32 t4_3048;
					word32 s3_3040;
					word32 s6_3043;
					word32 s7_3044;
					word32 s4_3041;
					word32 s5_3042;
					word32 a1_3036;
					word32 s1_3034;
					seg_tx_reset(printf(ra, &g_t230BA438, a3_1016, a2, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_3034, out a0_3035, out a1_3036, out a2_3037, out a3_1050, out a4_1051, out a5_3038, out a7_3039, out s2_1057, out s3_3040, out s4_3041, out s5_3042, out s6_3043, out s7_3044, out s8_3045, out s9_1064, out s10_3046, out s11_3047, out t4_3048), s0_1023, s9_1064, a3_1050, a4_1051, s2_1057, mstatus, dwLoc6C, a2, a5_781, dwLoc58, dwLoc54, s8, s6, s2, dwLoc38, dwLoc34, dwLoc28, dwLoc20, dwLoc1C, dwLoc18, dwLoc08, dwArg08, s5_623 + 1107380088, a5_875 >> 16, dwArg28, s11, s5, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, out s0_3049, out a0_3050, out a1_3051, out a3_3052, out a4_1017, out a5_1073, out s2_1077, out s3_3053, out s4_3054, out s5_1080, out s6_3055, out s7_3056, out s8_3057, out s9_3058, out s11_3059, out mstatus);
					s0_1023 = s5_1080;
					goto l23046596;
				}
			}
			s4_1126 = s4_1029 + 0x01 & 0x00FF;
		}
		Eq_2 s3_1197 = s3_1028 + 96;
		s2_1077 = (word32) s3_1197 + s2_1027;
		if (*((word32) s2_1077 + 4) == 0x00)
		{
			word32 a0_1217;
			<anonymous> * a5_1222;
			Eq_2 s11_1241;
			Eq_237183 s0_1245;
			word32 a1_2917;
			word32 a3_2918;
			word32 s9_2919;
			word32 a5_2920;
			ra = send_cb_finalize(seg_tx_reset(ra, s0_1023, s9_1034, a3_1016, a4_1017, s2_1077, mstatus, dwLoc6C, a2, a5_781, dwLoc58, dwLoc54, s8, s6, s2, dwLoc38, dwLoc34, dwLoc28, dwLoc20, dwLoc1C, dwLoc18, dwLoc08, dwArg08, s5_623 + 1107380088, dwArg24, dwArg28, s11, s5, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, out s0_1245, out a0_1217, out a1_2917, out a3_2918, out a4_1017, out a5_1222, out s2_1077, out s3_1197, out s4_1126, out s5_1042, out s6_1031, out s7_1032, out s8_1033, out s9_2919, out s11_1241, out mstatus), s0_1245, a0_1217, s11_1241, a5_1222, a5_781, 588036632, out s0_1023, out a5_2920);
		}
		a5_1073 = *((word32) s6_1031 + 308) >> 4 & 0x01;
		if (a5_1073 != 0x00)
			s0_1023 = bt_mesh_lpn_poll(ra, s2_1077, s3_1197, s4_1126, s5_1042, s6_1031, s7_1032, s8_1033, mstatus, s2_183, dwLoc6C, a2, s6, s0, dwLoc38, dwLoc34, dwLoc24, dwLoc18, dwLoc08, dwArg08, s5_623 + 1107380088, dwArg28, s5, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, out a4_1017, out a5_1073, out s2_1077, out mstatus);
	}
l23046596:
	s0Out = s0_1023;
	s1Out = dwLoc64;
	a0Out = s0_1023;
	a3Out = dwArg78;
	a4Out = a4_1017;
	a5Out = a5_1073;
	s2Out = s2_1077;
	mstatusOut = mstatus;
	return dwLoc24;
}

// 2304696E: Register Eq_2 bt_mesh_ctl_send(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_187171) a0, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_187218 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_187223) s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      send_friend_poll
//      clear_friendship
//      sub_update
//      send_friend_req.constprop.8
//      send_ack
//      bt_mesh_heartbeat_send
//      send_friend_clear
//      bt_mesh_friend_clear
Eq_2 bt_mesh_ctl_send(Eq_2 ra, Eq_2 s0, struct Eq_187171 * a0, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_187218 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_187223 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_187218 a0_212;
	ptr32 a1_188;
	ptr32 a3_190;
	ptr32 a4_191;
	ptr32 a5_192;
	Eq_2 ra_196;
	ptr32 s1_198;
	ptr32 s11_127;
	struct Eq_187223 * s2_199;
	ptr32 s3_200;
	ptr32 s5_202;
	ptr32 s6_203;
	ptr32 s7_119;
	ptr32 s9_121;
	Eq_2 a0_42;
	Eq_2 a3_45;
	Eq_2 a5_47;
	Eq_2 s1_53;
	struct Eq_240162 * s10_54;
	Eq_2 s3_57;
	Eq_2 s4_58;
	Eq_2 s5_59;
	Eq_2 s6_60;
	Eq_2 s7_61;
	Eq_2 s8_62;
	Eq_2 s9_63;
	word32 s0_413;
	word32 a1_414;
	word32 a4_415;
	word32 s2_416;
	word32 s11_417;
	ptr32 mstatus_195;
	Eq_2 ra_51 = bt_mesh_adv_create(ra, (word32) a0->b000A, 0x00, a5, a4, mstatus, dwArg10, dwArg14, dwArg38, s7, s3, dwArg68, dwArgA8, dwArgC8, dwArgF8, out s0_413, out s1_53, out a0_42, out a1_414, out a3_45, out a4_415, out a5_47, out s2_416, out s3_57, out s4_58, out s5_59, out s6_60, out s7_61, out s8_62, out s9_63, out s10_54, out s11_417, out mstatus_195);
	if (a0_42 != 0x00)
	{
		net_buf_simple_reserve((word32 *) 0x09, a5_47);
		struct Eq_240750 * a5_90;
		word32 a5_418;
		word32 a1_419;
		word32 a2_420;
		word32 a3_421;
		word32 a4_422;
		net_buf_simple_add_mem((word32) a0_42 + 8, s6_60, s7_61, net_buf_simple_add_u8((word32) a0_42 + 8, s8_62 & 0x007F, a5_47, out a5_418), out a1_419, out a2_420, out a3_421, out a4_422, out a5_90);
		word32 a0_104;
		Eq_2 a1_105;
		Eq_2 a4_108;
		struct Eq_241608 * a5_109;
		Eq_2 s2_115;
		Eq_2 s3_116;
		ptr32 mstatus_125;
		Eq_2 s6_128;
		word32 s0_423;
		word32 a2_424;
		word32 s4_425;
		word32 s10_426;
		Eq_2 s1_114;
		Eq_2 ra_112 = bt_mesh_friend_enqueue_tx(ra_51, (word32) a0_42 + 8, s1_53, s5_59, 0x01, (word32) a0_42 + 8, a5_90, a0_42, s3_57, s4_58, s6_60, s7_61, s8_62, s9_63, s10_54, mstatus_195, dwLoc30, s8, s6, s4, s2, s0, dwLoc18, dwLoc08, dwArg28, dwArg2C, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_423, out s1_114, out a0_104, out a1_105, out a2_424, out a4_108, out a5_109, out s2_115, out s3_116, out s4_425, out s6_128, out s7_119, out s9_121, out s10_426, out s11_127, out mstatus_125);
		if (a0_104 != 0x00)
		{
			s1_114 = a5_109->t0004;
			if ((int32) a5_109->t0004 > 0x00)
			{
				word32 s0_434;
				word32 a0_435;
				word32 a2_436;
				word32 s4_437;
				word32 s8_438;
				ra_196 = net_buf_unref(ra_112, s1_114, s2_115, a1_105, a4_108, mstatus_125, dwLoc30, s8, s6, dwLoc08, dwArg48, s7, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_434, out s1_198, out a0_435, out a1_188, out a2_436, out a3_190, out a4_191, out a5_192, out s2_199, out s3_200, out s4_437, out s5_202, out s6_203, out s8_438, out mstatus_195);
				a0_212.u0 = 0x00;
l230469B0:
				0x00 = (int8) dwArg0128;
				s0Out = s4;
				s1Out = s1_198;
				a0Out = a0_212;
				a1Out = a1_188;
				a3Out = a3_190;
				a4Out = a4_191;
				a5Out = a5_192;
				s2Out = s2_199;
				s3Out = s3_200;
				s4Out = dwArg78;
				s5Out = s5_202;
				s6Out = s6_203;
				s7Out = s7_119;
				s8Out = s5;
				s9Out = s9_121;
				s11Out = s11_127;
				mstatusOut = mstatus_195;
				return ra_196;
			}
		}
		0x00 = (int8) dwArg0128;
		Eq_187218 a0_157;
		ptr32 a1_158;
		ptr32 a3_160;
		ptr32 a4_161;
		ptr32 a5_162;
		ptr32 mstatus_165;
		Eq_2 s0_167;
		ptr32 s1_168;
		ptr32 s11_170;
		struct Eq_187223 * s2_171;
		ptr32 s3_172;
		Eq_2 s4_173;
		ptr32 s5_174;
		ptr32 s6_175;
		ptr32 s7_176;
		Eq_2 s8_177;
		ptr32 s9_178;
		word32 s10_439;
		Eq_2 ra_166 = bt_mesh_net_send(ra_112, s4, s1_114, s1_114, s2_115, s3_116, dwArg78, s2_115, s3_116, dwArg78, s6_128, mstatus_125, dwArg00, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg28, dwArg30, dwArg34, dwArg38, dwArg48, s5, s3, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_167, out s1_168, out a0_157, out a1_158, out a3_160, out a4_161, out a5_162, out s2_171, out s3_172, out s4_173, out s5_174, out s6_175, out s7_176, out s8_177, out s9_178, out s10_439, out s11_170, out mstatus_165);
		s0Out = s0_167;
		s1Out = s1_168;
		a0Out = a0_157;
		a1Out = a1_158;
		a3Out = a3_160;
		a4Out = a4_161;
		a5Out = a5_162;
		s2Out = s2_171;
		s3Out = s3_172;
		s4Out = s4_173;
		s5Out = s5_174;
		s6Out = s6_175;
		s7Out = s7_176;
		s8Out = s8_177;
		s9Out = s9_178;
		s11Out = s11_170;
		mstatusOut = mstatus_165;
		return ra_166;
	}
	else
	{
		word32 a0_427;
		word32 a2_428;
		word32 a7_429;
		word32 s4_430;
		word32 s8_431;
		word32 s10_432;
		word32 t4_433;
		ra_196 = printf(ra_51, &g_t230B9E64, a3_45, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_198, out a0_427, out a1_188, out a2_428, out a3_190, out a4_191, out a5_192, out a7_429, out s2_199, out s3_200, out s4_430, out s5_202, out s6_203, out s7_119, out s8_431, out s9_121, out s10_432, out s11_127, out t4_433);
		a0_212.u0 = -55;
		goto l230469B0;
	}
}

// 23046A30: Register Eq_2 send_ack(Register Eq_2 ra, Register (ptr32 Eq_241749) s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_241756) a5, Register Eq_241757 a6, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Register out (ptr32 Eq_241756) s0Out, Register out Eq_2 s1Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_241785 a4Out, Register out ptr32 a5Out, Register out Eq_241787 s2Out, Register out (ptr32 Eq_241788) s3Out, Register out (ptr32 Eq_241789) s4Out, Register out ptr32 s5Out, Register out Eq_241791 s6Out, Register out (ptr32 Eq_241792) s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      seg_ack
//      bt_mesh_trans_recv
Eq_2 send_ack(Eq_2 ra, struct Eq_241749 * s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, struct Eq_241756 * a5, Eq_241757 a6, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, struct Eq_241756 & s0Out, union Eq_2 & s1Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_241785 & a4Out, ptr32 & a5Out, union Eq_241787 & s2Out, struct Eq_241788 & s3Out, struct Eq_241789 & s4Out, ptr32 & s5Out, union Eq_241791 & s6Out, struct Eq_241792 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a3_38;
	word32 a5_361;
	word32 a4_360;
	word32 a2_359;
	word32 a1_358;
	word32 a0_357;
	word32 t1_356;
	Eq_2 ra_41 = memset(ra, fp + -50, 0x00, 0x12, out t1_356, out a0_357, out a1_358, out a2_359, out a3_38, out a4_360, out a5_361);
	byte bLoc39_293 = SLICE(s4, byte, 24);
	struct Eq_241756 * s0_123 = a5;
	Eq_2 a0_55 = a1;
	Eq_2 dwLoc38_218 = SEQ(~0x00, (word16) (word32) *((word32) a0 + 28));
	Eq_2 dwLoc34_235 = SEQ(SLICE(s0, word16, 16), (word16) a2);
	Eq_2 dwLoc30_245 = SEQ((byte) a3_38, nLoc30);
	if (a6 != 0x00)
	{
		word32 a5_363;
		a0_55 = bt_mesh_primary_addr(out a5_363);
	}
	ptr32 a1_114;
	Eq_241785 a4_117;
	ptr32 a5_118;
	Eq_2 ra_122;
	struct Eq_241788 * s3_128;
	Eq_241787 s2_127;
	ptr32 s11_126;
	Eq_241791 s6_131;
	struct Eq_241789 * s4_129;
	struct Eq_241792 * s7_132;
	ptr32 s8_133;
	struct Eq_274 * a0_143;
	word32 a5_362;
	ptr32 dwLoc3C_294 = SEQ(bLoc39_293, (byte) bt_mesh_net_transmit_get(out a5_362), (word16) a0_55);
	if ((g_t4200D7F0 >> 4 & 0x01) != 0x00)
		a0_143 = (struct Eq_274 *) &g_t230BA454;
	else
	{
		Eq_2 s2_70 = (int32) (word16) a1;
		if (s2_70 > 0x00)
		{
			ui32 a6_78 = (word32) *a4 << 19 >> 0x11 | a6 << 0x0F;
			Eq_2 s0_92 = (word32) (word16) a5 >> 8 | a5 << 0x08;
			word32 s9_368;
			word32 s5_367;
			word32 a3_366;
			word32 a0_365;
			word32 s1_364;
			ra_122 = bt_mesh_ctl_send(ra_41, s0_92, fp + -0x0044, 0x00, 0x00, s2_70, a0, a4, a2, s6, s7, s8, mstatus, dwLoc60, dwLoc58, dwLoc54, fp + -56, SEQ((byte) (a5 >> 0x10), (byte) (a5 >> 0x18), (word16) (a6_78 << 0x08 | (word32) ((word16) a6_78) >> 0x08)), SEQ(wLoc46, (word16) s0_92), dwLoc38_218, dwLoc34_235, dwLoc30_245, dwLoc2C, dwLoc28, dwLoc20, dwLoc1C, dwLoc18, dwArg08, dwArg14, dwArg18, dwArg1C, a3, dwArg28, a0, dwArg38, s1, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_123, out s1_364, out a0_365, out a1_114, out a3_366, out a4_117, out a5_118, out s2_127, out s3_128, out s4_129, out s5_367, out s6_131, out s7_132, out s8_133, out s9_368, out s11_126, out mstatus);
			goto l23046AAA;
		}
		a0_143 = (struct Eq_274 *) &g_t230BA47C;
	}
	word32 a3_372;
	word32 a2_371;
	word32 a0_370;
	word32 s1_369;
	word32 a7_373;
	word32 s5_374;
	word32 s9_375;
	word32 s10_376;
	word32 t4_377;
	ra_122 = printf(ra_41, a0_143, a3_38, dwLoc58, dwLoc38_218, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_369, out a0_370, out a1_114, out a2_371, out a3_372, out a4_117, out a5_118, out a7_373, out s2_127, out s3_128, out s4_129, out s5_374, out s6_131, out s7_132, out s8_133, out s9_375, out s10_376, out s11_126, out t4_377);
l23046AAA:
	s0Out = s0_123;
	s1Out = dwArg28;
	a1Out = a1_114;
	a3Out = dwArg08;
	a4Out = a4_117;
	a5Out = a5_118;
	s2Out = s2_127;
	s3Out = s3_128;
	s4Out = s4_129;
	s5Out = dwLoc3C_294;
	s6Out = s6_131;
	s7Out = s7_132;
	s8Out = s8_133;
	s9Out = dwLoc5C;
	s11Out = s11_126;
	mstatusOut = mstatus;
	return ra_122;
}

