pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23046B2A: void seg_ack(Register Eq_2 ra, Register (ptr32 Eq_241749) a0, Register Eq_2 a3, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void seg_ack(Eq_2 ra, struct Eq_241749 * a0, Eq_2 a3, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	word32 a1_220;
	word32 a2_221;
	word32 a5_222;
	if (k_uptime_get_32(out a1_220, out a2_221, out a5_222) - a0->tFFFFFFFC <= 0x0EFFFA60)
	{
		Eq_2 a3_37;
		ptr32 mstatus_42;
		Eq_2 s1_45;
		word32 s0_223;
		word32 a1_224;
		word32 a4_225;
		word32 a5_226;
		word32 s2_227;
		word32 s3_228;
		word32 s4_229;
		word32 s5_230;
		word32 s6_231;
		word32 s7_232;
		word32 s8_233;
		word32 s9_234;
		word32 s11_235;
		send_ack(ra, a0, &a0->tFFFFFFE0, a0->tFFFFFFE0, (word32) a0->wFFFFFFF6, (word32) a0->wFFFFFFF4, (word32) a0->bFFFFFFF2, (char *) &a0->tFFFFFFE0 + 8, a0->ptrFFFFFFF8, a0->tFFFFFFF0 >> 0x07 & 1, s6, s7, s8, mstatus, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg28, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_223, out s1_45, out a1_224, out a3_37, out a4_225, out a5_226, out s2_227, out s3_228, out s4_229, out s5_230, out s6_231, out s7_232, out s8_233, out s9_234, out s11_235, out mstatus_42);
		Eq_2 a4_66;
		Eq_2 a0_64 = ack_timeout(s1_45, out a4_66);
		word32 s1_261;
		word32 a0_262;
		word32 a1_263;
		word32 a2_264;
		word32 a3_265;
		word32 a4_266;
		word32 a5_267;
		word32 s2_268;
		word32 s3_269;
		word32 s4_270;
		word32 s5_271;
		word32 s6_272;
		word32 s8_273;
		k_delayed_work_submit(a0_64, a3_37, a4_66, mstatus_42, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_261, out a0_262, out a1_263, out a2_264, out a3_265, out a4_266, out a5_267, out s2_268, out s3_269, out s4_270, out s5_271, out s6_272, out s8_273);
	}
	else
	{
		Eq_2 a3_107;
		Eq_2 a4_108;
		Eq_2 s1_111;
		word32 a0_236;
		word32 a1_237;
		word32 a2_238;
		word32 a5_239;
		word32 a7_240;
		word32 s2_241;
		word32 s3_242;
		word32 s4_243;
		word32 s5_244;
		word32 s6_245;
		word32 s7_246;
		word32 s8_247;
		word32 s9_248;
		word32 s10_249;
		word32 s11_250;
		word32 t4_251;
		Eq_2 ra_110 = printf(ra, &g_t230BA3C8, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_111, out a0_236, out a1_237, out a2_238, out a3_107, out a4_108, out a5_239, out a7_240, out s2_241, out s3_242, out s4_243, out s5_244, out s6_245, out s7_246, out s8_247, out s9_248, out s10_249, out s11_250, out t4_251);
		word32 a1_252;
		word32 a3_253;
		word32 a4_254;
		word32 a5_255;
		word32 s2_256;
		word32 s3_257;
		word32 s4_258;
		word32 s5_259;
		word32 s6_260;
		seg_rx_reset(ra_110, s1_111, a3_107, a4_108, mstatus, dwArg18, dwArg24, dwArg28, dwArg38, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out a1_252, out a3_253, out a4_254, out a5_255, out s2_256, out s3_257, out s4_258, out s5_259, out s6_260);
	}
}

// 23046BA6: Register Eq_2 bt_mesh_trans_recv(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s9, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack (ptr32 byte) dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_net_recv
Eq_2 bt_mesh_trans_recv(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s9, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg5C, byte * dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 s1_1150;
	Eq_2 a1_32 = *(union Eq_2 *) ~0x00;
	Eq_2 a3_221;
	Eq_2 a4_1146;
	*((word32) a1_32 + 32) = (byte) ((word32) *((word32) a1_32 + 32) & 0x007F | bt_mesh_friend_match((word32) (*((union Eq_2 *) 0x1B)), (word32) (*((word32) a1_32 + 0x0A)), out a3_221, out a4_1146) << 7);
	word32 a5_4000;
	Eq_2 a1_113;
	net_buf_simple_pull(a0, 0x09, out a1_113, out a5_4000);
	Eq_2 dwArg2C_1794 = ~0x00;
	Eq_2 s0_1013 = a1_32;
	Eq_2 dwLoc54_1795 = ~0x00;
	Eq_2 s7_100 = 0x4200D6BC;
	if ((g_t4200D7F0 >> 4 & 0x01) != 0x00)
	{
		ui32 a5_64 = (word32) *((word32) a1_32 + 32);
		a4_1146 = a5_64 & 48;
		if ((a5_64 & 48) == 0x00)
		{
			a3_221 = (word32) g_b4200D7E4;
			a4_1146.u0 = 0x08;
			if (a3_221 != 0x08 || (a5_64 & 0x04) == 0x00)
			{
				word32 a2_4003;
				word32 a5_4005;
				word32 s1_4001;
				word32 a7_4006;
				word32 a3_4004;
				word32 a0_4002;
				word32 s5_4008;
				word32 s4_4007;
				word32 s11_4011;
				word32 t4_4012;
				word32 s8_4009;
				word32 s9_4010;
				printf(ra, &g_t230B9E80, a3_221, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_4001, out a0_4002, out a1_113, out a2_4003, out a3_4004, out a4_1146, out a5_4005, out a7_4006, out s2, out s3, out s4_4007, out s5_4008, out s6, out s7_100, out s8_4009, out s9_4010, out s10, out s11_4011, out t4_4012);
				s1_1150.u0 = ~0x0A;
				goto l23046C30;
			}
		}
	}
	Eq_2 ra_1088;
	Eq_2 s9_102;
	Eq_2 s4_1153;
	net_buf_simple_headroom(a4_1146);
	up32 s9_77 = (word32) *((word32) a0 + 4);
	struct Eq_242270 * a5_78 = (int32) **a0;
	if (a5_78 >= null)
	{
		if (s9_77 == 0x00)
		{
			word32 s6_4070;
			word32 s8_4071;
			word32 a7_4067;
			word32 a0_4063;
			word32 a2_4064;
			word32 a5_4066;
			word32 a3_4065;
			word32 s1_4062;
			word32 s2_4068;
			word32 s11_4073;
			word32 s10_4072;
			word32 s5_4069;
			word32 t4_4074;
			ra_1088 = printf(ra, &g_t230BA0D8, a3_221, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_4062, out a0_4063, out a1_113, out a2_4064, out a3_4065, out a4_1146, out a5_4066, out a7_4067, out s2_4068, out s3, out s4_1153, out s5_4069, out s6_4070, out s7_100, out s8_4071, out s9_102, out s10_4072, out s11_4073, out t4_4074);
		}
		else
		{
			word32 a0_83;
			Eq_2 a5_85;
			Eq_2 a3_89;
			Eq_2 s1_92;
			word32 s11_94;
			Eq_2 s5_98;
			Eq_2 s6_99;
			Eq_2 s8_101;
			ra_1088 = is_replay(ra, a1_32, 0x00, s10, dwArg00, dwArg04, dwArg28, ra, out s1_92, out a0_83, out a3_89, out a4_1146, out a5_85, out s3, out s4_1153, out s5_98, out s6_99, out s7_100, out s8_101, out s9_102, out s11_94);
			if (a0_83 == 0x00)
			{
				struct Eq_242835 * a5_111;
				word32 a2_4092;
				word32 a1_4091;
				Eq_2 a0_108 = net_buf_simple_pull_u8(a5_85, out a1_4091, out a2_4092, out a5_111);
				ui32 s2_112 = (word32) *((word32) a1_32 + 32);
				a1_113 = a0_108;
				s2 = s2_112 & 8;
				if ((s2_112 & 8) != 0x00)
				{
					Eq_2 a0_160;
					word32 a3_4127;
					ra_1088 = ctl_recv(ra_1088, s1_92, a1_32, a0_108, s4_1153, fp + -72, s2_112 & 8, s3, s4_1153, s5_98, s6_99, s7_100, s8_101, mstatus, dwLoc60, dwLoc5C, dwLoc58, ~0x00, dwLoc4C, s10, s8, s6, s4, s2, s0, dwLoc30, dwLoc2C, dwLoc28, dwLoc24, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg1C, dwArg28, ~0x00, s11, s9, s7, s3, s1, ra, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_1013, out a0_160, out a1_113, out a3_4127, out a4_1146, out s3, out s4_1153, out s7_100, out s9_102, out mstatus);
					s1_1150 = a0_160;
					s6.u0 = 0x01;
					s2.u0 = 0x00;
					goto l23046E9A;
				}
				s0_1013 = a5_111->t0020;
				s6.u0 = 0x01;
				if ((a5_111 & 0x00C0) != 0x00)
				{
					Eq_2 s0_118 = *((word32) a0_108 + 28);
					Eq_2 a0_123;
					word32 a3_4153;
					ra_1088 = sdu_recv(ra_1088, s0_118, s0_118, a0_108, 0x00, s4_1153, s2_112 & 8, s11_94, s8, dwLoc24, dwLoc08, dwArg18, s9, dwArg58, dwArg78, out s0_1013, out a0_123, out a1_113, out a3_4153, out a4_1146, out s2, out s3, out s4_1153, out s7_100, out s9_102);
					s1_1150 = a0_123;
					s6.u0 = 0x01;
					goto l23046E9A;
				}
				goto l2304719E;
			}
			s0_1013 = *((word32) a3_89 + 28);
			word32 t4_4105;
			word32 s2_4099;
			word32 s5_4100;
			word32 s6_4101;
			word32 a3_4096;
			word32 a2_4095;
			word32 s1_4093;
			word32 a5_4097;
			word32 a7_4098;
			word32 s8_4102;
			word32 s10_4103;
			word32 s11_4104;
			word32 a0_4094;
			ra_1088 = printf(ra_1088, &g_t230B9ED8, a3_89, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_4093, out a0_4094, out a1_113, out a2_4095, out a3_4096, out a4_1146, out a5_4097, out a7_4098, out s2_4099, out s3, out s4_1153, out s5_4100, out s6_4101, out s7_100, out s8_4102, out s9_102, out s10_4103, out s11_4104, out t4_4105);
		}
		s6.u0 = 0x01;
		goto l23046C8A;
	}
	s0_1013 = a5_78->t0020;
	s1_1150.u0 = 0x00;
	if ((a5_78 & 0x00C0) == 0x00)
		goto l23046C30;
	dwArg28.u0 = 0x00;
	if (s9_77 <= 0x04)
	{
		word32 a3_4023;
		word32 a2_4022;
		word32 a0_4021;
		word32 s1_4020;
		word32 s11_4031;
		word32 s6_4028;
		word32 a7_4025;
		word32 a5_4024;
		word32 s8_4029;
		word32 s10_4030;
		word32 t4_4032;
		word32 s5_4027;
		word32 s2_4026;
		ra_1088 = printf(ra, &g_t230B9EB0, a3_221, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_4020, out a0_4021, out a1_113, out a2_4022, out a3_4023, out a4_1146, out a5_4024, out a7_4025, out s2_4026, out s3, out s4_1153, out s5_4027, out s6_4028, out s7_100, out s8_4029, out s9_102, out s10_4030, out s11_4031, out t4_4032);
		goto l23046C88;
	}
	word32 a0_252;
	Eq_2 a3_258;
	byte * s8_270;
	word32 a4_4014;
	word32 s1_4013;
	word32 a5_4015;
	word32 s3_4016;
	word32 s5_4017;
	word32 s6_4018;
	word32 s11_4019;
	ra_1088 = is_replay(ra, s0_1013, fp + -76, s10, dwArg00, dwArg04, 0x00, ra, out s1_4013, out a0_252, out a3_258, out a4_4014, out a5_4015, out s3_4016, out s4_1153, out s5_4017, out s6_4018, out s7_100, out s8_270, out s9_102, out s11_4019);
	if (a0_252 != 0x00)
	{
		s0_1013 = *((word32) a3_258 + 28);
		word32 s5_4043;
		word32 s6_4044;
		word32 a3_4039;
		word32 s1_4036;
		word32 a0_4037;
		word32 s8_4045;
		word32 a5_4040;
		word32 a7_4041;
		word32 s2_4042;
		word32 a2_4038;
		word32 s10_4046;
		word32 s11_4047;
		word32 t4_4048;
		ra_1088 = printf(ra_1088, &g_t230B9ED8, a3_258, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_4036, out a0_4037, out a1_113, out a2_4038, out a3_4039, out a4_1146, out a5_4040, out a7_4041, out s2_4042, out s3, out s4_1153, out s5_4043, out s6_4044, out s7_100, out s8_4045, out s9_102, out s10_4046, out s11_4047, out t4_4048);
		goto l23046C88;
	}
	struct Eq_193726 * a5_280;
	word32 a1_4033;
	net_buf_simple_pull(s4_1153, 0x01, out a1_4033, out a5_280);
	ui32 a4_285;
	Eq_2 a5_286;
	word32 a1_4034;
	Eq_2 a0_282 = net_buf_simple_pull_be16(a5_280, out a1_4034, out a4_285, out a5_286);
	uint32 a1_296;
	struct Eq_242447 * a2_297;
	word32 a5_4035;
	Eq_2 a0_295 = net_buf_simple_pull_u8(a5_286, out a1_296, out a2_297, out a5_4035);
	ui32 s5_301 = a0_282 << 0x03 & 24 | a0_295 >> 0x05;
	ui32 s1_293 = (word32) (word16) (a0_282 >> 2) & 0x01FFFFFF;
	ui32 s2_302 = a0_295 & 31;
	uint32 s5_303 = s5_301 & 0x00FF;
	uint32 s10_304 = a0_295 & 31 & 0x00FF;
	if (s10_304 < (s5_301 & 0x00FF))
	{
		word32 s2_4055;
		word32 s5_4056;
		word32 a7_4054;
		word32 a5_4053;
		word32 a3_4052;
		word32 t4_4061;
		word32 s6_4057;
		word32 s1_4049;
		word32 a0_4050;
		word32 a2_4051;
		word32 s8_4058;
		word32 s10_4059;
		word32 s11_4060;
		ra_1088 = printf(ra_1088, &g_t230B9F04, a3_258, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_4049, out a0_4050, out a1_113, out a2_4051, out a3_4052, out a4_1146, out a5_4053, out a7_4054, out s2_4055, out s3, out s4_1153, out s5_4056, out s6_4057, out s7_100, out s8_4058, out s9_102, out s10_4059, out s11_4060, out t4_4061);
l23046C88:
		s6.u0 = 0x00;
		goto l23046C8A;
	}
	struct Eq_274 * a0_538;
	Eq_2 s1_326;
	Eq_2 a5_547;
	word32 a2_327;
	Eq_242586 a5_310 = *s7_100 - (a1_296 & 1);
	Eq_2 a5_315 = a5_310 << 24 | a4_285 - (a4_285 - s1_293 & 0x01FFFFFF);
	Eq_2 a3_1253 = a1_296 & 1;
	s0_1013 = a2_297->t0008;
	struct Eq_242447 * a4_319 = g_ptr4200DC9C;
	Eq_237973 s11_320 = s10_304 + 1;
	dwLoc54_1795 = a5_315;
	dwArg2C_1794 = a5_310 >> 0x08;
	s6 = s10_304 + 1 & 0x00FF;
	if (a2_297 == a4_319)
	{
		s1_326 = (a1_296 & 1)->t0008;
		if (a4_319 >= a5_310 >> 0x08 && (a5_310 >> 0x08 != a4_319 || (a1_296 & 1) >= a5_315))
		{
			a2_327 = 0x00;
			s3 = s1_326;
			goto l23047228;
		}
		ui32 a4_332 = (word32) *((word32) s1_326 + 16);
		a4_319 = a4_332 & 64;
		if ((a4_332 & 64) != 0x00)
			goto l23046DD8;
	}
	s1_326 = a4_319->t0064;
	a5_547 = a5_315;
	if (a4_319 != a2_297)
		goto l23046D86;
	s1_326 = (a1_296 & 1)->t0058;
	if (a4_319 >= a5_310 >> 0x08 && (a5_310 >> 0x08 != a4_319 || (a1_296 & 1) >= a5_315))
	{
		a2_327 = 0x01;
		s3 = (word32) s1_326 + 80;
l23047228:
		if (a5_310 >> 0x08 < a4_319 || a4_319 == a5_310 >> 0x08 && a5_315 < (a1_296 & 1))
		{
			a0_538 = (struct Eq_274 *) &g_t230B9F48;
			goto l2304723C;
		}
		struct Eq_243195 * a5_381 = (word32) ((word32) s1_326 + (a2_327 + 80) + 0x0011);
		if ((word32) *s8_270 != a5_381)
		{
l23046E12:
			a0_538 = (struct Eq_274 *) &g_t230B9F60;
			goto l2304723C;
		}
		struct Eq_243259 * s1_382 = a5_381->ptr0010;
		if ((a5_381 & 31) != s10_304)
			goto l23046E12;
		if ((a5_381 >> 5 & 0x01) != (a1_296 >> 3 & 0x01))
		{
			a0_538 = (struct Eq_274 *) &g_t230B9F88;
			goto l2304723C;
		}
		if (((word32) s1_382->b0010 & 64) == 0x00)
		{
			word32 a5_414;
			word32 a1_4190;
			word32 a4_4191;
			if (a5_414 != __ashldi3(0x01, 0x00, s10_304 + 1, out a1_4190, out a4_4191, out a5_414) + ~0x00)
			{
				word32 s1_4192;
				word32 a0_4193;
				word32 a5_4196;
				word32 a7_4197;
				word32 t4_4202;
				word32 s11_4201;
				word32 s5_4198;
				word32 s10_4200;
				word32 s8_4199;
				word32 a3_4195;
				word32 a2_4194;
				ra_1088 = printf(ra_1088, &g_t230B9FD0, a1_296 & 1, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_4192, out a0_4193, out a1_113, out a2_4194, out a3_4195, out a4_1146, out a5_4196, out a7_4197, out s2, out s3, out s4_1153, out s5_4198, out s6, out s7_100, out s8_4199, out s9_102, out s10_4200, out s11_4201, out t4_4202);
l23046EFC:
				s1_1150.u0 = ~0x15;
				goto l23046E9A;
			}
			Eq_2 a0_456;
			struct Eq_241756 * a5_457;
			struct Eq_243528 * s1_465;
			Eq_2 s6_472;
			Eq_2 s7_473;
			Eq_2 s8_474;
			struct Eq_243532 * a5_504;
			word32 s11_4221;
			word32 s4_4218;
			word32 s8_4220;
			word32 s5_4219;
			word32 t4_4215;
			word32 a3_4217;
			word32 s1_4216;
			word32 s9_4212;
			word32 s11_4214;
			word32 s10_4213;
			word32 s3_4209;
			word32 s5_4211;
			word32 s4_4210;
			word32 a4_4206;
			word32 s2_4208;
			word32 a7_4207;
			word32 a1_4203;
			word32 a3_4205;
			word32 a2_4204;
			ra_1088 = send_ack(printf(ra_1088, &g_t230B9FA8, a1_296 & 1, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_465, out a0_456, out a1_4203, out a2_4204, out a3_4205, out a4_4206, out a5_457, out a7_4207, out s2_4208, out s3_4209, out s4_4210, out s5_4211, out s6_472, out s7_473, out s8_474, out s9_4212, out s10_4213, out s11_4214, out t4_4215), *a0_456, a5_457->t0018, a0_456, (word32) *((word32) s0_1013 + 0x0A), (word32) *((word32) s0_1013 + 8), (word32) *((word32) s0_1013 + 0x0F), fp + -72, a5_457, s1_465->t0010 >> 0x07 & 1, s6_472, s7_473, s8_474, mstatus, dwLoc58, dwLoc50, dwLoc4C, s10, s8, s2, dwLoc28, dwLoc08, dwLoc04, dwArg08, dwArg18, 0x00, s9, s1, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, out s0_1013, out s1_4216, out a1_113, out a3_4217, out a4_1146, out a5_504, out s2, out s3, out s4_4218, out s5_4219, out s6, out s7_100, out s8_4220, out s9_102, out s11_4221, out mstatus);
			s4_1153 = dwArg84;
			s1_1150.u0 = -69;
			if (a5_504 != null)
			{
				struct Eq_243624 * a4_530 = (word32) *((word32) s0_1013 + 8);
				a5_504->w0000 = (word16) a4_530;
				a4_530->ptr0004 = a5_504;
				s0_1013 = a4_530->t0020;
				a5_504->b0002 = (byte) (a4_530 & 0x01);
				a4_1146 = a4_530 & 0x01;
			}
l23046E9A:
			uint16 wLoc54_3287 = (uint16) dwLoc54_1795;
			if ((*((word32) s7_100 + 308) >> 4 & 0x01) != 0x00)
			{
				a4_1146 = (word32) *((word32) s7_100 + 296);
				if (a4_1146 == 0x08)
					ra_1088 = bt_mesh_lpn_msg_received(ra_1088, s0_1013, mstatus, dwLoc60, dwLoc5C, dwLoc58, dwLoc54_1795, dwLoc4C, s10, s4, s2, dwLoc2C, dwLoc28, dwLoc24, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc08, dwArg08, dwArg10, dwArg14, dwArg18, dwArg28, dwArg2C_1794, s9, s1, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out s0_1013, out s1_1150, out a1_113, out a4_1146, out s2, out s3, out s4_1153, out s6, out s7_100, out s9_102, out mstatus);
			}
			int32 a5_1610 = *((word32) s4_1153 + 8);
			((word32) s4_1153 + 4)->u2 = (word16) s9_102;
			s10 = (word32) wLoc54_3287 + a5_1610;
			*s4_1153 = s10;
			int32 a5_1643 = (int32) *((word32) s0_1013 + 32);
			if (a5_1643 < 0x00 && s1_1150 == 0x00)
			{
				Eq_2 a2_1672;
				if (a5_1643 == ~0x00 && a5_1643 == ~0x00)
					a2_1672.u0 = 0x00;
				else
					a2_1672 = fp + -72;
				s0_1013 = bt_mesh_friend_enqueue_rx(ra_1088, s0_1013, s1_1150, s0_1013, s2, a2_1672, s6, s2, s4_1153, s6, s7_100, s9_102, mstatus, dwLoc60, dwLoc5C, dwLoc58, dwLoc50, dwLoc4C, s10, s6, s4, s2, s0, dwLoc30, dwLoc2C, dwLoc28, dwLoc1C, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg1C, dwArg28, s9, s1, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArg0138, out s1_1150, out a1_113, out a4_1146, out s2, out s3, out s6, out s7_100, out s10, out mstatus);
			}
l23046C30:
			s0Out = s0_1013;
			s1Out = dwArg28;
			a0Out = s1_1150;
			a1Out = a1_113;
			a3Out = dwArg08;
			a4Out = a4_1146;
			s2Out = s2;
			s3Out = s3;
			s4Out = dwArgDC;
			s5Out = s4;
			s6Out = s6;
			s7Out = s7_100;
			s8Out = dwArgBC;
			s10Out = s10;
			mstatusOut = mstatus;
			return dwArg68;
		}
		goto l23046FDA;
	}
	ui32 a5_545 = (word32) *((word32) s1_326 + 96);
	a5_547 = a5_545 & 64;
	if ((a5_545 & 64) == 0x00)
	{
l23046D86:
		s0_1013 = *((word32) a5_547 + 32);
		word32 a4_611 = 0x08;
		if ((a5_547 >> 0x03 & 0x01) == 0x00)
			a4_611 = 0x0C;
		Eq_2 a3_620 = 0x006B;
		if (a4_611 + s10_304 > 0x006B)
		{
			Eq_2 a0_1371;
			Eq_2 s1_1380;
			Eq_2 s6_1387;
			Eq_2 s7_1388;
			Eq_2 s8_1389;
			word32 s11_4126;
			word32 s10_4117;
			word32 a1_4106;
			word32 a5_4110;
			word32 s2_4112;
			word32 a7_4111;
			word32 a4_4109;
			word32 a2_4107;
			word32 a3_4108;
			word32 s3_4113;
			word32 s4_4114;
			word32 s1_4120;
			word32 t4_4119;
			word32 s11_4118;
			word32 s9_4116;
			word32 a3_4121;
			word32 s5_4115;
			word32 a5_4122;
			word32 s5_4124;
			word32 s2_4123;
			word32 s8_4125;
			ra_1088 = send_ack(printf(ra_1088, &g_t230B9FF0, 0x006B, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1380, out a0_1371, out a1_4106, out a2_4107, out a3_4108, out a4_4109, out a5_4110, out a7_4111, out s2_4112, out s3_4113, out s4_4114, out s5_4115, out s6_1387, out s7_1388, out s8_1389, out s9_4116, out s10_4117, out s11_4118, out t4_4119), *a0_1371, s1_1380, a0_1371, (word32) *((word32) s0_1013 + 0x0A), (word32) *((word32) s0_1013 + 8), (word32) *((word32) s0_1013 + 0x0F), fp + -72, null, *((word32) s0_1013 + 32) >> 0x07 & 1, s6_1387, s7_1388, s8_1389, mstatus, dwLoc58, dwLoc50, dwLoc4C, s10, s8, s2, dwLoc28, dwLoc08, dwLoc04, dwArg08, dwArg18, 0x00, s9, s1, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, out s0_1013, out s1_4120, out a1_113, out a3_4121, out a4_1146, out a5_4122, out s2_4123, out s3, out s4_1153, out s5_4124, out s6, out s7_100, out s8_4125, out s9_102, out s11_4126, out mstatus);
			goto l23046DCE;
		}
		struct Eq_242893 * a5_622 = a5_547 & 0x00C0;
		if (a5_622 == (struct Eq_242893 *) 0x0080)
		{
			struct Eq_243034 * s0_625 = a5_622->ptr0000;
			word32 a0_638;
			word32 s8_4131;
			word32 s3_4130;
			word32 a5_4129;
			word32 a4_4128;
			s0_1013 = bt_mesh_friend_queue_has_space((word32) a5_622->w001C, (word32) s0_625->w0008, (word32) s0_625->w000A, fp + -72, s6, dwArgC8, out s1_326, out a0_638, out a3_620, out a4_4128, out a5_4129, out s2_302, out s3_4130, out s4_1153, out s5_303, out s6, out s7_100, out s8_4131);
			if (a0_638 == 0x00)
			{
				Eq_2 a0_1307;
				Eq_2 s1_1316;
				Eq_2 s6_1323;
				Eq_2 s7_1324;
				Eq_2 s8_1325;
				word32 s2_4149;
				word32 s8_4151;
				word32 s11_4152;
				word32 s5_4150;
				word32 s1_4146;
				word32 a5_4148;
				word32 a3_4147;
				word32 a1_4132;
				word32 a3_4134;
				word32 a4_4135;
				word32 s3_4139;
				word32 s4_4140;
				word32 t4_4145;
				word32 s11_4144;
				word32 s5_4141;
				word32 s10_4143;
				word32 s9_4142;
				word32 s2_4138;
				word32 a7_4137;
				word32 a5_4136;
				word32 a2_4133;
