pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
				ra_1088 = send_ack(printf(ra_1088, &g_t230BA010, a3_620, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1316, out a0_1307, out a1_4132, out a2_4133, out a3_4134, out a4_4135, out a5_4136, out a7_4137, out s2_4138, out s3_4139, out s4_4140, out s5_4141, out s6_1323, out s7_1324, out s8_1325, out s9_4142, out s10_4143, out s11_4144, out t4_4145), *a0_1307, s1_1316, a0_1307, (word32) *((word32) s0_1013 + 0x0A), (word32) *((word32) s0_1013 + 8), (word32) *((word32) s0_1013 + 0x0F), fp + -72, null, *((word32) s0_1013 + 32) >> 0x07 & 1, s6_1323, s7_1324, s8_1325, mstatus, dwLoc58, dwLoc50, dwLoc4C, s10, s8, s2, dwLoc28, dwLoc08, dwLoc04, dwArg08, dwArg18, 0x00, s9, s1, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, out s0_1013, out s1_4146, out a1_113, out a3_4147, out a4_1146, out a5_4148, out s2_4149, out s3, out s4_1153, out s5_4150, out s6, out s7_100, out s8_4151, out s9_102, out s11_4152, out mstatus);
				s2.u0 = 0x00;
				s1_1150.u0 = -55;
				goto l23046E9A;
			}
		}
		word32 a5_663;
		if (((word32) *((word32) s1_326 + 16) & 64) != 0x00)
		{
			if (((word32) *((word32) s1_326 + 96) & 64) != 0x00)
			{
				word32 s10_4163;
				word32 t4_4165;
				word32 s11_4164;
				word32 a2_4156;
				word32 a3_4157;
				word32 s8_4162;
				word32 s5_4161;
				word32 a5_4158;
				word32 s2_4160;
				word32 a7_4159;
				word32 a0_4155;
				word32 s1_4154;
				ra_1088 = printf(ra_1088, &g_t230BA03C, a3_620, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_4154, out a0_4155, out a1_113, out a2_4156, out a3_4157, out a4_1146, out a5_4158, out a7_4159, out s2_4160, out s3, out s4_1153, out s5_4161, out s6, out s7_100, out s8_4162, out s9_102, out s10_4163, out s11_4164, out t4_4165);
				s2.u0 = 0x00;
				s1_1150.u0 = ~0x0B;
				goto l23046E9A;
			}
			s3 = (word32) s1_326 + 80;
			a5_663 = 0x01;
		}
		else
		{
			s3 = s1_326;
			a5_663 = 0x00;
		}
		ui32 a5_674 = (word32) ((word32) s1_326 + (a5_663 + 80) + 16);
		Eq_2 s1_675 = *(union Eq_2 *) 0x009C;
		((word32) s1_675 + 72)->u0 = 0x00;
		*((word32) s1_675 + 16) = (byte) (a5_674 | 64);
		*(union Eq_2 *) 0x94 = s1_675;
		*(union Eq_2 *) 80 = s1_675;
		Eq_2 s0_688 = *((word32) a3_620 + 32);
		(a5_674 | 64)->t000C = s1_675;
		*(union Eq_2 *) 88 = s1_675;
		ui32 a3_691 = a3_620 << 2;
		*((word32) s1_675 + 16) = (byte) ((a5_674 | 64) & 0x00C0 | a3_691 & 32 | s2_302);
		*((word32) s1_675 + 0x0011) = (byte) (word32) *dwArg64;
		*((word32) s1_675 + 18) = (byte) (word32) *((word32) s0_688 + 0x0F);
		*((word32) s1_675 + 20) = (word16) (word32) *((word32) s0_688 + 8);
		struct Eq_243381 * a5_710 = (word32) *((word32) s0_688 + 0x0A);
		*((word32) s1_675 + 24) = 0x00;
		*((word32) s1_675 + 22) = (word16) a5_710;
		s0_1013 = a5_710->t0020;
		*((word32) s3 + 16) = (byte) ((word32) *((word32) s3 + 16) & 0x007F | a5_710 & 0x0080);
		a3_1253 = a3_691 & 32;
l23046FDA:
		if ((*((word32) s3 + 24) >> s5_303 & 0x01) != 0x00)
		{
			word32 s10_4187;
			word32 t4_4189;
			word32 s11_4188;
			word32 s2_4184;
			word32 s8_4186;
			word32 s5_4185;
			word32 a3_4181;
			word32 a7_4183;
			word32 a5_4182;
			word32 s1_4178;
			word32 a2_4180;
			word32 a0_4179;
			ra_1088 = printf(ra_1088, &g_t230BA070, a3_1253, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_4178, out a0_4179, out a1_113, out a2_4180, out a3_4181, out a4_1146, out a5_4182, out a7_4183, out s2_4184, out s3, out s4_1153, out s5_4185, out s6, out s7_100, out s8_4186, out s9_102, out s10_4187, out s11_4188, out t4_4189);
			s2.u0 = 0x00;
			s1_1150.u0 = -69;
			goto l23046E9A;
		}
		Eq_2 a5_752 = (word32) *((word32) s4_1153 + 4);
		Eq_243425 a4_754 = *((word32) s3 + 16) >> 5 & 0x01;
		if (s5_303 == s10_304)
		{
			uint32 a3_808 = s5_303 << 0x10;
			a3_1253 = a3_808 >> 16;
			word32 a2_810 = 0x08;
			if (a4_754 == 0x00)
				a2_810 = 0x0C;
			Eq_243658 a5_818 = (word32) (word16) ((word32) a5_752 + ((a3_808 >> 16) + a2_810));
			*((word32) s3 + 72) = (word16) a5_818;
			if (a5_818 > 0x006C)
			{
				Eq_2 a0_1167;
				Eq_2 s1_1176;
				struct Eq_243693 * s3_1180;
				Eq_2 s6_1183;
				Eq_2 s7_1184;
				Eq_2 s8_1185;
				Eq_2 a3_1201;
				Eq_2 a4_1202;
				Eq_2 s3_1213;
				word32 s11_4247;
				word32 s4_4233;
				word32 s9_4235;
				word32 s10_4236;
				word32 a1_4240;
				word32 a5_4241;
				word32 s8_4246;
				word32 s6_4245;
				word32 s2_4242;
				word32 s5_4244;
				word32 s4_4243;
				word32 s1_4239;
				word32 t4_4238;
				word32 s11_4237;
				word32 s5_4234;
				word32 a5_4230;
				word32 s2_4232;
				word32 a7_4231;
				word32 a2_4227;
				word32 a4_4229;
				word32 a3_4228;
				word32 a1_4226;
				ra_1088 = send_ack(printf(ra_1088, &g_t230BA098, a3_808 >> 16, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1176, out a0_1167, out a1_4226, out a2_4227, out a3_4228, out a4_4229, out a5_4230, out a7_4231, out s2_4232, out s3_1180, out s4_4233, out s5_4234, out s6_1183, out s7_1184, out s8_1185, out s9_4235, out s10_4236, out s11_4237, out t4_4238), *a0_1167, s1_1176, a0_1167, (word32) *((word32) s0_1013 + 0x0A), (word32) *((word32) s0_1013 + 8), (word32) *((word32) s0_1013 + 0x0F), fp + -72, null, s3_1180->t0010 >> 0x07 & 1, s6_1183, s7_1184, s8_1185, mstatus, dwLoc58, dwLoc50, dwLoc4C, s10, s8, s2, dwLoc28, dwLoc08, dwLoc04, dwArg08, dwArg18, 0x00, s9, s1, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, out s0_1013, out s1_4239, out a1_4240, out a3_1201, out a4_1202, out a5_4241, out s2_4242, out s3_1213, out s4_4243, out s5_4244, out s6_4245, out s7_100, out s8_4246, out s9_102, out s11_4247, out mstatus);
				word32 s2_4250;
				word32 s5_4251;
				word32 a5_4249;
				word32 a3_4248;
				seg_rx_reset(ra_1088, s3_1213, a3_1201, a4_1202, mstatus, s10, s4, s2, dwLoc28, dwLoc20, dwLoc1C, dwArg00, dwArg04, dwArg08, dwArg18, 0x00, a5_310 >> 0x08, s9, s1, ra, dwArg58, dwArg78, dwArg98, dwArgB8, dwArgD8, out a1_113, out a3_4248, out a4_1146, out a5_4249, out s2_4250, out s3, out s4_1153, out s5_4251, out s6);
l23046DCE:
				s2.u0 = 0x00;
				s1_1150.u0 = -36;
				goto l23046E9A;
			}
		}
		else
		{
			a3_1253.u0 = 0x08;
			if (a4_754 == 0x00)
				a3_1253.u0 = 0x0C;
			if (a3_1253 != a5_752)
			{
				a0_538 = (struct Eq_274 *) &g_t230BA0AC;
l2304723C:
				word32 s10_4175;
				word32 t4_4177;
				word32 s11_4176;
				word32 s2_4172;
				word32 s8_4174;
				word32 s5_4173;
				word32 a3_4169;
				word32 a7_4171;
				word32 a5_4170;
				word32 s1_4166;
				word32 a2_4168;
				word32 a0_4167;
				ra_1088 = printf(ra_1088, a0_538, a3_1253, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_4166, out a0_4167, out a1_113, out a2_4168, out a3_4169, out a4_1146, out a5_4170, out a7_4171, out s2_4172, out s3, out s4_1153, out s5_4173, out s6, out s7_100, out s8_4174, out s9_102, out s10_4175, out s11_4176, out t4_4177);
l23046C8A:
				s2.u0 = 0x00;
				goto l23046EFC;
			}
		}
		word32 a5_4224;
		word32 a2_4223;
		word32 a1_4222;
		*((word32) s3 + 28) = k_uptime_get_32(out a1_4222, out a2_4223, out a5_4224);
		Eq_2 s1_828 = (word32) s3 + 32;
		word32 a5_4225;
		if (k_delayed_work_remaining_get(s0_1013, s1_828, s1_828, out a5_4225) == 0x00 && (*((word32) s7_100 + 308) >> 4 & 0x01) == 0x00)
		{
			Eq_2 a4_861;
			word32 a0_4252;
			word32 a1_4253;
			word32 a5_4257;
			word32 s2_4258;
			word32 s8_4259;
			word32 a4_4256;
			word32 a2_4254;
			word32 a3_4255;
			s0_1013 = k_delayed_work_submit(ack_timeout(s3, out a4_861), a3_1253, a4_861, mstatus, dwLoc5C, dwLoc58, s4, dwArg18, 0x00, s9, s1, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out s1_828, out a0_4252, out a1_4253, out a2_4254, out a3_4255, out a4_4256, out a5_4257, out s2_4258, out s3, out s4_1153, out s5_303, out s6, out s8_4259);
		}
		Eq_2 a0_904 = *((word32) s3 + 0x0044);
		word32 a4_905 = 0x08;
		if ((*((word32) s3 + 16) >> 5 & 0x01) == 0x00)
			a4_905 = 0x0C;
		Eq_2 a3_931;
		word32 a4_4262;
		word32 a5_4263;
		word32 a6_4264;
		word32 a7_4265;
		word32 a1_4260;
		word32 a2_4261;
		memcpy((word32) a0_904 + (a4_905 + s5_303), *s4_1153, (word32) *((word32) s4_1153 + 4), out a1_4260, out a2_4261, out a3_931, out a4_4262, out a5_4263, out a6_4264, out a7_4265);
		Eq_243472 s5_956 = 0x01 << s5_303 | *((word32) s3 + 24);
		*((word32) s3 + 24) = s5_956;
		struct Eq_243898 * a5_962;
		if (s5_956 == __ashldi3(0x01, 0x00, s11_320, out a1_113, out a4_1146, out a5_962) + ~0x00)
		{
			if (a5_962 != null)
			{
				struct Eq_244017 * a4_971 = (word32) *((word32) s0_1013 + 8);
				a5_962->w0000 = (word16) a4_971;
				a4_971->ptr0004 = a5_962;
				s0_1013 = a4_971->t0020;
				a5_962->b0002 = (byte) (a4_971 & 0x01);
				a4_1146 = a4_971 & 0x01;
			}
			Eq_2 a3_1086;
			Eq_2 a4_1071;
			Eq_2 s3_1077;
			Eq_2 a0_989;
			struct Eq_243917 * s3_1000;
			Eq_2 s6_1003;
			Eq_2 s8_1004;
			Eq_2 s0_1039;
			Eq_2 s1_1040;
			word32 s11_1042;
			Eq_2 s2_1043;
			Eq_2 s3_1044;
			Eq_2 s4_1045;
			Eq_2 s5_1046;
			Eq_2 s6_1047;
			Eq_2 s7_1048;
			Eq_2 s8_1049;
			word32 a3_4275;
			word32 a4_4276;
			word32 s9_4278;
			word32 a5_4277;
			word32 s5_4273;
			word32 a1_4274;
			word32 a1_4266;
			word32 a2_4267;
			word32 a3_4268;
			word32 a4_4269;
			word32 a5_4270;
			word32 s4_4272;
			word32 s2_4271;
			Eq_2 ra_1038 = send_ack(ra_1088, *a0_989, k_delayed_work_cancel(s1_828, a3_931, a4_1146, mstatus, dwLoc2C, dwLoc28, s1, dwArg58, dwArg88, dwArgC8, out a0_989, out a1_4266, out a2_4267, out a3_4268, out a4_4269, out a5_4270, out s2_4271, out s3_1000, out s4_4272, out s5_4273, out s6_1003, out s8_1004), a0_989, (word32) *((word32) s0_1013 + 0x0A), (word32) *((word32) s0_1013 + 8), (word32) *((word32) s0_1013 + 0x0F), fp + -72, s3_1000->ptr0018, s3_1000->t0010 >> 0x07 & 1, s6_1003, s7_100, s8_1004, mstatus, dwLoc58, dwLoc50, dwLoc4C, s10, s8, s2, dwLoc28, dwLoc08, dwLoc04, dwArg08, dwArg18, 0x00, s9, s1, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, out s0_1039, out s1_1040, out a1_4274, out a3_4275, out a4_4276, out a5_4277, out s2_1043, out s3_1044, out s4_1045, out s5_1046, out s6_1047, out s7_1048, out s8_1049, out s9_4278, out s11_1042, out mstatus);
			Eq_2 a1_1060 = (word32) *s8_1049;
			if (((word32) *((word32) s0_1039 + 32) & 0x08) != 0x00)
			{
				word32 a1_4284;
				word32 s4_4285;
				word32 a0_4283;
				ra_1088 = ctl_recv(ra_1038, s1_1040, s0_1039, a1_1060, (word32) s3_1044 + 0x0044, fp + -72, s2_1043, s3_1044, s4_1045, s5_1046, s6_1047, s7_1048, s8_1049, mstatus, dwLoc60, dwLoc5C, dwLoc58, a5_315, dwLoc4C, s10, s8, s6, s4, s2, s0, dwLoc30, dwLoc2C, dwLoc28, dwLoc24, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg1C, 0x00, a5_310 >> 0x08, s11, s9, s7, s3, s1, ra, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_1013, out a0_4283, out a1_4284, out a3_1086, out a4_1071, out s3_1077, out s4_4285, out s7_100, out s9_102, out mstatus);
			}
			else
			{
				word32 s4_4282;
				word32 s2_4281;
				word32 a0_4279;
				word32 a1_4280;
				ra_1088 = sdu_recv(ra_1038, s0_1039, s0_1039, a1_1060, (word32) *((word32) s8_1049 + 1) >> 7, (word32) s3_1044 + 0x0044, s2_1043, s11_1042, s8, dwLoc24, dwLoc08, dwArg18, s9, dwArg58, dwArg78, out s0_1013, out a0_4279, out a1_4280, out a3_1086, out a4_1071, out s2_4281, out s3_1077, out s4_4282, out s7_100, out s9_102);
			}
			word32 a3_4286;
			word32 a5_4287;
			word32 s5_4289;
			word32 s2_4288;
			s1_1150 = seg_rx_reset(ra_1088, s3_1077, a3_1086, a4_1071, mstatus, s10, s4, s2, dwLoc28, dwLoc20, dwLoc1C, dwArg00, dwArg04, dwArg08, dwArg18, 0x00, a5_310 >> 0x08, s9, s1, ra, dwArg58, dwArg78, dwArg98, dwArgB8, dwArgD8, out a1_113, out a3_4286, out a4_1146, out a5_4287, out s2_4288, out s3, out s4_1153, out s5_4289, out s6);
			s2.u0 = 0x02;
			goto l23046E9A;
		}
		s2.u0 = 0x01;
l2304719E:
		s1_1150.u0 = 0x00;
		goto l23046E9A;
	}
l23046DD8:
	Eq_2 a3_565;
	Eq_2 a4_566;
	Eq_2 s3_573;
	word32 s1_4075;
	word32 a2_4078;
	word32 s2_4081;
	word32 a7_4080;
	word32 s8_4085;
	word32 a0_4076;
	word32 a1_4077;
	word32 a5_4079;
	word32 s6_4084;
	word32 s5_4083;
	word32 s4_4082;
	word32 t4_4086;
	ra_1088 = printf(ra_1088, &g_t230B9F28, a1_296 & 1, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_4075, out a0_4076, out a1_4077, out a2_4078, out a3_565, out a4_566, out a5_4079, out a7_4080, out s2_4081, out s3_573, out s4_4082, out s5_4083, out s6_4084, out s7_100, out s8_4085, out s9_102, out s10_304, out s11_320, out t4_4086);
	word32 a1_4087;
	word32 a4_4089;
	word32 a3_4088;
	word32 s3_4090;
	s1_326 = seg_rx_reset(ra_1088, s3_573, a3_565, a4_566, mstatus, s10, s4, s2, dwLoc28, dwLoc20, dwLoc1C, dwArg00, dwArg04, dwArg08, dwArg18, 0x00, a5_310 >> 0x08, s9, s1, ra, dwArg58, dwArg78, dwArg98, dwArgB8, dwArgD8, out a1_4087, out a3_4088, out a4_4089, out a5_547, out s2_302, out s3_4090, out s4_1153, out s5_303, out s6);
	goto l23046D86;
}

// 2304724A: Register Eq_2 bt_mesh_rx_reset(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out)
// Called from:
//      clear_friendship
//      bt_mesh_reset
Eq_2 bt_mesh_rx_reset(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out)
{
	Eq_2 a3_18;
	Eq_2 a4_19;
	word32 a1_103;
	word32 a5_104;
	word32 s2_105;
	word32 s3_106;
	word32 s4_107;
	word32 s5_108;
	word32 s6_109;
	seg_rx_reset(ra, 0x4200DC88, a3, a4, mstatus, dwArg08, dwArg14, dwArg18, dwArg28, dwArg30, dwArg34, dwArg50, dwArg54, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out a1_103, out a3_18, out a4_19, out a5_104, out s2_105, out s3_106, out s4_107, out s5_108, out s6_109);
	ptr32 s2_48;
	word32 a1_110;
	word32 a3_111;
	word32 a4_112;
	word32 a5_113;
	word32 s3_114;
	word32 s4_115;
	word32 s5_116;
	word32 s6_117;
	seg_rx_reset(ra, 0x4200DCD8, a3_18, a4_19, mstatus, dwArg08, dwArg14, dwArg18, dwArg28, dwArg30, dwArg34, dwArg50, dwArg54, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out a1_110, out a3_111, out a4_112, out a5_113, out s2_48, out s3_114, out s4_115, out s5_116, out s6_117);
	ptr32 a3_71;
	ptr32 a4_72;
	word32 t1_118;
	word32 a0_119;
	word32 a1_120;
	word32 a2_121;
	word32 a5_122;
	Eq_2 ra_74 = memset(ra, 0x4200DA88, 0x00, 40, out t1_118, out a0_119, out a1_120, out a2_121, out a3_71, out a4_72, out a5_122);
	a3Out = a3_71;
	a4Out = a4_72;
	s2Out = s2_48;
	return ra_74;
}

// 23047284: Register Eq_2 bt_mesh_tx_reset(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_reset
Eq_2 bt_mesh_tx_reset(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a3_18;
	Eq_2 a4_19;
	Eq_2 s2_24;
	ptr32 mstatus_42;
	word32 s0_43;
	word32 a0_131;
	word32 a1_132;
	word32 a5_133;
	word32 s3_134;
	word32 s4_135;
	word32 s5_136;
	word32 s6_137;
	word32 s7_138;
	word32 s8_139;
	word32 s9_140;
	word32 s11_141;
	Eq_2 ra_37 = seg_tx_reset(ra, 0x42014758, 0x42014758, a3, a4, s2, mstatus, s0, dwLoc08, dwArg00, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg20, dwArg28, dwArg2C, dwArg38, dwArg40, dwArg44, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158, out s0_43, out a0_131, out a1_132, out a3_18, out a4_19, out a5_133, out s2_24, out s3_134, out s4_135, out s5_136, out s6_137, out s7_138, out s8_139, out s9_140, out s11_141, out mstatus_42);
	ptr32 a3_51;
	ptr32 a4_52;
	ptr32 s3_58;
	ptr32 s4_59;
	ptr32 s5_60;
	ptr32 s6_61;
	ptr32 s8_62;
	ptr32 s7_73;
	ptr32 mstatus_75;
	word32 s0_142;
	word32 a0_143;
	word32 a1_144;
	word32 a5_145;
	word32 s2_146;
	word32 s9_147;
	word32 s11_148;
	Eq_2 ra_70 = seg_tx_reset(ra_37, s0, s0_43 + 96, a3_18, a4_19, s2_24, mstatus_42, dwArg04, dwArg08, dwArg10, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg30, dwArg38, dwArg3C, dwArg48, dwArg50, dwArg54, dwArg58, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, out s0_142, out a0_143, out a1_144, out a3_51, out a4_52, out a5_145, out s2_146, out s3_58, out s4_59, out s5_60, out s6_61, out s7_73, out s8_62, out s9_147, out s11_148, out mstatus_75);
	a3Out = a3_51;
	a4Out = a4_52;
	s3Out = s3_58;
	s4Out = s4_59;
	s5Out = s5_60;
	s6Out = s6_61;
	s7Out = s7_73;
	s8Out = s8_62;
	mstatusOut = mstatus_75;
	return ra_70;
}

