pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 230472A8: Register Eq_2 bt_mesh_trans_init(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg84, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out ptr32 a4Out)
// Called from:
//      bt_mesh_init
Eq_2 bt_mesh_trans_init(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg84, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArg0118, ptr32 & a4Out)
{
	Eq_2 a3_23;
	Eq_2 a4_24;
	word32 a0_112;
	word32 a5_113;
	word32 s2_114;
	word32 s3_115;
	word32 s4_116;
	word32 s5_117;
	k_delayed_work_init(ra, 0x42014758, 1107380112, a3, a4, mstatus, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a0_112, out a3_23, out a4_24, out a5_113, out s2_114, out s3_115, out s4_116, out s5_117);
	Eq_2 a3_42;
	Eq_2 a4_43;
	word32 a0_118;
	word32 a5_119;
	word32 s2_120;
	word32 s3_121;
	word32 s4_122;
	word32 s5_123;
	k_delayed_work_init(ra, 0x4200DC88, 0x420147F0, a3_23, a4_24, mstatus, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a0_118, out a3_42, out a4_43, out a5_119, out s2_120, out s3_121, out s4_122, out s5_123);
	Eq_2 a3_61;
	Eq_2 a4_62;
	word32 a0_124;
	word32 a5_125;
	word32 s2_126;
	word32 s3_127;
	word32 s4_128;
	word32 s5_129;
	Eq_2 s1_65 = k_delayed_work_init(ra, 0x4200DC88, 0x4200DCA8, a3_42, a4_43, mstatus, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a0_124, out a3_61, out a4_62, out a5_125, out s2_126, out s3_127, out s4_128, out s5_129);
	*((word32) s1_65 + 0x06CC) = 0x4200DC88;
	*((word32) s1_65 + 0x06C4) = 0x4200DC88;
	Eq_2 a3_82;
	ptr32 a4_83;
	word32 a0_130;
	word32 a5_131;
	word32 s2_132;
	word32 s3_133;
	word32 s4_134;
	word32 s5_135;
	Eq_2 s1_86 = k_delayed_work_init(ra, 0x4200DC88, 0x4200DCF8, a3_61, a4_62, mstatus, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a0_130, out a3_82, out a4_83, out a5_131, out s2_132, out s3_133, out s4_134, out s5_135);
	g_t4200DD24 = s1_86;
	g_t4200DD1C = s1_86;
	0x00 = (int8) dwArg38;
	a4Out = a4_83;
	return a3_82;
}

// 2304731E: Register Eq_2 bt_mesh_heartbeat_send(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_187777) s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_187781 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      clear_friendship
//      friend_set
//      hb_publish
//      relay_set
//      gatt_proxy_set
//      ctl_recv
Eq_2 bt_mesh_heartbeat_send(Eq_2 ra, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, struct Eq_187777 & s0Out, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_187781 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a0_8 = bt_mesh_cfg_get();
	word32 a3_377;
	word32 a4_378;
	word32 a5_379;
	word32 a0_374;
	word32 a1_375;
	word32 a2_376;
	word32 t1_373;
	Eq_2 ra_131 = memset(ra, fp + -0x0022, 0x00, 0x12, out t1_373, out a0_374, out a1_375, out a2_376, out a3_377, out a4_378, out a5_379);
	Eq_2 a0_26 = (word32) *((word32) a0_8 + 56);
	word32 a4_380;
	word32 a5_381;
	ptr32 a3_125;
	Eq_2 a0_34 = bt_mesh_subnet_get(a0_26, out a3_125, out a4_380, out a5_381);
	struct Eq_187777 * s0_132 = *a0_34;
	ptr32 a4_126;
	word16 wLoc2C_167 = (word16) (word32) *bt_mesh_model_elem(a0_34, out a4_126);
	word32 a5_382;
	Eq_2 a0_47 = bt_mesh_net_transmit_get(out a5_382);
	byte bLoc35_250 = SLICE(fp + -40, byte, 24);
	Eq_187781 a5_127 = (word32) s0_132->t0030;
	Eq_2 dwLoc2C_192 = SEQ(bLoc29, (byte) a0_47, wLoc2C_167);
	Eq_2 dwLoc28_243 = SEQ(~0x00, (word16) a0_26);
	if (a5_127 != 0x00)
	{
		byte bLoc38_169 = (byte) (word32) s0_132->b0035;
		word32 a5_383;
		Eq_2 s0_56 = (word32) (bt_mesh_relay_get(out a5_383) < ~0x01);
		word32 a5_384;
		if (bt_mesh_gatt_proxy_get(out a5_384) == 0x01)
			s0_56 |= 2;
		word32 a5_385;
		if (bt_mesh_friend_get(out a5_385) == 0x01)
			s0_56 |= 4;
		if ((g_t4200D7F0 >> 4 & 0x01) != 0x00)
			s0_56 |= 8;
		word32 a0_386;
		word32 a1_387;
		word32 s8_388;
		ra_131 = bt_mesh_ctl_send(ra_131, s0_56, fp + -52, 0x00, 0x00, s2, s3, s4, s5, s6, s7, s8, mstatus, dwLoc40, SEQ(bLoc35_250, (byte) s0_56, 0x00, bLoc38_169), dwLoc34, dwLoc30, dwLoc2C_192, dwLoc28_243, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg28, dwArg34, dwArg38, dwArg3C, a0_34, 0x00, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_132, out s1, out a0_386, out a1_387, out a3_125, out a4_126, out a5_127, out s2, out s3, out s4, out s5, out s6, out s7, out s8_388, out s9, out s11, out mstatus);
	}
	s0Out = s0_132;
	s1Out = s1;
	a3Out = a3_125;
	a4Out = a4_126;
	a5Out = a5_127;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = dwArgD4;
	s9Out = s9;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra_131;
}

// 230473E2: void adv_alloc()
void adv_alloc()
{
}

// 230473F4: Register Eq_2 friend_purge_old_ack(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_friend_enqueue_rx
//      bt_mesh_friend_enqueue_tx
Eq_2 friend_purge_old_ack(Eq_2 ra, Eq_2 s1, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a4_20 = 0x00;
	while (a5 != 0x00)
	{
		struct Eq_244590 * a6_9 = *((word32) a5 + 20);
		Eq_2 a5_11 = *a3;
		if ((word32) a6_9->w000A == a2 && (a6_9->dw0010 == *a1 && a6_9->dw0014 == *((word32) a1 + 4)))
		{
			if (a4_20 == 0x00)
			{
				Eq_2 a0_27 = *((word32) a4_20 + 80);
				*((word32) a3 + 76) = a0_27;
				if (a5_11 == a4_20)
					*((word32) a3 + 80) = a0_27;
			}
			else
			{
				*a3 = a4_20;
				Eq_2 a0_25 = *((word32) a3 + 80);
				if (a5_11 == a3)
					*((word32) a4_20 + 80) = a0_25;
			}
			*a5_11 = 0x00;
			Eq_2 a4_34 = (word32) a4_20 - 1;
			*((word32) a4_34 + 84) = *((word32) a4_20 + 84);
			*a5_11 = 0x00;
			word32 s4_238;
			Eq_2 a4_58;
			Eq_2 a5_59;
			ptr32 mstatus_62;
			ptr32 s0_64;
			Eq_2 s1_65;
			ptr32 s3_67;
			ptr32 s5_69;
			ptr32 s8_71;
			word32 s2_237;
			word32 s6_239;
			word32 a2_235;
			word32 a3_236;
			word32 a0_233;
			word32 a1_234;
			Eq_2 ra_63 = net_buf_unref(ra, s1, a5_11, a1, a4_34, mstatus, dwArg00, dwArg04, dwArg08, dwArg28, dwArg78, dwArg84, dwArg98, dwArgA4, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out s0_64, out s1_65, out a0_233, out a1_234, out a2_235, out a3_236, out a4_58, out a5_59, out s2_237, out s3_67, out s4_238, out s5_69, out s6_239, out s8_71, out mstatus_62);
			s0Out = s0_64;
			s1Out = s1_65;
			a4Out = a4_58;
			a5Out = a5_59;
			s3Out = s3_67;
			s5Out = s5_69;
			s8Out = s8_71;
			mstatusOut = mstatus_62;
			return ra_63;
		}
		a4_20 = a5_11;
		a5 = a3;
	}
	s0Out = s0;
	s1Out = s1;
	a4Out = a4_20;
	a5Out = a5;
	s3Out = s3;
	s5Out = s5;
	s8Out = s8;
	mstatusOut = mstatus;
	return ra;
}

// 23047454: Register Eq_2 send_friend_clear(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_244728) s1Out, Register out (ptr32 Eq_244729) s3Out, Register out ptr32 mstatusOut)
// Called from:
//      clear_timeout
//      bt_mesh_friend_req
Eq_2 send_friend_clear(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, struct Eq_244728 & s1Out, struct Eq_244729 & s3Out, ptr32 & mstatusOut)
{
	word32 t1_151;
	word32 a0_152;
	word32 a1_153;
	word32 a2_154;
	word32 a3_155;
	word32 a4_156;
	word32 a5_157;
	Eq_2 ra_19 = memset(ra, fp + -0x0022, 0x00, 0x12, out t1_151, out a0_152, out a1_153, out a2_154, out a3_155, out a4_156, out a5_157);
	word16 wLoc28_103 = (word16) (word32) *((word32) a0 + 0x0E);
	word32 a5_158;
	word16 wLoc2C_109 = (word16) bt_mesh_primary_addr(out a5_158);
	word32 a5_159;
	Eq_2 a0_39 = bt_mesh_net_transmit_get(out a5_159);
	uint32 a5_41 = (word32) *a0;
	uint32 a5_48 = (word32) *((word32) a0 + 0x0A);
	ptr32 mstatus_76;
	struct Eq_244728 * s1_79;
	struct Eq_244729 * s3_83;
	word32 s0_160;
	word32 a0_161;
	word32 a1_162;
	word32 a3_163;
	word32 a4_164;
	word32 a5_165;
	word32 s2_166;
	word32 s4_167;
	word32 s5_168;
	word32 s6_169;
	word32 s7_170;
	word32 s8_171;
	word32 s9_172;
	word32 s11_173;
	Eq_2 ra_77 = bt_mesh_ctl_send(ra_19, a0, fp + -52, 0x00, 588036656, s2, s3, s4, s5, s6, s7, s8, mstatus, dwLoc40, SEQ((word16) (a5_48 << 8 | a5_48 >> 0x08), (word16) (a5_41 << 8 | a5_41 >> 0x08)), dwLoc34, dwLoc30, SEQ(bLoc29, (byte) a0_39, wLoc2C_109), SEQ(~0x00, wLoc28_103), dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg28, dwArg34, dwArg38, dwArg3C, 0x4200D8C0, 0x00, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_160, out s1_79, out a0_161, out a1_162, out a3_163, out a4_164, out a5_165, out s2_166, out s3_83, out s4_167, out s5_168, out s6_169, out s7_170, out s8_171, out s9_172, out s11_173, out mstatus_76);
	s1Out = s1_79;
	s3Out = s3_83;
	mstatusOut = mstatus_76;
	return ra_77;
}

// 230474E6: void friend_clear_sent(Register Eq_2 s0, Register (ptr32 Eq_244850) a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void friend_clear_sent(Eq_2 s0, struct Eq_244850 * a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	word32 s1_63;
	word32 a0_64;
	word32 a1_65;
	word32 a2_66;
	word32 a3_67;
	word32 a4_68;
	word32 a5_69;
	word32 s2_70;
	word32 s3_71;
	word32 s4_72;
	word32 s5_73;
	word32 s6_74;
	word32 s8_75;
	Eq_2 s0_22 = k_delayed_work_submit((word32) a1->w005E + 1000, a3, a4, mstatus, s0, dwLoc08, dwArg14, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s1_63, out a0_64, out a1_65, out a2_66, out a3_67, out a4_68, out a5_69, out s2_70, out s3_71, out s4_72, out s5_73, out s6_74, out s8_75);
	*((word32) s0_22 + 94) = (word16) ((word32) *((word32) s0_22 + 94) << 1);
}

// 23047514: Register Eq_2 create_friend_pdu(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_244940 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_221336) s2Out, Register out (ptr32 Eq_244946) s3Out, Register out (ptr32 uint16) s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      encode_friend_ctl
//      bt_mesh_friend_enqueue_rx
//      bt_mesh_friend_enqueue_tx
Eq_2 create_friend_pdu(Eq_2 ra, Eq_2 a0, Eq_2 s3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_244940 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, struct Eq_221336 & s2Out, struct Eq_244946 & s3Out, uint16 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a5_25;
	word32 a3_516;
	word32 a4_517;
	bt_mesh_subnet_get((word32) *((word32) a0 + 0x0E), out a3_516, out a4_517, out a5_25);
	struct Eq_244968 * s0_46;
	ptr32 a0_61;
	word32 s1_518;
	word32 s8_519;
	ptr32 s9_214;
	ptr32 s7_212;
	struct Eq_221336 * s2_237;
	uint16 * s4_239;
	ptr32 s5_240;
	ptr32 s6_241;
	struct Eq_244946 * s3_238;
	ptr32 s10_236;
	ptr32 s11_206;
	ptr32 mstatus_294;
	Eq_244940 a1_111;
	ptr32 a4_229;
	Eq_2 a5_230;
	Eq_2 a3_197;
	Eq_2 ra_202 = bt_mesh_adv_create_from_pool(ra, 0x08, 0x00, a5_25, s5, mstatus, dwArg10, dwArg14, dwArg38, dwArg54, s3, dwArg68, dwArgA8, dwArgC8, dwArgF8, out s0_46, out s1_518, out a0_61, out a1_111, out a3_197, out a4_229, out a5_230, out s2_237, out s3_238, out s4_239, out s5_240, out s6_241, out s7_212, out s8_519, out s9_214, out s10_236, out s11_206, out mstatus_294);
	ptr32 s1_235 = a0_61;
	if (a0_61 == 0x00)
	{
l23047642:
		0x00 = (int8) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1_235;
		a0Out = s1_235;
		a1Out = a1_111;
		a2Out = dwArg0100;
		a3Out = a3_197;
		a4Out = a4_229;
		a5Out = a5_230;
		s2Out = s2_237;
		s3Out = s3_238;
		s4Out = s4_239;
		s5Out = s5_240;
		s6Out = s6_241;
		s7Out = s7_212;
		s8Out = dwArg58;
		s9Out = s9_214;
		s10Out = s10_236;
		s11Out = s11_206;
		mstatusOut = mstatus_294;
		return ra_202;
	}
	Eq_2 dwLoc2C_385;
	struct Eq_274 * a0_251;
	*((word32) a5_230 + 0x0A) = (word16) (word32) s0_46->w0000;
	*(union Eq_2 *) 0x0F = a5_230;
	*(union Eq_2 *) 0x13 = a5_230;
	if ((int32) s0_46->b0007 < 0x00 && ((word32) (*s3_238->t0000) & 0x007F) == 0x04)
	{
		word32 a0_99 = (word32) s2_237->b001E;
		dwArg54 = s2_237 + (a0_99 + 0x00C2) / 31;
		dwLoc2C = SEQ((byte) (word32) (&(s2_237 + (a0_99 + 89) / 31)->b001E)[0x0022], (word24) (s2_237 + (a0_99 + 0x009A) / 31));
	}
	else
	{
		dwLoc2C_385 = dwLoc2C;
		if (friend_cred_get(s2_237, (word32) *s4_239, fp + -41, fp + -40, fp + -36, out a1_111, out a3_197) != 0x00)
		{
			a0_251 = (struct Eq_274 *) &g_t230BA89C;
			goto l23047636;
		}
	}
	Eq_2 a1_129;
	Eq_2 a5_115 = (word32) SLICE(dwLoc2C, byte, 24);
	ui32 a1_120 = a1_111 << 7 | a5_115;
	word32 a5_559;
	net_buf_simple_add_u8(a0_61 + 8, a1_120 & 0x00FF, a5_115, out a5_559);
	struct Eq_245197 * s0_126 = (a1_120 & 0x00FF)->ptr0004;
	Eq_2 a5_127 = (int32) s0_126->b0007;
	dwLoc2C_385 = dwLoc2C;
	if (a5_127 < 0x00)
		a1_129 = (a1_120 & 0x00FF) >> 24 | 0x0080;
	else
		a1_129 = (a1_120 & 0x00FF) >> 24 & 0x007F;
	struct Eq_194075 * a5_147;
	word32 a4_544;
	word32 a5_540;
	word32 a1_541;
	word32 a2_542;
	word32 a3_543;
	net_buf_simple_add_mem(a0_61 + 8, &s0_126->w0002 + 1, 0x03, net_buf_simple_add_u8(a0_61 + 8, a1_129, a5_127, out a5_540), out a1_541, out a2_542, out a3_543, out a4_544, out a5_147);
	struct Eq_194075 * a5_161;
	word32 a4_545;
	net_buf_simple_add_be16(a0_61 + 8, (word32) s0_126->w0000, a5_147, out a4_545, out a5_161);
	Eq_2 a4_165;
	word32 a5_546;
	net_buf_simple_add_be16(a0_61 + 8, (word32) s0_126->w0002, a5_161, out a4_165, out a5_546);
	Eq_213742 a2_175;
	struct Eq_215703 * a5_178;
	word32 a3_548;
	word32 a4_549;
	word32 a1_547;
	Eq_2 a0_173 = net_buf_simple_add_mem(a0_61 + 8, s3_238->t0000, (word32) s3_238->w0004, a4_165, out a1_547, out a2_175, out a3_548, out a4_549, out a5_178);
	Eq_213742 a1_195;
	word32 s5_556;
	word32 s6_557;
	word32 s10_558;
	word32 a4_552;
	word32 a5_553;
	word32 s2_554;
	word32 s3_555;
	word32 s0_550;
	word32 s1_551;
	ra_202 = bt_mesh_net_encrypt(ra_202, a0_173, a2_175, 0x00, a5_178, out s0_550, out s1_551, out a1_195, out a3_197, out a4_552, out a5_553, out s2_554, out s3_555, out s5_556, out s6_557, out s7_212, out s9_214, out s10_558, out s11_206);
	if (a0_173 != 0x00)
		a0_251 = (struct Eq_274 *) &g_t230B90AC;
	else
	{
		word32 a0_225;
		word32 s8_522;
		word32 s0_520;
		word32 a2_521;
		ra_202 = bt_mesh_net_obfuscate(ra_202, a0_173, a1_195, dwArg54, dwArgF8, out s0_520, out s1_235, out a0_225, out a1_111, out a2_521, out a3_197, out a4_229, out a5_230, out s2_237, out s3_238, out s4_239, out s5_240, out s6_241, out s8_522, out s10_236);
		if (a0_225 == 0x00)
			goto l23047642;
		a0_251 = (struct Eq_274 *) &g_t230B90C4;
	}
l23047636:
	Eq_2 a1_262;
	Eq_2 a4_265;
	Eq_2 s1_268;
	word32 a2_538;
	word32 s8_539;
	word32 t4_534;
	word32 s0_535;
	word32 s1_536;
	word32 a0_537;
	word32 s4_530;
	word32 s5_531;
	word32 s6_532;
	word32 s8_533;
	word32 a5_526;
	word32 a7_527;
	word32 s2_528;
	word32 s3_529;
	word32 a0_523;
	word32 a2_524;
	word32 a3_525;
	ra_202 = net_buf_unref(printf(ra_202, a0_251, a3_197, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_268, out a0_523, out a1_262, out a2_524, out a3_525, out a4_265, out a5_526, out a7_527, out s2_528, out s3_529, out s4_530, out s5_531, out s6_532, out s7_212, out s8_533, out s9_214, out s10_236, out s11_206, out t4_534), s1_268, s1_268, a1_262, a4_265, mstatus_294, dwLoc30, dwLoc2C_385, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_535, out s1_536, out a0_537, out a1_111, out a2_538, out a3_197, out a4_229, out a5_230, out s2_237, out s3_238, out s4_239, out s5_240, out s6_241, out s8_539, out mstatus_294);
	s1_235 = 0x00;
	goto l23047642;
}

