pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23047670: void clear_timeout(Register Eq_2 ra, Register (ptr32 Eq_245306) a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void clear_timeout(Eq_2 ra, struct Eq_245306 * a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	word32 a1_131;
	word32 a2_132;
	word32 a5_133;
	if (a0->dwFFFFFFA4 << 1 >= k_uptime_get_32(out a1_131, out a2_132, out a5_133) - a0->tFFFFFFF8)
	{
		word32 s1_134;
		word32 s3_135;
		word32 mstatus_136;
		send_friend_clear(ra, (char *) a0 - 96, s2, s3, s4, s5, s6, s7, s8, mstatus, dwArg00, dwArg04, dwArg08, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s1_134, out s3_135, out mstatus_136);
	}
	else
		a0->w0FFC = 0x00;
}

// 230476A6: Register Eq_2 friend_lpn_matches(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      bt_mesh_friend_match
//      bt_mesh_friend_queue_has_space
//      bt_mesh_friend_enqueue_rx
//      bt_mesh_friend_enqueue_tx
//      bt_mesh_friend_clear_incomplete
Eq_2 friend_lpn_matches(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a0_10;
	ui32 a5_5 = (word32) *((word32) a0 + 3);
	Eq_2 a5_14 = a5_5 & 64;
	if ((a5_5 & 64) != 0x00)
	{
		a5_14 = (word32) *((word32) a0 + 0x0E);
		a0_10.u0 = 0x00;
		if (a5_14 == a1)
		{
			a5_14 = (int32) (word16) a2;
			if (a5_14 <= 0x00)
			{
				a5_14 = (word32) *((word32) a0 + 16);
				a0_10.u0 = 0x01;
				if (a5_14 != a2)
				{
					a5_14 = (word32) *((word32) a0 + 18);
					if (a5_14 != a2)
					{
						Eq_2 a0_27 = (word32) ((word32) *((word32) a0 + 20) - a2 < 1);
						a3Out = a3;
						a4Out.u0 = <invalid>;
						a5Out = a5_14;
						return a0_27;
					}
				}
			}
			else
			{
				a3 = (word32) *a0;
				if (a3 != 0x00)
				{
					Eq_2 a5_16 = 0x00;
					if (a2 >= a3)
						a5_16 = (word32) (a2 < (word32) a3 + (word32) (*((word32) a0 + 8)));
					a3Out = a3;
					a4Out.u0 = <invalid>;
					a5Out = a5_16;
					return a5_16;
				}
			}
		}
	}
	else
		a0_10.u0 = 0x00;
	a3Out = a3;
	a4Out.u0 = <invalid>;
	a5Out = a5_14;
	return a0_10;
}

// 23047702: Register Eq_2 friend_queue_has_space.part.6(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register (ptr32 Eq_245439) a5, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      friend_queue_prepare_space
//      bt_mesh_friend_queue_has_space
Eq_2 friend_queue_has_space.part.6(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, struct Eq_245439 * a5, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (a2 != 0x00)
	{
		a0 = a5->t003C;
		if (a5 != null)
		{
			a4 = (word32) a5->ptr0014->w000A;
			if (a4 == a1 && a1 == a4)
			{
				Eq_2 a5_12 = *((word32) a4 + 20);
				if (a4 == a5_12)
				{
					a4Out = a4;
					a5Out = a5_12;
					return 0x01;
				}
			}
		}
	}
	Eq_2 a5_18 = (word32) *((word32) a0 + 0x0044);
	a4Out = a4;
	a5Out = a5_18;
	return (word32) (a3 < 0x10 - a5_18);
}

// 23047734: void buf_send_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_245479) a2, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void buf_send_start(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, struct Eq_245479 * a2, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	ui32 a5_5 = (word32) a2->b0003;
	a2->b0003 = (byte) (a5_5 & -0x0011);
	if ((a5_5 & 64) != 0x00)
		return;
	struct Eq_245508 * s0_30;
	word32 s1_108;
	word32 a0_109;
	word32 a1_110;
	word32 a2_111;
	word32 a3_112;
	word32 a4_113;
	word32 a5_114;
	word32 s2_115;
	word32 s3_116;
	word32 s4_117;
	word32 s5_118;
	word32 s6_119;
	word32 s8_120;
	word32 mstatus_121;
	net_buf_unref(ra, s1, a0, a1, a5_5 & -0x0011, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_30, out s1_108, out a0_109, out a1_110, out a2_111, out a3_112, out a4_113, out a5_114, out s2_115, out s3_116, out s4_117, out s5_118, out s6_119, out s8_120, out mstatus_121);
	s0_30->dw0048 = 0x00;
}

// 23047762: void buf_send_end(Register Eq_2 ra, Register (ptr32 Eq_245548) a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void buf_send_end(Eq_2 ra, struct Eq_245548 * a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	ui32 a5_5 = (word32) a1->b0003;
	if ((a5_5 & 4) == 0x00)
	{
		Eq_2 a1_10;
		if ((a5_5 & 64) != 0x00)
			a1_10 = a1->t0004;
		else
			a1_10.u0 = 1000;
		word32 s1_164;
		word32 a0_165;
		word32 a1_166;
		word32 a2_167;
		word32 a3_168;
		word32 a4_169;
		word32 a5_170;
		word32 s2_171;
		word32 s3_172;
		word32 s4_173;
		word32 s5_174;
		word32 s6_175;
		word32 s8_176;
		k_delayed_work_submit(a1_10, a3, a5_5 & 4, mstatus, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_164, out a0_165, out a1_166, out a2_167, out a3_168, out a4_169, out a5_170, out s2_171, out s3_172, out s4_173, out s5_174, out s6_175, out s8_176);
	}
	else
	{
		word32 a4_150;
		word32 a3_149;
		word32 a2_148;
		word32 a1_147;
		word32 a0_146;
		word32 s1_145;
		word32 a5_151;
		word32 a7_152;
		word32 s2_153;
		word32 s3_154;
		word32 s4_155;
		word32 s5_156;
		word32 s6_157;
		word32 s7_158;
		word32 s8_159;
		word32 s9_160;
		word32 s10_161;
		word32 s11_162;
		word32 t4_163;
		printf(ra, &g_t230BA868, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_145, out a0_146, out a1_147, out a2_148, out a3_149, out a4_150, out a5_151, out a7_152, out s2_153, out s3_154, out s4_155, out s5_156, out s6_157, out s7_158, out s8_159, out s9_160, out s10_161, out s11_162, out t4_163);
	}
}

// 2304778E: Register Eq_2 purge_buffers(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register Eq_2 a4, Register (ptr32 Eq_245664) a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_245664) a5Out, Register out (ptr32 Eq_245683) s2Out, Register out (ptr32 Eq_245684) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      friend_clear
//      bt_mesh_friend_clear_incomplete
Eq_2 purge_buffers(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, Eq_2 a1, Eq_2 a4, struct Eq_245664 * a5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s1Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, struct Eq_245664 & a5Out, struct Eq_245683 & s2Out, struct Eq_245684 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	ra_26 = ra;
	while (true)
	{
		Eq_2 ra_26;
		if (a0 == 0x00)
			break;
		Eq_2 a0_14 = a5->t0000;
		Eq_2 s0_16 = *((word32) a4 + 4);
		a5->t0000 = s0_16;
		if (a0_14 == a4)
			a5->t0004 = s0_16;
		ui32 a5_21 = (word32) *((word32) a0_14 + 5);
		*a0_14 = 0x00;
		*((word32) a0_14 + 5) = (byte) (a5_21 & ~0x01);
		word32 s0_164;
		word32 a2_165;
		ra_26 = net_buf_unref(ra_26, s1, a0_14, a1, a4, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_164, out s1, out a0, out a1, out a2_165, out a3, out a4, out a5, out s2, out s3, out s4, out s5, out s6, out s8, out mstatus);
	}
	s1Out = s1;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s8Out = s8;
	mstatusOut = mstatus;
	return ra_26;
}

// 230477C2: Register Eq_2 friend_clear(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out (ptr32 Eq_245781) s1Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_245785 s2Out, Register out (ptr32 Eq_245786) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      friend_timeout
//      bt_mesh_friend_clear_net_idx
//      bt_mesh_friend_clear
//      bt_mesh_friend_req
Eq_2 friend_clear(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, struct Eq_245781 & s1Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_245785 & s2Out, struct Eq_245786 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	word32 s6_259;
	word32 s8_260;
	word32 s4_257;
	word32 s5_258;
	word32 s3_256;
	word32 a5_254;
	word32 s2_255;
	word32 a3_252;
	word32 a4_253;
	word32 a1_250;
	word32 a2_251;
	word32 a0_249;
	Eq_2 s1_19 = k_delayed_work_cancel((word32) a0 + 24, a3, a4, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_249, out a1_250, out a2_251, out a3_252, out a4_253, out a5_254, out s2_255, out s3_256, out s4_257, out s5_258, out s6_259, out s8_260);
	Eq_2 a0_38;
	word32 a3_261;
	struct Eq_245664 * a5_42;
	Eq_2 a4_41;
	Eq_2 a1_43;
	Eq_2 ra_44 = friend_cred_del(ra, (word32) *((word32) a0 + 0x0E), (word32) *a0, out a0_38, out a1_43, out a3_261, out a4_41, out a5_42);
	Eq_2 s0_47 = *((word32) a4_41 + 72);
	if (a4_41 != 0x00)
	{
		if (((word32) *((word32) s0_47 + 3) & 0x10) != 0x00)
		{
			a4_41 = *((word32) a4_41 + 20);
			*((word32) a4_41 + 8) = (byte) ((word32) *((word32) a4_41 + 8) & ~0x04);
		}
		word32 s4_278;
		word32 s3_277;
		word32 s2_276;
		word32 a3_275;
		word32 a2_274;
		word32 a0_273;
		word32 s5_279;
		word32 s6_280;
		word32 s8_281;
		ra_44 = net_buf_unref(ra_44, s1_19, a0_38, a1_43, a4_41, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_47, out s1_19, out a0_273, out a1_43, out a2_274, out a3_275, out a4_41, out a5_42, out s2_276, out s3_277, out s4_278, out s5_279, out s6_280, out s8_281, out mstatus);
		((word32) s0_47 + 72)->u0 = 0x00;
	}
	Eq_2 a1_100;
	Eq_2 a4_103;
	struct Eq_245664 * a5_104;
	ptr32 mstatus_107;
	Eq_2 s1_109;
	ptr32 mstatus_132;
	struct Eq_245781 * s1_134;
	Eq_245785 s2_135;
	struct Eq_245786 * s3_136;
	ptr32 s4_137;
	ptr32 s5_138;
	ptr32 s6_139;
	ptr32 s8_140;
	word32 a5_272;
	word32 a4_271;
	word32 a3_270;
	word32 a1_269;
	word32 s8_268;
	word32 s6_267;
	word32 s5_266;
	word32 s4_265;
	word32 s3_264;
	word32 s2_263;
	word32 a3_262;
	Eq_2 ra_133 = purge_buffers(purge_buffers(ra_44, s0_47, s1_19, (word32) s0_47 + 76, a1_43, a4_41, a5_42, mstatus, dwArg08, dwArg58, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s1_109, out a1_100, out a3_262, out a4_103, out a5_104, out s2_263, out s3_264, out s4_265, out s5_266, out s6_267, out s8_268, out mstatus_107), s0_47, s1_109, (word32) s0_47 + 60, a1_100, a4_103, a5_104, mstatus_107, dwArg08, dwArg58, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s1_134, out a1_269, out a3_270, out a4_271, out a5_272, out s2_135, out s3_136, out s4_137, out s5_138, out s6_139, out s8_140, out mstatus_132);
	ui32 a5_148 = (word32) *((word32) s0_47 + 3);
	((word32) s0_47 + 0x0044)->u0 = 0x00;
	((word32) s0_47 + 84)->u0 = 0x00;
	*((word32) s0_47 + 3) = (byte) (a5_148 & -118);
	Eq_2 a0_153 = (word32) s0_47 + 16;
	ptr32 a1_160;
	ptr32 a3_162;
	ptr32 a4_163;
	word32 t1_282;
	word32 a0_283;
	word32 a2_284;
	word32 a5_285;
	Eq_2 ra_165 = memset(ra_133, a0_153, 0x00, 0x06, out t1_282, out a0_283, out a1_160, out a2_284, out a3_162, out a4_163, out a5_285);
	s1Out = s1_134;
	a1Out = a1_160;
	a3Out = a3_162;
	a4Out = a4_163;
	s2Out = s2_135;
	s3Out = s3_136;
	s4Out = s4_137;
	s5Out = s5_138;
	s6Out = s6_139;
	s8Out = s8_140;
	mstatusOut = mstatus_132;
	return ra_165;
}

// 23047834: void friend_timeout(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_246002) a0, Register (ptr32 Eq_246003) a2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168)
void friend_timeout(Eq_2 ra, Eq_2 s0, struct Eq_246002 * a0, struct Eq_246003 * a2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168)
{
	struct Eq_246002 * a0_109;
	ui32 a5_9 = (word32) a0->bFFFFFFEB;
	Eq_2 a4_11 = a5_9 & 2;
	a0_109 = a0;
	if ((a5_9 & 2) != 0x00)
	{
		a0_109 = (a5_9 & 2)->ptr0030;
		if ((a5_9 & 2) != 0x00)
		{
			a0_109->b0FEB = (byte) (a5_9 & ~0x02);
			goto l23047852;
		}
	}
	struct Eq_274 * a0_41;
	int32 a3_15 = a0_109->dwFFFFFFE8;
	if ((a3_15 & 0x44000000) == 0x40000000)
		a0_41 = (struct Eq_274 *) &g_t230BA964;
	else
	{
		struct Eq_246088 * a0_20 = (a3_15 & 0x44000000)->ptr0034;
		if ((a3_15 & 0x44000000) != 0x00)
		{
			struct Eq_246003 * a4_21 = *(struct Eq_246003 **) 0x40000000;
			a0_109 = a2->ptr0038;
			*(struct Eq_246002 **) 0x40000034 = a0_109;
			if (a4_21 == a2)
				*(struct Eq_246002 **) 0x40000038 = a0_109;
			a4_21->ptr0030 = a0_109;
			a4_21->b0005 = (byte) ((word32) a4_21->b0005 & ~0x01);
			a4_21->dw0000 = 0x00;
			a4_21->dw003B = a4_21->dw003C;
			a4_11 = (char *) a4_21 - 1;
l23047852:
			a0_109->b0FEB = (byte) ((word32) a0_109->bFFFFFFEB & ~0x04 | 16);
			word32 a3_299;
			word32 a4_300;
			word32 a1_298;
			word32 s2_302;
			word32 s3_303;
			word32 a5_301;
			word32 s6_305;
			word32 s8_306;
			word32 s5_304;
			bt_mesh_adv_send(ra, s0, 588036648, dwArg10, a4_11, mstatus, dwArgE8, dwArg0128, dwArg0168, out a1_298, out a3_299, out a4_300, out a5_301, out s2_302, out s3_303, out s5_304, out s6_305, out s8_306);
			return;
		}
		a0_20->dw0030 = 0x00;
		a0_41 = (struct Eq_274 *) &g_t230BA984;
	}
	word32 a7_323;
	word32 a5_322;
	word32 s2_324;
	word32 s3_325;
	word32 s4_326;
	word32 s5_327;
	Eq_2 a3_57;
	Eq_2 a4_58;
	word32 s7_329;
	word32 s6_328;
	word32 s9_331;
	word32 s8_330;
	word32 s10_332;
	word32 s11_333;
	word32 a1_320;
	word32 a2_321;
	word32 s1_318;
	word32 a0_319;
	word32 t4_334;
	Eq_2 ra_60 = printf(ra, a0_41, 0x40000000, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_318, out a0_319, out a1_320, out a2_321, out a3_57, out a4_58, out a5_322, out a7_323, out s2_324, out s3_325, out s4_326, out s5_327, out s6_328, out s7_329, out s8_330, out s9_331, out s10_332, out s11_333, out t4_334);
	word32 s8_316;
	word32 mstatus_317;
	word32 s5_314;
	word32 s6_315;
	word32 s3_312;
	word32 s4_313;
	word32 a4_310;
	word32 s2_311;
	word32 a3_309;
	word32 a1_308;
	word32 s1_307;
	friend_clear(ra_60, s0, &a0->dwFFFFFFE8, a3_57, a4_58, mstatus, dwArg08, dwArg18, dwArg24, dwArg28, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, out s1_307, out a1_308, out a3_309, out a4_310, out s2_311, out s3_312, out s4_313, out s5_314, out s6_315, out s8_316, out mstatus_317);
}

// 230478E2: Register Eq_2 encode_friend_ctl(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_246251) s0Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      enqueue_sub_cfm
//      enqueue_update
//      bt_mesh_friend_req
Eq_2 encode_friend_ctl(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, struct Eq_246251 & s0Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	net_buf_simple_push_u8(a1, a4);
	ptr32 mstatus_37;
	Eq_2 s1_39;
	Eq_2 s3_43;
	Eq_2 s5_45;
	ptr32 a1_73;
	ptr32 a3_75;
	ptr32 a4_76;
	ptr32 mstatus_80;
	ptr32 s10_84;
	ptr32 s11_85;
	ptr32 s2_86;
	ptr32 s3_87;
	ptr32 s5_89;
	ptr32 s6_90;
	ptr32 s7_91;
	ptr32 s9_93;
	ptr32 a0_101;
	word32 a5_170;
	word32 a0_171;
	word32 a4_172;
	word32 a5_173;
	word32 s2_174;
	word32 s4_175;
	word32 s10_176;
	word32 s0_177;
	word32 s1_178;
	word32 a2_179;
	word32 a5_180;
	word32 s4_181;
	word32 s8_182;
	Eq_2 ra_81 = create_friend_pdu(bt_mesh_next_seq(ra, s0, a0, a3, mstatus, dwLoc30, dwLoc2C, dwLoc28, dwLoc24, SEQ(0x80, nLoc18), dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg08, dwArg18, dwArg20, dwArg24, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0138, out s1_39, out a0_171, out a4_172, out a5_173, out s2_174, out s3_43, out s4_175, out s5_45, out s10_176, out mstatus_37), s1_39, s3_43, s5_45, mstatus_37, dwLoc20, SEQ((word16) (word32) *a0, (word16) bt_mesh_primary_addr(out a5_170)), dwArg08, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg58, g_t4200D6BC - (atomic_get(0x4200D6C4) >> 2 & 0x01), dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, out s0_177, out s1_178, out a0_101, out a1_73, out a2_179, out a3_75, out a4_76, out a5_180, out s2_86, out s3_87, out s4_181, out s5_89, out s6_90, out s7_91, out s8_182, out s9_93, out s10_84, out s11_85, out mstatus_80);
	s0Out = dwArgE4;
	a0Out = a0_101;
	a1Out = a1_73;
	a3Out = a3_75;
	a4Out = a4_76;
	s2Out = s2_86;
	s3Out = s3_87;
	s5Out = s5_89;
	s6Out = s6_90;
	s7Out = s7_91;
	s9Out = s9_93;
	s10Out = s10_84;
	s11Out = s11_85;
	mstatusOut = mstatus_80;
	return ra_81;
}

