pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23047954: Register Eq_2 enqueue_sub_cfm(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_friend_sub_add
//      bt_mesh_friend_sub_rem
Eq_2 enqueue_sub_cfm(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, union Eq_2 & s0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s3Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	net_buf_simple_reserve((word32 *) 0x01, 0x00020000);
	word32 a1_227;
	word32 a5_228;
	*net_buf_simple_add(fp + ~0x1B, 0x01, a4, out a1_227, out a5_228) = (byte) a1;
	Eq_2 a0_34;
	word32 s2_229;
	word32 s5_230;
	word32 s6_231;
	word32 s10_232;
	word32 s11_233;
	Eq_2 a1_102;
	Eq_2 a3_104;
	Eq_2 a4_105;
	ptr32 mstatus_185;
	Eq_2 s0_189;
	ptr32 s3_112;
	ptr32 s7_116;
	ptr32 s9_118;
	Eq_2 ra_107 = encode_friend_ctl(ra, a0, a0, 0x09, a3, a4, mstatus, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, dwArg48, dwArg4C, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, out s0_189, out a0_34, out a1_102, out a3_104, out a4_105, out s2_229, out s3_112, out s5_230, out s6_231, out s7_116, out s9_118, out s10_232, out s11_233, out mstatus_185);
	if (a0_34 == 0x00)
	{
		word32 s1_234;
		word32 a0_235;
		word32 a2_236;
		word32 a5_237;
		word32 a7_238;
		word32 s2_239;
		word32 s4_240;
		word32 s5_241;
		word32 s6_242;
		word32 s8_243;
		word32 s10_244;
		word32 s11_245;
		word32 t4_246;
		ra_107 = printf(ra_107, &g_t230BA8E8, a3_104, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_234, out a0_235, out a1_102, out a2_236, out a3_104, out a4_105, out a5_237, out a7_238, out s2_239, out s3_112, out s4_240, out s5_241, out s6_242, out s7_116, out s8_243, out s9_118, out s10_244, out s11_245, out t4_246);
	}
	else
	{
		Eq_2 s1_63 = a0_34;
		s0_189 = *((word32) a0_34 + 72);
		if (a0_34 != 0x00)
		{
			word32 a0_247;
			word32 a2_248;
			word32 a5_249;
			word32 s2_250;
			word32 s4_251;
			word32 s5_252;
			word32 s6_253;
			word32 s8_254;
			ra_107 = net_buf_unref(ra_107, a0_34, a0_34, a1_102, a4_105, mstatus_185, dwLoc20, 0x00020000, dwLoc18, dwArg08, dwArg58, fp + ~0x1F, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_189, out s1_63, out a0_247, out a1_102, out a2_248, out a3_104, out a4_105, out a5_249, out s2_250, out s3_112, out s4_251, out s5_252, out s6_253, out s8_254, out mstatus_185);
		}
		ui32 a5_92 = (word32) *((word32) s0_189 + 3);
		*((word32) s1_63 + 72) = s0_189;
		*((word32) s0_189 + 3) = (byte) (a5_92 | 2);
	}
	s0Out = s0_189;
	a1Out = a1_102;
	a3Out = a3_104;
	a4Out = a4_105;
	s3Out = s3_112;
	s7Out = s7_116;
	s9Out = s9_118;
	mstatusOut = mstatus_185;
	return ra_107;
}

// 230479BA: Register Eq_2 friend_queue_prepare_space(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_246576) a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out Eq_2 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_friend_enqueue_rx
//      bt_mesh_friend_enqueue_tx
Eq_2 friend_queue_prepare_space(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_246576 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_2 & s8Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s1_115;
	ptr32 s2_128;
	struct Eq_246576 * a5_107 = (struct Eq_246576 *) 0x10;
	s1_115 = s1;
	if (a3 <= 0x10)
	{
		ptr32 a0_23 = friend_queue_has_space.part.6(a0, a1, a2, a3, (struct Eq_245439 *) 0x10, out a4, out a5_107);
		s1_115 = a0;
		s3 = a3;
		s2_128 = a0_23;
		if (a0_23 != 0x00)
		{
			s1_115 = a5_107->t0054;
			word32 s4_30 = 0x00;
			Eq_2 s0_32 = 0x10 - a5_107 & 0x00FF;
			while (s4_30 != 0x00 || s0_32 < s3)
			{
				if (a0_23 == 0x00)
				{
					word32 a0_353;
					word32 a2_354;
					word32 a7_355;
					word32 s2_356;
					word32 s4_357;
					word32 s8_358;
					word32 s9_359;
					word32 t4_360;
					ra = printf(ra, &g_t230BA940, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_115, out a0_353, out a1, out a2_354, out a3, out a4, out a5_107, out a7_355, out s2_356, out s3, out s4_357, out s5, out s6, out s7, out s8_358, out s9_359, out s10, out s11, out t4_360);
					goto l23047A10;
				}
				Eq_2 a0_43 = a5_107->t0000;
				Eq_2 s1_46 = *((word32) a4 + 80);
				a5_107->t004C = s1_46;
				if (a0_43 == a4)
					a5_107->t0050 = s1_46;
				Eq_2 s1_51 = a5_107->t0054;
				a5_107->t0053 = s1_51;
				ui32 a5_59 = (word32) *((word32) a0_43 + 5);
				*a0_43 = 0x00;
				*((word32) a0_43 + 5) = (byte) (a5_59 & ~0x01);
				word32 a2_361;
				word32 s8_362;
				ra = net_buf_unref(ra, s1_51, a0_43, a1, a4, mstatus, dwLoc20, s4, s2, dwArg08, dwArg58, s3, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_32, out s1_115, out a0_23, out a1, out a2_361, out a3, out a4, out a5_107, out s2_128, out s3, out s4_30, out s5, out s6, out s8_362, out mstatus);
			}
		}
	}
	else
	{
l23047A10:
		s2_128 = 0x00;
	}
	s0Out = s1;
	s1Out = s1_115;
	a0Out = s2_128;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_107;
	s2Out = s2_128;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s4;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

// 23047A44: Register Eq_2 enqueue_update(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Register out (ptr32 Eq_246736) s1Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_246739) a4Out, Register out (ptr32 Eq_246740) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      enqueue_friend_pdu
//      bt_mesh_friend_poll
Eq_2 enqueue_update(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, struct Eq_246736 & s1Out, union Eq_2 & a1Out, ptr32 & a3Out, struct Eq_246739 & a4Out, struct Eq_246740 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_246736 * s1_110;
	Eq_2 a1_100;
	ptr32 a3_106;
	struct Eq_246739 * a4_107;
	struct Eq_246740 * a5_115;
	Eq_2 a4_26;
	Eq_2 a5_27;
	word32 a3_231;
	Eq_2 a0_25 = bt_mesh_subnet_get((word32) *((word32) a0 + 0x0E), out a3_231, out a4_26, out a5_27);
	net_buf_simple_reserve((word32 *) 0x01, a5_27);
	word32 a1_232;
	word32 a5_233;
	Eq_2 a0_36 = net_buf_simple_add(fp + -44, 0x06, a4_26, out a1_232, out a5_233);
	*a0_36 = (byte) bt_mesh_net_flags(a0_25);
	Eq_2 a4_45 = g_t4200D6BC;
	uint32 a5_57 = a4_45 >> 0x18 | a4_45 << 0x18 | a4_45 >> 0x08 & 0x0FFFFF00 | a4_45 << 8 & 0x00FF0000;
	*((word32) a0_36 + 1) = (byte) a5_57;
	*((word32) a0_36 + 2) = (byte) (a5_57 >> 0x08);
	*((word32) a0_36 + 3) = (byte) (a5_57 >> 0x10);
	*((word32) a0_36 + 4) = (byte) (a5_57 >> 24);
	*((word32) a0_36 + 5) = (byte) a1;
	Eq_2 a0_70;
	Eq_2 a3_73;
	Eq_2 a4_74;
	ptr32 mstatus_78;
	struct Eq_246839 * s0_80;
	word32 a1_234;
	ptr32 s10_129;
	ptr32 s11_130;
	ptr32 s2_131;
	ptr32 s3_132;
	ptr32 s5_134;
	ptr32 s6_135;
	ptr32 s7_136;
	ptr32 s9_138;
	Eq_2 ra_127 = encode_friend_ctl(ra, a0, a0, 0x02, 0x00FF0000, a5_57 >> 0x10, mstatus, dwLoc38, dwLoc30, dwLoc2C, s2, dwLoc20, dwLoc1C, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg38, fp + -52, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, out s0_80, out a0_70, out a1_234, out a3_73, out a4_74, out s2_131, out s3_132, out s5_134, out s6_135, out s7_136, out s9_138, out s10_129, out s11_130, out mstatus_78);
	if (a0_70 == 0x00)
	{
		word32 a0_237;
		word32 a2_238;
		word32 a7_239;
		word32 s4_240;
		word32 s8_241;
		word32 t4_242;
		ra_127 = printf(ra_127, &g_t230BA91C, a3_73, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_110, out a0_237, out a1_100, out a2_238, out a3_106, out a4_107, out a5_115, out a7_239, out s2_131, out s3_132, out s4_240, out s5_134, out s6_135, out s7_136, out s8_241, out s9_138, out s10_129, out s11_130, out t4_242);
	}
	else
	{
		s0_80->b0003 = (byte) ((word32) s0_80->b0003 & ~0x08);
		struct Eq_246890 * a5_108;
		word32 s4_235;
		word32 s8_236;
		net_buf_slist_put(a0_70, a3_73, a4_74, mstatus_78, out s1_110, out a3_106, out a4_107, out a5_108, out s4_235, out s8_236);
		a5_108->dw0055 = a5_108->dw0054;
		a1_100 = a0_70;
		a5_115 = (struct Eq_246740 *) ((char *) a5_108 + 1);
	}
	s1Out = s1_110;
	a1Out = a1_100;
	a3Out = a3_106;
	a4Out = a4_107;
	a5Out = a5_115;
	s2Out = s2_131;
	s3Out = s3_132;
	s4Out = dwArgF4;
	s5Out = s5_134;
	s6Out = s6_135;
	s7Out = s7_136;
	s8Out = dwArgD4;
	s9Out = s9_138;
	s10Out = s10_129;
	s11Out = s11_130;
	mstatusOut = mstatus_78;
	return ra_127;
}

// 23047B12: Register Eq_2 enqueue_friend_pdu(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_246946) a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out (ptr32 Eq_246982) a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_246984) a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_246986) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_friend_enqueue_rx
//      bt_mesh_friend_enqueue_tx
Eq_2 enqueue_friend_pdu(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, struct Eq_246946 * a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a1Out, struct Eq_246982 & a3Out, union Eq_2 & a4Out, struct Eq_246984 & a5Out, union Eq_2 & s2Out, struct Eq_246986 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 s8_106;
	ptr32 s4_105;
	Eq_2 a1_121;
	Eq_2 a4_101;
	struct Eq_246982 * a3_100;
	struct Eq_246984 * a5_112;
	Eq_2 s1_104;
	Eq_2 s1_15 = a3;
	if (a1 == 0x00)
	{
		if (((word32) *((word32) a0 + 3) & 0x08) != 0x00)
		{
			word32 s9_535;
			word32 s8_534;
			word32 a5_532;
			word32 s4_533;
			word32 a1_531;
			ra = enqueue_update(ra, a3, a0, 0x01, s2, mstatus, s0, dwLoc08, dwArg08, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgE8, out s1_15, out a1_531, out a3, out a4, out a5_532, out s2, out s3, out s4_533, out s5, out s6, out s7, out s8_534, out s9_535, out s10, out s11, out mstatus);
		}
		struct Eq_247028 * a5_220;
		net_buf_slist_put(s1_15, a3, a4, mstatus, out s1_104, out a3_100, out a4_101, out a5_220, out s4_105, out s8_106);
		a5_220->dw0055 = a5_220->dw0054;
		a1_121 = s1_15;
		a5_112 = (struct Eq_246984 *) ((char *) a5_220 + 1);
		goto l23047B40;
	}
	Eq_2 a3_18 = a5[20];
	Eq_2 a0_20 = *((word32) a4 + 60);
	s2 = a1;
	Eq_2 a1_22 = (word32) a5[0x0A];
	if (a4 == 0x00)
	{
		*((word32) a0_20 + 0x0044) = (byte) a2;
		goto l23047B72;
	}
	else
	{
		a3_18 = (word32) *((word32) *((word32) a4 + 20) + 0x0A);
		if (a3_18 == a1_22)
		{
			struct Eq_247132 * a4_27 = *((word32) a2 + 16);
			struct Eq_247136 * a5_28 = *((word32) a3_18 + 16);
			if (a2 == a3_18)
			{
				a4 = a4_27->t0014;
				if (a4 == a5_28->t0014)
				{
l23047B72:
					a1_121 = a3;
					word32 a5_549;
					Eq_2 s0_103 = net_buf_slist_put(a3, a3_18, a4, mstatus, out s1_104, out a3_100, out a4_101, out a5_549, out s4_105, out s8_106);
					if (a1 == 0x02)
					{
						ui32 a5_114 = (word32) *((word32) s0_103 + 3);
						a5_112 = a5_114 & 0x08;
						if ((a5_114 & 0x08) != 0x00)
						{
							word32 s9_551;
							word32 a3_550;
							ra = enqueue_update(ra, s1_104, s0_103, 0x01, a1, mstatus, s0, dwLoc08, dwArg08, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgE8, out s1_104, out a1_121, out a3_550, out a4_101, out a5_112, out s2, out s3, out s4_105, out s5, out s6, out s7, out s8_106, out s9_551, out s10, out s11, out mstatus);
						}
						a3_100 = (struct Eq_246982 *) ~0x00;
						while (a5_112 != null)
						{
							struct Eq_246984 ** a5_157 = *((word32) a4_101 + 20);
							*(union Eq_2 *) 0x0F = a4_101;
							*(union Eq_2 *) 0x13 = a4_101;
							a4_101 = (word32) a4_101 + 1;
							*((word32) a4_101 + 84) = *((word32) a4_101 + 84);
							a5_112 = (struct Eq_246984 *) *a5_157;
						}
						struct Eq_247223 * s0_168 = a5_112[64];
						if (a4_101 == 0x00)
							*(struct Eq_247223 **) 0x4B = s0_168;
						else
							*(union Eq_2 *) ~0x00 = a4_101;
						a5_112[80] = (struct Eq_246984) s0_168;
						s0_168->dw003C = 0x00;
						s0_168->dw0040 = 0x00;
						s0_168->b0044 = 0x00;
					}
					else
					{
						ui32 a5_111 = (word32) *((word32) s1_104 + 5);
						*((word32) s1_104 + 5) = (byte) (a5_111 | 1);
						a5_112 = a5_111 | 1;
					}
l23047B40:
					0x00 = (int8) dwArg38;
					s0Out = s0;
					s1Out = s1_104;
					a1Out = a1_121;
					a3Out = a3_100;
					a4Out = a4_101;
					a5Out = a5_112;
					s2Out = s2;
					s3Out = s3;
					s4Out = s4_105;
					s5Out = s5;
					s6Out = s6;
					s7Out = s7;
					s8Out = s8_106;
					s10Out = s10;
					s11Out = s11;
					mstatusOut = mstatus;
					return ra;
				}
			}
		}
		Eq_2 a1_40;
		Eq_2 a4_43;
		Eq_2 s1_46;
		ptr32 s10_47;
		ptr32 s11_48;
		ptr32 s7_54;
		word32 t4_548;
		word32 s8_546;
		word32 s9_547;
		word32 s6_545;
		word32 s4_543;
		word32 s5_544;
		word32 s3_542;
		word32 a7_540;
		word32 s2_541;
		word32 a5_539;
		word32 a2_537;
		word32 a3_538;
		word32 a0_536;
		Eq_2 ra_45 = printf(ra, &g_t230BA8B8, a3_18, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_46, out a0_536, out a1_40, out a2_537, out a3_538, out a4_43, out a5_539, out a7_540, out s2_541, out s3_542, out s4_543, out s5_544, out s6_545, out s7_54, out s8_546, out s9_547, out s10_47, out s11_48, out t4_548);
		0x00 = (int8) dwArg38;
		Eq_2 a1_67;
		struct Eq_246982 * a3_69;
		Eq_2 a4_70;
		struct Eq_246984 * a5_71;
		ptr32 mstatus_74;
		Eq_2 s0_76;
		Eq_2 s1_77;
		Eq_2 s2_78;
		struct Eq_246986 * s3_79;
		ptr32 s4_80;
		ptr32 s5_81;
		ptr32 s6_82;
		ptr32 s8_83;
		word32 a2_553;
		word32 a0_552;
		Eq_2 ra_75 = net_buf_unref(ra_45, s1_46, s1_46, a1_40, a4_43, mstatus, dwArg00, dwArg04, dwArg08, dwArg28, dwArg78, dwArg84, dwArg98, dwArgA4, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out s0_76, out s1_77, out a0_552, out a1_67, out a2_553, out a3_69, out a4_70, out a5_71, out s2_78, out s3_79, out s4_80, out s5_81, out s6_82, out s8_83, out mstatus_74);
		s0Out = s0_76;
		s1Out = s1_77;
		a1Out = a1_67;
		a3Out = a3_69;
		a4Out = a4_70;
		a5Out = a5_71;
		s2Out = s2_78;
		s3Out = s3_79;
		s4Out = s4_80;
		s5Out = s5_81;
		s6Out = s6_82;
		s7Out = s7_54;
		s8Out = s8_83;
		s10Out = s10_47;
		s11Out = s11_48;
		mstatusOut = mstatus_74;
		return ra_75;
	}
}

// 23047BF8: Register ptr32 bt_mesh_friend_find(Register ptr32 a0, Register Eq_2 a1, Register word32 a2, Register word32 a3, Register out Eq_2 a5Out)
// Called from:
//      lpn_timeout_get
//      bt_mesh_friend_clear
//      bt_mesh_friend_sub_add
//      bt_mesh_friend_sub_rem
//      bt_mesh_friend_poll
//      bt_mesh_friend_req
ptr32 bt_mesh_friend_find(ptr32 a0, Eq_2 a1, word32 a2, word32 a3, union Eq_2 & a5Out)
{
	struct Eq_247284 * a6_38 = &g_t4200D6BC;
	struct Eq_247286 * a4_12 = null;
	while (true)
	{
		if ((a2 == 0x00 || ((word32) a4_12->b4200D763 & 32) != 0x00) && ((a3 == 0x00 || ((word32) a4_12->b4200D763 & 64) != 0x00) && (a0 == 0x0FFFFFFF || (word32) a6_38->w002E == a0)))
		{
			Eq_2 t3_43 = (word32) a6_38->w0020;
			if (t3_43 != 0x00 && (a1 >= t3_43 && a1 < (word32) t3_43 + (word32) a6_38->b0028))
			{
				a5Out.u0 = <invalid>;
				return (char *) a4_12 + 0x4200D760;
			}
		}
		++a6_38;
		if (a4_12 == (struct Eq_247286 *) 0x01)
		{
			a5Out.u0 = <invalid>;
			return 0x00;
		}
		a4_12 = (struct Eq_247286 *) 0x01;
	}
}

