pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23047C7A: Register Eq_2 bt_mesh_friend_clear_net_idx(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out (ptr32 Eq_202958) s1Out, Register out Eq_2 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      friend_set
//      bt_mesh_subnet_del
//      bt_mesh_reset
Eq_2 bt_mesh_friend_clear_net_idx(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, struct Eq_202958 & s1Out, union Eq_2 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a3_12 = (word32) *((char *) &g_t4200D6E4 + 6);
	struct Eq_202958 * s1_17 = &g_t4200D6BC;
	if (a3_12 != 0x0FFFFFFF && (a0 == 0x0FFFFFFF || a0 == a3_12))
	{
		word32 a1_310;
		word32 a4_311;
		ra = friend_clear(ra, a0, 0x4200D6DC, a3_12, 0x0FFFFFFF, mstatus, dwLoc08, dwArg08, dwArg14, dwArg18, dwArg48, dwArg58, dwArg68, ra, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s1_17, out a1_310, out a3_12, out a4_311, out s2, out s3, out s4, out s5, out s6, out s8, out mstatus);
	}
	Eq_2 a4_54 = (word32) s1_17->w00B2;
	if (a4_54 == 0x0FFFFFFF || a0 != 0x0FFFFFFF && a0 != a4_54)
	{
		s1Out = s1_17;
		a3Out = a3_12;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = s8;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a3_83;
		ptr32 mstatus_88;
		struct Eq_202958 * s1_90;
		ptr32 s2_91;
		ptr32 s3_92;
		ptr32 s4_93;
		ptr32 s5_94;
		ptr32 s6_95;
		ptr32 s8_96;
		word32 a1_312;
		word32 a4_313;
		Eq_2 ra_89 = friend_clear(ra, s0, 0x4200D760, a3_12, a4_54, mstatus, dwArg08, dwArg18, dwArg24, dwArg28, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, out s1_90, out a1_312, out a3_83, out a4_313, out s2_91, out s3_92, out s4_93, out s5_94, out s6_95, out s8_96, out mstatus_88);
		s1Out = s1_90;
		a3Out = a3_83;
		s2Out = s2_91;
		s3Out = s3_92;
		s4Out = s4_93;
		s5Out = s5_94;
		s6Out = s6_95;
		s8Out = s8_96;
		mstatusOut = mstatus_88;
		return ra_89;
	}
}

// 23047CE4: Register Eq_2 bt_mesh_friend_sec_update(Register word32 a0, Register out Eq_221941 a4Out)
// Called from:
//      bt_mesh_net_sec_update
Eq_2 bt_mesh_friend_sec_update(word32 a0, union Eq_221941 & a4Out)
{
	word32 a3_6 = (word32) *((char *) &g_t4200D6E4 + 6);
	if (a3_6 != 0x0FFFFFFF && (a0 == 0x0FFFFFFF || a0 == a3_6))
		g_b4200D6DF = (byte) ((word32) g_b4200D6DF | 8);
	word32 a3_18 = (word32) g_w4200D76E;
	if (a3_18 == 0x0FFFFFFF || a0 != 0x0FFFFFFF && a0 != a3_18)
	{
		a4Out.u0 = 0x0FFFFFFF;
		return <invalid>;
	}
	else
	{
		ui32 a4_25 = (word32) g_b4200D763;
		g_b4200D763 = (byte) (a4_25 | 8);
		a4Out = a4_25 | 8;
		return <invalid>;
	}
}

// 23047D36: Register Eq_2 bt_mesh_friend_clear(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      ctl_recv
Eq_2 bt_mesh_friend_clear(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 s9_114;
	ptr32 s7_112;
	ptr32 s3_135;
	Eq_2 ra_132;
	ptr32 a1_124;
	ptr32 a0_197;
	ptr32 a3_126;
	ptr32 a4_127;
	struct Eq_247521 ** a0_15 = *a5;
	Eq_2 a1_16 = *s0;
	word32 a5_357;
	bt_mesh_primary_addr(out a5_357);
	word32 a5_358;
	bt_mesh_net_transmit_get(out a5_358);
	if ((word32) *((word32) a1_16 + 4) <= 0x03)
	{
		word32 s1_360;
		word32 a0_361;
		word32 a2_362;
		word32 a5_363;
		word32 a7_364;
		word32 s2_365;
		word32 s4_366;
		word32 s5_367;
		word32 s6_368;
		word32 s8_369;
		word32 s10_370;
		word32 s11_371;
		word32 t4_372;
		ra_132 = printf(ra, &g_t230BA4A8, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_360, out a0_361, out a1_124, out a2_362, out a3_126, out a4_127, out a5_363, out a7_364, out s2_365, out s3_135, out s4_366, out s5_367, out s6_368, out s7_112, out s8_369, out s9_114, out s10_370, out s11_371, out t4_372);
		a0_197 = ~0x15;
	}
	else
	{
		uint32 a5_36 = (word32) *((word32) s0 + 1) << 8 | (word32) (*s0);
		uint32 a5_45 = (word32) *((word32) s0 + 3) << 8 | (word32) (*((word32) s0 + 2));
		Eq_2 s2_43 = (word32) (word16) (a5_36 >> 0x08 | a5_36 << 8);
		int32 s1_54 = (word32) (word16) (a5_45 << 8 | a5_45 >> 0x08);
		word32 a5_359;
		Eq_2 a0_55 = bt_mesh_friend_find((word32) *((char *) *a0_15 + 28), s2_43, 0x00, 0x00, out a5_359);
		if (a0_55 == 0x00)
		{
			word32 s1_373;
			word32 a0_374;
			word32 a2_375;
			word32 a5_376;
			word32 a7_377;
			word32 s2_378;
			word32 s4_379;
			word32 s5_380;
			word32 s6_381;
			word32 s8_382;
			word32 s10_383;
			word32 s11_384;
			word32 t4_385;
			ra_132 = printf(ra, &g_t230BA4C4, 0x00, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_373, out a0_374, out a1_124, out a2_375, out a3_126, out a4_127, out a5_376, out a7_377, out s2_378, out s3_135, out s4_379, out s5_380, out s6_381, out s7_112, out s8_382, out s9_114, out s10_383, out s11_384, out t4_385);
		}
		else if (s1_54 - (word32) (*((word32) a0_55 + 0x0A)) > 0x00FF)
		{
			word32 s1_402;
			word32 a0_403;
			word32 a2_404;
			word32 a5_405;
			word32 a7_406;
			word32 s2_407;
			word32 s4_408;
			word32 s5_409;
			word32 s6_410;
			word32 s8_411;
			word32 s10_412;
			word32 s11_413;
			word32 t4_414;
			ra_132 = printf(ra, &g_t230BA4E4, 0x00, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_402, out a0_403, out a1_124, out a2_404, out a3_126, out a4_127, out a5_405, out a7_406, out s2_407, out s3_135, out s4_408, out s5_409, out s6_410, out s7_112, out s8_411, out s9_114, out s10_412, out s11_413, out t4_414);
		}
		else
		{
			*(byte *) 266 = 0x7F;
			Eq_2 a3_96;
			Eq_2 a4_97;
			ptr32 mstatus_101;
			Eq_2 s3_108;
			word32 s1_386;
			word32 a0_387;
			word32 a1_388;
			word32 a5_389;
			word32 s2_390;
			word32 s4_391;
			word32 s5_392;
			word32 s6_393;
			word32 s8_394;
			word32 s11_395;
			word32 s1_396;
			word32 s2_397;
			word32 s4_398;
			word32 s5_399;
			word32 s6_400;
			word32 s8_401;
			ra_132 = friend_clear(bt_mesh_ctl_send(ra, s0, fp + -44, 0x00, 0x00, s2_43, a0_55, s4, s5, s6, s7, dwArgA4, mstatus, dwLoc40, dwLoc38, (char *) a0_15 + 4, SEQ((word16) ((word32) *((word32) s0 + 3) << 8 | (word32) (*((word32) s0 + 2))), (word16) ((word32) *((word32) s0 + 1) << 8 | (word32) (*s0))), dwLoc2C, s2, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg28, dwArg34, dwArg38, dwArg3C, a1_16, a5, 0x00, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0, out s1_386, out a0_387, out a1_388, out a3_96, out a4_97, out a5_389, out s2_390, out s3_108, out s4_391, out s5_392, out s6_393, out s7_112, out s8_394, out s9_114, out s11_395, out mstatus_101), s0, s3_108, a3_96, a4_97, mstatus_101, dwLoc38, s2, dwLoc1C, dwLoc18, dwArg18, dwArg28, dwArg38, a1_16, a5, s3, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s1_396, out a1_124, out a3_126, out a4_127, out s2_397, out s3_135, out s4_398, out s5_399, out s6_400, out s8_401, out mstatus);
		}
		a0_197 = 0x00;
	}
	s0Out = s0;
	a0Out = a0_197;
	a1Out = a1_124;
	a3Out = a3_126;
	a4Out = a4_127;
	s3Out = s3_135;
	s4Out = dwArgF4;
	s7Out = s7_112;
	s9Out = s9_114;
	mstatusOut = mstatus;
	return ra_132;
}

