pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23047E50: Register Eq_2 bt_mesh_friend_sub_add(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      ctl_recv
Eq_2 bt_mesh_friend_sub_add(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a1_135;
	ptr32 a3_137;
	ptr32 a4_138;
	Eq_2 ra_143;
	ptr32 s3_149;
	ptr32 s7_153;
	ptr32 s9_155;
	ptr32 a0_212;
	if ((word32) *((word32) a1 + 4) <= 0x02)
	{
		word32 s10_433;
		word32 s11_434;
		word32 s6_431;
		word32 s8_432;
		word32 s4_429;
		word32 s5_430;
		word32 a7_427;
		word32 s2_428;
		word32 a2_425;
		word32 a5_426;
		word32 s1_423;
		word32 a0_424;
		word32 t4_435;
		ra_143 = printf(ra, &g_t230BA7D4, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_423, out a0_424, out a1_135, out a2_425, out a3_137, out a4_138, out a5_426, out a7_427, out s2_428, out s3_149, out s4_429, out s5_430, out s6_431, out s7_153, out s8_432, out s9_155, out s10_433, out s11_434, out t4_435);
		a0_212 = ~0x15;
	}
	else
	{
		word32 a5_422;
		Eq_2 a0_26 = bt_mesh_friend_find((word32) *(uint16 *) 0x1E, (word32) *((word32) *(union Eq_2 *) 0x02 + 8), 0x01, 0x01, out a5_422);
		if (a0_26 == 0x00)
		{
			word32 s1_436;
			word32 a0_437;
			word32 a2_438;
			word32 a5_439;
			word32 a7_440;
			word32 s2_441;
			word32 s4_442;
			word32 s5_443;
			word32 s6_444;
			word32 s8_445;
			word32 s10_446;
			word32 s11_447;
			word32 t4_448;
			ra_143 = printf(ra, &g_t230BA4C4, 0x01, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_436, out a0_437, out a1_135, out a2_438, out a3_137, out a4_138, out a5_439, out a7_440, out s2_441, out s3_149, out s4_442, out s5_443, out s6_444, out s7_153, out s8_445, out s9_155, out s10_446, out s11_447, out t4_448);
		}
		else
		{
			ui32 a5_36 = (word32) *((word32) a0_26 + 3);
			if ((a5_36 & 16) != 0x00)
			{
				word32 s1_461;
				word32 a0_462;
				word32 a2_463;
				word32 a5_464;
				word32 a7_465;
				word32 s2_466;
				word32 s4_467;
				word32 s5_468;
				word32 s6_469;
				word32 s8_470;
				word32 s10_471;
				word32 s11_472;
				word32 t4_473;
				ra_143 = printf(ra, &g_t230BA7F8, 0x01, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_461, out a0_462, out a1_135, out a2_463, out a3_137, out a4_138, out a5_464, out a7_465, out s2_466, out s3_149, out s4_467, out s5_468, out s6_469, out s7_153, out s8_470, out s9_155, out s10_471, out s11_472, out t4_473);
			}
			else
			{
				word32 a1_38 = (word32) *((word32) a0_26 + 2);
				*((word32) a0_26 + 3) = (byte) (a5_36 | 4);
				Eq_2 a5_48;
				word32 a0_449;
				word32 a1_450;
				word32 a2_451;
				word32 s2_452;
				word32 s3_453;
				word32 s4_454;
				word32 s5_455;
				word32 s6_456;
				word32 s8_457;
				Eq_2 s1_105;
				Eq_2 a3_101;
				Eq_2 a4_102;
				Eq_2 s0_49 = k_delayed_work_submit(a1_38 + 0x0033, 0x01, a5_36 & 16, mstatus, s4, s2, dwArg04, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s1_105, out a0_449, out a1_450, out a2_451, out a3_101, out a4_102, out a5_48, out s2_452, out s3_453, out s4_454, out s5_455, out s6_456, out s8_457);
				word32 a1_458;
				word32 a2_459;
				word32 a5_460;
				Eq_2 s2_108 = net_buf_simple_pull_u8(a5_48, out a1_458, out a2_459, out a5_460);
				struct Eq_193726 * s3_109 = (struct Eq_193726 *) 0x01;
				word32 s4_110 = 0x230BB000;
				while (true)
				{
					struct Eq_193726 * a5_77 = (word32) *((word32) s1_105 + 4);
					if (s3_109 >= a5_77)
						break;
					word32 a5_118;
					word32 a1_474;
					word32 a5_475;
					Eq_2 a0_80 = net_buf_simple_pull_be16(a5_77, out a1_474, out a4_102, out a5_475);
					if ((word32) *((word32) s0_49 + 16) == 0x00)
					{
						a5_118 = 0x00;
						goto l23047F1A;
					}
					if ((word32) *((word32) s0_49 + 18) == 0x00)
					{
						a5_118 = 0x01;
						goto l23047F1A;
					}
					if ((word32) *((word32) s0_49 + 20) == 0x00)
					{
						a5_118 = 0x02;
l23047F1A:
						*((word32) s0_49 + (a5_118 + 0x08) * 0x02) = (word16) a0_80;
						continue;
					}
					word32 a0_477;
					word32 a1_478;
					word32 a2_479;
					word32 a5_480;
					word32 a7_481;
					word32 s5_482;
					word32 s6_483;
					word32 s7_484;
					word32 s8_485;
					word32 s9_486;
					word32 s10_487;
					word32 s11_488;
					word32 t4_489;
					ra = printf(ra, s4_110 + -2024, a3_101, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_105, out a0_477, out a1_478, out a2_479, out a3_101, out a4_102, out a5_480, out a7_481, out s2_108, out s3_109, out s4_110, out s5_482, out s6_483, out s7_484, out s8_485, out s9_486, out s10_487, out s11_488, out t4_489);
				}
				word32 s0_476;
				ra_143 = enqueue_sub_cfm(ra, s1_105, s0_49, s2_108, a3_101, a4_102, mstatus, dwLoc20, s4, s2, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg58, s3, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s0_476, out a1_135, out a3_137, out a4_138, out s3_149, out s7_153, out s9_155, out mstatus);
			}
		}
		a0_212 = 0x00;
	}
	s0Out = s1;
	a0Out = a0_212;
	a1Out = a1_135;
	a3Out = a3_137;
	a4Out = a4_138;
	s3Out = s3_149;
	s4Out = dwArg04;
	s7Out = s7_153;
	s9Out = s9_155;
	mstatusOut = mstatus;
	return ra_143;
}

// 23047F38: Register Eq_2 bt_mesh_friend_sub_rem(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      ctl_recv
Eq_2 bt_mesh_friend_sub_rem(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a1_107;
	ptr32 a3_109;
	ptr32 a4_110;
	Eq_2 ra_115;
	ptr32 s3_121;
	ptr32 s7_125;
	ptr32 s9_127;
	ptr32 a0_184;
	if ((word32) *((word32) a1 + 4) <= 0x02)
	{
		word32 s1_386;
		word32 a0_387;
		word32 a2_388;
		word32 a5_389;
		word32 a7_390;
		word32 s2_391;
		word32 s4_392;
		word32 s5_393;
		word32 s6_394;
		word32 s8_395;
		word32 s10_396;
		word32 s11_397;
		word32 t4_398;
		ra_115 = printf(ra, &g_t230BA840, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_386, out a0_387, out a1_107, out a2_388, out a3_109, out a4_110, out a5_389, out a7_390, out s2_391, out s3_121, out s4_392, out s5_393, out s6_394, out s7_125, out s8_395, out s9_127, out s10_396, out s11_397, out t4_398);
		a0_184 = ~0x15;
	}
	else
	{
		word32 a5_385;
		Eq_2 a0_22 = bt_mesh_friend_find((word32) *(uint16 *) 0x1E, (word32) *((word32) *(union Eq_2 *) 0x02 + 8), 0x01, 0x01, out a5_385);
		s0 = a0_22;
		if (a0_22 == 0x00)
		{
			word32 s1_399;
			word32 a0_400;
			word32 a2_401;
			word32 a5_402;
			word32 a7_403;
			word32 s2_404;
			word32 s4_405;
			word32 s5_406;
			word32 s6_407;
			word32 s8_408;
			word32 s10_409;
			word32 s11_410;
			word32 t4_411;
			ra_115 = printf(ra, &g_t230BA4C4, 0x01, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_399, out a0_400, out a1_107, out a2_401, out a3_109, out a4_110, out a5_402, out a7_403, out s2_404, out s3_121, out s4_405, out s5_406, out s6_407, out s7_125, out s8_408, out s9_127, out s10_409, out s11_410, out t4_411);
		}
		else
		{
			ui32 a5_32 = (word32) *((word32) a0_22 + 3);
			if ((a5_32 & 16) != 0x00)
			{
				word32 s1_424;
				word32 a0_425;
				word32 a2_426;
				word32 a5_427;
				word32 a7_428;
				word32 s2_429;
				word32 s4_430;
				word32 s5_431;
				word32 s6_432;
				word32 s8_433;
				word32 s10_434;
				word32 s11_435;
				word32 t4_436;
				ra_115 = printf(ra, &g_t230BA7F8, 0x01, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_424, out a0_425, out a1_107, out a2_426, out a3_109, out a4_110, out a5_427, out a7_428, out s2_429, out s3_121, out s4_430, out s5_431, out s6_432, out s7_125, out s8_433, out s9_127, out s10_434, out s11_435, out t4_436);
			}
			else
			{
				word32 a1_34 = (word32) *((word32) a0_22 + 2);
				*((word32) a0_22 + 3) = (byte) (a5_32 | 4);
				Eq_2 a3_42;
				Eq_2 a5_44;
				Eq_2 s1_46;
				word32 a0_412;
				word32 a1_413;
				word32 a2_414;
				word32 s2_415;
				word32 s3_416;
				word32 s4_417;
				word32 s5_418;
				word32 s6_419;
				word32 s8_420;
				Eq_2 a4_100;
				Eq_2 s0_45 = k_delayed_work_submit(a1_34 + 0x0033, 0x01, a5_32 & 16, mstatus, dwLoc1C, s2, dwArg04, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s1_46, out a0_412, out a1_413, out a2_414, out a3_42, out a4_100, out a5_44, out s2_415, out s3_416, out s4_417, out s5_418, out s6_419, out s8_420);
				word32 a1_421;
				word32 a2_422;
				word32 a5_423;
				Eq_2 a1_68 = net_buf_simple_pull_u8(a5_44, out a1_421, out a2_422, out a5_423);
				while (true)
				{
					struct Eq_193726 * a5_72 = (word32) *((word32) s1_46 + 4);
					if (a5_72 <= (struct Eq_193726 *) 0x01)
						break;
					word32 a5_86;
					word32 a5_437;
					Eq_2 a0_78 = net_buf_simple_pull_be16(a5_72, out a1_68, out a4_100, out a5_437);
					dwArg64 = a1_68;
					if ((word32) *((word32) s0_45 + 16) != a0_78)
					{
						if ((word32) *((word32) s0_45 + 18) != a0_78)
						{
							if ((word32) *((word32) s0_45 + 20) != a0_78)
								continue;
							a5_86 = 0x02;
						}
						else
							a5_86 = 0x01;
					}
					else
						a5_86 = 0x00;
					*((word32) s0_45 + (a5_86 + 0x08) * 0x02) = 0x00;
				}
				ra_115 = enqueue_sub_cfm(ra, s1_46, s0_45, a1_68, a3_42, a4_100, mstatus, dwLoc20, dwLoc1C, s2, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg58, dwArg64, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s0, out a1_107, out a3_109, out a4_110, out s3_121, out s7_125, out s9_127, out mstatus);
			}
		}
		a0_184 = 0x00;
	}
	s0Out = s0;
	a0Out = a0_184;
	a1Out = a1_107;
	a3Out = a3_109;
	a4Out = a4_110;
	s3Out = s3_121;
	s4Out = dwArg04;
	s7Out = s7_125;
	s9Out = s9_127;
	mstatusOut = mstatus;
	return ra_115;
}

