pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23048012: Register Eq_2 bt_mesh_friend_poll(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      ctl_recv
Eq_2 bt_mesh_friend_poll(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 a1_124;
	ptr32 a3_126;
	Eq_2 a4_110;
	ptr32 s3_138;
	ptr32 s4_139;
	Eq_2 s1_120;
	struct Eq_274 * a0_180;
	struct Eq_248308 * a5_13 = (word32) *((word32) a1 + 4);
	byte * s2_14 = *a1;
	if (a5_13 == null)
	{
		a0_180 = (struct Eq_274 *) &g_t230BA5E0;
		goto l2304802E;
	}
	a3.u0 = 0x00;
	word32 a5_427;
	Eq_2 a0_21 = bt_mesh_friend_find((word32) a5_13->w001C, (word32) a5_13->ptr0000->w0008, 0x01, 0x00, out a5_427);
	if (a0_21 == 0x00)
	{
		word32 s1_428;
		word32 a0_429;
		word32 a2_430;
		word32 a5_431;
		word32 a7_432;
		word32 s2_433;
		word32 s5_434;
		word32 s6_435;
		word32 s8_436;
		word32 s10_437;
		word32 s11_438;
		word32 t4_439;
		ra = printf(ra, &g_t230BA4C4, 0x00, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_428, out a0_429, out a1_124, out a2_430, out a3_126, out a4_110, out a5_431, out a7_432, out s2_433, out s3_138, out s4_139, out s5_434, out s6_435, out s7, out s8_436, out s9, out s10_437, out s11_438, out t4_439);
		s1_120.u0 = 0x00;
		goto l2304805E;
	}
	if (((word32) *s2_14 & ~0x01) != 0x00)
	{
		a0_180 = (struct Eq_274 *) &g_t230BA5F8;
l2304802E:
		word32 s1_440;
		word32 a0_441;
		word32 a2_442;
		word32 a5_443;
		word32 a7_444;
		word32 s2_445;
		word32 s5_446;
		word32 s6_447;
		word32 s8_448;
		word32 s10_449;
		word32 s11_450;
		word32 t4_451;
		ra = printf(ra, a0_180, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_440, out a0_441, out a1_124, out a2_442, out a3_126, out a4_110, out a5_443, out a7_444, out s2_445, out s3_138, out s4_139, out s5_446, out s6_447, out s7, out s8_448, out s9, out s10_449, out s11_450, out t4_451);
		s1_120.u0 = ~0x15;
		goto l2304805E;
	}
	ui32 a5_33 = (word32) *((word32) a0_21 + 3);
	if ((a5_33 & 16) != 0x00)
	{
		word32 a0_458;
		word32 a2_459;
		word32 a5_460;
		word32 a7_461;
		word32 s2_462;
		word32 s5_463;
		word32 s6_464;
		word32 s8_465;
		word32 s10_466;
		word32 s11_467;
		word32 t4_468;
		ra = printf(ra, &g_t230BA620, 0x00, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_120, out a0_458, out a1_124, out a2_459, out a3_126, out a4_110, out a5_460, out a7_461, out s2_462, out s3_138, out s4_139, out s5_463, out s6_464, out s7, out s8_465, out s9, out s10_466, out s11_467, out t4_468);
		goto l2304805E;
	}
	word32 a1_35 = (word32) *((word32) a0_21 + 2);
	*((word32) a0_21 + 3) = (byte) (a5_33 | 4);
	Eq_2 a0_41;
	word32 a2_452;
	word32 a4_453;
	word32 a5_454;
	word32 s5_455;
	word32 s6_456;
	word32 s8_457;
	Eq_2 s2_107;
	Eq_2 s0_46 = k_delayed_work_submit(a1_35 + 0x0033, 0x00, a5_33 & 16, mstatus, s0, dwLoc08, dwArg14, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s1_120, out a0_41, out a1_124, out a2_452, out a3_126, out a4_453, out a5_454, out s2_107, out s3_138, out s4_139, out s5_455, out s6_456, out s8_457);
	ui32 a5_64 = (word32) *((word32) s0_46 + 3);
	if ((a5_64 & 64) == 0x00)
		*((word32) s0_46 + 3) = (byte) (a5_64 | 64);
	a4_110 = (word32) *s2_107;
	Eq_2 s0_111 = *((word32) a0_41 + 72);
	if (a4_110 == ((word32) (*((word32) s0_46 + 3)) & 0x01))
	{
		if (a0_41 != 0x00)
		{
			*((word32) s0_111 + 3) = (byte) ((word32) *((word32) s0_111 + 3) | 2);
l2304805E:
			0x00 = (int8) dwArg38;
			a0Out = s1_120;
			a1Out = a1_124;
			a3Out = a3_126;
			a4Out = a4_110;
			s3Out = s3_138;
			s4Out = s4_139;
			s7Out = s7;
			s9Out = s9;
			mstatusOut = mstatus;
			return ra;
		}
	}
	else if (a0_41 != 0x00)
	{
		word32 a0_469;
		word32 a2_470;
		word32 a4_471;
		word32 a5_472;
		word32 s5_473;
		word32 s6_474;
		word32 s8_475;
		ra = net_buf_unref(ra, s1_120, a0_41, a1_124, a4_110, mstatus, s2, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_111, out s1_120, out a0_469, out a1_124, out a2_470, out a3_126, out a4_471, out a5_472, out s2_107, out s3_138, out s4_139, out s5_473, out s6_474, out s8_475, out mstatus);
		((word32) s0_111 + 72)->u0 = 0x00;
	}
	ui32 a5_109 = (word32) *s2_107;
	struct Eq_248545 * a5_114 = (word32) *((word32) s0_111 + 3) & ~0x01 | a5_109 & 1;
	*((word32) s0_111 + 3) = (byte) a5_114;
	a4_110 = a5_109 & 1;
	Eq_2 s0_116 = a5_114->t004C;
	if (a5_114 == null)
	{
		word32 a5_476;
		word32 s2_477;
		word32 s5_478;
		word32 s6_479;
		word32 s8_480;
		word32 s10_481;
		word32 s11_482;
		ra = enqueue_update(ra, s1_120, s0_116, 0x00, s2_107, mstatus, s0, dwLoc08, dwArg08, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgE8, out s1_120, out a1_124, out a3_126, out a4_110, out a5_476, out s2_477, out s3_138, out s4_139, out s5_478, out s6_479, out s7, out s8_480, out s9, out s10_481, out s11_482, out mstatus);
	}
	goto l2304805E;
}

// 2304810A: Register Eq_2 bt_mesh_friend_clear_cfm(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 s9Out)
// Called from:
//      ctl_recv
Eq_2 bt_mesh_friend_clear_cfm(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgD8, Eq_2 dwArg0118, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & s9Out)
{
	ptr32 s4_122;
	ptr32 s3_121;
	ptr32 a3_113;
	ptr32 a1_111;
	ptr32 a0_130;
	ptr32 a4_114;
	Eq_2 a3_9 = (word32) *((word32) a1 + 4);
	if (a3_9 <= 0x03)
	{
		word32 a5_289;
		word32 a7_290;
		word32 s2_291;
		word32 a2_288;
		word32 a0_287;
		word32 s1_286;
		word32 s5_292;
		word32 s6_293;
		word32 s8_294;
		word32 s10_295;
		word32 s11_296;
		word32 t4_297;
		ra = printf(ra, &g_t230B71D0, a3_9, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_286, out a0_287, out a1_111, out a2_288, out a3_113, out a4_114, out a5_289, out a7_290, out s2_291, out s3_121, out s4_122, out s5_292, out s6_293, out s7, out s8_294, out s9, out s10_295, out s11_296, out t4_297);
		a0_130 = ~0x15;
		goto l2304812A;
	}
	struct Eq_248643 * s0_19;
	Eq_2 a1_16 = (word32) *((word32) a0 + 8);
	Eq_2 a3_17 = (word32) g_w4200D738;
	if (a3_17 != a1_16)
	{
		if ((word32) g_w4200D7BC != a1_16)
		{
			word32 s1_298;
			word32 a0_299;
			word32 a2_300;
			word32 a5_301;
			word32 a7_302;
			word32 s2_303;
			word32 s5_304;
			word32 s6_305;
			word32 s8_306;
			word32 s10_307;
			word32 s11_308;
			word32 t4_309;
			ra = printf(ra, &g_t230BA510, a3_17, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_298, out a0_299, out a1_111, out a2_300, out a3_113, out a4_114, out a5_301, out a7_302, out s2_303, out s3_121, out s4_122, out s5_304, out s6_305, out s7, out s8_306, out s9, out s10_307, out s11_308, out t4_309);
			goto l2304815A;
		}
		s0_19 = (struct Eq_248643 *) &g_dw4200D760;
	}
	else
		s0_19 = (struct Eq_248643 *) g_a4200D6DC;
	struct Eq_274 * a0_75;
	uint32 a5_30 = (word32) *((word32) a4 + 1) << 8 | (word32) (*a4);
	if ((word32) s0_19->w0000 != (word32) ((word16) (a5_30 << 8 | a5_30 >> 0x08)))
		a0_75 = (struct Eq_274 *) &g_t230BA538;
	else
	{
		uint32 a5_40 = (word32) *((word32) a4 + 3) << 8 | (word32) (*((word32) a4 + 2));
		if ((word32) s0_19->w000A == (word32) ((word16) (a5_40 << 8 | a5_40 >> 0x08)))
		{
			word32 a0_310;
			word32 a2_311;
			word32 a5_312;
			word32 s2_313;
			word32 s5_314;
			word32 s6_315;
			word32 s8_316;
			k_delayed_work_cancel(&s0_19->w005C + 2, a3_17, a4, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_310, out a1_111, out a2_311, out a3_113, out a4_114, out a5_312, out s2_313, out s3_121, out s4_122, out s5_314, out s6_315, out s8_316);
			s0_19->w005C = 0x00;
			goto l2304815A;
		}
		a0_75 = (struct Eq_274 *) &g_t230BA564;
	}
	word32 s1_317;
	word32 a0_318;
	word32 a2_319;
	word32 a5_320;
	word32 a7_321;
	word32 s2_322;
	word32 s5_323;
	word32 s6_324;
	word32 s8_325;
	word32 s10_326;
	word32 s11_327;
	word32 t4_328;
	ra = printf(ra, a0_75, a3_17, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_317, out a0_318, out a1_111, out a2_319, out a3_113, out a4_114, out a5_320, out a7_321, out s2_322, out s3_121, out s4_122, out s5_323, out s6_324, out s7, out s8_325, out s9, out s10_326, out s11_327, out t4_328);
l2304815A:
	a0_130 = 0x00;
l2304812A:
	a0Out = a0_130;
	a1Out = a1_111;
	a3Out = a3_113;
	a4Out = a4_114;
	s3Out = s3_121;
	s4Out = s4_122;
	s7Out = s7;
	s9Out = s9;
	return ra;
}

