pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 230481DA: Register Eq_2 bt_mesh_friend_req(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      ctl_recv
Eq_2 bt_mesh_friend_req(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 a1_364;
	Eq_2 a3_366;
	ptr32 a0_477;
	Eq_2 a4_367;
	Eq_2 ra_372;
	ptr32 s3_378;
	ptr32 s7_382;
	ptr32 s9_384;
	struct Eq_274 * a0_506;
	if ((word32) *((word32) a1 + 4) <= 0x09)
	{
		a0_506 = (struct Eq_274 *) &g_t230BA640;
		goto l230481FA;
	}
	struct Eq_274 * a0_513;
	if ((word32) *((word32) s1 + 1) <= 0x09)
	{
		a0_513 = (struct Eq_274 *) &g_t230BA65C;
		goto l23048210;
	}
	uint32 s2_140 = (word32) *((word32) s1 + 2) << 16 | (word32) (*((word32) s1 + 3)) << 8 | (word32) (*((word32) s1 + 4));
	if (s2_140 > 0xFFCB4401)
	{
		a0_513 = (struct Eq_274 *) &g_t230BA680;
l23048210:
		word32 s1_1003;
		word32 a0_1004;
		word32 a7_1007;
		word32 a2_1005;
		word32 s2_1008;
		word32 a5_1006;
		word32 s4_1009;
		word32 s5_1010;
		word32 s6_1011;
		word32 s8_1012;
		word32 s10_1013;
		word32 t4_1015;
		word32 s11_1014;
		ra_372 = printf(ra, a0_513, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1003, out a0_1004, out a1_364, out a2_1005, out a3_366, out a4_367, out a5_1006, out a7_1007, out s2_1008, out s3_378, out s4_1009, out s5_1010, out s6_1011, out s7_382, out s8_1012, out s9_384, out s10_1013, out s11_1014, out t4_1015);
		goto l23048214;
	}
	word32 a5_29 = (word32) *((word32) s1 + 7);
	if (a5_29 == 0x00)
	{
		a0_506 = (struct Eq_274 *) &g_t230BA6A4;
		goto l230481FA;
	}
	Eq_2 a1_164 = (word32) *((word32) a0 + 8);
	Eq_2 s3_124 = a0;
	int32 a5_34 = (word32) a1_164 + a5_29;
	if (a5_34 == 0x01 || a5_34 > 0x08000000)
	{
		a0_506 = (struct Eq_274 *) &g_t230BA6CC;
		goto l230481FA;
	}
	ui32 a5_36 = (word32) *s1;
	if ((a5_36 & 0x07) == 0x00)
	{
		a0_506 = (struct Eq_274 *) &g_t230BA6FC;
l230481FA:
		word32 t4_1028;
		word32 s6_1024;
		word32 s8_1025;
		word32 s10_1026;
		word32 s11_1027;
		word32 s2_1021;
		word32 s4_1022;
		word32 s5_1023;
		word32 s1_1016;
		word32 a0_1017;
		word32 a5_1019;
		word32 a7_1020;
		word32 a2_1018;
		ra_372 = printf(ra, a0_506, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1016, out a0_1017, out a1_364, out a2_1018, out a3_366, out a4_367, out a5_1019, out a7_1020, out s2_1021, out s3_378, out s4_1022, out s5_1023, out s6_1024, out s7_382, out s8_1025, out s9_384, out s10_1026, out s11_1027, out t4_1028);
l23048214:
		a0_477 = ~0x15;
		goto l23048216;
	}
	if (0x01 << (a5_36 & 0x07) > 0x10)
	{
		word32 s10_1040;
		word32 s11_1041;
		word32 t4_1042;
		word32 s6_1038;
		word32 s8_1039;
		word32 s4_1036;
		word32 s5_1037;
		word32 a2_1032;
		word32 a5_1033;
		word32 a7_1034;
		word32 s2_1035;
		word32 s1_1030;
		word32 a0_1031;
		ra_372 = printf(ra, &g_t230BA730, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1030, out a0_1031, out a1_364, out a2_1032, out a3_366, out a4_367, out a5_1033, out a7_1034, out s2_1035, out s3_378, out s4_1036, out s5_1037, out s6_1038, out s7_382, out s8_1039, out s9_384, out s10_1040, out s11_1041, out t4_1042);
	}
	else
	{
		Eq_2 s1_130;
		word32 a5_1029;
		Eq_2 a0_44 = bt_mesh_friend_find((word32) *(union Eq_71486 *) 44, a1_164, 0x01, 0x00, out a5_1029);
		s0 = a0_44;
		if (a0_44 == 0x00)
		{
			word32 a4_109;
			if (g_a4200D6DC[0].dw0000 << 0x02 < 0x00)
			{
				int32 a4_110 = g_dw4200D760;
				if (a4_110 << 0x02 < 0x00)
				{
					word32 s11_1072;
					word32 t4_1073;
					word32 s5_1068;
					word32 s6_1069;
					word32 s8_1070;
					word32 s10_1071;
					word32 a5_1064;
					word32 a7_1065;
					word32 s2_1066;
					word32 s4_1067;
					word32 s1_1061;
					word32 a0_1062;
					word32 a2_1063;
					ra_372 = printf(ra, &g_t230BA764, a4_110 << 0x02, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1061, out a0_1062, out a1_364, out a2_1063, out a3_366, out a4_367, out a5_1064, out a7_1065, out s2_1066, out s3_378, out s4_1067, out s5_1068, out s6_1069, out s7_382, out s8_1070, out s9_384, out s10_1071, out s11_1072, out t4_1073);
					a0_477 = ~0x0B;
					goto l23048216;
				}
				a4_109 = 0x01;
			}
			else
				a4_109 = 0x00;
			struct Eq_249157 * a4_115 = a4_109 + 0x0084;
			a4_115->b4200D6DF = (byte) ((word32) a4_115->b4200D6DF | 32);
			s0 = (char *) a4_115 + 0x4200D6DC;
			s1_130 = s1;
		}
		else
		{
			Eq_2 a3_61;
			Eq_2 a4_62;
			word32 a4_1060;
			word32 s10_1056;
			word32 s11_1057;
			word32 t4_1058;
			word32 a3_1059;
			word32 s5_1052;
			word32 s6_1053;
			word32 s8_1054;
			word32 s9_1055;
			word32 a7_1048;
			word32 s2_1049;
			word32 s3_1050;
			word32 s4_1051;
			word32 a2_1046;
			word32 a5_1047;
			word32 a0_1044;
			word32 a1_1045;
			word32 s1_1043;
			ra = friend_clear(printf(ra, &g_t230BA78C, 0x00, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1043, out a0_1044, out a1_1045, out a2_1046, out a3_61, out a4_62, out a5_1047, out a7_1048, out s2_1049, out s3_1050, out s4_1051, out s5_1052, out s6_1053, out s7, out s8_1054, out s9_1055, out s10_1056, out s11_1057, out t4_1058), a0_44, a0_44, a3_61, a4_62, mstatus, dwLoc38, s2, dwLoc1C, dwLoc18, dwArg18, dwArg28, dwArg38, dwArg44, dwArg48, s3, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s1_130, out a1_164, out a3_1059, out a4_1060, out s2_140, out s3_124, out s4, out s5, out s6, out s8, out mstatus);
		}
		*s0 = (word16) (word32) *((word32) s3_124 + 8);
		*((word32) s0 + 8) = (byte) (word32) *((word32) s1_130 + 7);
		*((word32) s0 + 0x0E) = (word16) (word32) *((word32) *s3_124 + 28);
		*((word32) s0 + 2) = (byte) (word32) *((word32) s1_130 + 1);
		Eq_2 s2_142 = s2_140 + 100;
		*((word32) s0 + 4) = s2_142;
		uint32 a5_147 = (word32) *((word32) s1_130 + 9) << 8 | (word32) (*((word32) s1_130 + 8));
		*((word32) s0 + 0x0A) = (word16) (a5_147 << 8 | a5_147 >> 0x08);
		uint32 a5_155 = (word32) *((word32) s1_130 + 6) << 8 | (word32) (*((word32) s1_130 + 5));
		int32 a5_160 = (int32) (word16) (a5_155 << 8 | a5_155 >> 0x08);
		Eq_2 a0_162 = (word32) (word16) a5_160;
		*((word32) s0 + 92) = (word16) a0_162;
		if (a5_160 > 0x00)
		{
			word32 a4_1076;
			word32 a5_1077;
			word32 a1_1074;
			word32 a3_1075;
			if (bt_mesh_elem_find(a0_162, a1_164, out a1_1074, out a3_1075, out a4_1076, out a5_1077) == 0x00)
			{
				struct Eq_249311 * a5_181;
				word32 a1_1078;
				word32 a2_1079;
				struct Eq_192645 * a0_178 = k_uptime_get_32(out a1_1078, out a2_1079, out a5_181);
				Eq_2 s0_182 = a5_181->t0004;
				*((char *) &(a0_178 + (a5_181 << 1) / 40)->t0024 + 52) = (struct Eq_192645 *) s0_182;
				((word32) s0_182 + 94)->u2 = 0x01;
				ra = send_friend_clear(ra, s0_182, s2_142, s3_124, s4, s5, s6, s7, s8, mstatus, dwLoc40, dwLoc3C, dwLoc38, dwLoc18, dwLoc0C, dwLoc08, dwLoc04, dwArg0C, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, out s1_130, out s3_124, out mstatus);
			}
		}
		uint32 a3_241 = (word32) *s1_130;
		Eq_2 a3_253 = (int32) *((word32) s3_124 + 0x0C);
		int32 a5_260 = (word32) (a3_241 >> 0x03 & 0x03)->b230CBA38 + 0x00FF - ((word32) a3_253 + (word32) (a3_241 >> 5 & 0x03)->b230CBA38);
		Eq_2 a1_262 = a5_260 ^ 0x0A;
		if (a5_260 <= 999)
			a1_262.u0 = 100;
		union Eq_2 * s3_280;
		word32 s6_1090;
		word32 s8_1091;
		word32 s4_1088;
		word32 s5_1089;
		word32 a3_1084;
		word32 a4_1085;
		word32 a5_1086;
		word32 s2_1087;
		word32 a1_1082;
		word32 a2_1083;
		word32 s1_1080;
		word32 a0_1081;
		Eq_2 s0_277 = k_delayed_work_submit(a1_262, a3_253, 999, mstatus, dwLoc3C, dwLoc38, dwLoc1C, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s1_1080, out a0_1081, out a1_1082, out a2_1083, out a3_1084, out a4_1085, out a5_1086, out s2_1087, out s3_280, out s4_1088, out s5_1089, out s6_1090, out s8_1091);
		Eq_2 a3_304;
		Eq_2 a4_305;
		struct Eq_249376 * s3_314;
		Eq_2 ra_309 = friend_cred_create(ra, *s3_280, (word32) *s0_277, (word32) *((word32) s0_277 + 0x0A), (word32) *((word32) s0_277 + 0x0C), s2, dwLoc10, dwLoc0C, dwArg18, dwArg20, dwArg24, dwArg3C, dwArg48, dwArg6C, dwArgD8, out a3_304, out a4_305, out s3_314);
		int32 s1_335 = (int32) s3_314->b000C;
		net_buf_simple_reserve((word32 *) 0x01, fp + -52);
		word32 a1_1092;
		word32 a5_1093;
		Eq_2 a0_341 = net_buf_simple_add(fp + -44, 0x06, a4_305, out a1_1092, out a5_1093);
		*a0_341 = ~0x00;
		*((word32) a0_341 + 1) = 0x10;
		*((word32) a0_341 + 2) = 0x03;
		*((word32) a0_341 + 3) = (byte) s1_335;
		uint32 a4_351 = (word32) *((word32) s0_277 + 0x0C);
		uint32 a5_358 = (word32) (word16) (a4_351 >> 0x08 | a4_351 << 8);
		*((word32) a0_341 + 4) = (byte) a5_358;
		*((word32) a0_341 + 5) = (byte) (a5_358 >> 8);
		Eq_2 a0_363;
		word32 s11_1098;
		word32 s6_1096;
		word32 s10_1097;
		word32 s2_1094;
		word32 s5_1095;
		ra_372 = encode_friend_ctl(ra_309, s0_277, s0_277, 0x04, a3_304, a4_351 << 8, mstatus, dwLoc38, dwLoc30, dwLoc2C, s2, dwLoc20, dwLoc1C, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg38, fp + -52, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, out s0, out a0_363, out a1_364, out a3_366, out a4_367, out s2_1094, out s3_378, out s5_1095, out s6_1096, out s7_382, out s9_384, out s10_1097, out s11_1098, out mstatus);
		Eq_2 s1_392 = a0_363;
		if (a0_363 == 0x00)
		{
			word32 s11_1110;
			word32 t4_1111;
			word32 s8_1108;
			word32 s10_1109;
			word32 s5_1106;
			word32 s6_1107;
			word32 s2_1104;
			word32 s4_1105;
			word32 a5_1102;
			word32 a7_1103;
			word32 a0_1100;
			word32 a2_1101;
			word32 s1_1099;
			ra_372 = printf(ra_372, &g_t230BA7B4, a3_366, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1099, out a0_1100, out a1_364, out a2_1101, out a3_366, out a4_367, out a5_1102, out a7_1103, out s2_1104, out s3_378, out s4_1105, out s5_1106, out s6_1107, out s7_382, out s8_1108, out s9_384, out s10_1109, out s11_1110, out t4_1111);
		}
		else
		{
			s0 = *((word32) a0_363 + 72);
			((word32) s0 + 0x0C)->u2 = (word16) ((word32) *((word32) s0 + 0x0C) + 0x01);
			if (a0_363 != 0x00)
			{
				word32 s6_1118;
				word32 s8_1119;
				word32 s4_1116;
				word32 s5_1117;
				word32 a5_1114;
				word32 s2_1115;
				word32 a0_1112;
				word32 a2_1113;
				ra_372 = net_buf_unref(ra_372, a0_363, a0_363, a1_364, a4_367, mstatus, dwLoc40, dwLoc3C, dwLoc38, dwLoc18, dwArg38, dwArg44, s1, dwArg64, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s0, out s1_392, out a0_1112, out a1_364, out a2_1113, out a3_366, out a4_367, out a5_1114, out s2_1115, out s3_378, out s4_1116, out s5_1117, out s6_1118, out s8_1119, out mstatus);
			}
			ui32 a5_424 = (word32) *((word32) s0 + 3);
			*((word32) s1_392 + 72) = s0;
			*((word32) s0 + 3) = (byte) (a5_424 | 2);
		}
	}
	a0_477 = 0x00;
l23048216:
	s0Out = s0;
	a0Out = a0_477;
	a1Out = a1_364;
	a3Out = a3_366;
	a4Out = a4_367;
	s3Out = s3_378;
	s4Out = dwArgF4;
	s7Out = s7_382;
	s9Out = s9_384;
	mstatusOut = mstatus;
	return ra_372;
}

