pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 230484AC: Register Eq_2 bt_mesh_friend_init(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Register out ptr32 a3Out, Register out ptr32 s5Out)
// Called from:
//      bt_mesh_net_start
Eq_2 bt_mesh_friend_init(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0108, ptr32 & a3Out, ptr32 & s5Out)
{
	*((char *) &g_t4200D6E4 + 6) = (struct Globals *) ~0x00;
	g_dw4200D728 = 0x00;
	g_dw4200D72C = 0x00;
	Eq_2 a3_30;
	Eq_2 a4_31;
	word32 a0_127;
	word32 a5_128;
	word32 s2_129;
	word32 s3_130;
	word32 s4_131;
	word32 s5_132;
	k_delayed_work_init(ra, 0x4200D6BC, 0x4200D6F4, a3, a4, mstatus, dwArg74, dwArgA8, dwArgC8, dwArg0108, out a0_127, out a3_30, out a4_31, out a5_128, out s2_129, out s3_130, out s4_131, out s5_132);
	Eq_2 a3_49;
	Eq_2 a4_50;
	word32 s3_55;
	word32 a0_133;
	word32 a5_134;
	word32 s2_135;
	word32 s4_136;
	word32 s5_137;
	k_delayed_work_init(ra, 0x4200D6BC, 1107351356, a3_30, a4_31, mstatus, dwArg74, dwArgA8, dwArgC8, dwArg0108, out a0_133, out a3_49, out a4_50, out a5_134, out s2_135, out s3_55, out s4_136, out s5_137);
	g_w4200D76E = (word16) s3_55;
	g_dw4200D718 = 0x00;
	g_dw4200D71C = 0x00;
	g_dw4200D7AC = 0x00;
	g_dw4200D7B0 = 0x00;
	Eq_2 a3_72;
	Eq_2 a4_73;
	word32 a0_138;
	word32 a5_139;
	word32 s2_140;
	word32 s3_141;
	word32 s4_142;
	word32 s5_143;
	k_delayed_work_init(ra, 0x4200D6BC, 0x4200D778, a3_49, a4_50, mstatus, dwArg74, dwArgA8, dwArgC8, dwArg0108, out a0_138, out a3_72, out a4_73, out a5_139, out s2_140, out s3_141, out s4_142, out s5_143);
	ptr32 a3_90;
	ptr32 s5_98;
	word32 a0_144;
	word32 a4_145;
	word32 a5_146;
	word32 s2_147;
	word32 s3_148;
	word32 s4_149;
	Eq_2 s1_94 = k_delayed_work_init(ra, 0x4200D6BC, 0x4200D7C0, a3_72, a4_73, mstatus, dwArg74, dwArgA8, dwArgC8, dwArg0108, out a0_144, out a3_90, out a4_145, out a5_146, out s2_147, out s3_148, out s4_149, out s5_98);
	g_ptr4200D79C = null;
	g_dw4200D7A0 = 0x00;
	a3Out = a3_90;
	s5Out = s5_98;
	return s1_94;
}

// 23048542: Register Eq_2 bt_mesh_friend_match(Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      bt_mesh_trans_recv
Eq_2 bt_mesh_friend_match(Eq_2 a0, Eq_2 a1, ptr32 & a3Out, ptr32 & a4Out)
{
	ptr32 a4_19;
	ptr32 a3_21;
	word32 a5_55;
	Eq_2 a0_18 = friend_lpn_matches(0x4200D6DC, a0, a1, out a3_21, out a4_19, out a5_55);
	if (a0_18 != 0x00)
	{
		a3Out = a3_21;
		a4Out = a4_19;
		return a0_18;
	}
	else
	{
		ptr32 a4_35;
		ptr32 a3_37;
		word32 a5_56;
		Eq_2 a0_34 = friend_lpn_matches(0x4200D760, a0, a1, out a3_37, out a4_35, out a5_56);
		a3Out = a3_37;
		a4Out = a4_35;
		return a0_34;
	}
}

// 23048582: Register word32 bt_mesh_friend_queue_has_space(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_240776) s4Out, Register out Eq_2 s5Out, Register out (ptr32 Eq_240778) s6Out, Register out Eq_2 s7Out, Register out Eq_240780 s8Out)
// Called from:
//      bt_mesh_trans_send
//      bt_mesh_trans_recv
word32 bt_mesh_friend_queue_has_space(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 dwArg0128, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, struct Eq_240776 & s4Out, union Eq_2 & s5Out, struct Eq_240778 & s6Out, union Eq_2 & s7Out, union Eq_240780 & s8Out)
{
	word32 a3_150;
	word32 a4_151;
	word32 a5_152;
	Eq_2 a0_35 = friend_lpn_matches(0x4200D6DC, a0, a2, out a3_150, out a4_151, out a5_152);
	ptr32 s0_40 = 0x00;
	if (a0_35 != 0x00 && a4 <= 0x10)
	{
		word32 a4_153;
		word32 a5_154;
		s0_40 = friend_queue_has_space.part.6(0x4200D6DC, a1, a3, a4, (struct Eq_245439 *) 0x10, out a4_153, out a5_154);
	}
	ptr32 a4_129;
	ptr32 a5_130;
	Eq_2 a3_128;
	if (friend_lpn_matches(0x4200D760, a0, a2, out a3_128, out a4_129, out a5_130) != 0x00)
	{
		a5_130 = 0x10;
		if (a4 <= 0x10)
		{
			a3_128 = a4;
			ptr32 a0_71 = friend_queue_has_space.part.6(0x4200D760, a1, a3, a4, (struct Eq_245439 *) 0x10, out a4_129, out a5_130);
			if (a0_71 != 0x00)
				s0_40 = a0_71;
		}
	}
	else if (a0_35 == 0x00)
		s0_40 = 0x01;
	0x00 = (int8) dwArg0128;
	s1Out = a4;
	a0Out = s0_40;
	a3Out = a3_128;
	a4Out = a4_129;
	a5Out = a5_130;
	s2Out = a0_35;
	s3Out = 0x4200D000;
	s4Out = dwArg78;
	s5Out = a3;
	s6Out = (struct Eq_240778 *) &g_dw4200D000;
	s7Out = a2;
	s8Out = s5;
	return dwArgE4;
}

// 23048614: Register Eq_2 bt_mesh_friend_enqueue_rx(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0198, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_trans_recv
Eq_2 bt_mesh_friend_enqueue_rx(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0198, union Eq_2 & s1Out, union Eq_2 & a1Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	ui32 a5_5 = (word32) *((word32) a0 + 32);
	if ((int32) (byte) a5_5 >= 0x00 || (word32) (*((word32) a0 + 0x0D)) <= 0x01 && (a5_5 & 48) != 0x10)
	{
		s1Out = s1;
		a1Out = a1;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s6Out = s6;
		s7Out = s7;
		s10Out = s10;
		mstatusOut = mstatus;
		return s0;
	}
	else
	{
		Eq_2 s7_115 = a4;
		Eq_2 s5_113 = a3;
		Eq_2 s2_253 = a2;
		Eq_2 s4_100 = a1;
		Eq_2 a5_131 = 0x01;
		word32 a5_837;
		if (bt_mesh_friend_get(out a5_837) == 0x01)
		{
			s1.u0 = 0x4200D6DC;
			s6.u0 = 0x4200D7E4;
			s3.u0 = 0x4200D6BC;
			ra_110 = ra;
			do
			{
				Eq_2 ra_110;
				struct Eq_249824 * s0_74 = *a5_131;
				a1 = (word32) *((word32) a5_131 + 28);
				word32 a3_857;
				if (friend_lpn_matches(s1, a1, (word32) s0_74->w000A, out a3_857, out a4, out a5_131) != 0x00)
				{
					word32 a0_94;
					struct Eq_249818 * s0_98;
					Eq_2 a3_107;
					word32 s11_838;
					ui32 s8_101;
					ra_110 = friend_queue_prepare_space(ra_110, s1, (word32) s0_74->w0008, s2_253, s5_113, s2_253, s3, s4_100, mstatus, dwLoc38, dwArg10, dwArg14, dwArg18, dwArg38, dwArg44, s1, ra, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out s0_98, out s1, out a0_94, out a1, out a3_107, out a4, out a5_131, out s2_253, out s3, out s4_100, out s5_113, out s6, out s7_115, out s8_101, out s10, out s11_838, out mstatus);
					if (a0_94 != 0x00)
					{
						if (s4_100 == 0x00 && s2_253 != 0x00)
						{
							word32 a4_840;
							word32 s0_839;
							ra_110 = friend_purge_old_ack(ra_110, s1, s2_253, (word32) s0_98->w0008, a3_107, a5_131, mstatus, dwLoc40, dwLoc3C, dwLoc38, dwLoc18, dwArg38, dwArg44, s1, dwArg64, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s0_839, out s1, out a4_840, out a5_131, out s3, out s5_113, out s8_101, out mstatus);
						}
						struct Eq_249852 * s0_153 = *((word32) a5_131 + 8);
						ui32 a4_154 = (word32) s0_153->b0020;
						ui32 a5_158 = (word32) s0_153->b000D;
						if ((a4_154 & 48) != s8_101)
							a5_158 += ~0x00;
						Eq_2 a4_188 = *s3.u0 - ((a4_154 & 48) & 0x01);
						uint32 a5_171 = a5_158 & 0x007F | (a4_154 & 48) << 0x04 & 0x0080;
						dwArg44 = a4_188;
						word32 a3_842;
						word32 a2_197;
						Eq_2 s0_205;
						Eq_2 s1_206;
						Eq_2 s2_209;
						Eq_2 s4_211;
						Eq_2 s5_212;
						word32 s9_216;
						Eq_2 a0_224;
						word32 s10_847;
						word32 a1_841;
						word32 s3_843;
						word32 s6_844;
						word32 s7_845;
						word32 s8_846;
						word32 s11_848;
						struct Eq_246946 * a5_200;
						Eq_2 a4_199;
						Eq_2 ra_204 = create_friend_pdu(ra_110, s1, s3, s5_113, mstatus, s6, s4, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg14, dwArg28, dwArg34, s9, s7, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, out s0_205, out s1_206, out a0_224, out a1_841, out a2_197, out a3_842, out a4_199, out a5_200, out s2_209, out s3_843, out s4_211, out s5_212, out s6_844, out s7_845, out s8_846, out s9_216, out s10_847, out s11_848, out mstatus);
						dwLoc38 = SEQ((byte) a5_171, (byte) a5_171, (byte) (a5_171 >> 0x08), (byte) (a5_171 >> 0x10));
						if (a0_224 == 0x00)
						{
							word32 a0_849;
							word32 a7_852;
							word32 s11_855;
							word32 a2_850;
							word32 a3_851;
							word32 s8_853;
							word32 s9_854;
							word32 t4_856;
							ra_110 = printf(ra_204, s9_216 + 0x05BC, a0_224, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1, out a0_849, out a1, out a2_850, out a3_851, out a4, out a5_131, out a7_852, out s2_253, out s3, out s4_100, out s5_113, out s6, out s7_115, out s8_853, out s9_854, out s10, out s11_855, out t4_856);
						}
						else
						{
							if (s2_209 != 0x00)
							{
								a4_199 = *s2_209;
								a5_200 = (struct Eq_246946 *) *((word32) s2_209 + 4);
								*((word32) a4_199 + 16) = a2_197;
								a5_200[20] = (struct Eq_246946) a2_197;
							}
							word32 a3_859;
							word32 s0_858;
							word32 s8_860;
							word32 s11_861;
							ra_110 = enqueue_friend_pdu(ra_204, s0_205, s1_206, s4_211, s5_212, a0_224, a4_199, a5_200, s2_209, mstatus, dwLoc40, dwLoc3C, dwLoc38, s2, s0, dwLoc20, dwLoc1C, dwLoc18, dwLoc08, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg38, a4_188, s9, s1, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s0_858, out s1, out a1, out a3_859, out a4, out a5_131, out s2_253, out s3, out s4_100, out s5_113, out s6, out s7_115, out s8_860, out s10, out s11_861, out mstatus);
						}
					}
				}
				s1 = (byte) s1.u0 + 0x0084;
			} while (s6 != s1);
		}
		0x00 = (int8) dwArg0198;
		s1Out = s1;
		a1Out = a1;
		a4Out = a4;
		s2Out = s2_253;
		s3Out = s3;
		s6Out = s6;
		s7Out = s7_115;
		s10Out = s10;
		mstatusOut = mstatus;
		return dwArg0158;
	}
}

// 2304875E: Register Eq_2 bt_mesh_friend_enqueue_tx(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_240750) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s9, Register (ptr32 Eq_240162) s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_240876) a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s6Out, Register out ptr32 s7Out, Register out Eq_2 s9Out, Register out (ptr32 Eq_240162) s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_trans_send
//      bt_mesh_ctl_send
Eq_2 bt_mesh_friend_enqueue_tx(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a4, struct Eq_240750 * a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s9, struct Eq_240162 * s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, struct Eq_240876 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s6Out, ptr32 & s7Out, union Eq_2 & s9Out, struct Eq_240162 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a1_110;
	Eq_2 a5_100;
	Eq_2 s3_109 = (word32) a5->w001C;
	Eq_2 s4_40 = (word32) a5->w0004;
	byte bLoc45_417 = SLICE(s10, byte, 24);
	word24 nLoc48_439 = (word24) s10;
	Eq_2 s0_102 = 0x4200D000;
	ptr32 s7_119 = a1;
	Eq_2 s2_103 = a2;
	Eq_2 s8_105 = a3;
	word32 a5_871;
	Eq_2 a3_111;
	struct Eq_240876 * a4_107;
	if (friend_lpn_matches(0x4200D6DC, s3_109, s4_40, out a3_111, out a4_107, out a5_871) != 0x00 || friend_lpn_matches(0x4200D760, s3_109, s4_40, out a3_111, out a4_107, out a5_100) != 0x00)
	{
		a5_100.u0 = 0x01;
		word32 a5_872;
		if (bt_mesh_friend_get(out a5_872) == 0x01)
		{
			s0_102.u0 = 0x4200D6DC;
			Eq_2 s4_104 = 0x4200D7E4;
			s3_109.u0 = 0x4200D6BC;
			s10 = (struct Eq_240162 *) &g_dw4200D000;
			s11 = 0x230BA000;
			ra_114 = ra;
			do
			{
				Eq_2 ra_114;
				struct Eq_250115 * s1_78 = a4_107->dw0000;
				a1_110 = (word32) a4_107->w001C;
				if (friend_lpn_matches(s0_102, a1_110, (word32) *((word32) a3_111 + 4), out a3_111, out a4_107, out a5_100) != 0x00)
				{
					Eq_2 a0_98;
					Eq_2 s1_108;
					word32 s6_873;
					up32 s5_117;
					ra_114 = friend_queue_prepare_space(ra_114, s0_102, (word32) s1_78->w0008, s2_103, s8_105, s2_103, s3_109, s4_104, mstatus, dwLoc58, dwLoc10, dwLoc0C, dwLoc08, dwArg18, a4, s9, s7, dwArg58, dwArg68, dwArg78, dwArg98, dwArgB8, dwArgD8, dwArgF8, out s0_102, out s1_108, out a0_98, out a1_110, out a3_111, out a4_107, out a5_100, out s2_103, out s3_109, out s4_104, out s5_117, out s6_873, out s7_119, out s8_105, out s10, out s11, out mstatus);
					s6 = a0_98;
					if (a0_98 != 0x00)
					{
						if (s7_119 == 0x00 && s2_103 != 0x00)
						{
							word32 s8_892;
							word32 s1_889;
							word32 a5_890;
							word32 s3_891;
							ra_114 = friend_purge_old_ack(ra_114, s1_108, s2_103, (word32) *((word32) s1_108 + 8), a3_111, a5_100, mstatus, dwLoc60, dwLoc5C, dwLoc58, s2, dwArg18, a4, s9, s3, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out s0_102, out s1_889, out a4_107, out a5_890, out s3_891, out s5_117, out s8_892, out mstatus);
						}
						ui32 a5_164 = (word32) a4_107->b000B;
						byte bLoc45_419 = (byte) (((word32) bLoc45_417 & -0x0080 | a5_164 & 0x007F) & 0x007F | (word32) ((word32) a4_107->w0002 + s5_117 < 1) << 7);
						Eq_2 s1_158 = a4_107->t0004;
						Eq_2 dwLoc48_440 = SEQ(bLoc45_419, nLoc48_439);
						uint32 a0_181;
						ptr32 mstatus_190;
						word32 s10_193;
						Eq_2 s3_196;
						Eq_2 s5_198;
						Eq_2 a4_227;
						struct Eq_246946 * a5_228;
						word32 s11_236;
						Eq_2 s2_237;
						Eq_2 s7_242;
						Eq_2 s8_243;
						Eq_2 a0_252;
						word32 s10_888;
						word32 s5_885;
						word32 s3_883;
						word32 s4_878;
						word32 s1_874;
						word32 s6_886;
						word32 s4_884;
						word32 s9_887;
						word32 a3_882;
						word32 s1_879;
						word32 a1_880;
						word32 a2_881;
						word32 s2_877;
						word32 a5_876;
						word32 a4_875;
						Eq_2 ra_232 = create_friend_pdu(bt_mesh_next_seq(ra_114, s0_102, s1_158, a5_164 & 0x007F, mstatus, dwLoc60, dwLoc5C, dwLoc58, dwLoc54, dwLoc48_440, s6, s4, s2, s0, dwLoc28, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg08, dwArg18, dwArg28, s9, s7, s1, dwArg58, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArg0108, out s1_874, out a0_181, out a4_875, out a5_876, out s2_877, out s3_196, out s4_878, out s5_198, out s10_193, out mstatus_190), s0_102, s3_196, s5_198, mstatus_190, dwLoc50, SEQ((word16) (word32) a4_107->t0004, (word16) (word32) *((word32) s1_158 + 8)), dwLoc28, dwLoc20, dwLoc1C, dwLoc18, dwLoc0C, dwArg08, dwArg14, dwArg28, *s3_196 - (atomic_get(s10_193 + 0x06C4) >> 2 & 0x01), s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgE8, out s0_102, out s1_879, out a0_252, out a1_880, out a2_881, out a3_882, out a4_227, out a5_228, out s2_237, out s3_883, out s4_884, out s5_885, out s6_886, out s7_242, out s8_243, out s9_887, out s10_888, out s11_236, out mstatus);
						nLoc48_439 = SEQ((byte) a0_181, (byte) (a0_181 >> 0x08), (byte) (a0_181 >> 0x10));
						if (a0_252 == 0x00)
						{
							word32 s9_898;
							word32 s1_893;
							word32 t4_899;
							word32 s5_897;
							word32 a0_894;
							word32 a2_895;
							word32 a7_896;
							ra_114 = printf(ra_232, s11_236 + 0x05BC, a0_252, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_893, out a0_894, out a1_110, out a2_895, out a3_111, out a4_107, out a5_100, out a7_896, out s2_103, out s3_109, out s4_104, out s5_897, out s6, out s7_119, out s8_105, out s9_898, out s10, out s11, out t4_899);
						}
						else
						{
							if (s2_237 != 0x00)
							{
								struct Eq_250373 * a0_256 = *s2_237;
								*((word32) *((word32) s2_237 + 4) + 20) = a5_228;
								a0_256->ptr0010 = a5_228;
							}
							word32 s1_900;
							word32 s5_901;
							ra_114 = enqueue_friend_pdu(ra_232, s0_102, s0_102, s7_242, s8_243, a0_252, a4_227, a5_228, s2_237, mstatus, dwLoc60, dwLoc5C, dwLoc58, dwLoc48_440, s8, s6, s4, s2, dwLoc28, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg18, a4, dwArg28, s9, s3, s1, ra, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out s0_102, out s1_900, out a1_110, out a3_111, out a4_107, out a5_100, out s2_103, out s3_109, out s4_104, out s5_901, out s6, out s7_119, out s8_105, out s10, out s11, out mstatus);
						}
						bLoc45_417 = bLoc45_419;
					}
				}
				s0_102 = (byte) s0_102.u0 + 0x0084;
			} while (s4_104 != s0_102);
l230487B6:
			s0Out = s0_102;
			s1Out = dwArg28;
			a0Out = dwLoc5C;
			a1Out = a1_110;
			a2Out = dwArg011C;
			a4Out = a4_107;
			a5Out = a5_100;
			s2Out = s2_103;
			s3Out = s3_109;
			s4Out = dwArgDC;
			s6Out = s6;
			s7Out = s7_119;
			s9Out = dwLoc5C;
			s10Out = s10;
			s11Out = s11;
			mstatusOut = mstatus;
			return dwArg68;
		}
	}
	a1_110 = s3_109;
	goto l230487B6;
}

