pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 230488E6: Register Eq_2 bt_mesh_friend_clear_incomplete(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_237993) a0, Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 Eq_238019) a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_238019) s2Out, Register out (ptr32 Eq_237993) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      seg_rx_reset
Eq_2 bt_mesh_friend_clear_incomplete(Eq_2 ra, Eq_2 s1, struct Eq_237993 * a0, Eq_2 a1, Eq_2 a2, struct Eq_238019 * a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & s1Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_238019 & s2Out, struct Eq_237993 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_2 s1_108 = a1;
	struct Eq_237993 * s3_156 = a0;
	Eq_2 s4_24 = a2;
	struct Eq_238019 * s2_110 = a3;
	struct Eq_250391 * a5_29;
	Eq_2 a3_30;
	word32 a4_289;
	if (friend_lpn_matches(0x4200D6DC, (word32) a0->w001C, a2, out a3_30, out a4_289, out a5_29) != 0x00)
	{
		Eq_2 s0_32 = a5_29->t005C;
		if (a5_29 != null && (word32) (a5_29->ptr0014)->w000A == a1)
		{
			Eq_2 a4_36 = a3->t0000;
			if (a3_30 == a4_36 && a4_36 == a3->t0004)
			{
				struct Eq_245664 * a5_43;
				Eq_2 a1_45;
				Eq_2 a4_48;
				Eq_2 s1_51;
				word32 a0_291;
				word32 a2_292;
				word32 a3_293;
				word32 a7_294;
				word32 s2_295;
				word32 s3_296;
				word32 s4_297;
				word32 s5_298;
				word32 s6_299;
				word32 s7_300;
				word32 s8_301;
				word32 s9_302;
				word32 s10_303;
				word32 s11_304;
				word32 t4_305;
				word32 a1_306;
				word32 a3_307;
				word32 a4_308;
				word32 a5_309;
				word32 s8_310;
				ra = purge_buffers(printf(ra, &g_t230BA590, a3_30, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_51, out a0_291, out a1_45, out a2_292, out a3_293, out a4_48, out a5_43, out a7_294, out s2_295, out s3_296, out s4_297, out s5_298, out s6_299, out s7_300, out s8_301, out s9_302, out s10_303, out s11_304, out t4_305), s0_32, s1_51, 1107351320, a1_45, a4_48, a5_43, mstatus, dwLoc08, dwArg48, s1, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_108, out a1_306, out a3_307, out a4_308, out a5_309, out s2_110, out s3_156, out s4_24, out s5, out s6, out s8_310, out mstatus);
				((word32) s0_32 + 100)->u0 = 0x00;
			}
		}
	}
	Eq_2 a1_145 = (word32) s3_156->w001C;
	word32 a5_290;
	Eq_2 a3_102;
	Eq_2 a4_100;
	if (friend_lpn_matches(0x4200D760, a1_145, s4_24, out a3_102, out a4_100, out a5_290) != 0x00)
	{
		struct Eq_249688 * a5_105 = g_ptr4200D79C;
		if (a5_105 != null)
		{
			a4_100 = (word32) a5_105->ptr0014->w000A;
			if (a4_100 == s1_108)
			{
				a4_100 = s2_110->t0000;
				if (a3_102 == a4_100 && a4_100 == s2_110->t0004)
				{
					struct Eq_245664 * a5_120;
					Eq_2 a1_122;
					Eq_2 a4_125;
					Eq_2 s1_128;
					word32 a0_311;
					word32 a2_312;
					word32 a3_313;
					word32 a7_314;
					word32 s2_315;
					word32 s3_316;
					word32 s4_317;
					word32 s5_318;
					word32 s6_319;
					word32 s7_320;
					word32 s8_321;
					word32 s9_322;
					word32 s10_323;
					word32 s11_324;
					word32 t4_325;
					word32 a5_326;
					word32 s4_327;
					word32 s8_328;
					word32 mstatus_329;
					purge_buffers(printf(ra, &g_t230BA590, a3_102, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_128, out a0_311, out a1_122, out a2_312, out a3_313, out a4_125, out a5_120, out a7_314, out s2_315, out s3_316, out s4_317, out s5_318, out s6_319, out s7_320, out s8_321, out s9_322, out s10_323, out s11_324, out t4_325), 0x4200D6BC, s1_128, 0x4200D79C, a1_122, a4_125, a5_120, mstatus, dwLoc08, dwArg48, s1, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_108, out a1_145, out a3_102, out a4_100, out a5_326, out s2_110, out s3_156, out s4_327, out s5, out s6, out s8_328, out mstatus_329);
					g_b4200D7A4 = 0x00;
				}
			}
		}
	}
	s1Out = s1_108;
	a1Out = a1_145;
	a3Out = a3_102;
	a4Out = a4_100;
	s2Out = s2_110;
	s3Out = s3_156;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	return s1;
}

// 230489C4: void bt_mesh_srv_update_last_rcvd_msg(Register (ptr32 Eq_192149) a0, Register word32 a1, Register word32 a2, Register word32 a3, Register (ptr32 Eq_192156) a4, Register (ptr32 Eq_192157) a5)
// Called from:
//      gen_onoff_set.isra.0
void bt_mesh_srv_update_last_rcvd_msg(struct Eq_192149 * a0, word32 a1, word32 a2, word32 a3, struct Eq_192156 * a4, struct Eq_192157 * a5)
{
	a0->b0000 = (byte) a1;
	a0->w0002 = (word16) a2;
	a0->w0004 = (word16) a3;
	a4->ptr0008 = a0;
	a5->ptr000C = a0;
}

// 230489D6: Register word32 bt_mesh_srv_check_rcvd_msg_with_last(Register Eq_2 a0, Register ui32 a2, Register Eq_192162 a3, Register Eq_2 a4, Stack word32 dwArg84, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_192167) a1Out, Register out Eq_2 a4Out, Register out ptr32 s4Out)
// Called from:
//      gen_onoff_set.isra.0
word32 bt_mesh_srv_check_rcvd_msg_with_last(Eq_2 a0, ui32 a2, Eq_192162 a3, Eq_2 a4, word32 dwArg84, union Eq_2 & s1Out, ptr32 & a0Out, struct Eq_192167 & a1Out, union Eq_2 & a4Out, ptr32 & s4Out)
{
	ptr32 a5_31;
	word32 a5_88;
	struct Eq_192167 * a1_21;
	Eq_2 a0_20 = k_uptime_get(out a1_21, out a5_88);
	*a0_20 = a3;
	a1_21->t0004 = a3;
	if ((word32) *a4 == a0)
	{
		a5_31 = 0x00;
		if ((word32) *((word32) a4 + 2) != dwArg84)
		{
l23048A32:
			s1Out = a0;
			a0Out = a5_31;
			a1Out = a1_21;
			a4Out = a4;
			s4Out = dwArg04;
			return dwArg84;
		}
		ui32 a3_32 = (word32) *((word32) a4 + 4);
		if (a3_32 != a2)
			goto l23048A32;
		a4 = a0_20;
		a1_21 = a1_21 - a3_32 - (word32) (a0_20 < a0_20);
		a5_31 = 0x01;
		if (a1_21 <= null && (a1_21 != null || a0_20 <= 0x01000770))
			goto l23048A32;
	}
	a5_31 = 0x00;
	goto l23048A32;
}

// 23048A3E: Register word32 k_queue_init(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_196572) s2Out, Register out ptr32 s3Out)
// Called from:
//      cmd_stack_ble
//      bt_mesh_adv_init
//      k_work_q_start
//      bl_onchiphci_interface_init
//      hci_driver_open
//      bt_conn_init
//      l2cap_chan_tx_init
//      l2cap_chan_add
//      bt_att_connected
word32 k_queue_init(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, struct Eq_196572 & s2Out, ptr32 & s3Out)
{
	struct Eq_123301 ** a0_18;
	ptr32 a3_21;
	Eq_2 a4_22;
	word32 s1_26;
	struct Eq_196572 * s2_27;
	ptr32 s3_28;
	word32 s4_72;
	word32 a5_71;
	word32 a2_70;
	word32 a1_69;
	struct Eq_123301 * s0_25 = xQueueGenericCreate(ra, a1, 0x05, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s1_26, out a0_18, out a1_69, out a2_70, out a3_21, out a4_22, out a5_71, out s2_27, out s3_28, out s4_72);
	*a0_18 = (struct Eq_123301 **) s0_25;
	if (a0_18 == null)
	{
		word32 a5_73;
		user_vAssertCalled(a4_22, mstatus, out a5_73);
	}
	s0_25->ptr0008 = s0_25;
	s0_25->ptr000C = s0_25;
	a3Out = a3_21;
	a4Out = a4_22;
	a5Out = (char *) s0_25 + 4;
	s2Out = s2_27;
	s3Out = s3_28;
	return s1_26;
}

// 23048A68: Register Eq_2 k_queue_insert(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      k_queue_append
Eq_2 k_queue_insert(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	ptr32 a0_16;
	ptr32 a1_17;
	ptr32 a3_19;
	Eq_2 a4_20;
	ptr32 s1_25;
	ptr32 s2_26;
	ptr32 s3_27;
	ptr32 s4_28;
	ptr32 s5_29;
	ptr32 s6_30;
	ptr32 s8_31;
	word32 a7_92;
	word32 a5_91;
	Eq_2 a2_18;
	Eq_2 s0_24 = xQueueGenericSend(*a0, fp + ~0x13, 0x00, a4, a5, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_25, out a0_16, out a1_17, out a2_18, out a3_19, out a4_20, out a5_91, out a7_92, out s2_26, out s3_27, out s4_28, out s5_29, out s6_30, out s8_31);
	ptr32 a5_39 = 0x01;
	if (a0_16 != 0x01)
		a2_18 = user_vAssertCalled(a4_20, mstatus, out a5_39);
	s1Out = s1_25;
	a0Out = a0_16;
	a1Out = a1_17;
	a2Out = a2_18;
	a3Out = a3_19;
	a4Out = a4_20;
	a5Out = a5_39;
	s2Out = s2_26;
	s3Out = s3_27;
	s4Out = s4_28;
	s5Out = s5_29;
	s6Out = s6_30;
	s8Out = s8_31;
	return s0_24;
}

