pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23048A8A: Register word32 k_queue_append(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      k_queue_prepend
//      net_buf_put
//      k_work_submit
//      bl_onchiphci_rx_packet_handler
//      tx_free
//      bt_conn_init
//      bt_att_send
//      bt_att_req_send
word32 k_queue_append(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	ptr32 a0_11;
	ptr32 a1_12;
	ptr32 a2_13;
	ptr32 a3_14;
	ptr32 a4_15;
	ptr32 a5_16;
	ptr32 s1_20;
	ptr32 s2_21;
	ptr32 s3_22;
	ptr32 s4_23;
	ptr32 s5_24;
	ptr32 s6_25;
	ptr32 s8_26;
	word32 s0_19 = k_queue_insert(a0, a4, a5, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_20, out a0_11, out a1_12, out a2_13, out a3_14, out a4_15, out a5_16, out s2_21, out s3_22, out s4_23, out s5_24, out s6_25, out s8_26);
	s1Out = s1_20;
	a0Out = a0_11;
	a1Out = a1_12;
	a2Out = a2_13;
	a3Out = a3_14;
	a4Out = a4_15;
	a5Out = a5_16;
	s2Out = s2_21;
	s3Out = s3_22;
	s4Out = s4_23;
	s5Out = s5_24;
	s6Out = s6_25;
	s8Out = s8_26;
	return s0_19;
}

// 23048A92: Register Eq_2 k_queue_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out)
// Called from:
//      bl_onchiphci_interface_deinit
//      conn_cleanup
//      bt_delete_queue
//      bt_disable
//      bt_att_disconnected
Eq_2 k_queue_free(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out)
{
	if (a0 == 0x00 || a5 == 0x00)
	{
		ptr32 a5_40;
		ptr32 a3_44;
		ptr32 a4_45;
		ptr32 s1_48;
		ptr32 s2_51;
		ptr32 s3_52;
		ptr32 s4_53;
		ptr32 s5_54;
		ptr32 s6_55;
		ptr32 s7_56;
		ptr32 s8_57;
		ptr32 s9_58;
		word32 a0_136;
		word32 a1_137;
		word32 a2_138;
		word32 a7_139;
		word32 s10_140;
		word32 s11_141;
		word32 t4_142;
		Eq_2 ra_47 = printf(ra, &g_t230BA9B0, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_48, out a0_136, out a1_137, out a2_138, out a3_44, out a4_45, out a5_40, out a7_139, out s2_51, out s3_52, out s4_53, out s5_54, out s6_55, out s7_56, out s8_57, out s9_58, out s10_140, out s11_141, out t4_142);
		s1Out = s1_48;
		a3Out = a3_44;
		a4Out = a4_45;
		a5Out = a5_40;
		s2Out = s2_51;
		s3Out = s3_52;
		s4Out = s4_53;
		s5Out = s5_54;
		s6Out = s6_55;
		s7Out = s7_56;
		s8Out = s8_57;
		s9Out = s9_58;
		return ra_47;
	}
	else
	{
		ptr32 a3_20;
		ptr32 a4_21;
		ptr32 a5_22;
		ptr32 s1_25;
		ptr32 s4_26;
		word32 a0_133;
		word32 a1_134;
		word32 a2_135;
		vQueueDelete(a5, a3, a4, mstatus, dwArg0148, dwArg0188, out s1_25, out a0_133, out a1_134, out a2_135, out a3_20, out a4_21, out a5_22, out s4_26)->dw0000 = 0x00;
		s1Out = s1_25;
		a3Out = a3_20;
		a4Out = a4_21;
		a5Out = a5_22;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4_26;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		return ra;
	}
}

// 23048ABE: Register (ptr32 Eq_2) k_queue_prepend(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_250940) a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_250943) a5Out, Register out Eq_250944 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_250947 s5Out, Register out ptr32 s6Out)
// Called from:
//      net_buf_alloc_fixed
//      net_buf_unref
union Eq_2 * k_queue_prepend(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a0Out, struct Eq_250940 & a1Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_250943 & a5Out, union Eq_250944 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_250947 & s5Out, ptr32 & s6Out)
{
	ptr32 a0_8;
	struct Eq_250940 * a1_9;
	ptr32 a3_11;
	ptr32 a4_12;
	struct Eq_250943 * a5_13;
	ptr32 s1_17;
	Eq_250944 s2_18;
	ptr32 s3_19;
	ptr32 s4_20;
	Eq_250947 s5_21;
	ptr32 s6_22;
	word32 a2_47;
	word32 s8_48;
	union Eq_2 * s0_16 = k_queue_append(a0, a4, a5, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_17, out a0_8, out a1_9, out a2_47, out a3_11, out a4_12, out a5_13, out s2_18, out s3_19, out s4_20, out s5_21, out s6_22, out s8_48);
	s1Out = s1_17;
	a0Out = a0_8;
	a1Out = a1_9;
	a3Out = a3_11;
	a4Out = a4_12;
	a5Out = a5_13;
	s2Out = s2_18;
	s3Out = s3_19;
	s4Out = s4_20;
	s5Out = s5_21;
	s6Out = s6_22;
	return s0_16;
}

// 23048AC2: Register Eq_2 k_queue_append_list(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      net_buf_put
Eq_2 k_queue_append_list(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	Eq_2 s1_11 = a0;
	Eq_2 s0_13 = a1;
	while (s0_13 != 0x00)
	{
		word32 a2_112;
		s0_13 = *k_queue_append(s1_11, a4, a5, mstatus, s0, ra, dwArgE8, dwArg0128, dwArg0168, out s1_11, out a0, out a1, out a2_112, out a3, out a4, out a5, out s2, out s3, out s4, out s5, out s6, out s8);
	}
	a0Out = a0;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s8Out = s8;
	return s1_11;
}

// 23048AE6: Register Eq_2 k_queue_get(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_251041) s1Out, Register out (ptr32 Eq_251042) a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_251048) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      net_buf_alloc_fixed
//      net_buf_get
//      net_buf_unref
//      work_queue_main
//      bl_onchiphci_interface_deinit
//      bt_l2cap_send_cb
//      att_reset
Eq_2 k_queue_get(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, struct Eq_251041 & s1Out, struct Eq_251042 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_251048 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 a2_10 = a1;
	if (a1 == ~0x00)
		a2_10.u0 = ~0x00;
	word32 a5_102;
	word32 a4_101;
	word32 a0_25;
	ptr32 a1_26;
	ptr32 a3_28;
	struct Eq_251041 * s1_34;
	struct Eq_251048 * s2_35;
	ptr32 s3_36;
	ptr32 s4_37;
	ptr32 s8_38;
	ptr32 a2_27;
	Eq_2 s0_33 = xQueueReceive(*a0, fp + ~0x13, a2_10, a3, a4, ~0x00, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_34, out a0_25, out a1_26, out a2_27, out a3_28, out a4_101, out a5_102, out s2_35, out s3_36, out s4_37, out s8_38);
	if (a0_25 == 0x01)
		a2_27 = dwArgC4;
	s1Out = s1_34;
	a0Out = null;
	a1Out = a1_26;
	a2Out = a2_27;
	a3Out = a3_28;
	a4Out = 0x01;
	a5Out = 0x00;
	s2Out = s2_35;
	s3Out = s3_36;
	s4Out = s4_37;
	s8Out = s8_38;
	return s0_33;
}

// 23048B10: Register (ptr32 (ptr32 Eq_251110)) k_queue_is_empty(Register (ptr32 (ptr32 Eq_251110)) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      net_buf_unref
//      polling_events.constprop.1
struct Eq_251110 ** k_queue_is_empty(struct Eq_251110 ** a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_13;
	ptr32 a4_14;
	ptr32 a5_15;
	word32 a2_25;
	struct Eq_251110 ** a0_17 = (word32) (uxQueueMessagesWaiting(*a0, a3, a4, mstatus, out a2_25, out a3_13, out a4_14, out a5_15) < 1);
	a2Out = dwArg10;
	a3Out = a3_13;
	a4Out = a4_14;
	a5Out = a5_15;
	return a0_17;
}

// 23048B24: Register Eq_2 k_queue_get_cnt(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      bt_buf_get_rx_avail_cnt
Eq_2 k_queue_get_cnt(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a3Out, ptr32 & a4Out)
{
	struct Eq_251110 * a0_5 = *a0;
	ptr32 a3_11;
	ptr32 a4_12;
	word32 a2_16;
	word32 a5_17;
	Eq_2 a0_9 = uxQueueMessagesWaiting(a0_5, a3, a4, mstatus, out a2_16, out a3_11, out a4_12, out a5_17);
	a3Out = a3_11;
	a4Out = a4_12;
	return a0_9;
}

// 23048B2A: Register Eq_2 k_sem_init(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_251167) s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_251171) a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out)
// Called from:
//      cmd_stack_ble
//      set_ad
//      init_work
//      l2cap_chan_tx_init
//      l2cap_chan_rx_init
//      smp_init
//      bt_smp_init
//      bt_att_accept
Eq_2 k_sem_init(Eq_2 ra, Eq_2 s0, ptr32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArg0128, struct Eq_251167 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, struct Eq_251171 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out)
{
	ptr32 s8_105;
	ptr32 s4_28;
	ptr32 s3_27;
	ptr32 s2_26;
	struct Eq_251167 * s1_25;
	ptr32 a5_32;
	struct Eq_251171 * a4_21;
	ptr32 a3_20;
	ptr32 a0_36;
	ptr32 a1_18;
	if (a0 == 0x00)
	{
		word32 a0_128;
		word32 a2_129;
		word32 a7_130;
		word32 s9_131;
		word32 s10_132;
		word32 s11_133;
		word32 t4_134;
		ra = printf(ra, &g_t230BA9C4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_25, out a0_128, out a1_18, out a2_129, out a3_20, out a4_21, out a5_32, out a7_130, out s2_26, out s3_27, out s4_28, out s5, out s6, out s7, out s8_105, out s9_131, out s10_132, out s11_133, out t4_134);
		a0_36 = ~0x15;
	}
	else
	{
		struct Eq_251193 ** a0_17;
		struct Eq_251193 * s0_24 = xQueueCreateCountingSemaphore(ra, a2, a1, a3, a4, a5, mstatus, dwLoc10, s0, dwArgE8, dwArg0128, out s1_25, out a0_17, out a1_18, out a3_20, out a4_21, out s2_26, out s3_27, out s4_28, out s8_105);
		*a0_17 = (struct Eq_251193 **) s0_24;
		s0_24->ptr0008 = s0_24;
		s0_24->ptr000C = s0_24;
		a5_32 = (char *) s0_24 + 4;
		a0_36 = 0x00;
	}
	s1Out = s1_25;
	a0Out = a0_36;
	a1Out = a1_18;
	a3Out = a3_20;
	a4Out = a4_21;
	a5Out = a5_32;
	s2Out = s2_26;
	s3Out = s3_27;
	s4Out = s4_28;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8_105;
	return ra;
}

// 23048B5E: Register Eq_2 k_sem_take(Register (ptr32 Eq_2) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_251291) s2Out, Register out ptr32 s3Out, Register out Eq_251293 s4Out, Register out ptr32 s8Out)
// Called from:
//      send_frag
//      set_ad
//      hci_tx_thread
//      l2cap_chan_le_send
//      l2cap_rx_process
//      k_poll
//      bt_att_encrypt_change
//      bt_att_send
//      bt_att_req_send
Eq_2 k_sem_take(union Eq_2 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, struct Eq_251291 & s2Out, ptr32 & s3Out, union Eq_251293 & s4Out, ptr32 & s8Out)
{
	if (a0 == null)
	{
		s1Out = s1;
		a0Out = ~0x00;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		return s0;
	}
	else
	{
		word32 a0_15;
		Eq_2 a1_16;
		Eq_2 a3_18;
		Eq_2 a4_19;
		Eq_2 a5_20;
		ptr32 s1_23;
		struct Eq_251291 * s2_24;
		ptr32 s3_25;
		Eq_251293 s4_26;
		ptr32 s8_27;
		word32 a2_77;
		Eq_2 s0_22 = xQueueSemaphoreTake(*a0, a1, a2, a3, a4, a5, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_23, out a0_15, out a1_16, out a2_77, out a3_18, out a4_19, out a5_20, out s2_24, out s3_25, out s4_26, out s8_27);
		s1Out = s1_23;
		a0Out = 0x00 - (word32) (a0_15 != ~0x00);
		a1Out = a1_16;
		a3Out = a3_18;
		a4Out = a4_19;
		a5Out = a5_20;
		s2Out = s2_24;
		s3Out = s3_25;
		s4Out = s4_26;
		s8Out = s8_27;
		return s0_22;
	}
}

// 23048B7E: Register Eq_2 k_sem_give(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out Eq_2 s0Out, Register out (ptr32 Eq_198734) s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_198738) a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_198741) s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_198743) s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      hb_pub_status
//      hb_sub_status
//      mod_pub_status
//      relay_status
//      app_key_status
//      net_key_status
//      comp_data_status
//      mod_sub_status
//      mod_app_status
//      beacon_status
//      health_period_status
//      health_fault_status
//      health_attention_status
//      send_frag
//      hci_num_completed_packets
//      hci_cmd_done
//      hci_cmd_status
//      hci_cmd_complete
//      set_ad
//      bt_le_set_data_len
//      hci_tx_thread
//      l2cap_chan_tx_give_credits
//      bt_l2cap_send_cb
//      l2cap_chan_send_credits.isra.10
//      bt_smp_pkey_ready
//      k_poll_signal_raise
//      att_reset
//      bt_att_encrypt_change
//      att_rsp_sent
//      bt_att_send
Eq_2 k_sem_give(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgAC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, union Eq_2 & s0Out, struct Eq_198734 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, struct Eq_198738 & a3Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_198741 & s2Out, ptr32 & s3Out, struct Eq_198743 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 s8_107;
	ptr32 s6_104;
	ptr32 s5_103;
	struct Eq_198743 * s4_102;
	ptr32 s3_101;
	struct Eq_198741 * s2_100;
	struct Eq_198734 * s1_23;
	ptr32 a5_19;
	ptr32 a4_18;
	struct Eq_198738 * a3_17;
	ptr32 a1_15;
	ptr32 a0_39;
	if (a0 == 0x00)
	{
		word32 a0_141;
		word32 a2_142;
		word32 a7_143;
		word32 t4_144;
		ra = printf(ra, &g_t230BA9C4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_23, out a0_141, out a1_15, out a2_142, out a3_17, out a4_18, out a5_19, out a7_143, out s2_100, out s3_101, out s4_102, out s5_103, out s6_104, out s7, out s8_107, out s9, out s10, out s11, out t4_144);
		a0_39 = ~0x15;
	}
	else
	{
		word32 a0_14;
		word32 a2_139;
		word32 a7_140;
		s0 = xQueueGenericSend(*a0, 0x00, 0x00, a4, a5, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s1_23, out a0_14, out a1_15, out a2_139, out a3_17, out a4_18, out a5_19, out a7_140, out s2_100, out s3_101, out s4_102, out s5_103, out s6_104, out s8_107);
		a0_39 = 0x00 - (word32) (a0_14 != ~0x00);
	}
	s0Out = s0;
	s1Out = s1_23;
	a0Out = a0_39;
	a1Out = a1_15;
	a2Out = dwArg10;
	a3Out = a3_17;
	a4Out = a4_18;
	a5Out = a5_19;
	s2Out = s2_100;
	s3Out = s3_101;
	s4Out = s4_102;
	s5Out = s5_103;
	s6Out = s6_104;
	s7Out = s7;
	s8Out = s8_107;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return ra;
}

// 23048BB0: Register Eq_2 k_sem_delete(Register Eq_2 ra, Register (ptr32 int32) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 s1Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      set_ad
//      bt_disable
//      bt_att_disconnected
Eq_2 k_sem_delete(Eq_2 ra, int32 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & s1Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 s1_22;
	ptr32 a1_15;
	ptr32 a4_18;
	ptr32 a3_17;
	if (a0 != null)
	{
		Eq_2 a0_10 = *a0;
		if (a0_10 != 0x00)
		{
			word32 a0_141;
			word32 a2_142;
			word32 a5_143;
			word32 s4_144;
			vQueueDelete(a0_10, a3, a4, mstatus, dwArg0148, dwArg0188, out s1_22, out a0_141, out a1_15, out a2_142, out a3_17, out a4_18, out a5_143, out s4_144)->dw0000 = 0x00;
l23048BCC:
			s1Out = s1_22;
			a1Out = a1_15;
			a3Out = a3_17;
			a4Out = a4_18;
			s2Out = s2;
			s3Out = s3;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s9Out = s9;
			s10Out = s10;
			s11Out = s11;
			return ra;
		}
	}
	word32 a0_134;
	word32 a2_135;
	word32 a5_136;
	word32 a7_137;
	word32 s4_138;
	word32 s8_139;
	word32 t4_140;
	ra = printf(ra, &g_t230BA9C4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_22, out a0_134, out a1_15, out a2_135, out a3_17, out a4_18, out a5_136, out a7_137, out s2, out s3, out s4_138, out s5, out s6, out s7, out s8_139, out s9, out s10, out s11, out t4_140);
	goto l23048BCC;
}

// 23048BE0: Register Eq_2 k_sem_count_get(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      l2cap_chan_le_send
//      l2cap_chan_le_recv_seg
//      polling_events.constprop.1
Eq_2 k_sem_count_get(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out)
{
	struct Eq_251110 * a0_5 = *a0;
	ptr32 a2_10;
	ptr32 a3_11;
	ptr32 a4_12;
	word32 a5_17;
	Eq_2 a0_9 = uxQueueMessagesWaiting(a0_5, a3, a4, mstatus, out a2_10, out a3_11, out a4_12, out a5_17);
	a2Out = a2_10;
	a3Out = a3_11;
	a4Out = a4_12;
	return a0_9;
}

// 23048BE6: Register Eq_2 k_thread_create(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_196608 a2, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      cmd_stack_ble
//      bt_mesh_adv_init
//      k_work_q_start
//      hci_driver_open
Eq_2 k_thread_create(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_196608 a2, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out)
{
	Eq_251528 a0_22;
	ptr32 a3_25;
	ptr32 a4_26;
	ptr32 a5_27;
	ptr32 s1_30;
	ptr32 s2_31;
	ptr32 s3_32;
	word32 a2_66;
	Eq_2 ra_40 = xTaskCreate(ra, s1, (word32) (word16) (a2 >> 2), 0x00, a4, a0, s3, mstatus, dwArg00, dwArg04, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s1_30, out a0_22, out a2_66, out a3_25, out a4_26, out a5_27, out s2_31, out s3_32);
	s1Out = s1_30;
	a0Out = 0x00 - (word32) (a0_22 < 1);
	a3Out = a3_25;
	a4Out = a4_26;
	a5Out = a5_27;
	s2Out = s2_31;
	s3Out = s3_32;
	return ra_40;
}

