pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23048C10: Register Eq_2 k_thread_delete(Register Eq_2 ra, Register word32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      bt_disable
Eq_2 k_thread_delete(Eq_2 ra, word32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	if (a0 == 0x00 || a5 == 0x00)
	{
		ptr32 a5_43;
		ptr32 a2_46;
		ptr32 a3_47;
		ptr32 a4_48;
		word32 s1_126;
		word32 a0_127;
		word32 a1_128;
		word32 a7_129;
		word32 s2_130;
		word32 s3_131;
		word32 s4_132;
		word32 s5_133;
		word32 s6_134;
		word32 s7_135;
		word32 s8_136;
		word32 s9_137;
		word32 s10_138;
		word32 s11_139;
		word32 t4_140;
		Eq_2 ra_50 = printf(ra, &g_t230BA9D4, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_126, out a0_127, out a1_128, out a2_46, out a3_47, out a4_48, out a5_43, out a7_129, out s2_130, out s3_131, out s4_132, out s5_133, out s6_134, out s7_135, out s8_136, out s9_137, out s10_138, out s11_139, out t4_140);
		a2Out = a2_46;
		a3Out = a3_47;
		a4Out = a4_48;
		a5Out = a5_43;
		return ra_50;
	}
	else
	{
		ptr32 a3_21;
		ptr32 a4_22;
		ptr32 a5_23;
		word32 a0_124;
		word32 s2_125;
		vTaskDelete(a5, a2, a3, a4, a5, mstatus, dwArg0118, dwArg0128, dwArg0158, dwArg0168, out a0_124, out a3_21, out a4_22, out a5_23, out s2_125)->dw0000 = 0x00;
		a2Out = dwArg10;
		a3Out = a3_21;
		a4Out = a4_22;
		a5Out = a5_23;
		return ra;
	}
}

// 23048C3C: void k_yield()
// Called from:
//      adv_thread
//      work_queue_main
//      recv_thread
//      hci_tx_thread
void k_yield()
{
	__syscall();
}

// 23048C44: Register Eq_2 k_sleep(Register word32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      adv_thread
Eq_2 k_sleep(word32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a3Out, ptr32 & a4Out)
{
	Eq_2 a0_6 = a0 + 1000 >> 1000;
	ptr32 a3_15;
	ptr32 a4_16;
	word32 s1_33;
	word32 a0_34;
	word32 a1_35;
	word32 a2_36;
	word32 a5_37;
	word32 s2_38;
	word32 s3_39;
	word32 s4_40;
	Eq_2 s0_19 = vTaskDelay(a0_6, a2, a3, a4, 1000, mstatus, dwArg24, dwArg28, dwArg0138, dwArg0178, out s1_33, out a0_34, out a1_35, out a2_36, out a3_15, out a4_16, out a5_37, out s2_38, out s3_39, out s4_40);
	a3Out = a3_15;
	a4Out = a4_16;
	return s0_19;
}

// 23048C54: Register word32 irq_lock(Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a2Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_251679) a5Out)
// Called from:
//      atomic_cas
//      atomic_inc
//      atomic_set
//      atomic_clear
//      atomic_or
//      atomic_and
//      net_buf_alloc_fixed
//      net_buf_slist_put
//      net_buf_slist_get
//      k_delayed_work_cancel
//      k_delayed_work_submit
//      send_frag
//      tx_notify
//      sc_indicate
//      hci_num_completed_packets
//      bt_buf_get_cmd_complete
//      polling_events.constprop.1
//      k_poll
//      k_poll_signal_raise
word32 irq_lock(Eq_2 a4, ptr32 mstatus, ptr32 & a2Out, union Eq_2 & a4Out, struct Eq_251679 & a5Out)
{
	struct Eq_251679 * a5_8;
	Eq_2 a4_9 = vTaskEnterCritical(a4, mstatus, out a5_8);
	a2Out = dwArg10;
	a4Out = a4_9;
	a5Out = a5_8;
	return 0x01;
}

// 23048C64: Register Eq_2 irq_unlock(Register Eq_2 a3, Register ptr32 mstatus, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      atomic_cas
//      atomic_inc
//      atomic_set
//      atomic_clear
//      atomic_or
//      atomic_and
//      net_buf_alloc_fixed
//      net_buf_slist_put
//      net_buf_slist_get
//      k_delayed_work_cancel
//      k_delayed_work_submit
//      send_frag
//      tx_notify
//      sc_indicate
//      hci_num_completed_packets
//      bt_buf_get_cmd_complete
//      polling_events.constprop.1
//      k_poll
//      k_poll_signal_raise
Eq_2 irq_unlock(Eq_2 a3, ptr32 mstatus, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a5_5;
	ptr32 a4_7;
	Eq_2 a3_6 = vTaskExitCritical(a3, mstatus, out a4_7, out a5_5);
	a4Out = a4_7;
	a5Out = a5_5;
	return a3_6;
}

// 23048C68: Register Eq_2 k_timer_init(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out)
// Called from:
//      bt_gatt_init
Eq_2 k_timer_init(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArgA4, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0138, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out)
{
	Eq_2 s0_19 = a0;
	if (a0 == 0x00)
	{
		user_vAssertCalled(a1, mstatus, out a5);
		s0_19 = dwArgA4;
	}
	*((word32) a2 + 8) = s0_19;
	*((word32) a1 + 4) = s0_19;
	word32 a3_37;
	Eq_2 a4_38;
	ptr32 a5_39;
	word32 s1_42;
	word32 s2_43;
	word32 s3_44;
	word32 s4_45;
	g_dw230BA9E4 = xTimerCreate(ra, 587966948, 1000, 0x00, a1, a5, mstatus, dwLoc08, dwArg00, dwArg04, dwArgD8, dwArgF8, dwArg0138, out s1_42, out a3_37, out a4_38, out a5_39, out s2_43, out s3_44, out s4_45);
	if (true)
	{
		s1Out.u0 = <invalid>;
		a0Out.u0 = <invalid>;
		a3Out.u0 = <invalid>;
		a4Out.u0 = <invalid>;
		a5Out = a5_39;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		return <invalid>;
	}
	else
	{
		ptr32 a5_58;
		user_vAssertCalled(a4_38, mstatus, out a5_58);
		s1Out.u0 = <invalid>;
		a0Out.u0 = <invalid>;
		a3Out.u0 = <invalid>;
		a4Out.u0 = <invalid>;
		a5Out = a5_58;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		return <invalid>;
	}
}

// 23048CAE: Register word32 k_timer_stop(Register (ptr32 Eq_2) a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg44, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out Eq_251789 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      k_delayed_work_cancel
//      work_timeout
word32 k_timer_stop(union Eq_2 * a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg44, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0138, union Eq_251789 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	if (a0 == null)
		user_vAssertCalled(a4, mstatus, out a5);
	word32 a0_24;
	word32 s1_29;
	word32 s2_30;
	word32 s3_31;
	word32 s4_32;
	word32 s8_33;
	word32 a1_35;
	word32 a3_36;
	Eq_2 a4_37;
	word32 s5_45;
	word32 s6_46;
	word32 a5_104;
	xTimerGenericCommand(*a0, 0x03, null, 0x00, a5, mstatus, dwArg44, dwArgB8, dwArgC8, dwArgF8, dwArg0138, out s1_29, out a0_24, out a1_35, out a3_36, out a4_37, out a5_104, out s2_30, out s3_31, out s4_32, out s5_45, out s6_46, out s8_33);
	if (a0_24 == 0x01)
		return;
	word32 a5_105;
	user_vAssertCalled(a4_37, mstatus, out a5_105);
	return;
}

// 23048CDE: Register Eq_2 k_timer_delete(Register (ptr32 Eq_2) a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg44, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s8Out)
// Called from:
//      k_delayed_work_del_timer
Eq_2 k_timer_delete(union Eq_2 * a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg44, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0138, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s8Out)
{
	if (a0 == null)
		user_vAssertCalled(a4, mstatus, out a5);
	word32 a0_24;
	word32 s1_29;
	word32 s2_30;
	word32 s3_31;
	word32 s4_32;
	word32 s8_33;
	word32 a3_36;
	Eq_2 a4_37;
	word32 s5_45;
	word32 s6_46;
	word32 a5_105;
	word32 a1_104;
	xTimerGenericCommand(*a0, 0x05, null, 0x00, a5, mstatus, dwArg44, dwArgB8, dwArgC8, dwArgF8, dwArg0138, out s1_29, out a0_24, out a1_104, out a3_36, out a4_37, out a5_105, out s2_30, out s3_31, out s4_32, out s5_45, out s6_46, out s8_33);
	if (a0_24 == 0x01)
	{
		s1Out.u0 = <invalid>;
		a0Out.u0 = <invalid>;
		a3Out.u0 = <invalid>;
		a4Out.u0 = <invalid>;
		a5Out = 0x01;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		s6Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
	else
	{
		ptr32 a5_53;
		user_vAssertCalled(a4_37, mstatus, out a5_53);
		s1Out.u0 = <invalid>;
		a0Out.u0 = <invalid>;
		a3Out.u0 = <invalid>;
		a4Out.u0 = <invalid>;
		a5Out = a5_53;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		s6Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
}

