pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23048D0E: Register uint32 k_now_ms(Register out ptr32 a1Out, Register out Eq_251910 a5Out)
// Called from:
//      k_uptime_get
//      k_uptime_get_32
//      k_timer_start
//      k_delayed_work_remaining_get
uint32 k_now_ms(ptr32 & a1Out, union Eq_251910 & a5Out)
{
	word32 a5_18;
	uint32 a0_13 = (word32) xTaskGetTickCount(out a5_18) + 1000 >> 1000;
	a1Out = 0x00;
	a5Out.u0 = 1000;
	return a0_13;
}

// 23048D2A: Register Eq_2 k_uptime_get(Register out ptr32 a1Out, Register out ptr32 a5Out)
// Called from:
//      hb_sub_send_status.constprop.14
//      heartbeat_sub_set
//      bt_mesh_heartbeat
//      send_reliable
//      prov_retransmit
//      bt_mesh_srv_check_rcvd_msg_with_last
Eq_2 k_uptime_get(ptr32 & a1Out, ptr32 & a5Out)
{
	ptr32 a1_4;
	ptr32 a5_6;
	Eq_2 a0_3 = k_now_ms(out a1_4, out a5_6);
	a1Out = a1_4;
	a5Out = a5_6;
	return a0_3;
}

// 23048D2E: Register Eq_2 k_uptime_get_32(Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a5Out)
// Called from:
//      publish_start
//      publish_sent
//      beacon_complete
//      beacon_send
//      bt_mesh_proxy_identity_start
//      bt_mesh_proxy_adv_start
//      seg_ack
//      bt_mesh_trans_recv
//      clear_timeout
//      bt_mesh_friend_req
//      net_buf_alloc_fixed
Eq_2 k_uptime_get_32(ptr32 & a1Out, ptr32 & a2Out, ptr32 & a5Out)
{
	ptr32 a1_7;
	ptr32 a5_9;
	Eq_2 a0_6 = k_now_ms(out a1_7, out a5_9);
	a1Out = a1_7;
	a2Out = dwArg10;
	a5Out = a5_9;
	return a0_6;
}

// 23048D3C: Register Eq_2 k_timer_start(Register ptr32 a0, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg54, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out Eq_2 a2Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      k_delayed_work_submit
Eq_2 k_timer_start(ptr32 a0, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg54, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0148, union Eq_2 & a2Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	if (a0 == 0x00)
	{
		word32 a5_219;
		user_vAssertCalled(a4, mstatus, out a5_219);
	}
	*((word32) a1 + 0x0C) = a0;
	Eq_2 a5_24;
	word32 a1_208;
	Eq_2 a0_21 = k_now_ms(out a1_208, out a5_24);
	*((word32) a0_21 + 16) = a0;
	Eq_2 a0_33;
	Eq_2 a4_46;
	word32 s1_209;
	word32 a1_210;
	word32 a3_211;
	word32 a5_212;
	word32 s2_213;
	word32 s3_214;
	word32 s5_216;
	word32 s4_215;
	word32 s8_218;
	word32 s6_217;
	xTimerGenericCommand(a0_21, 0x03, null, 0x00, a5_24, mstatus, dwArg54, dwArgC8, dwArgD8, dwArg0108, dwArg0148, out s1_209, out a0_33, out a1_210, out a3_211, out a4_46, out a5_212, out s2_213, out s3_214, out s4_215, out s5_216, out s6_217, out s8_218);
	Eq_2 a5_56 = 0x01;
	if (a0_33 != 0x01)
		user_vAssertCalled(a4_46, mstatus, out a5_56);
	word32 a0_72;
	Eq_2 a4_85;
	word32 s1_220;
	word32 a1_221;
	word32 a3_222;
	word32 a5_223;
	word32 s2_224;
	word32 s3_225;
	word32 s4_226;
	word32 s5_227;
	word32 s6_228;
	word32 s8_229;
	Eq_2 s0_76 = xTimerGenericCommand(a0_33, 0x04, null, 0x00, a5_56, mstatus, dwArg54, dwArgC8, dwArgD8, dwArg0108, dwArg0148, out s1_220, out a0_72, out a1_221, out a3_222, out a4_85, out a5_223, out s2_224, out s3_225, out s4_226, out s5_227, out s6_228, out s8_229);
	if (a0_72 != 0x01)
	{
		word32 a5_234;
		user_vAssertCalled(a4_85, mstatus, out a5_234);
	}
	Eq_2 s0_100 = *s0_76;
	Eq_2 a5_102;
	xTaskGetTickCount(out a5_102);
	word32 a0_110;
	word32 s1_115;
	word32 s2_116;
	word32 s3_117;
	word32 s4_118;
	Eq_2 a4_123;
	word32 s5_131;
	word32 s6_132;
	word32 a1_230;
	word32 a3_231;
	word32 a5_232;
	word32 s8_233;
	xTimerGenericCommand(s0_100, 0x01, null, 0x00, a5_102, mstatus, dwArg54, dwArgC8, dwArgD8, dwArg0108, dwArg0148, out s1_115, out a0_110, out a1_230, out a3_231, out a4_123, out a5_232, out s2_116, out s3_117, out s4_118, out s5_131, out s6_132, out s8_233);
	if (a0_110 == 0x01)
	{
		a2Out = dwArg10;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		s6Out.u0 = <invalid>;
		return <invalid>;
	}
	else
	{
		word32 a5_235;
		a2Out = user_vAssertCalled(a4_123, mstatus, out a5_235);
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		s6Out.u0 = <invalid>;
		return <invalid>;
	}
}

// 23048DC0: Register Eq_2 k_get_random_byte_array(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_64398) a2, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      bt_rand
Eq_2 k_get_random_byte_array(Eq_2 a0, Eq_2 a1, struct Eq_64398 * a2, union Eq_2 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 s0_11 = a0;
	word32 s1_13 = a0 + a1;
	while (s0_11 != s1_13)
	{
		s1_13 = bl_rand(a0, a2, out a0, out a1, out a2, out a3, out a4, out a5, out s4, out s8);
		*s0_11 = (byte) a0;
		s0_11 = (word32) s0_11 + 1;
	}
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s4Out = s4;
	s8Out = s8;
	return s1_13;
}

// 23048DE8: Register Eq_2 k_malloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s2Out, Register out (ptr32 Eq_252139) s3Out, Register out ptr32 s4Out)
// Called from:
//      bl_onchiphci_rx_packet_handler
Eq_2 k_malloc(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg8C, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s2Out, struct Eq_252139 & s3Out, ptr32 & s4Out)
{
	Eq_2 a0_11;
	ptr32 s2_20;
	struct Eq_252139 * s3_21;
	ptr32 s4_22;
	word32 s1_34;
	word32 a1_35;
	word32 a2_36;
	word32 a3_37;
	word32 a4_38;
	word32 a5_39;
	word32 a6_40;
	word32 s8_41;
	pvPortMalloc(ra, s1, a0, a3, a4, a5, mstatus, dwArg40, dwArg44, dwArg8C, dwArg0138, dwArg0178, out s1_34, out a0_11, out a1_35, out a2_36, out a3_37, out a4_38, out a5_39, out a6_40, out s2_20, out s3_21, out s4_22, out s8_41);
	s2Out = s2_20;
	s3Out = s3_21;
	s4Out = s4_22;
	return a0_11;
}

// 23048DEC: Register word32 k_free(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 a3Out, Register out Eq_252175 a4Out)
// Called from:
//      net_buf_unref
//      bl_onchiphci_interface_deinit
word32 k_free(Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & a3Out, union Eq_252175 & a4Out)
{
	ptr32 a3_9;
	Eq_252175 a4_10;
	word32 s0_17;
	word32 s1_24;
	word32 a0_25;
	word32 a1_26;
	word32 a2_27;
	word32 a5_28;
	word32 a6_29;
	word32 s4_30;
	word32 t3_31;
	vPortFree(a0, a2, a5, mstatus, dwArg0158, dwArg0198, out s0_17, out s1_24, out a0_25, out a1_26, out a2_27, out a3_9, out a4_10, out a5_28, out a6_29, out s4_30, out t3_31);
	a3Out = a3_9;
	a4Out = a4_10;
	return s0_17;
}

// 23048DF0: Register ptr32 atomic_cas(Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg44, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      bt_gatt_init
ptr32 atomic_cas(word32 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg44, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 s0_23;
	word32 a5_19;
	word32 a2_52;
	word32 a4_53;
	irq_lock(a4, mstatus, out a2_52, out a4_53, out a5_19);
	if (a5_19 == a1)
	{
		*dwArg44 = a1;
		s0_23 = 0x01;
	}
	else
		s0_23 = 0x00;
	ptr32 a4_30;
	ptr32 a5_31;
	Eq_2 a3_29 = irq_unlock(a3, mstatus, out a4_30, out a5_31);
	a0Out = s0_23;
	a3Out = a3_29;
	a4Out = a4_30;
	a5Out = a5_31;
	return s0_23;
}

// 23048E20: Register word32 atomic_inc(Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out ptr32 a4Out)
// Called from:
//      bt_conn_set_state
//      bt_conn_lookup_handle
//      bt_conn_lookup_addr_le
//      bt_conn_lookup_state_le
//      bt_conn_ref
word32 atomic_inc(Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a0Out, union Eq_2 & a3Out, ptr32 & a4Out)
{
	word32 a2_38;
	word32 a4_39;
	word32 a5_40;
	irq_lock(a4, mstatus, out a2_38, out a4_39, out a5_40);
	word32 s1_18 = *s0;
	*((word32) s0 + 1) = s1_18;
	ptr32 a4_23;
	word32 a5_41;
	Eq_2 a3_22 = irq_unlock(a3, mstatus, out a4_23, out a5_41);
	a0Out = s0;
	a3Out = a3_22;
	a4Out = a4_23;
	return s1_18;
}

// 23048E46: Register word32 atomic_dec(Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      bt_conn_unref
//      bt_conn_create_le
//      conn_update_timeout
word32 atomic_dec(Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	word32 a2_38;
	word32 a4_39;
	word32 a5_40;
	irq_lock(a4, mstatus, out a2_38, out a4_39, out a5_40);
	word32 s1_18 = *s0;
	*((word32) s0 - 1) = s1_18;
	ptr32 a4_23;
	ptr32 a5_24;
	a3Out = irq_unlock(a3, mstatus, out a4_23, out a5_24);
	a4Out = a4_23;
	a5Out = a5_24;
	return s1_18;
}

