pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23048E6C: Register Eq_2 atomic_get(Register Eq_2 a0)
// Called from:
//      blemesh_iv_update
//      atomic_test_bit
//      sub_update
//      bt_mesh_adv_create_from_pool
//      beacon_send
//      bt_mesh_beacon_recv
//      bt_mesh_beacon_disable
//      bt_mesh_reset
//      bt_mesh_is_provisioned
//      atomic_test_bit.constprop.8
//      prov_retransmit
//      gen_prov_start
//      send_pub_key
//      gen_prov_ctl
//      bt_prov_active
//      bt_mesh_pb_adv_recv
//      ctl_recv
//      bt_mesh_trans_send
//      encode_friend_ctl
//      bt_mesh_friend_enqueue_tx
//      k_delayed_work_cancel
//      atomic_test_bit
//      le_check_valid_conn
//      bt_conn_prepare_events
//      bt_conn_add_le
//      bt_conn_lookup_handle
//      bt_conn_lookup_addr_le
//      bt_conn_lookup_state_le
//      bt_conn_foreach
//      bt_conn_get_remote_dev_info
//      bt_conn_init
//      sc_indicate_rsp
//      sc_indicate
//      bt_gatt_unsubscribe
//      bt_gatt_disconnected
//      atomic_test_bit
//      init_work
//      atomic_test_bit
//      bt_att_encrypt_change
//      att_chan_get
Eq_2 atomic_get(Eq_2 a0)
{
	return *a0;
}

// 23048E70: Register word32 atomic_set(Register Eq_2 s1, Register (ptr32 word32) a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      group_zero
//      bt_conn_add_le
//      init_work
//      smp_pairing_complete
word32 atomic_set(Eq_2 s1, word32 * a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a0Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & s4Out, ptr32 & s8Out)
{
	word32 a2_45;
	word32 a4_46;
	word32 a5_47;
	irq_lock(a4, mstatus, out a2_45, out a4_46, out a5_47);
	word32 s0_21 = *s1;
	*a1 = s0_21;
	ptr32 a4_25;
	word32 a5_48;
	Eq_2 a3_24 = irq_unlock(a3, mstatus, out a4_25, out a5_48);
	a0Out = s1;
	a3Out = a3_24;
	a4Out = a4_25;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s0_21;
}

// 23048E96: Register Eq_2 atomic_clear(Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      hci_disconn_complete
Eq_2 atomic_clear(Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a4Out, ptr32 & a5Out)
{
	word32 a2_36;
	word32 a4_37;
	word32 a5_38;
	irq_lock(a4, mstatus, out a2_36, out a4_37, out a5_38);
	**s1 = 0x00;
	ptr32 a4_22;
	ptr32 a5_23;
	Eq_2 a3_21 = irq_unlock(a3, mstatus, out a4_22, out a5_23);
	a4Out = a4_22;
	a5Out = a5_23;
	return a3_21;
}

// 23048EBA: Register word32 atomic_or(Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a0Out, Register out (ptr32 word32) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_188711 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      cmd_stack_ble
//      sub_update
//      bt_mesh_lpn_group_del
//      bt_mesh_beacon_ivu_initiator
//      bt_mesh_provision
//      bt_mesh_net_create
//      bt_mesh_net_iv_update
//      prov_send_fail_msg
//      prov_pub_key
//      prov_start
//      gen_prov_ctl
//      bt_mesh_pb_gatt_open
//      ctl_recv
//      k_work_submit
//      bt_conn_set_security
//      conn_update_timeout
//      bt_conn_le_param_update
//      sc_indicate
//      sc_process
//      bt_gatt_unsubscribe
//      le_pkey_complete
//      atomic_set_bit_to
//      le_conn_update_complete
//      bt_id_add
//      bt_id_del
//      bt_finalize_init
//      bt_setup_id_addr
//      bt_le_scan_start
//      bt_pub_key_gen
//      l2cap_chan_tx_give_credits
//      bt_l2cap_connected
//      atomic_set_bit
//      att_reset
word32 atomic_or(Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a0Out, word32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_188711 & a4Out, ptr32 & a5Out, ptr32 & s4Out, ptr32 & s8Out)
{
	word32 a2_49;
	word32 a4_50;
	word32 a5_51;
	irq_lock(a4, mstatus, out a2_49, out a4_50, out a5_51);
	word32 s1_21 = *s0;
	word32 * a1_22 = a1 | s0;
	*a1_22 = s1_21;
	Eq_188711 a4_26;
	ptr32 a5_27;
	Eq_2 a3_25 = irq_unlock(a3, mstatus, out a4_26, out a5_27);
	a0Out = s0;
	a1Out = a1_22;
	a2Out = dwArg44;
	a3Out = a3_25;
	a4Out = a4_26;
	a5Out = a5_27;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s1_21;
}

// 23048EE2: Register word32 atomic_and(Register Eq_2 s0, Register int32 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a0Out, Register out (ptr32 word32) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_188015 a4Out, Register out (ptr32 code) a5Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      atomic_test_and_clear_bit
//      bt_mesh_lpn_group_add
//      bt_mesh_beacon_ivu_initiator
//      bt_mesh_provision
//      bt_mesh_net_create
//      bt_mesh_net_iv_update
//      pub_key_ready
//      prov_input_complete
//      bt_mesh_input_number
//      bt_mesh_input_string
//      seg_tx_reset
//      ctl_recv
//      work_queue_main
//      k_work_init
//      notify_le_param_updated
//      bt_conn_set_security
//      bt_conn_prepare_events
//      bt_conn_disconnect
//      conn_update_timeout
//      bt_conn_le_param_update
//      bt_conn_process_tx
//      gatt_write_ccc_rsp
//      sc_indicate_rsp
//      sc_process
//      le_pkey_complete
//      atomic_set_bit_to
//      bt_le_scan_update
//      enh_conn_complete
//      bt_disable
//      bt_le_adv_start
//      bt_le_scan_start
//      bt_le_scan_stop
//      bt_pub_key_gen
//      l2cap_chan_le_send
//      atomic_test_and_clear_bit
//      smp_dhkey_check
//      bt_smp_encrypt_change
//      smp_send_pairing_confirm
//      legacy_pairing_confirm
//      smp_pairing_confirm
//      smp_pairing_rsp
word32 atomic_and(Eq_2 s0, int32 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a0Out, word32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_188015 & a4Out, <anonymous> & a5Out, ptr32 & s4Out, ptr32 & s8Out)
{
	word32 a2_49;
	word32 a4_50;
	word32 a5_51;
	irq_lock(a4, mstatus, out a2_49, out a4_50, out a5_51);
	word32 s1_21 = *s0;
	word32 * a1_22 = a1 & s0;
	*a1_22 = s1_21;
	Eq_188015 a4_26;
	<anonymous> * a5_27;
	Eq_2 a3_25 = irq_unlock(a3, mstatus, out a4_26, out a5_27);
	a0Out = s0;
	a1Out = a1_22;
	a2Out = dwArg44;
	a3Out = a3_25;
	a4Out = a4_26;
	a5Out = a5_27;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s1_21;
}

// 23048F0A: void fixed_data_unref()
void fixed_data_unref()
{
}

// 23048F0C: Register word32 net_buf_pool_get(Register word32 a0, Register out ptr32 a5Out)
// Called from:
//      hci_cmd_done
//      l2cap_chan_le_send
word32 net_buf_pool_get(word32 a0, ptr32 & a5Out)
{
	a5Out = 0x4200EECC;
	return a0 + 0x4200EEE8;
}

