pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23048F1E: Register Eq_2 net_buf_id(Register Eq_2 a0, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_196248) a5Out)
// Called from:
//      bt_mesh_adv_create_from_pool
//      fixed_data_alloc
//      hci_cmd_done
//      bt_hci_cmd_create
//      set_le_scan_enable
//      set_advertise_enable
//      set_ad
//      hci_tx_thread
Eq_2 net_buf_id(Eq_2 a0, ptr32 & a3Out, ptr32 & a4Out, struct Eq_196248 & a5Out)
{
	struct Eq_252410 * a4_5 = (word32) *((word32) a0 + 6);
	struct Eq_196248 * a5_11 = a4_5->ptr4200EF00;
	a3Out = 0x1C;
	a4Out = (char *) a4_5 + 28;
	a5Out = a5_11;
	return a0 - a5_11 >> 5;
}

// 23048F3A: void fixed_data_alloc(Register (ptr32 Eq_252425) s0, Register Eq_2 a0)
void fixed_data_alloc(struct Eq_252425 * s0, Eq_2 a0)
{
	word32 * a5_16 = s0->ptr0004;
	up32 a4_9 = (word32) *((word32) a0 + 6);
	word32 a1_17 = *a5_16;
	if (a4_9 + 0x1C < a5_16)
		a5_16 = a4_9 + 0x1C;
	*a5_16 = a1_17;
	word32 a4_42;
	word32 a3_41;
	word32 a5_43;
	net_buf_id(a0, out a3_41, out a4_42, out a5_43);
}

// 23048F7A: Register Eq_2 net_buf_alloc_len(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_192645) s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out Eq_2 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      net_buf_alloc_fixed
Eq_2 net_buf_alloc_len(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, struct Eq_192645 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, union Eq_2 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 s5_168;
	Eq_2 s0_106;
	Eq_2 a3_116;
	word32 s4_165;
	Eq_2 a4_100;
	ptr32 a5_112;
	word32 a2_407;
	word32 a5_408;
	ptr32 a1_184;
	struct Eq_192645 * s3_134 = k_uptime_get_32(out a1_184, out a2_407, out a5_408);
	word32 a5_411;
	word32 a2_409;
	word32 a4_410;
	Eq_2 a0_31 = irq_lock(a4, mstatus, out a2_409, out a4_410, out a5_411);
	Eq_2 s1_113 = a0;
	Eq_2 s2_126 = a2;
	Eq_2 a5_35 = (word32) *((word32) a0 + 0x0E);
	if (a5_35 != 0x00)
	{
		Eq_2 a4_64 = (word32) *((word32) a0 + 0x0C);
		s5_168 = a0_31;
		if (a5_35 < a4_64)
		{
			Eq_2 a0_68;
			word32 a4_413;
			word32 s8_415;
			word32 a5_414;
			word32 a2_412;
			k_queue_get(a0, 0x00, a3, a4_64, mstatus, dwLoc2C, a1, dwArgC8, dwArg0108, out s1_113, out a0_68, out a1_184, out a2_412, out a3, out a4_413, out a5_414, out s2_126, out s3_134, out s4_165, out s8_415);
			s0_106 = a0_68;
			if (a0_68 != 0x00)
			{
				a3_116 = irq_unlock(a3, mstatus, out a4_100, out a5_112);
				goto l23048FBC;
			}
		}
		s4_165 = (word32) *((word32) s1_113 + 0x0E);
		*((word32) s1_113 + 0x0E) = (word16) (s4_165 + -1);
		word32 a5_421;
		a3_116 = irq_unlock(a3, mstatus, out a4_100, out a5_421);
		struct Eq_252673 * s0_103 = (word32) *((word32) s1_113 + 0x0C) - s4_165;
		int32 s1_111 = s0_103->dw0018 - 0x4200EECC >> 2;
		((Eq_582974[]) 6)[s0_103].b0000 = (byte) (s1_111 + 3067833783);
		s0_106 = s0_103 * 33;
		a5_112 = 3067833783;
		s1_113 = s1_111 + 3067833783;
	}
	else
	{
		Eq_2 a4_38;
		Eq_2 a0_42;
		word32 a2_423;
		word32 s8_424;
		word32 a5_422;
		k_queue_get(a0, a2, irq_unlock(a3, mstatus, out a4_38, out a5_422), a4_38, mstatus, dwLoc2C, a1, dwArgC8, dwArg0108, out s1_113, out a0_42, out a1_184, out a2_423, out a3_116, out a4_100, out a5_112, out s2_126, out s3_134, out s4_165, out s8_424);
		s0_106 = a0_42;
		s5_168 = s5;
		s5_168 = s5;
		if (a0_42 == 0x00)
			goto l23049066;
	}
l23048FBC:
	if (a5_112 != 0x00)
	{
		if (s2_126 > 0x00)
		{
			word32 a2_417;
			word32 a5_418;
			word32 a1_416;
			Eq_2 a0_136 = k_uptime_get_32(out a1_416, out a2_417, out a5_418) - s3_134;
			if (s2_126 < a0_136)
				a0_136 = s2_126;
			s2_126 -= a0_136;
		}
		<anonymous> * a5_159 = ***((char *) g_a4200EEFC + (word32) (*((word32) s0_106 + 6)));
		struct Eq_252577 * sp_178;
		struct Eq_252578 * a0_183;
		Eq_2 a5_189;
		word32 a6_196;
		word32 a7_197;
		word32 t0_198;
		word32 t1_199;
		word32 t4_200;
		word32 t5_201;
		word32 t6_202;
		a5_159();
		a0_183->t0010 = s0_106;
		if (a0_183 == null)
		{
			word32 a0_419;
			word32 s4_420;
			s0_106 = k_queue_prepend(CONVERT(Mem203[s0_106 + 6:byte], byte, word32) + s3_134 + s1_113, a4_100, a5_189, mstatus, Mem203[sp_178 + 4:word32], Mem203[sp_178 + 0x0084:word32], Mem203[sp_178 + 0x00F8:word32], Mem203[sp_178 + 312:word32], Mem203[sp_178 + 376:word32], out s1_113, out a0_419, out a1_184, out a3_116, out a4_100, out a5_112, out s2_126, out s3_134, out s4_420, out s5_168, out s6);
			goto l23049066;
		}
	}
	else
		*((word32) s0_106 + 16) = 0x00;
	*s0_106 = 0x00;
	*((word32) s0_106 + 4) = 0x01;
	*((word32) s0_106 + 0x0C) = 0x00;
	((word32) s0_106 + 0x0E)->u2 = 0x01;
	s0_106 = *(union Eq_2 *) 0x11;
	*(union Eq_2 *) 0x09 = s0_106;
	a5_112 = 0x01;
l23049066:
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_113;
	a0Out = s0_106;
	a1Out = a1_184;
	a3Out = a3_116;
	a4Out = a4_100;
	a5Out = a5_112;
	s2Out = s2_126;
	s3Out = s3_134;
	s4Out = dwArg78;
	s5Out = s5_168;
	s6Out = s6;
	s8Out = s5;
	mstatusOut = mstatus;
	return ra;
}

// 23049098: Register Eq_2 net_buf_alloc_fixed(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_196181) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_adv_create_from_pool
//      bt_hci_cmd_create
//      bt_buf_get_rx
//      bt_l2cap_create_pdu_timeout
//      l2cap_chan_le_send
Eq_2 net_buf_alloc_fixed(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_196181 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a0_5 = *((word32) a5 + 20);
	ptr32 a0_15;
	ptr32 a1_16;
	ptr32 a3_18;
	ptr32 a4_19;
	ptr32 a5_20;
	ptr32 mstatus_23;
	ptr32 s0_25;
	ptr32 s1_26;
	struct Eq_196181 * s2_27;
	ptr32 s3_28;
	ptr32 s4_29;
	ptr32 s5_30;
	ptr32 s6_31;
	ptr32 s8_32;
	Eq_2 ra_24 = net_buf_alloc_len(ra, a0_5, a1, a1, a3, a4, s5, mstatus, dwArgB4, dwArgC8, dwArg0108, dwArg0128, out s0_25, out s1_26, out a0_15, out a1_16, out a3_18, out a4_19, out a5_20, out s2_27, out s3_28, out s4_29, out s5_30, out s6_31, out s8_32, out mstatus_23);
	s0Out = s0_25;
	s1Out = s1_26;
	a0Out = a0_15;
	a1Out = a1_16;
	a3Out = a3_18;
	a4Out = a4_19;
	a5Out = a5_20;
	s2Out = s2_27;
	s3Out = s3_28;
	s4Out = s4_29;
	s5Out = s5_30;
	s6Out = s6_31;
	s8Out = s8_32;
	mstatusOut = mstatus_23;
	return ra_24;
}

// 230490A4: Register (ptr32 Eq_195214) net_buf_get(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_195214) a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_195219 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      adv_thread
//      recv_thread
//      conn_cleanup
//      bt_conn_process_tx
//      hci_tx_thread
//      bt_delete_queue
//      l2cap_chan_destroy
//      l2cap_rx_process
//      att_rsp_sent
struct Eq_195214 * net_buf_get(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArgE8, Eq_2 dwArg0128, struct Eq_195214 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_195219 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	struct Eq_195214 * a0_18;
	word32 s1_146;
	word32 a2_147;
	Eq_195219 a5_112;
	Eq_2 a4_111;
	Eq_2 a3_110;
	Eq_2 s2_117;
	ptr32 a1_108;
	ptr32 s3_118;
	ptr32 s4_120;
	ptr32 s8_122;
	k_queue_get(a0, a1, a3, a4, mstatus, s0, ra, dwArgE8, dwArg0128, out s1_146, out a0_18, out a1_108, out a2_147, out a3_110, out a4_111, out a5_112, out s2_117, out s3_118, out s4_120, out s8_122);
	struct Eq_195214 * s1_39 = a0_18;
	struct Eq_195214 * s0_40 = a0_18;
	if (a0_18 != null)
	{
		while (true)
		{
			ui32 a5_43 = (word32) s0_40->b0005;
			a5_112 = a5_43 & 0x01;
			if ((a5_43 & 0x01) == 0x00)
				break;
			struct Eq_195214 * a0_52;
			word32 a2_148;
			word32 a5_149;
			Eq_2 s0_60 = k_queue_get(s2_117, 0x00, a3_110, a4_111, mstatus, s0, ra, dwArgE8, dwArg0128, out s1_39, out a0_52, out a1_108, out a2_148, out a3_110, out a4_111, out a5_149, out s2_117, out s3_118, out s4_120, out s8_122);
			ui32 a5_73 = (word32) *((word32) s0_60 + 5);
			a0_52->t0000 = s0_60;
			*((word32) s0_60 + 5) = (byte) (a5_73 & ~0x01);
			s0_40 = a0_52;
		}
		s0_40->t0000.u0 = 0x00;
	}
	0x00 = (int8) dwArg38;
	a0Out = s1_39;
	a1Out = a1_108;
	a2Out = dwArg10;
	a3Out = a3_110;
	a4Out = a4_111;
	a5Out = a5_112;
	s2Out = s2_117;
	s3Out = s3_118;
	s4Out = s4_120;
	s8Out = s8_122;
	return s1_39;
}

// 230490EC: Register (ptr32 word32) net_buf_simple_reserve(Register (ptr32 word32) a1, Register Eq_2 a5)
// Called from:
//      blemesh_net_send
//      prov_buf_init
//      beacon_send
//      send_filter_status
//      bt_mesh_proxy_relay
//      bt_mesh_trans_send
//      bt_mesh_ctl_send
//      enqueue_sub_cfm
//      enqueue_update
//      bt_mesh_friend_req
//      bt_hci_cmd_create
//      bt_buf_get_rx
//      bt_buf_get_cmd_complete
//      bt_l2cap_create_pdu_timeout
//      l2cap_chan_le_send
word32 * net_buf_simple_reserve(word32 * a1, Eq_2 a5)
{
	word32 a1_7 = a1 + a5;
	*a1_7 = (word32) *((word32) a5 + 8);
	return a1_7;
}

