pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 230490F4: Register (ptr32 Eq_252842) net_buf_slist_put(Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out (ptr32 Eq_223634) s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      bt_mesh_ctl_send
//      enqueue_update
//      enqueue_friend_pdu
struct Eq_252842 * net_buf_slist_put(Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, struct Eq_223634 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s4Out, ptr32 & s8Out)
{
	while (true)
	{
		struct Eq_252842 * s0_16 = *a4;
		if (a4 == 0x00)
			break;
		s0_16->b0005 = (byte) ((word32) s0_16->b0005 | 1);
	}
	struct Eq_223634 * a5_29;
	word32 a2_73;
	word32 a4_74;
	irq_lock(a4, mstatus, out a2_73, out a4_74, out a5_29);
	struct Eq_223634 * s1_30 = a5_29->ptr0004;
	if (a5_29 == null)
		*a1 = s1_30;
	else
		*a1 = a5_29;
	s0_16->ptr0004 = s1_30;
	ptr32 a4_47;
	ptr32 a5_48;
	Eq_2 a3_46 = irq_unlock(a3, mstatus, out a4_47, out a5_48);
	s1Out = s1_30;
	a3Out = a3_46;
	a4Out = a4_47;
	a5Out = a5_48;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s0_16;
}

// 23049134: Register (ptr32 Eq_225342) net_buf_slist_get(Register (ptr32 (ptr32 Eq_225342)) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out (ptr32 Eq_225342) a0Out, Register out (ptr32 Eq_225342) s2Out)
// Called from:
//      bt_mesh_net_local
struct Eq_225342 * net_buf_slist_get(struct Eq_225342 ** a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg38, struct Eq_225342 & a0Out, struct Eq_225342 & s2Out)
{
	struct Eq_225342 * a4_18;
	word32 a5_106;
	word32 a2_105;
	irq_lock(a4, mstatus, out a2_105, out a4_18, out a5_106);
	struct Eq_225342 * s2_20 = *a0;
	if (s2_20 != null)
	{
		struct Eq_225342 * a5_21 = s2_20->ptr0000;
		struct Eq_225342 * s0_22 = a4_18->ptr0004;
		a5_21->ptr0000 = s0_22;
		if (s2_20 == a4_18)
			a5_21->ptr0004 = s0_22;
	}
	word32 a5_107;
	Eq_2 a4_29;
	Eq_2 a3_28 = irq_unlock(a3, mstatus, out a4_29, out a5_107);
	struct Eq_225342 * s1_102 = s2_20;
	if (s2_20 != null)
	{
		while (((word32) s1_102->b0005 & 0x01) != 0x00)
		{
			word32 a2_108;
			struct Eq_252941 * a4_41;
			Eq_2 a5_42;
			irq_lock(a4_29, mstatus, out a2_108, out a4_41, out a5_42);
			if (a5_42 != 0x00)
			{
				a5_42 = a4_41->t0000;
				Eq_2 s0_46 = *((word32) a3_28 + 4);
				a4_41->t0000 = s0_46;
				if (a5_42 == a3_28)
					a4_41->t0004 = s0_46;
			}
			*a5_42 = s1_102;
			word32 a5_109;
			a3_28 = irq_unlock(a3_28, mstatus, out a4_29, out a5_109);
			s1_102->b0005 = (byte) ((word32) s1_102->b0005 & ~0x01);
			s1_102 = s1_102->ptr0000;
		}
		s1_102->ptr0000 = null;
	}
	0x00 = (int8) dwArg38;
	a0Out = s2_20;
	s2Out = s2_20;
	return s1_102;
}

// 230491A6: Register word32 net_buf_put(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      bt_mesh_adv_update
//      bt_mesh_adv_send
//      hci_driver_enque_recvq
//      set_ad
//      bt_le_set_data_len
//      bt_l2cap_send_cb
//      bt_l2cap_recv
word32 net_buf_put(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	while (true)
	{
		struct Eq_252991 * a2_7 = *a4;
		if (a4 == 0x00)
			break;
		ui32 a5_8 = (word32) a2_7->b0005;
		a2_7->b0005 = (byte) (a5_8 | 1);
		a5 = a5_8 | 1;
	}
	ptr32 a0_24;
	ptr32 a1_25;
	ptr32 a3_27;
	ptr32 a4_28;
	ptr32 a5_29;
	ptr32 s2_33;
	ptr32 s3_34;
	ptr32 s4_35;
	ptr32 s5_36;
	ptr32 s6_37;
	ptr32 s8_38;
	word32 s1_32 = k_queue_append_list(ra, s0, a0, a1, a4, a5, mstatus, dwArgE8, dwArg0128, dwArg0168, out a0_24, out a1_25, out a3_27, out a4_28, out a5_29, out s2_33, out s3_34, out s4_35, out s5_36, out s6_37, out s8_38);
	a0Out = a0_24;
	a1Out = a1_25;
	a3Out = a3_27;
	a4Out = a4_28;
	a5Out = a5_29;
	s2Out = s2_33;
	s3Out = s3_34;
	s4Out = s4_35;
	s5Out = s5_36;
	s6Out = s6_37;
	s8Out = s8_38;
	return s1_32;
}

// 230491C0: Register Eq_2 net_buf_unref(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_195346) s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out (ptr32 Eq_195350) s6Out, Register out Eq_195351 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      adv_thread
//      beacon_send
//      bt_mesh_net_recv
//      bt_mesh_net_local
//      prov_clear_tx
//      gen_prov_start
//      seg_tx_reset
//      ctl_recv
//      bt_mesh_trans_send
//      bt_mesh_ctl_send
//      friend_purge_old_ack
//      create_friend_pdu
//      buf_send_start
//      purge_buffers
//      friend_clear
//      enqueue_sub_cfm
//      friend_queue_prepare_space
//      enqueue_friend_pdu
//      bt_mesh_friend_poll
//      bt_mesh_friend_req
//      net_buf_frag_del
//      hci_driver_send
//      send_frag
//      bt_conn_reset_rx_state
//      conn_cleanup
//      bt_conn_recv
//      create_frag.isra.11
//      bt_conn_process_tx
//      set_ad
//      bt_le_set_data_len
//      hci_tx_thread
//      bt_recv
//      bt_recv_prio
//      bt_delete_queue
//      init_work
//      l2cap_chan_destroy
//      bt_l2cap_send_cb
//      l2cap_chan_le_send
//      l2cap_chan_le_send_sdu
//      bt_l2cap_recv
//      l2cap_chan_le_recv_seg
//      l2cap_rx_process
//      smp_send_pairing_confirm
//      legacy_pairing_confirm
//      att_send
//      att_reset
//      bt_att_encrypt_change
//      att_read_group_req
//      att_read_mult_req
//      att_read_req
//      att_read_type_req
//      att_find_type_req
//      att_find_info_req
//      att_signed_write_cmd
//      bt_att_send
//      bt_att_req_send
//      bt_att_req_cancel
Eq_2 net_buf_unref(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, struct Eq_195346 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, struct Eq_195350 & s6Out, union Eq_195351 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 s0_148 = a0;
	struct Eq_195346 * s2_113 = &g_t4200EECC;
	ptr32 s4_101 = 0x1C;
	Eq_2 s3_100 = 1107357500;
	s1_127 = s1;
	do
	{
		Eq_2 s1_127;
		struct Eq_253131 * sp_48 = fp - 32;
		if (s0_148 == 0x00)
		{
l230491E6:
			s0Out = s1;
			s1Out = s1_127;
			a0Out = a0;
			a1Out = a1;
			a2Out = dwArg48;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5;
			s2Out = s2_113;
			s3Out = s3_100;
			s4Out = dwArg04;
			s5Out = s5;
			s6Out = s6;
			s8Out = s4;
			mstatusOut = mstatus;
			return ra;
		}
		s5 = *s0_148;
		a5 = (word32) *((word32) s0_148 + 4) + ~0x00 & 0x00FF;
		*((word32) s0_148 + 4) = (byte) a5;
		if (a5 != 0x00)
			goto l230491E6;
		struct Eq_253065 * s0_33 = *((word32) a1 + 16);
		if (a1 != 0x00)
		{
			ui32 a5_34 = (word32) s0_33->b0005;
			a5 = a5_34 & 0x02;
			if ((a5_34 & 0x02) == 0x00)
			{
				<anonymous> * a5_44 = *((word32) (s2_113 + ((word32) s0_33->b0006 + s4_101) / 20)[1].t0000->dw0004 + 4);
				word32 a1_64;
				word32 a3_65;
				word32 a7_215;
				word32 s6_216;
				word32 t0_217;
				word32 t1_218;
				word32 t4_219;
				word32 t5_220;
				word32 t6_221;
				a5_44();
			}
			s0_33->dw0010 = 0x00;
		}
		struct Eq_195350 * s6_141;
		Eq_2 a4_139;
		ptr32 mstatus_138;
		Eq_2 a3_137;
		Eq_2 a1_136;
		Eq_2 a5_135;
		s0_33->dw0008 = 0x00;
		s0_33->dw0000 = 0x00;
		Eq_2 s1_78 = *((word32) a5 + 16);
		if (a5 != 0x00)
		{
			word32 a7_140;
			word32 t0_142;
			word32 t1_143;
			word32 t4_144;
			word32 t5_145;
			word32 t6_146;
			a5();
			mstatus = mstatus_138;
			a4 = a4_139;
			a3 = a3_137;
			a1 = a1_136;
			a5 = a5_135;
			s6 = s6_141;
		}
		else
			k_queue_prepend(s1_78, a4, a5, mstatus, sp_48->t0004, sp_48->t0084, sp_48->t00F8, sp_48->t0138, sp_48->t0178, out s1_127, out a0, out a1, out a3, out a4, out a5, out s2_113, out s3_100, out s4_101, out s5, out s6);
		s0_148 = s5;
	} while (s1_127 != s3_100);
	Eq_2 a0_165;
	ptr32 a2_166;
	Eq_2 a3_167;
	Eq_2 a4_168;
	Eq_2 a5_169;
	Eq_2 s0_170;
	Eq_195351 s8_171;
	Eq_2 a1_173;
	ptr32 mstatus_176;
	Eq_2 s1_178;
	struct Eq_195346 * s2_179;
	Eq_2 s3_180;
	Eq_2 s4_181;
	Eq_2 s5_182;
	struct Eq_195350 * s6_183;
	Eq_2 ra_177 = bl_handle_queued_msg(ra, a3, a4, s5, mstatus, dwArg00, dwArg04, dwArg08, dwArg28, s1, dwArg78, dwArg84, dwArg98, dwArgA4, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out s0_170, out s1_178, out a0_165, out a1_173, out a2_166, out a3_167, out a4_168, out a5_169, out s2_179, out s3_180, out s4_181, out s5_182, out s6_183, out s8_171, out mstatus_176);
	s0Out = s0_170;
	s1Out = s1_178;
	a0Out = a0_165;
	a1Out = a1_173;
	a2Out = a2_166;
	a3Out = a3_167;
	a4Out = a4_168;
	a5Out = a5_169;
	s2Out = s2_179;
	s3Out = s3_180;
	s4Out = s4_181;
	s5Out = s5_182;
	s6Out = s6_183;
	s8Out = s8_171;
	mstatusOut = mstatus_176;
	return ra_177;
}

// 2304926E: Register word32 net_buf_ref(Register Eq_2 a0)
// Called from:
//      bt_mesh_adv_update
//      bt_mesh_adv_send
//      bt_mesh_trans_send
//      bt_mesh_ctl_send
//      set_ad
//      hci_tx_thread
//      l2cap_chan_le_send
//      bt_l2cap_recv
//      bt_att_req_send
word32 net_buf_ref(Eq_2 a0)
{
	word32 a5_5 = (word32) *((word32) a0 + 4);
	*((word32) a0 + 4) = (byte) (a5_5 + 0x01);
	return a5_5 + 0x01;
}

// 2304927A: void net_buf_frag_insert(Register (ptr32 Eq_253255) a1, Register (ptr32 word32) a3, Register (ptr32 word32) a4)
// Called from:
//      net_buf_frag_add
void net_buf_frag_insert(struct Eq_253255 * a1, word32 * a3, word32 * a4)
{
	word32 a0_5 = *a4;
	if (a4 != null)
	{
		do
		{
			word32 a5_10 = *a3;
		} while (a3 != null);
		*a4 = a5_10;
	}
	a1->dw0000 = a0_5;
}

