pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304928E: void net_buf_frag_add(Register Eq_2 a0, Register (ptr32 Eq_253255) a1, Register (ptr32 word32) a3, Register (ptr32 word32) a4)
// Called from:
//      net_buf_append_bytes
void net_buf_frag_add(Eq_2 a0, struct Eq_253255 * a1, word32 * a3, word32 * a4)
{
	if (a0 != 0x00)
	{
		do
			;
		while (a4 != null);
		net_buf_frag_insert(a1, a3, a4);
	}
	else
		a1->b0004 = (byte) ((word32) a1->b0004 + 0x01);
}

// 230492BC: Register Eq_2 net_buf_frag_del(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_2) a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_2) s3Out, Register out Eq_253322 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      l2cap_chan_le_send_sdu
Eq_2 net_buf_frag_del(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_253322 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	if (a0 != 0x00)
		*a5 = a0;
	Eq_2 a1_14 = *s0;
	*a1_14 = 0x00;
	word32 s8_102;
	ptr32 a3_28;
	union Eq_2 * a4_29;
	ptr32 a5_30;
	ptr32 mstatus_33;
	ptr32 s1_36;
	ptr32 s2_37;
	union Eq_2 * s3_38;
	Eq_253322 s4_39;
	ptr32 s5_40;
	ptr32 s6_41;
	word32 a2_101;
	word32 a1_100;
	word32 a0_99;
	word32 s0_98;
	Eq_2 ra_34 = net_buf_unref(ra, s1, a1_14, a1_14, a4, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_98, out s1_36, out a0_99, out a1_100, out a2_101, out a3_28, out a4_29, out a5_30, out s2_37, out s3_38, out s4_39, out s5_40, out s6_41, out s8_102, out mstatus_33);
	s1Out = s1_36;
	a3Out = a3_28;
	a4Out = a4_29;
	a5Out = a5_30;
	s2Out = s2_37;
	s3Out = s3_38;
	s4Out = s4_39;
	s5Out = s5_40;
	s6Out = s6_41;
	mstatusOut = mstatus_33;
	return ra_34;
}

// 230492DE: Register Eq_2 net_buf_simple_add(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register out ptr32 a1Out, Register out Eq_201918 a5Out)
// Called from:
//      send_mod_sub_status
//      create_mod_app_status.isra.5
//      send_mod_pub_status.isra.7
//      heartbeat_pub_set
//      bt_mesh_net_encrypt
//      bt_mesh_app_encrypt
//      bt_mesh_app_decrypt
//      health_get_registered
//      health_pub_update
//      net_decrypt.isra.1
//      prov_confirm
//      send_pub_key
//      enqueue_sub_cfm
//      enqueue_update
//      bt_mesh_friend_req
//      bt_conn_le_start_encryption
//      bt_conn_disconnect
//      bt_conn_le_conn_update
//      bt_conn_le_param_update
//      gatt_notify
//      gatt_indicate
//      bt_gatt_exchange_mtu
//      gatt_read_type_rsp
//      bt_gatt_read
//      bt_gatt_write_without_response_cb
//      bt_gatt_write
//      gatt_prepare_write_rsp
//      bt_gatt_unsubscribe
//      bt_hci_cmd_create
//      set_le_scan_enable
//      hci_id_add
//      set_ad
//      bt_id_del
//      bt_le_set_data_len
//      le_adv_report
//      le_ltk_request
//      le_conn_param_neg_reply
//      le_conn_param_req
//      enh_conn_complete
//      init_work
//      bt_dh_key_gen
//      l2cap_create_le_sig_pdu.isra.7
//      l2cap_chan_send_credits.isra.10
//      l2cap_le_conn_req
//      l2cap_send_reject
//      bt_l2cap_chan_disconnect
//      smp_create_pdu.isra.7
//      sc_smp_send_dhkey_check
//      smp_send_pairing_random
//      sc_send_public_key
//      send_pairing_rsp
//      bt_smp_distribute_keys
//      smp_error
//      smp_send_pairing_confirm
//      legacy_pairing_confirm
//      bt_smp_sign
//      bt_smp_start_security
//      read_group_cb
//      read_type_cb
//      find_type_cb
//      find_info_cb
//      read_cb
//      bt_att_create_pdu
//      att_mtu_req
//      send_err_rsp.part.7
//      att_read_group_req
//      att_read_type_req
Eq_2 net_buf_simple_add(Eq_2 a0, Eq_2 a1, Eq_2 a4, ptr32 & a1Out, union Eq_201918 & a5Out)
{
	Eq_201918 a5_5 = (word32) *((word32) a0 + 4);
	word32 a1_9 = a1 + a5_5;
	*((word32) *a4 + 4) = (word16) a1_9;
	a1Out = a1_9;
	a5Out = a5_5;
	return a4 + a5_5;
}

// 230492F0: Register Eq_2 net_buf_simple_add_mem(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      vendor_data_set
//      blemesh_seg_send
//      blemesh_net_send
//      bt_mesh_model_publish
//      mod_publish
//      bt_mesh_beacon_create
//      beacon_send
//      comp_data_status
//      mod_app_get
//      bt_mesh_net_recv
//      prov_send
//      bearer_ctl_send
//      prov_random
//      proxy_recv
//      bt_mesh_proxy_relay
//      bt_mesh_trans_send
//      bt_mesh_ctl_send
//      create_friend_pdu
//      net_buf_append_bytes
//      bt_conn_recv
//      create_frag.isra.11
//      bt_gatt_read
//      set_random_address
//      bt_id_add
//      bt_le_scan_update
//      bt_le_adv_start
//      bt_set_tx_pwr
//      l2cap_send_reject
//      l2cap_chan_le_send
Eq_2 net_buf_simple_add_mem(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	int32 a5_5 = (word32) *((word32) a0 + 4);
	*((word32) *a4 + 4) = (word16) ((word32) a2 + a5_5);
	Eq_2 a0_11 = (word32) a4 + a5_5;
	ptr32 a4_13;
	ptr32 a5_14;
	ptr32 a1_16;
	ptr32 a2_17;
	ptr32 a3_18;
	word32 a6_31;
	word32 a7_32;
	memcpy(a0_11, a1, a2, out a1_16, out a2_17, out a3_18, out a4_13, out a5_14, out a6_31, out a7_32);
	a1Out = a1_16;
	a2Out = a2_17;
	a3Out = a3_18;
	a4Out = a4_13;
	a5Out = a5_14;
	return a0_11;
}

// 23049306: Register int32 net_buf_simple_add_u8(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a5, Register out (ptr32 byte) a5Out)
// Called from:
//      gen_onoff_get
//      bt_mesh_model_msg_init
//      bt_mesh_beacon_create
//      beacon_send
//      key_idx_pack
//      node_identity_get
//      app_key_get
//      send_mod_sub_status
//      krp_set
//      lpn_timeout_get
//      friend_set
//      mod_sub_get
//      mod_sub_get_vnd
//      create_mod_app_status.isra.5
//      send_mod_pub_status.isra.7
//      mod_app_get
//      dev_comp_data_get
//      app_key_update
//      app_key_add
//      heartbeat_pub_set
//      hb_sub_send_status.constprop.14
//      app_key_del
//      net_transmit_set
//      net_transmit_get
//      relay_set
//      relay_get
//      beacon_set
//      beacon_get
//      node_identity_set
//      gatt_proxy_set
//      default_ttl_set
//      default_ttl_get
//      net_key_del
//      health_period_get
//      attention_set
//      prov_buf_init
//      prov_send
//      bearer_ctl_send
//      prov_send_fail_msg
//      prov_invite
//      gen_prov_start
//      send_filter_status
//      bt_mesh_trans_send
//      bt_mesh_ctl_send
//      create_friend_pdu
//      addr_res_enable
//      set_advertise_enable
int32 net_buf_simple_add_u8(Eq_2 a0, Eq_2 a1, Eq_2 a5, byte & a5Out)
{
	int32 a4_5 = (word32) *((word32) a0 + 4);
	*((word32) *a5 + 4) = (word16) (a4_5 + 0x01);
	byte * a5_8 = (word32) a5 + a4_5;
	*a5_8 = (byte) a1;
	a5Out = a5_8;
	return a4_5 + 0x01;
}

// 2304931C: Register Eq_2 net_buf_simple_add_le16(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a5, Register out Eq_194090 a4Out, Register out (ptr32 Eq_194091) a5Out)
// Called from:
//      bt_mesh_model_msg_init
//      key_idx_pack
//      net_key_get
//      node_identity_get
//      app_key_get
//      send_mod_sub_status
//      krp_set
//      lpn_timeout_get
//      mod_sub_get
//      mod_sub_get_vnd
//      create_mod_app_status.isra.5
//      send_mod_pub_status.isra.7
//      mod_app_get
//      dev_comp_data_get
//      heartbeat_pub_set
//      hb_sub_send_status.constprop.14
//      node_identity_set
//      net_key_del
//      health_get_registered
//      bt_gatt_read
//      bt_gatt_unsubscribe
//      l2cap_chan_le_send
Eq_2 net_buf_simple_add_le16(Eq_2 a0, Eq_2 a1, Eq_2 a5, union Eq_194090 & a4Out, struct Eq_194091 & a5Out)
{
	int32 a4_5 = (word32) *((word32) a0 + 4);
	*((word32) *a5 + 4) = (word16) (a4_5 + 0x02);
	struct Eq_194091 * a5_8 = (word32) a5 + a4_5;
	a5_8->b0000 = (byte) a1;
	a5_8->b0001 = (byte) (a1 >> 8);
	a4Out = a4_5 + 0x02;
	a5Out = a5_8;
	return a1 >> 8;
}

// 23049336: Register Eq_2 net_buf_simple_add_be16(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_194075) a5, Register out Eq_194076 a4Out, Register out (ptr32 Eq_194077) a5Out)
// Called from:
//      bt_mesh_model_msg_init
//      beacon_send
//      prov_send
//      prov_invite
//      send_filter_status
//      create_friend_pdu
Eq_2 net_buf_simple_add_be16(Eq_2 a0, Eq_2 a1, struct Eq_194075 * a5, union Eq_194076 & a4Out, struct Eq_194077 & a5Out)
{
	int32 a4_5 = (word32) *((word32) a0 + 4);
	Eq_2 a0_7 = a5->t0000;
	*((word32) a0_7 + 4) = (word16) (a4_5 + 0x02);
	struct Eq_194077 * a5_8 = a5 + a4_5 / 24;
	a5_8->b0000 = (byte) (a1 >> 0x08);
	a5_8->b0001 = (byte) a1;
	a4Out = a1 >> 0x08;
	a5Out = a5_8;
	return a0_7;
}

// 23049352: Register uint32 net_buf_simple_add_be32(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 (ptr32 Eq_253509)) a5, Register out (ptr32 Eq_196958) a5Out)
// Called from:
//      bt_mesh_beacon_create
//      prov_send
//      bearer_ctl_send
//      gen_prov_start
uint32 net_buf_simple_add_be32(Eq_2 a0, Eq_2 a1, struct Eq_253509 ** a5, struct Eq_196958 & a5Out)
{
	int32 a4_5 = (word32) *((word32) a0 + 4);
	*((char *) *a5 + 4) = (struct Eq_253509 **) (word16) (a4_5 + 0x04);
	struct Eq_196958 * a5_8 = (char *) a5 + a4_5;
	a5_8->b0001 = (byte) (a1 >> 0x10);
	a5_8->b0000 = (byte) (a1 >> 0x18);
	uint32 a4_16 = (word32) (word16) a1;
	a5_8->b0002 = (byte) (a4_16 >> 8);
	a5_8->b0003 = (byte) a1;
	a5Out = a5_8;
	return a4_16 >> 8;
}

