pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23049382: Register (ptr32 (ptr32 Eq_253542)) net_buf_simple_push(Register ui32 a1, Register Eq_2 a5, Register out ptr32 a4Out)
// Called from:
//      bt_mesh_net_encode
//      send_frag
//      bt_l2cap_send_cb
//      att_signed_write_cmd
struct Eq_253542 ** net_buf_simple_push(ui32 a1, Eq_2 a5, ptr32 & a4Out)
{
	struct Eq_253542 * a0_5 = *a5;
	ptr32 a4_6 = (word32) a0_5->w0004;
	struct Eq_253542 ** a5_8 = a5 - a1;
	*a5_8 = (struct Eq_253542 **) a0_5;
	a0_5->w0004 = (word16) (a1 + a4_6);
	a4Out = a4_6;
	return a5_8;
}

// 23049396: Register uint32 net_buf_simple_push_le16(Register uint32 a1, Register (ptr32 Eq_253562) a5, Register out ptr32 a4Out)
// Called from:
//      l2cap_chan_le_send
uint32 net_buf_simple_push_le16(uint32 a1, struct Eq_253562 * a5, ptr32 & a4Out)
{
	struct Eq_253564 * a0_5 = a5->ptr0000;
	a5->ptrFFFFFFFE = a0_5;
	word32 a4_8 = (word32) a0_5->w0004;
	a0_5->w0004 = (word16) (a4_8 + 0x02);
	a5->b0FFE = (byte) a1;
	a5->b0FFF = (byte) (a1 >> 8);
	a4Out = a4_8 + 0x02;
	return a1 >> 8;
}

// 230493B4: void net_buf_simple_push_be16(Register uint32 a1, Register (ptr32 Eq_223123) a5)
// Called from:
//      bt_mesh_net_encode
void net_buf_simple_push_be16(uint32 a1, struct Eq_223123 * a5)
{
	struct Eq_253594 * a0_5 = a5->ptr0000;
	a5->ptrFFFFFFFE = a0_5;
	a0_5->w0004 = (word16) ((word32) a0_5->w0004 + 0x02);
	a5->b0FFE = (byte) (a1 >> 0x08);
	a5->b0FFF = (byte) a1;
}

// 230493D4: Register word32 net_buf_simple_push_u8(Register Eq_2 a1, Register Eq_2 a4)
// Called from:
//      bt_mesh_net_encode
//      proxy_segment_and_send
//      encode_friend_ctl
word32 net_buf_simple_push_u8(Eq_2 a1, Eq_2 a4)
{
	struct Eq_253622 * a0_5 = *a4;
	*((word32) a4 - 1) = a0_5;
	word32 a5_8 = (word32) a0_5->w0004;
	a0_5->w0004 = (word16) (a5_8 + 0x01);
	*((word32) a4 + 0x0FFF) = (byte) a1;
	return a5_8 + 0x01;
}

// 230493EC: Register Eq_2 net_buf_simple_pull(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out, Register out (ptr32 word32) a5Out)
// Called from:
//      bt_mesh_scan_cb
//      key_idx_unpack
//      key_idx_unpack
//      prov_send
//      proxy_segment_and_send
//      proxy_complete_pdu
//      bt_mesh_trans_send
//      bt_mesh_trans_recv
//      net_buf_simple_pull_u8
//      net_buf_simple_pull_le16
//      net_buf_simple_pull_be16
//      net_buf_simple_pull_be32
//      bl_onchiphci_send_2_controller
//      create_frag.isra.11
//      bt_data_parse
//      le_adv_report
//      l2cap_chan_le_send
//      att_signed_write_cmd
Eq_2 net_buf_simple_pull(Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out, word32 & a5Out)
{
	word32 * a5_7 = (word32) *((word32) a0 + 4) - a1;
	((word32) a0 + 4)->u2 = (word16) a5_7;
	word32 a1_10 = a1 + a5_7;
	*a1_10 = *a5_7;
	a1Out = a1_10;
	a5Out = a5_7;
	return a1_10;
}

// 23049400: Register Eq_2 net_buf_simple_pull_mem(Register Eq_2 a0, Register word32 a1, Register out (ptr32 Eq_2) a1Out, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      bt_mesh_beacon_recv
//      mod_sub_va_del
//      mod_pub_va_set
//      mod_sub_va_add
//      mod_sub_va_overwrite
//      hci_le_meta_event
//      hci_cmd_status
//      hci_cmd_complete
//      le_adv_report
//      bt_recv
//      bt_recv_prio
//      bt_l2cap_recv
//      l2cap_recv
//      bt_smp_recv
//      bt_att_recv
//      att_read_group_req
//      att_read_type_req
//      att_find_type_req
Eq_2 net_buf_simple_pull_mem(Eq_2 a0, word32 a1, union Eq_2 & a1Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a0_7 = *a0;
	ptr32 a4_9 = (word32) *((word32) a0 + 4) - a1;
	((word32) a0 + 4)->u2 = (word16) a4_9;
	union Eq_2 * a1_10 = (word32) a0_7 + a1;
	*a1_10 = (union Eq_2 *) a0;
	a1Out = a1_10;
	a4Out = a4_9;
	a5Out = a0;
	return a0_7;
}

// 23049414: Register word32 net_buf_simple_pull_u8(Register Eq_2 a5, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_192084) a5Out)
// Called from:
//      gen_onoff_set.isra.0
//      bt_mesh_model_recv
//      bt_mesh_scan_cb
//      bt_mesh_beacon_recv
//      hb_pub_status
//      hb_sub_status
//      mod_pub_status
//      relay_status
//      app_key_status
//      net_key_status
//      comp_data_status
//      mod_sub_status
//      mod_app_status
//      beacon_status
//      krp_set
//      mod_pub_set
//      mod_pub_va_set
//      dev_comp_data_get
//      heartbeat_sub_set
//      node_identity_set
//      health_period_status
//      health_current_status
//      health_fault_status
//      health_attention_status
//      health_period_set_unrel
//      health_fault_test_unrel
//      health_fault_test
//      attention_set_unrel
//      gen_prov_start
//      bt_mesh_pb_gatt_recv
//      bt_mesh_pb_adv_recv
//      proxy_complete_pdu
//      ctl_recv
//      bt_mesh_trans_recv
//      bt_mesh_friend_sub_add
//      bt_mesh_friend_sub_rem
//      bt_data_parse
//      le_adv_report
word32 net_buf_simple_pull_u8(Eq_2 a5, ptr32 & a1Out, ptr32 & a2Out, struct Eq_192084 & a5Out)
{
	word32 s0_11 = (word32) *a5;
	ptr32 a1_13;
	struct Eq_192084 * a5_14;
	net_buf_simple_pull(*a5, 0x01, out a1_13, out a5_14);
	a1Out = a1_13;
	a2Out = dwArg10;
	a5Out = a5_14;
	return s0_11;
}

// 23049430: Register ui32 net_buf_simple_pull_le16(Register Eq_2 a5, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_193799 a4Out, Register out (ptr32 Eq_193800) a5Out)
// Called from:
//      bt_mesh_model_recv
//      hb_pub_status
//      hb_sub_status
//      mod_pub_status
//      mod_sub_status
//      mod_app_status
//      krp_get
//      node_identity_get
//      app_key_get
//      krp_set
//      lpn_timeout_get
//      mod_sub_get
//      mod_sub_get_vnd
//      net_key_update
//      net_key_add
//      get_model
//      mod_app_get
//      mod_app_unbind
//      mod_app_bind
//      mod_pub_set
//      mod_pub_get
//      mod_sub_del
//      mod_sub_add
//      mod_sub_va_del
//      mod_pub_va_set
//      mod_sub_va_add
//      heartbeat_sub_set
//      node_identity_set
//      mod_sub_del_all
//      mod_sub_va_overwrite
//      mod_sub_overwrite
//      net_key_del
//      health_current_status
//      health_fault_status
//      health_fault_test_unrel
//      health_fault_clear_unrel
//      health_fault_test
//      health_fault_clear
//      health_fault_get
//      l2cap_rx_process
//      att_notify
//      att_indicate
//      att_read_mult_req
//      att_write_req
//      att_write_cmd
ui32 net_buf_simple_pull_le16(Eq_2 a5, ptr32 & a1Out, ptr32 & a2Out, union Eq_193799 & a4Out, struct Eq_193800 & a5Out)
{
	Eq_193799 a4_12 = (word32) *a5;
	ui32 s0_14 = (word32) *((word32) a5 + 1) << 8 | a4_12;
	ptr32 a1_16;
	struct Eq_193800 * a5_17;
	net_buf_simple_pull(*a5, 0x02, out a1_16, out a5_17);
	a1Out = a1_16;
	a2Out = dwArg10;
	a4Out = a4_12;
	a5Out = a5_17;
	return s0_14;
}

// 23049454: Register word32 net_buf_simple_pull_be16(Register (ptr32 Eq_193726) a5, Register out Eq_193727 a1Out, Register out Eq_193728 a4Out, Register out ptr32 a5Out)
// Called from:
//      bt_mesh_model_recv
//      gen_prov_start
//      proxy_complete_pdu
//      ctl_recv
//      bt_mesh_trans_recv
//      bt_mesh_friend_sub_add
//      bt_mesh_friend_sub_rem
word32 net_buf_simple_pull_be16(struct Eq_193726 * a5, union Eq_193727 & a1Out, union Eq_193728 & a4Out, ptr32 & a5Out)
{
	Eq_193728 a4_12 = (word32) a5->t0000;
	uint32 s0_14 = (word32) a5->b0001 << 8 | a4_12;
	Eq_193727 a1_16;
	ptr32 a5_17;
	net_buf_simple_pull(a5->t0000, 0x02, out a1_16, out a5_17);
	a1Out = a1_16;
	a4Out = a4_12;
	a5Out = a5_17;
	return (word32) (word16) (s0_14 >> 0x08 | s0_14 << 8);
}

// 23049482: Register ui32 net_buf_simple_pull_be32(Register Eq_2 a4, Register out ptr32 a1Out, Register out ptr32 a5Out)
// Called from:
//      bt_mesh_beacon_recv
//      bt_mesh_pb_adv_recv
//      ctl_recv
ui32 net_buf_simple_pull_be32(Eq_2 a4, ptr32 & a1Out, ptr32 & a5Out)
{
	uint32 s0_20 = (word32) *((word32) a4 + 3) << 24 | (((word32) (*((word32) a4 + 1)) << 8 | (word32) (*a4)) | (word32) (*((word32) a4 + 2)) << 16);
	ptr32 a1_22;
	word32 a5_44;
	net_buf_simple_pull(*a4, 0x04, out a1_22, out a5_44);
	a1Out = a1_22;
	a5Out = 0x00FF0000;
	return s0_20 >> 0x18 | s0_20 << 0x18 | s0_20 >> 0x08 & 0x0FFFFF00 | s0_20 << 8 & 0x00FF0000;
}

// 230494D6: Register word32 net_buf_simple_headroom(Register Eq_2 a4)
// Called from:
//      bt_mesh_model_recv
//      bt_mesh_scan_cb
//      bt_mesh_net_recv
//      bt_mesh_trans_recv
//      hci_vendor_event
//      le_adv_report
//      l2cap_chan_le_send
//      att_rsp_sent
//      bt_att_req_send
word32 net_buf_simple_headroom(Eq_2 a4)
{
	return a4 - *((word32) (*a4) + 8);
}

