pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 230494E0: Register Eq_2 net_buf_simple_tailroom(Register Eq_2 a0, Register out ptr32 a4Out)
// Called from:
//      model_send
//      beacon_send
//      comp_data_status
//      dev_comp_data_get
//      health_get_registered
//      health_pub_update
//      bt_mesh_net_encode
//      proxy_recv
//      bt_mesh_trans_send
//      net_buf_append_bytes
//      bt_conn_recv
//      create_frag.isra.11
//      l2cap_chan_le_send
Eq_2 net_buf_simple_tailroom(Eq_2 a0, ptr32 & a4Out)
{
	struct Eq_253830 ** a5_5 = (word32) *((word32) a0 + 4);
	ptr32 a4_7 = (word32) *((word32) a0 + 6) - a5_5;
	Eq_2 a0_11 = a4_7 - (a5_5 - *((char *) (*a5_5) + 8));
	a4Out = a4_7;
	return a0_11;
}

// 230494F8: Register Eq_2 net_buf_append_bytes(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register word32 a3, Register (ptr32 code) a4, Register Eq_2 a5, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out (ptr32 word32) a3Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out (ptr32 code) s7Out)
// Called from:
//      l2cap_chan_le_recv_seg
Eq_2 net_buf_append_bytes(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, word32 a3, <anonymous> * a4, Eq_2 a5, Eq_2 dwArg0128, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, word32 & a3Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, <anonymous> & s7Out)
{
	Eq_2 s5_168 = a0;
	Eq_2 s2_167 = a1;
	Eq_2 s4_29 = a2;
	word32 s6_31 = a3;
	<anonymous> * s7_100 = a4;
	Eq_2 s8_101 = a5;
	do
	{
		struct Eq_253255 * s0_120 = *a5;
	} while (a5 != 0x00);
	ptr32 s3_104 = 0x00;
	while (true)
	{
		Eq_2 s0_43 = &s0_120->b0004 + 4;
		Eq_2 a4_46;
		Eq_2 a0_45 = net_buf_simple_tailroom(s0_43, out a4_46);
		uint32 s1_48 = a0_45 << 0x10;
		if (s2_167 < a0_45)
			s1_48 = s2_167 << 0x10;
		Eq_2 s1_103 = s1_48 >> 16;
		word32 a2_64;
		word32 a4_66;
		word32 a5_67;
		ptr32 a1_106;
		word32 * a3_108;
		net_buf_simple_add_mem(s0_43, s4_29, s1_103, a4_46, out a1_106, out a2_64, out a3_108, out a4_66, out a5_67);
		s2_167 -= s1_103;
		s3_104 = (word32) s1_103 + s3_104;
		word32 s4_79 = s4_29 + s1_103;
		if (s2_167 == 0x00)
			break;
		struct Eq_253255 * a0_105;
		word32 * a4_109;
		s7_100();
		s0_120 = a0_105;
		if (a0_105 == null)
			break;
		net_buf_frag_add(s5_168, a0_105, a3_108, a4_109);
	}
	0x00 = (int8) dwArg0128;
	s1Out = s1_103;
	a0Out = s3_104;
	a1Out = a1_106;
	a3Out = a3_108;
	s2Out = s2_167;
	s3Out = s3_104;
	s5Out = s5_168;
	s7Out = s7_100;
	return ra;
}

// 23049580: Register Eq_2 bt_hex_real(Register Eq_2 a0, Register Eq_183537 a1, Register out (ptr32 Eq_183538) a3Out)
// Called from:
//      vendor_data_set
//      auth_match
//      bt_mesh_net_decode
//      handle_event
Eq_2 bt_hex_real(Eq_2 a0, Eq_183537 a1, struct Eq_183538 & a3Out)
{
	if (a1 > 63)
		a1.u0 = 63;
	struct Eq_183538 * a3_19 = &g_t42015364;
	word32 a7_12 = a0 + a1;
	while (a0 != a7_12)
	{
		++a3_19;
		a3_19[0x07FF] = (struct Eq_183538) (byte) (word32) ((word32) *a0 >> 4)->b230BAA4C;
		a0 = (word32) a0 + 1;
		a3_19->b0FFF = (byte) (word32) ((word32) *((word32) a0 - 1) & 0x0F)->b230BAA4C;
	}
	(&g_t42015364)[a1] = (struct Eq_183538) 0x00;
	a3Out = a3_19;
	return 1107383140;
}

// 230495DC: Register Eq_2 bt_addr_le_str_real(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg08, Stack Eq_2 dwArg34, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 a3Out)
// Called from:
//      smp_ident_info
//      smp_encrypt_info
//      bt_smp_distribute_keys
//      smp_signing_info
//      smp_master_ident
//      smp_ident_addr_info
//      bt_smp_sign_verify
//      bt_smp_sign
//      bt_smp_update_keys
Eq_2 bt_addr_le_str_real(Eq_2 ra, Eq_2 a0, Eq_2 dwArg08, Eq_2 dwArg34, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & a3Out)
{
	Eq_2 a1_18;
	word32 a3_13 = (word32) *a0;
	Eq_2 s1_16 = fp + -28;
	if (a3_13 != 0x01)
	{
		if (a3_13 != 0x00)
		{
			if (a3_13 != 0x02)
			{
				if (a3_13 != 0x03)
				{
					word32 s10_165;
					word32 s11_166;
					word32 s8_163;
					word32 s9_164;
					word32 s6_161;
					word32 s7_162;
					word32 s4_159;
					word32 s5_160;
					word32 s2_157;
					word32 s3_158;
					word32 a5_155;
					word32 a7_156;
					word32 a3_153;
					word32 a4_154;
					word32 a1_151;
					word32 a2_152;
					word32 s0_149;
					word32 a0_150;
					ra = snprintf(ra, fp + -28, 0x0A, &g_t230BAA20, dwLoc18, dwArg08, dwArg34, dwArg50, dwArg54, dwArg78, dwArg9C, out s0_149, out s1_16, out a0_150, out a1_151, out a2_152, out a3_153, out a4_154, out a5_155, out a7_156, out s2_157, out s3_158, out s4_159, out s5_160, out s6_161, out s7_162, out s8_163, out s9_164, out s10_165, out s11_166);
					goto l23049622;
				}
				a1_18.u0 = 587966996;
			}
			else
				a1_18.u0 = 0x230BAA08;
		}
		else
			a1_18.u0 = 587966968;
	}
	else
		a1_18.u0 = 0x230BAA00;
	word32 a4_185;
	word32 a5_186;
	strcpy(fp + -28, a1_18, out a4_185, out a5_186);
l23049622:
	ptr32 a3_85;
	word32 s0_167;
	word32 s1_168;
	word32 a0_169;
	word32 a1_170;
	word32 a2_171;
	word32 a4_172;
	word32 a5_173;
	word32 a7_174;
	word32 s2_175;
	word32 s3_176;
	word32 s4_177;
	word32 s5_178;
	word32 s6_179;
	word32 s7_180;
	word32 s8_181;
	word32 s9_182;
	word32 s10_183;
	word32 s11_184;
	Eq_2 ra_89 = snprintf(ra, 0x420153E4, 0x1E, &g_t230BAA28, dwLoc18, dwArg08, dwArg34, s1_16, dwArg54, dwArg78, dwArg9C, out s0_167, out s1_168, out a0_169, out a1_170, out a2_171, out a3_85, out a4_172, out a5_173, out a7_174, out s2_175, out s3_176, out s4_177, out s5_178, out s6_179, out s7_180, out s8_181, out s9_182, out s10_183, out s11_184);
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	a3Out = a3_85;
	return ra_89;
}

// 23049682: Register (ptr32 Eq_2) k_work_submit_to_queue(Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_2 s1Out, Register out Eq_254095 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      k_work_submit
//      k_delayed_work_submit
//      work_timeout
union Eq_2 * k_work_submit_to_queue(Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & s1Out, union Eq_254095 & a0Out, ptr32 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	ui32 a0_19;
	ptr32 a1_20;
	ptr32 a3_22;
	Eq_2 a4_23;
	Eq_2 a5_24;
	ptr32 s4_26;
	ptr32 s8_27;
	word32 a2_120;
	Eq_2 s1_25 = atomic_or(a1, 0x01, a3, a4, mstatus, out a0_19, out a1_20, out a2_120, out a3_22, out a4_23, out a5_24, out s4_26, out s8_27);
	if ((a0_19 & 0x01) != 0x00)
	{
		s1Out = s1_25;
		a0Out = a0_19 & 0x01;
		a1Out = a1_20;
		a3Out = a3_22;
		a4Out = a4_23;
		a5Out = a5_24;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4_26;
		s5Out = s5;
		s6Out = s6;
		s8Out = s8_27;
		return s0;
	}
	else
	{
		Eq_254095 a0_40;
		ptr32 a1_41;
		ptr32 a3_43;
		Eq_2 a4_44;
		Eq_2 a5_45;
		Eq_2 s1_49;
		ptr32 s2_50;
		ptr32 s3_51;
		ptr32 s4_52;
		ptr32 s5_53;
		ptr32 s6_54;
		ptr32 s8_55;
		word32 a2_121;
		union Eq_2 * s0_48 = k_queue_append(s1_25, a4_23, a5_24, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_49, out a0_40, out a1_41, out a2_121, out a3_43, out a4_44, out a5_45, out s2_50, out s3_51, out s4_52, out s5_53, out s6_54, out s8_55);
		s1Out = s1_49;
		a0Out = a0_40;
		a1Out = a1_41;
		a3Out = a3_43;
		a4Out = a4_44;
		a5Out = a5_45;
		s2Out = s2_50;
		s3Out = s3_51;
		s4Out = s4_52;
		s5Out = s5_53;
		s6Out = s6_54;
		s8Out = s8_55;
		return s0_48;
	}
}

// 230496B6: void work_queue_main(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128)
void work_queue_main(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgE8, Eq_2 dwArg0128)
{
	Eq_2 s1_10 = 0x42026000;
	while (true)
	{
		word32 s2_93;
		Eq_2 a0_19;
		Eq_2 a3_22;
		Eq_2 a4_23;
		word32 a2_91;
		word32 s4_95;
		word32 s1_89;
		word32 s8_96;
		word32 s3_94;
		word32 a5_92;
		word32 a1_90;
		k_queue_get((word32) s1_10 + 1448, ~0x00, a3, a4, mstatus, s0, ra, dwArgE8, dwArg0128, out s1_89, out a0_19, out a1_90, out a2_91, out a3_22, out a4_23, out a5_92, out s2_93, out s3_94, out s4_95, out s8_96);
		ui32 a0_43;
		word32 a1_44;
		<anonymous> * a5_48;
		word32 a2_97;
		word32 s4_98;
		word32 s8_99;
		s1_10 = atomic_and(a0_19, ~0x01, a3_22, a4_23, mstatus, out a0_43, out a1_44, out a2_97, out a3, out a4, out a5_48, out s4_98, out s8_99);
		if ((a0_43 & 0x01) != 0x00)
			a5_48();
		k_yield();
	}
}

// 230496E6: Register Eq_2 k_work_q_start(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      cmd_stack_ble
Eq_2 k_work_q_start(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	g_dw42015404 = 0x00;
	g_dw42015408 = 0x00;
	g_dw4201540C = 0x00;
	g_dw42015410 = 0x00;
	g_dw42015414 = 0x00;
	g_dw42015418 = 0x00;
	g_dw4201541C = 0x00;
	g_dw42015420 = 0x00;
	g_dw42015424 = 0x00;
	g_dw42015428 = 0x00;
	Eq_2 s3_33;
	word32 a3_81;
	word32 a4_82;
	word32 a5_83;
	word32 s2_84;
	Eq_2 s1_31 = k_queue_init(ra, 0x14, a3, a4, 0x42015404, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out a3_81, out a4_82, out a5_83, out s2_84, out s3_33);
	ptr32 a3_52;
	ptr32 a4_53;
	ptr32 a5_54;
	word32 s1_85;
	word32 a0_86;
	word32 s2_87;
	word32 s3_88;
	Eq_2 ra_56 = k_thread_create(ra, s1_31, 0x420265B4, 0x00FFF800, 0x1E, s3_33, mstatus, dwArg00, dwArg04, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s1_85, out a0_86, out a3_52, out a4_53, out a5_54, out s2_87, out s3_88);
	a3Out = a3_52;
	a4Out = a4_53;
	a5Out = a5_54;
	return ra_56;
}

// 23049750: Register Eq_2 k_work_init(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      cmd_stack_ble
//      bt_mesh_net_init
//      bt_conn_add_le
//      bt_gatt_init
//      l2cap_chan_add
Eq_2 k_work_init(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_22;
	ptr32 a4_23;
	ptr32 a5_24;
	word32 a0_43;
	word32 a1_44;
	word32 a2_45;
	word32 s4_46;
	word32 s8_47;
	Eq_2 s1_25 = atomic_and(a0, ~0x01, a3, a4, mstatus, out a0_43, out a1_44, out a2_45, out a3_22, out a4_23, out a5_24, out s4_46, out s8_47);
	*((word32) s1_25 + 4) = a0;
	a3Out = a3_22;
	a4Out = a4_23;
	a5Out = a5_24;
	return s1_25;
}

// 23049772: Register (ptr32 Eq_254326) k_work_submit(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_197841 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      cmd_stack_ble
//      bt_mesh_beacon_ivu_initiator
//      bt_mesh_beacon_enable
//      heartbeat_pub_set
//      proxy_ccc_write
//      bt_mesh_ctl_send
//      hci_num_completed_packets
//      bt_l2cap_recv
struct Eq_254326 * k_work_submit(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_197841 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	ptr32 a0_11;
	ptr32 a1_12;
	ptr32 a3_14;
	ptr32 a4_15;
	ptr32 a5_16;
	ptr32 s1_17;
	ptr32 s4_18;
	ptr32 s8_19;
	Eq_197841 s2_25;
	ptr32 s3_26;
	ptr32 s5_27;
	ptr32 s6_28;
	struct Eq_254326 * s0_24 = k_work_submit_to_queue(a0, a3, a4, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_17, out a0_11, out a1_12, out a3_14, out a4_15, out a5_16, out s2_25, out s3_26, out s4_18, out s5_27, out s6_28, out s8_19);
	s1Out = s1_17;
	a0Out = a0_11;
	a1Out = a1_12;
	a3Out = a3_14;
	a4Out = a4_15;
	a5Out = a5_16;
	s2Out = s2_25;
	s3Out = s3_26;
	s4Out = s4_18;
	s5Out = s5_27;
	s6Out = s6_28;
	s8Out = s8_19;
	return s0_24;
}

// 23049780: Register word32 k_delayed_work_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      bt_mesh_lpn_init
//      mod_init
//      bt_mesh_beacon_init
//      bt_mesh_cfg_srv_init
//      bt_mesh_health_srv_init
//      bt_mesh_net_init
//      bt_mesh_prov_init
//      bt_mesh_proxy_init
//      bt_mesh_trans_init
//      bt_mesh_friend_init
//      bt_conn_add_le
//      bt_gatt_init
//      l2cap_chan_add
//      bt_smp_connected
//      bt_att_connected
word32 k_delayed_work_init(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0128, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 a5_18;
	word32 a3_64;
	word32 a4_65;
	k_work_init(a0, a3, a4, mstatus, out a3_64, out a4_65, out a5_18);
	ptr32 a0_28;
	ptr32 a3_31;
	ptr32 a4_32;
	ptr32 a5_33;
	word32 s1_36;
	ptr32 s2_37;
	ptr32 s3_38;
	ptr32 s4_39;
	k_timer_init(ra, (word32) a0 + 16, 587503994, a0, a5_18, mstatus, dwLoc10, s0, dwArg94, dwArgC8, dwArgE8, dwArg0128, out s1_36, out a0_28, out a3_31, out a4_32, out a5_33, out s2_37, out s3_38, out s4_39)->dw000C = 0x00;
	a0Out = a0_28;
	a3Out = a3_31;
	a4Out = a4_32;
	a5Out = a5_33;
	s2Out = s2_37;
	s3Out = s3_38;
	s4Out = s4_39;
	s5Out = s5_40;
	return s1_36;
}

// 230497AA: Register Eq_2 k_delayed_work_remaining_get(Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register out ptr32 a5Out)
// Called from:
//      lpn_timeout_get
//      attention_set
//      bt_mesh_trans_recv
Eq_2 k_delayed_work_remaining_get(Eq_2 s0, Eq_2 s1, Eq_2 a0, ptr32 & a5Out)
{
	if (a0 == 0x00)
	{
		a5Out = a5;
		return 0x00;
	}
	else
	{
		ptr32 a5_17;
		word32 a1_50;
		word32 a0_19 = s0 + s1 - k_now_ms(out a1_50, out a5_17);
		if (a0_19 < 0x00)
			a0_19.u0 = 0x00;
		a5Out = a5_17;
		return a0_19;
	}
}

// 230497D6: Register word32 k_delayed_work_del_timer(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      conn_cleanup
//      bt_gatt_deinit
//      bt_l2cap_chan_del
//      bt_smp_disconnected
//      bt_att_disconnected
word32 k_delayed_work_del_timer(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	if (a0 != 0x00)
	{
		a0 = *((word32) a5 + 16);
		if (a5 != 0x00)
		{
			Eq_2 a0_16;
			ptr32 a3_19;
			Eq_2 a4_20;
			Eq_2 a5_21;
			word32 s1_25;
			ptr32 s2_26;
			ptr32 s3_27;
			ptr32 s4_28;
			ptr32 s5_29;
			ptr32 s6_30;
			ptr32 s8_31;
			k_timer_delete((word32) a0 + 16, a4, a5, mstatus, dwArg34, dwArgA8, dwArgB8, dwArgE8, dwArg0128, out s1_25, out a0_16, out a3_19, out a4_20, out a5_21, out s2_26, out s3_27, out s4_28, out s5_29, out s6_30, out s8_31)->dw0010 = 0x00;
			a0Out = a0_16;
			a2Out = dwArg10;
			a3Out = a3_19;
			a4Out = a4_20;
			a5Out = a5_21;
			s2Out = s2_26;
			s3Out = s3_27;
			s4Out = s4_28;
			s5Out = s5_29;
			s6Out = s6_30;
			s8Out = s8_31;
			return s1_25;
		}
	}
	a0Out = a0;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s8Out = s8;
	return s1;
}

// 230497F8: Register word32 add_timer_record(Register (ptr32 Eq_254477) a2, Register out ptr32 a1Out, Register out (ptr32 Eq_254479) a3Out, Register out (ptr32 Eq_254480) a4Out)
// Called from:
//      k_delayed_work_submit
word32 add_timer_record(struct Eq_254477 * a2, ptr32 & a1Out, struct Eq_254479 & a3Out, struct Eq_254480 & a4Out)
{
	struct Eq_254481 * a0_6 = a2->ptr0010;
	struct Eq_254479 * a3_19 = &g_dw42015404;
	struct Eq_254480 * a4_11 = &g_dw42015404;
	ptr32 a1_18 = 1107383340;
	do
	{
		if (a4_11->dw0000 == a2)
		{
l23049830:
			a1Out = a1_18;
			a3Out = a3_19;
			a4Out = a4_11;
			return 0x00;
		}
		++a4_11;
	} while (a4_11 != &g_t4201542C);
	struct Eq_254480 * a4_17 = null;
	a1_18 = 0x05;
	do
	{
		if (a3_19->dw0000 == 0x00)
		{
			a4_11 = a4_17 << 3;
			a2->ptr0000 = &a4_11->dw0000 + 0x10805501;
			a0_6->ptr0004 = &a4_11->dw0000 + 0x10805501;
			goto l23049830;
		}
		a4_17 = (struct Eq_254480 *) ((char *) &a4_17->dw0000 + 1);
		++a3_19;
	} while (a4_17 != (struct Eq_254480 *) 0x05);
	a1Out = 0x05;
	a3Out = a3_19;
	a4Out = a4_17;
	return ~0x00;
}

// 23049840: Register word32 remv_timer_record(Register (ptr32 Eq_187459) a1)
// Called from:
//      k_delayed_work_cancel
word32 remv_timer_record(struct Eq_187459 * a1)
{
	struct Eq_187459 * a0_5 = a1->ptr0010;
	ui32 a5_15;
	for (a5_15 = 0x00; a5_15 != 0x05; ++a5_15)
	{
		word32 a3_13 = a0_5->dw0000;
		if (a0_5 == a1)
		{
			(&g_dw42015404)[a5_15 * 0x08] = 0x00;
			return a3_13;
		}
		a3_13 += 0x08;
	}
	return a3_13;
}

// 2304986E: Register (ptr32 Eq_187458) k_delayed_work_cancel(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_187458) a0Out, Register out (ptr32 Eq_187459) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_187463) a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      clear_friendship
//      friend_response_received.constprop.7
//      bt_mesh_model_publish
//      bt_mesh_beacon_ivu_initiator
//      bt_mesh_beacon_disable
//      _mod_pub_set.isra.1
//      heartbeat_pub_set
//      bt_mesh_subnet_del
//      bt_mesh_attention
//      bt_mesh_reset
//      prov_clear_tx
//      bt_mesh_pb_gatt_close
//      proxy_disconnected
//      proxy_recv
//      seg_rx_reset
//      seg_tx_reset
//      ctl_recv
//      bt_mesh_trans_recv
//      friend_clear
//      bt_mesh_friend_clear_cfm
//      k_delayed_work_submit
//      bt_conn_set_state
//      bt_conn_disconnect
//      l2cap_chan_destroy
//      smp_pairing_complete
//      bt_smp_disconnected
//      bt_att_encrypt_change
struct Eq_187458 * k_delayed_work_cancel(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0128, struct Eq_187458 & a0Out, struct Eq_187459 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, struct Eq_187463 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	struct Eq_187458 * s1_24;
	Eq_2 a4_18;
	Eq_2 a5_19;
	word32 a2_132;
	Eq_2 s2_20 = irq_lock(a4, mstatus, out a2_132, out a4_18, out a5_19);
	if ((atomic_get((word32) a0 + 8) & 1) == 0x00)
	{
		word32 s0_25 = *((word32) a5_19 + 0x0C);
		if (a5_19 != 0x00)
		{
			word32 a0_133;
			word32 a3_134;
			word32 a4_135;
			struct Eq_254581 * s0_36 = k_timer_stop(s0_25 + 16, a4_18, a5_19, mstatus, dwArg34, dwArgA8, dwArgB8, dwArgE8, dwArg0128, out s1_24, out a0_133, out a1, out a3_134, out a4_135, out s2_20, out s3, out s4, out s5, out s6, out s8);
			a3 = remv_timer_record(a1);
			s0_36->dw000C = 0x00;
			s0_36->dw001C = 0x00;
			s0_36->dw0020 = 0x00;
		}
		else
			s1_24 = (struct Eq_187458 *) ~0x15;
	}
	else
		s1_24 = (struct Eq_187458 *) -0x0044;
	ptr32 a4_66;
	struct Eq_187463 * a5_67;
	Eq_2 a3_65 = irq_unlock(a3, mstatus, out a4_66, out a5_67);
	0x00 = (int8) dwArg38;
	a0Out = s1_24;
	a1Out = a1;
	a2Out = dwArg10;
	a3Out = a3_65;
	a4Out = a4_66;
	a5Out = a5_67;
	s2Out = s2_20;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s8Out = s8;
	return s1_24;
}

