pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 230498CA: Register word32 k_delayed_work_submit(Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out Eq_187907 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_187914) s3Out, Register out Eq_2 s4Out, Register out Eq_187916 s5Out, Register out Eq_187917 s6Out, Register out ptr32 s8Out)
// Called from:
//      clear_friendship
//      friend_req_sent
//      friend_clear_sent
//      req_sent
//      bt_mesh_lpn_msg_received
//      publish_sent
//      mod_publish
//      beacon_send
//      _mod_pub_set.isra.1
//      hb_publish
//      bt_mesh_attention
//      bt_mesh_net_iv_update
//      ivu_refresh
//      prov_send
//      buf_sent
//      gen_prov_start
//      proxy_recv
//      seg_sent
//      seg_send_start
//      ctl_recv
//      seg_ack
//      bt_mesh_trans_recv
//      friend_clear_sent
//      buf_send_end
//      bt_mesh_friend_sub_add
//      bt_mesh_friend_sub_rem
//      bt_mesh_friend_poll
//      bt_mesh_friend_req
//      conn_cleanup
//      sc_indicate_rsp
//      sc_indicate
//      slave_update_conn_param
//      l2cap_le_conn_req
//      bt_l2cap_chan_disconnect
//      smp_send.isra.9
//      att_req_sent
word32 k_delayed_work_submit(Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & s1Out, union Eq_187907 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, struct Eq_187914 & s3Out, union Eq_2 & s4Out, union Eq_187916 & s5Out, union Eq_187917 & s6Out, ptr32 & s8Out)
{
	Eq_187907 s0_124;
	struct Eq_254630 * a5_25;
	word32 a2_256;
	Eq_2 a4_24;
	Eq_2 a0_22 = irq_lock(a4, mstatus, out a2_256, out a4_24, out a5_25);
	Eq_2 s1_103 = a5_25->t000C;
	ptr32 s2_104 = 0x42026000;
	Eq_2 s4_106 = a0_22;
	struct Eq_187914 * s3_105 = &g_t420265A8;
	if (a5_25 != null)
	{
		s0_124.u0 = -48;
		if (a5_25 != &g_t420265A8)
			goto l23049926;
		Eq_187907 a0_35;
		word32 a2_262;
		word32 a5_263;
		word32 s8_264;
		s1_103 = k_delayed_work_cancel(s1_103, a3, a4_24, mstatus, dwArg04, dwArg08, dwArg78, dwArg88, dwArgB8, dwArgF8, out a0_35, out a1, out a2_262, out a3, out a4_24, out a5_263, out s2_104, out s3_105, out s4_106, out s5, out s6, out s8_264);
		s0_124 = a0_35;
		if (a0_35 < 0x00)
			goto l23049926;
	}
	*((word32) s1_103 + 0x0C) = s3_105;
	if (a1 != 0x00)
	{
		struct Eq_254477 * a2_97;
		s1_103 = k_timer_start((word32) s1_103 + 16, a1, a4_24, mstatus, dwArg24, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a2_97, out s2_104, out s3_105, out s4_106, out s5, out s6);
		Eq_2 a4_121;
		Eq_187907 a0_118 = add_timer_record(a2_97, out a1, out a3, out a4_121);
		s0_124 = a0_118;
		if (a0_118 == 0x00)
			goto l23049926;
		word32 a5_261;
		user_vAssertCalled(a4_121, mstatus, out a5_261);
	}
	else
	{
		word32 a0_257;
		word32 a4_258;
		word32 a5_259;
		word32 s8_260;
		k_work_submit_to_queue(s1_103, a3, a4_24, mstatus, dwLoc2C, a1, dwArgC8, dwArg0108, dwArg0148, out s1_103, out a0_257, out a1, out a3, out a4_258, out a5_259, out s2_104, out s3_105, out s4_106, out s5, out s6, out s8_260);
		*((word32) s1_103 + 0x0C) = null;
	}
	s0_124.u0 = 0x00;
l23049926:
	ptr32 a4_136;
	ptr32 a5_137;
	Eq_2 a3_135 = irq_unlock(a3, mstatus, out a4_136, out a5_137);
	0x00 = (int8) dwArg0128;
	s1Out = s1_103;
	a0Out = s0_124;
	a1Out = a1;
	a2Out = dwArg0100;
	a3Out = a3_135;
	a4Out = a4_136;
	a5Out = a5_137;
	s2Out = s2_104;
	s3Out = s3_105;
	s4Out = s4_106;
	s5Out = s5;
	s6Out = s6;
	s8Out = dwArg58;
	return dwArgE4;
}

// 23049950: Register ui32 get_timer_record(Register ui32 a0, Register ui32 a1, Register out Eq_254743 a4Out, Register out Eq_2 a5Out)
// Called from:
//      work_timeout
ui32 get_timer_record(ui32 a0, ui32 a1, union Eq_254743 & a4Out, union Eq_2 & a5Out)
{
	Eq_254743 a4_12 = 0x00;
	do
	{
		if (a1 == a0)
		{
			a4Out = a4_12;
			a5Out.u0 = <invalid>;
			return (a4_12 << 0x03) + 0x42015404;
		}
		a4_12 = (word32) a4_12.u0 + 1;
	} while (a4_12 != 0x05);
	a4Out = a4_12;
	a5Out.u0 = <invalid>;
	return 0x00;
}

// 2304997A: void work_timeout(Register Eq_2 ra, Register Eq_2 s0, Register ui32 a0, Register ui32 a1, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void work_timeout(Eq_2 ra, Eq_2 s0, ui32 a0, ui32 a1, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	Eq_2 a4_15;
	Eq_2 a5_16;
	if (get_timer_record(a0, a1, out a4_15, out a5_16) == 0x00)
		user_vAssertCalled(a4_15, mstatus, out a5_16);
	struct Eq_254777 * a0_29;
	Eq_2 a3_32;
	Eq_2 a4_33;
	word32 s8_111;
	word32 s6_110;
	word32 s5_109;
	word32 s4_108;
	word32 s3_107;
	word32 s2_106;
	word32 a1_105;
	word32 s1_104;
	k_timer_stop((word32) s0 + 16, a4_15, a5_16, mstatus, dwArg34, dwArgA8, dwArgB8, dwArgE8, dwArg0128, out s1_104, out a0_29, out a1_105, out a3_32, out a4_33, out s2_106, out s3_107, out s4_108, out s5_109, out s6_110, out s8_111);
	word32 a1_113;
	word32 * s1_60;
	word32 a0_112;
	word32 a3_114;
	word32 a4_115;
	word32 a5_116;
	word32 s2_117;
	word32 s3_118;
	word32 s4_119;
	word32 s5_120;
	word32 s6_121;
	word32 s8_122;
	k_work_submit_to_queue(a0_29->t000C, a3_32, a4_33, mstatus, s0, ra, dwArgE8, dwArg0128, dwArg0168, out s1_60, out a0_112, out a1_113, out a3_114, out a4_115, out a5_116, out s2_117, out s3_118, out s4_119, out s5_120, out s6_121, out s8_122)->dw000C = 0x00;
	*s1_60 = 0x00;
}

