pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 230499B2: void reverse_bytearray(Register ptr32 a0, Register ptr32 a1, Register int32 a2)
// Called from:
//      ble_select_conn
//      ble_disconnect
//      ble_connect
//      ble_unpair
void reverse_bytearray(ptr32 a0, ptr32 a1, int32 a2)
{
	byte * a1_5 = a1 + a2;
	int32 a5_15 = 0x00;
	while (true)
	{
		a1_5 += -1;
		if (a5_15 >= a2)
			break;
		*a1_5 = (byte) (word32) (a0 + a5_15);
		++a5_15;
	}
}

// 230499CE: Register Eq_196083 find_msb_set(Register Eq_196083 a0, Register out (ptr32 Eq_239456) a3Out, Register out Eq_239457 a4Out)
// Called from:
//      ctl_recv
Eq_196083 find_msb_set(Eq_196083 a0, struct Eq_239456 & a3Out, union Eq_239457 & a4Out)
{
	if (a0 != 0x00)
	{
		a4.u0 = 0x80000000;
		int32 a5_10 = 0x00;
		while (true)
		{
			a3 = a4 & a0;
			if (a3 != null)
				break;
			++a5_10;
			a4 >>= 1;
		}
		a0 = 32 - a5_10;
	}
	a3Out = a3;
	a4Out = a4;
	return a0;
}

// 230499EA: Register Eq_2 find_lsb_set(Register Eq_2 a0, Register out Eq_239672 a3Out, Register out Eq_239673 a4Out)
// Called from:
//      ctl_recv
Eq_2 find_lsb_set(Eq_2 a0, union Eq_239672 & a3Out, union Eq_239673 & a4Out)
{
	Eq_2 a5_10 = 0x00;
	if (a0 != 0x00)
	{
		a4.u0 = 0x01;
		a5_10.u0 = 0x00;
		while (true)
		{
			a3 = a4 & a0;
			a5_10 = (byte) a5_10.u0 + 1;
			if (a3 != 0x00)
				break;
			a4 <<= 1;
		}
	}
	a3Out = a3;
	a4Out = a4;
	return a5_10;
}

// 23049A02: void gf_double(Register word32 a0, Register Eq_2 a1)
// Called from:
//      tc_cmac_setup
void gf_double(word32 a0, Eq_2 a1)
{
	Eq_2 a4_11 = (word32) a1 + 0x0F;
	struct Eq_254898 * a0_14 = a0 + 0x0F;
	uint32 a5_10 = (int32) *a1 >> 31 & 0x0087;
	while (true)
	{
		a0_14 = (struct Eq_254898 *) ((char *) a0_14 - 1);
		a0_14[1] = (struct Eq_254898) (byte) (a5_10 ^ (word32) (*a4_11) << 1);
		if (a4_11 == a1)
			break;
		a4_11 = (word32) a4_11 - 1;
		a5_10 = (word32) *((word32) a4_11 + 1) >> 7;
	}
}

// 23049A30: Register word32 tc_cmac_erase(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      tc_cmac_final
word32 tc_cmac_erase(Eq_2 ra, Eq_2 a0, ptr32 & a3Out, ptr32 & a4Out)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		return a1;
	}
	else
	{
		word32 a1_11;
		ptr32 a3_13;
		ptr32 a4_14;
		word32 a2_43;
		word32 a5_44;
		_set(ra, a0, 0x00, 88, out a1_11, out a2_43, out a3_13, out a4_14, out a5_44);
		a3Out = a3_13;
		a4Out = a4_14;
		return a1_11;
	}
}

// 23049A4A: Register Eq_2 tc_cmac_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      tc_cmac_setup
Eq_2 tc_cmac_init(Eq_2 ra, Eq_2 a0, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out)
{
	if (a0 == 0x00)
	{
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		return ra;
	}
	else
	{
		ptr32 a1_26;
		ptr32 a3_28;
		word32 a1_67;
		word32 a2_68;
		word32 a3_69;
		word32 a4_70;
		word32 a5_71;
		word32 a2_72;
		word32 a4_73;
		word32 a5_74;
		Eq_2 ra_31 = _set(_set(ra, a0, 0x00, 0x10, out a1_67, out a2_68, out a3_69, out a4_70, out a5_71), (word32) a0 + 48, 0x00, 0x10, out a1_26, out a2_72, out a3_28, out a4_73, out a5_74);
		((word32) a0 + 0x0044)->u0 = 0x00;
		*(union Eq_2 *) 80 = a0;
		*(union Eq_2 *) 0x10000054 = a0;
		a1Out = a1_26;
		a3Out = a3_28;
		a4Out = 0x00;
		return ra_31;
	}
}

// 23049A7E: Register Eq_2 tc_cmac_setup(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_214961) a2, Stack word32 dwArg38, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out (ptr32 Eq_214961) a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      bt_mesh_aes_cmac
//      bt_smp_aes_cmac
Eq_2 tc_cmac_setup(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_214961 * a2, word32 dwArg38, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, struct Eq_214961 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	if (a0 == 0x00 || a1 == 0x00)
	{
		s1Out = s1;
		a0Out = 0x00;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = 0x00;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s8Out = s8;
		return ra;
	}
	else
	{
		word32 a5_204;
		word32 a4_203;
		word32 a3_202;
		word32 a2_201;
		word32 a1_200;
		Eq_2 ra_29 = _set(ra, a0, 0x00, 88, out a1_200, out a2_201, out a3_202, out a4_203, out a5_204);
		a2[18] = (struct Eq_214961) a0;
		Eq_2 a2_58;
		word32 a4_209;
		word32 a3_208;
		word32 a1_207;
		word32 a0_206;
		word32 s1_205;
		word32 s4_210;
		word32 s8_211;
		word32 a1_212;
		word32 a3_213;
		word32 a4_214;
		word32 a5_215;
		Eq_2 ra_62 = _set(ra_29, tc_aes128_set_encrypt_key(a2, a1, out s1_205, out a0_206, out a1_207, out a3_208, out a4_209, out s4_210, out s8_211), 0x00, 0x10, out a1_212, out a2_58, out a3_213, out a4_214, out a5_215);
		Eq_2 s0_65 = *((word32) a2_58 + 72);
		Eq_2 s0_77;
		ptr32 s2_79;
		ptr32 s3_80;
		ptr32 s4_81;
		ptr32 s5_82;
		ptr32 s8_83;
		word32 s1_216;
		word32 a0_217;
		word32 a1_218;
		word32 a3_219;
		word32 a4_220;
		word32 a5_221;
		Eq_2 ra_76 = tc_aes_encrypt(ra_62, s0_65, s0_65, a2_58, out s0_77, out s1_216, out a0_217, out a1_218, out a3_219, out a4_220, out a5_221, out s2_79, out s3_80, out s4_81, out s5_82, out s8_83);
		gf_double((word32) s0_77 + 16, s0_77);
		gf_double((word32) s0_77 + 32, (word32) s0_77 + 16);
		Eq_2 a1_106;
		ptr32 a3_108;
		ptr32 a4_109;
		Eq_2 ra_111 = tc_cmac_init(ra_76, s0_77, out a1_106, out a3_108, out a4_109);
		0x00 = dwArg38;
		s1Out = (word32) s0_77 + 16;
		a0Out = 0x01;
		a1Out = a1_106;
		a2Out = dwArg10;
		a3Out = a3_108;
		a4Out = a4_109;
		a5Out = 0x01;
		s2Out = s2_79;
		s3Out = s3_80;
		s4Out = s4_81;
		s5Out = s5_82;
		s8Out = s8_83;
		return ra_111;
	}
}

// 23049AE8: Register Eq_2 tc_cmac_update(Register Eq_2 ra, Register ptr32 a0, Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 Eq_197405) a4, Register (ptr32 Eq_214946) a5, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_215015 a3Out, Register out (ptr32 Eq_197405) a4Out, Register out (ptr32 Eq_214946) a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      bt_mesh_aes_cmac
//      bt_smp_aes_cmac
Eq_2 tc_cmac_update(Eq_2 ra, ptr32 a0, Eq_2 a1, Eq_2 a2, struct Eq_197405 * a4, struct Eq_214946 * a5, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_215015 & a3Out, struct Eq_197405 & a4Out, struct Eq_214946 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = 0x00;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s8Out = s8;
		return ra;
	}
	ptr32 a0_189;
	Eq_2 s1_103 = a2;
	if (a2 == 0x00)
	{
l23049AFE:
		a0_189 = 0x01;
		goto l23049B00;
	}
	s2 = a1;
	a0_189 = 0x00;
	if (a1 == 0x00)
		goto l23049B00;
	union Eq_255182 * s0_133 = a4->dw0054;
	a3 = a5 | a4;
	if (a3 == 0x00)
	{
l23049B00:
		s0Out = s1;
		s1Out = s1_103;
		a0Out = a0_189;
		a1Out = a1;
		a2Out = dwArg48;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out = s5;
		s8Out = s4;
		return ra;
	}
	int32 s4_32 = *((char *) s0_133 + 0x0044);
	a5->dw004F = s0_133;
	a5 = (struct Eq_214946 *) ((char *) a4 - 1 + (word32) ((char *) a5 - 1 < a5));
	a5->dw0054 = s0_133;
	a3 = (char *) a5 - 1;
	a4 = (struct Eq_197405 *) ((char *) a4 - 1);
	if (s4_32 != 0x00)
	{
		s3 = 0x10 - s4_32;
		Eq_2 a0_39 = (char *) s0_133 + (s4_32 + 48);
		if (a2 < s3)
		{
			a1 = _copy(a0_39, a2, a1, a2, out a3, out a4, out a5);
			s0_133 = a5->dw0044;
			s1_103 = a2 + a5;
			goto l23049B56;
		}
		word32 a3_382;
		word32 a4_383;
		word32 a5_384;
		_copy(a0_39, s3, a1, s3, out a3_382, out a4_383, out a5_384);
		*((char *) s0_133 + 0x0044) = 0x00;
		union Eq_255182 * a5_61 = s0_133;
		do
		{
			Eq_2 a2_66 = (word32) *((char *) a5_61 + 48);
			a5_61 = (union Eq_255182 *) ((char *) a5_61 + 1);
			*((char *) a5_61 + 0x0FFF) = (union Eq_255182 *) (byte) ((word32) *a5_61 ^ a2_66);
		} while ((char *) s0_133 + 16 != a5_61);
		Eq_2 s0_71 = *((word32) a2_66 + 72);
		word32 a0_385;
		word32 s3_386;
		word32 s4_387;
		word32 s8_388;
		ra = tc_aes_encrypt(ra, s0_71, s0_71, a2_66, out s0_133, out s1_103, out a0_385, out a1, out a3, out a4, out a5, out s2, out s3_386, out s4_387, out s5, out s8_388);
	}
	s2 += s1_103;
	s3.u0 = 0x10;
	while (true)
	{
		Eq_2 a2_104 = s2 - s1_103;
		if (s3 >= s1_103)
			break;
		Eq_2 a5_106 = 0x00;
		do
		{
			word32 a3_109 = s0_133 + a5_106;
			Mem117[a3_109 + 0x00:byte] = SLICE(CONVERT(Mem112[a2_104 + a5_106:byte], byte, word32) ^ CONVERT(Mem112[a3_109 + 0x00:byte], byte, word32), byte, 0);
			a5_106 = (word32) a5_106 + 1;
		} while (a5_106 != s3);
		Eq_2 s0_119 = *((word32) a2_104 + 72);
		word32 s1_134;
		word32 a0_389;
		word32 s4_390;
		word32 s8_391;
		ra = tc_aes_encrypt(ra, s0_119, s0_119, a2_104, out s0_133, out s1_134, out a0_389, out a1, out a3, out a4, out a5, out s2, out s3, out s4_390, out s5, out s8_391);
		s1_103 = s1_134 + ~0x0F;
	}
	if (s1_103 == 0x00)
		goto l23049AFE;
	a1 = _copy((char *) s0_133 + 48, s1_103, a2_104, s1_103, out a3, out a4, out a5);
l23049B56:
	*((word32) s1_103 + 0x0044) = s0_133;
	goto l23049AFE;
}

// 23049BDA: Register Eq_2 tc_cmac_final(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      bt_mesh_aes_cmac
//      bt_smp_aes_cmac
Eq_2 tc_cmac_final(Eq_2 ra, Eq_2 a0, ptr32 a1, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	if (a0 == 0x00 || a1 == 0x00)
	{
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s8Out = s8;
		return 0x00;
	}
	else
	{
		Eq_2 a2_105;
		struct Eq_6298 * a1_15 = *(struct Eq_6298 **) 0x44;
		struct Eq_6298 * s0_17 = a1_15;
		if (false)
			a2_105 = a1_15 + 16;
		else
		{
			struct Eq_255366 * a5_28;
			word32 a4_191;
			word32 a3_190;
			word32 a2_189;
			word32 a1_188;
			ra = _set(ra, a1_15 + 48, 0x00, 0x10, out a1_188, out a2_189, out a3_190, out a4_191, out a5_28);
			s0_17 = a5_28->ptr0044;
			Mem36[a5_28 + s0_17 + 48:byte] = 0x80;
			a2_105 = s0_17 + 32;
		}
		struct Eq_6298 * a5_39 = s0_17;
		int32 a3_40;
		for (a3_40 = 0x00; a3_40 != 0x10; ++a3_40)
		{
			++a5_39;
			a5_39[0x0FFF] = (struct Eq_6298) (byte) ((word32) a5_39->b0000 ^ (word32) a5_39[48] ^ (word32) (*((word32) a2_105 + a3_40)));
		}
		Eq_2 s0_72;
		ptr32 s3_75;
		ptr32 s4_76;
		ptr32 s5_77;
		ptr32 s8_78;
		ptr32 a3_90;
		ptr32 a4_91;
		word32 s2_198;
		word32 a5_197;
		word32 a4_196;
		word32 a3_195;
		word32 a1_194;
		word32 a0_193;
		word32 s1_192;
		a1Out = tc_cmac_erase(tc_aes_encrypt(ra, a0, *((word32) a2_105 + 72), a2_105, out s0_72, out s1_192, out a0_193, out a1_194, out a3_195, out a4_196, out a5_197, out s2_198, out s3_75, out s4_76, out s5_77, out s8_78), s0_72, out a3_90, out a4_91);
		a2Out = dwArg10;
		a3Out = a3_90;
		a4Out = a4_91;
		s3Out = s3_75;
		s4Out = s4_76;
		s5Out = s5_77;
		s8Out = s8_78;
		return 0x01;
	}
}

