pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23049C5E: Register Eq_2 _copy(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register out Eq_255228 a3Out, Register out (ptr32 Eq_255229) a4Out, Register out (ptr32 Eq_255230) a5Out)
// Called from:
//      tc_cmac_update
//      shift_rows
//      tc_aes_encrypt
Eq_2 _copy(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, union Eq_255228 & a3Out, struct Eq_255229 & a4Out, struct Eq_255230 & a5Out)
{
	if (a1 < a3)
	{
		a3Out.u0 = 0x00;
		a4Out = a4;
		a5Out = a5;
		return a1;
	}
	else
	{
		struct Eq_255229 * a4_16;
		struct Eq_255230 * a5_17;
		Eq_2 a1_19;
		Eq_255228 a3_21;
		word32 a2_65;
		word32 a6_66;
		word32 a7_67;
		memcpy(a0, a2, a3, out a1_19, out a2_65, out a3_21, out a4_16, out a5_17, out a6_66, out a7_67);
		a3Out = a3_21;
		a4Out = a4_16;
		a5Out = a5_17;
		return a1_19;
	}
}

// 23049C82: Register Eq_2 _set(Register Eq_2 ra, Register Eq_2 a0, Register Eq_630 a1, Register Eq_2 a2, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      tc_cmac_erase
//      tc_cmac_init
//      tc_cmac_setup
//      tc_cmac_final
//      tc_aes_encrypt
Eq_2 _set(Eq_2 ra, Eq_2 a0, Eq_630 a1, Eq_2 a2, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a1_8;
	ptr32 a2_9;
	ptr32 a3_10;
	ptr32 a4_11;
	ptr32 a5_12;
	word32 t1_21;
	word32 a0_22;
	Eq_2 ra_13 = memset(ra, a0, a1, a2, out t1_21, out a0_22, out a1_8, out a2_9, out a3_10, out a4_11, out a5_12);
	a1Out = a1_8;
	a2Out = a2_9;
	a3Out = a3_10;
	a4Out = a4_11;
	a5Out = a5_12;
	return ra_13;
}

// 23049C86: Register uint32 _double_byte(Register uint32 a0)
// Called from:
//      mult_row_column
uint32 _double_byte(uint32 a0)
{
	return (a0 << 1 ^ (a0 >> 0x07) + 0x1B) & 0x00FF;
}

// 23049C9A: Register Eq_2 bl_find_valid_queued_entry(Register Eq_2 ra, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_255508 s1Out, Register out Eq_255509 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out)
// Called from:
//      bl_onchiphci_rx_packet_handler
Eq_2 bl_find_valid_queued_entry(Eq_2 ra, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_255508 & s1Out, union Eq_255509 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out)
{
	Eq_255508 s1_18 = 0x00;
	word32 t1_97;
	word32 a1_99;
	word32 a0_98;
	word32 a3_101;
	word32 a2_100;
	word32 a4_102;
	word32 a5_103;
	Eq_2 ra_25 = memset(ra, fp + -40, 0x00, 0x08, out t1_97, out a0_98, out a1_99, out a2_100, out a3_101, out a4_102, out a5_103);
	do
	{
		ui32 s0_31 = s1_18 << 0x03;
		Eq_255509 s0_33 = s0_31 + 0x420265B8;
		ptr32 a5_39;
		ptr32 a3_40;
		ptr32 a4_41;
		word32 a1_104;
		word32 a2_105;
		if (memcmp(s0_31 + 0x420265B8, fp + -40, 0x08, out a1_104, out a2_105, out a3_40, out a4_41, out a5_39) == 0x00)
			goto l23049CD6;
		s1_18 = (word32) s1_18.u0 + 1;
	} while (s1_18 != 0x09);
	s0_33.u0 = 0x00;
l23049CD6:
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_18;
	a0Out = s0_33;
	a3Out = a3_40;
	a4Out = a4_41;
	a5Out = a5_39;
	s2Out = 0x420265B8;
	return ra_25;
}

// 23049CE6: Register Eq_2 bl_onchiphci_rx_packet_handler(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register (ptr32 byte) a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack word32 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_2) s0Out, Register out Eq_2 a2Out, Register out ptr32 mstatusOut)
// Called from:
//      net_buf_unref
Eq_2 bl_onchiphci_rx_packet_handler(Eq_2 ra, word32 a0, Eq_2 a1, byte * a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, ptr32 mstatus, word32 dwArg00, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & a2Out, ptr32 & mstatusOut)
{
	word32 s0_136 = a0;
	Eq_2 s1_21 = a1;
	byte * s4_102 = a2;
	Eq_2 s2_100 = a3;
	Eq_2 s3_113 = a4;
	if (a4 != 0x00)
	{
l23049D2A:
		word32 a0_266 = (word32) *((word32) s3_113 + 8) + (word32) (*((word32) s3_113 + 0x0C));
		if ((s0_136 + ~0x00 & 0x00FF) <= 0x04)
		{
			union Eq_2 * s0_300;
			Eq_2 ra_305;
			Eq_2 a2_309;
			ptr32 mstatus_317;
			word32 a7_318;
			word32 s6_319;
			word32 t0_320;
			word32 t1_321;
			word32 t4_322;
			word32 t5_323;
			word32 t6_324;
			g_t230BAA70();
			s0Out = s0_300;
			a2Out = a2_309;
			mstatusOut = mstatus_317;
			return ra_305;
		}
		goto l23049EF8;
	}
	Eq_2 a0_111;
	s5.u0 = 0x4200F450;
	if (a0 != 0x01)
	{
		if ((a0 + -2 & 0x00FF) <= 0x01)
		{
			ra = bt_buf_get_cmd_complete(ra, a1, a3, a4, 0x4200F450, mstatus, dwArg84, dwArg98, dwArgD8, dwArgF8, out s0_136, out s1_21, out a0_111, out a1, out a2, out a3, out a4, out s2_100, out s4_102, out s5, out mstatus);
			goto l23049D22;
		}
		a5.u0 = 0x04;
		if (a0 == 0x04)
		{
			a4 = (word32) *a2;
			a5.u0 = 0x02;
			if (a4 == 0x02 && bt_buf_get_rx_avail_cnt(a3, a4, mstatus, out a3, out a4, out a5) <= 0x01)
				goto l23049D72;
		}
		a0_111.u0 = 0x01;
	}
	else
		a0_111.u0 = 0x03;
	ra = bt_buf_get_rx(ra, 0x00, a3, a4, a5, 0x4200F450, mstatus, dwArg84, dwArg98, dwArgD8, dwArgF8, out s1_21, out a1, out a2, out a3, out a4, out s2_100, out s4_102, out s5, out mstatus);
l23049D22:
	s3_113 = a0_111;
	if (a0_111 != 0x00)
	{
		*s5.u0 = 0x00;
		goto l23049D2A;
	}
l23049D72:
	int32 a5_118 = *s5.u0;
	*s5.u0 = a5_118 + 0x01;
	if ((a5_118 + 0x01 & 0x00FF) == 0x00)
	{
		word32 a1_596;
		word32 a0_595;
		word32 a2_597;
		word32 a4_598;
		word32 s8_600;
		word32 a5_599;
		puts(587967108, out a0_595, out a1_596, out a2_597, out a4_598, out a5_599, out s4_102, out s8_600);
	}
	if (s0_136 != 0x04 || (word32) (*s4_102) != 0x02)
	{
		struct Eq_255729 * a0_155;
		Eq_2 a3_158;
		word32 s0_162;
		uint32 s1_163;
		Eq_2 s2_164;
		Eq_2 a4_159;
		Eq_2 a5_160;
		ra = bl_find_valid_queued_entry(ra, dwArg0108, out s0_162, out s1_163, out a0_155, out a3_158, out a4_159, out a5_160, out s2_164);
		struct Eq_255729 * s3_170 = a0_155;
		if (a0_155 != null)
		{
			a0_155->b0001 = (byte) s1_163;
			a0_155->b0000 = (byte) s0_162;
			a0_155->b0002 = (byte) (s1_163 >> 8);
			if (s2_164 != 0x00)
			{
				Eq_2 s4_191;
				Eq_2 a0_180 = k_malloc(ra, s1_163 >> 8, s2_164, a3_158, a4_159, a5_160, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s2_164, out s3_170, out s4_191);
				s3_170->b0004 = (byte) (a0_180 >> 0x08);
				s3_170->b0003 = (byte) a0_180;
				s3_170->b0005 = (byte) (a0_180 >> 0x10);
				s3_170->b0006 = (byte) (a0_180 >> 0x18);
				word32 a2_602;
				word32 a1_601;
				word32 a3_603;
				word32 a6_604;
				word32 a7_605;
				memcpy(a0_180, s4_191, s2_164, out a1_601, out a2_602, out a3_603, out a4_159, out a5_160, out a6_604, out a7_605);
			}
			s3_170->b0007 = (byte) s2_164;
			Eq_2 a2_237;
			word32 s6_616;
			word32 s8_617;
			word32 a4_610;
			word32 a5_611;
			word32 s2_612;
			word32 s3_613;
			word32 s4_614;
			word32 s5_615;
			word32 a3_609;
			word32 s1_606;
			word32 a0_607;
			word32 a1_608;
			s0Out = k_queue_append(0x42026600, a4_159, a5_160, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_606, out a0_607, out a1_608, out a2_237, out a3_609, out a4_610, out a5_611, out s2_612, out s3_613, out s4_614, out s5_615, out s6_616, out s8_617);
			a2Out = a2_237;
			mstatusOut = mstatus;
			return ra;
		}
	}
l23049EF8:
	s0Out = s1;
	a2Out = dwArg48;
	mstatusOut = mstatus;
	return ra;
}

// 23049F0A: Register Eq_2 bl_handle_queued_msg(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out Eq_2 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      net_buf_unref
Eq_2 bl_handle_queued_msg(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, union Eq_2 & s8Out, ptr32 & mstatusOut)
{
	ptr32 a2_14;
	Eq_2 a3_15;
	Eq_2 a4_16;
	Eq_2 a5_17;
	ptr32 a0_13 = k_queue_is_empty((char *) &g_t420265A8.t0048 + 16, a3, a4, mstatus, out a2_14, out a3_15, out a4_16, out a5_17);
	if (a0_13 == 0x00)
	{
		a0_13 = 0x03;
		ra = bt_buf_get_rx(ra, 0x00, a3_15, a4_16, a5_17, s5, mstatus, dwArg84, dwArg98, dwArgD8, dwArgF8, out s1, out a1, out a2_14, out a3_15, out a4_16, out s2, out s4, out s5, out mstatus);
		if (true)
		{
			struct Eq_255930 * a0_52;
			Eq_2 a4_56;
			word32 s1_273;
			word32 a1_274;
			word32 a2_275;
			word32 a3_276;
			word32 a5_277;
			word32 s2_278;
			word32 s3_279;
			word32 s4_280;
			word32 s8_281;
			k_queue_get(0x42026600, 0x00, a3_15, a4_16, mstatus, dwLoc1C, 0x03, dwArgD8, dwArg0118, out s1_273, out a0_52, out a1_274, out a2_275, out a3_276, out a4_56, out a5_277, out s2_278, out s3_279, out s4_280, out s8_281);
			Eq_2 a5_81 = (word32) a0_52->b0005 << 16 | dwArgA4;
			Eq_2 a2_91;
			ptr32 mstatus_106;
			Eq_2 s0_132;
			Eq_2 ra_107 = bl_onchiphci_rx_packet_handler(ra, (word32) a0_52->b0000, (word32) a0_52->b0002 << 8 | (word32) a0_52->b0001, (word32) a0_52->b0006 << 24 | a5_81, (word32) a0_52->b0007, a4_56, a5_81, s5, mstatus, dwLoc20, dwLoc1C, dwArg00, dwArg04, dwArg08, dwArg28, 0x03, dwArg68, dwArg78, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_132, out a2_91, out mstatus_106);
			Eq_2 a5_121 = (word32) *((word32) s0_132 + 4) << 8 | (word32) (*((word32) s0_132 + 3)) | (word32) (*((word32) s0_132 + 5)) << 16;
			Eq_2 a0_124 = (word32) *((word32) s0_132 + 6) << 24 | a5_121;
			if (a0_124 != 0x00)
			{
				word32 a3_282;
				word32 a4_283;
				s0_132 = k_free(a0_124, a2_91, a5_121, mstatus_106, dwArg0138, dwArg0178, out a3_282, out a4_283);
			}
			ptr32 s4_134;
			ptr32 s1_133;
			ptr32 a0_147;
			ptr32 a1_148;
			ptr32 a2_149;
			Eq_2 a3_150;
			Eq_2 a4_151;
			Eq_2 a5_152;
			word32 t1_284;
			Eq_2 ra_153 = memset(ra_107, s0_132, 0x00, 0x08, out t1_284, out a0_147, out a1_148, out a2_149, out a3_150, out a4_151, out a5_152);
			s0Out = s0_132;
			s1Out = s1_133;
			a0Out = a0_147;
			a1Out = a1_148;
			a2Out = a2_149;
			a3Out = a3_150;
			a4Out = a4_151;
			a5Out = a5_152;
			s2Out = s2_96;
			s3Out = s3_97;
			s4Out = s4_134;
			s5Out = s5_108;
			s6Out = s6_109;
			s8Out.u0 = <invalid>;
			mstatusOut = mstatus_106;
			return ra_153;
		}
	}
	s0Out.u0 = 0x42026000;
	s1Out = s1;
	a0Out = a0_13;
	a1Out = a1;
	a2Out = a2_14;
	a3Out = a3_15;
	a4Out = a4_16;
	a5Out = a5_17;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s8Out.u0 = <invalid>;
	mstatusOut = mstatus;
	return ra;
}

