pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 23049FA6: Register Eq_2 bl_onchiphci_interface_deinit(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s5Out)
// Called from:
//      bt_disable
Eq_2 bl_onchiphci_interface_deinit(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s5Out)
{
	Eq_2 s0_10 = 0x42026000;
	while (true)
	{
		struct Eq_256088 * a0_17;
		Eq_2 a2_19;
		Eq_2 a4_21;
		Eq_2 a5_22;
		word32 s8_125;
		word32 s4_124;
		word32 s3_123;
		word32 s2_122;
		word32 a1_121;
		word32 s1_120;
		s0_10 = k_queue_get((word32) s0_10 + 0x0600, 0x00, a3, a4, mstatus, s0, ra, dwArgE8, dwArg0128, out s1_120, out a0_17, out a1_121, out a2_19, out a3, out a4_21, out a5_22, out s2_122, out s3_123, out s4_124, out s8_125);
		if (a0_17 == null)
			break;
		a4 = (word32) a0_17->b0003 | (word32) a0_17->b0004 << 8;
		Eq_2 a5_74 = (word32) a0_17->b0005 << 16 | a4;
		Eq_2 a0_76 = (word32) a0_17->b0006 << 24 | a5_74;
		if (a0_76 != 0x00)
			s0_10 = k_free(a0_76, a2_19, a5_74, mstatus, dwArg0148, dwArg0188, out a3, out a4);
	}
	word32 a5_126;
	word32 s2_127;
	ptr32 a3_46;
	ptr32 a4_47;
	ptr32 s1_51;
	ptr32 s5_57;
	word32 s3_128;
	word32 s4_129;
	word32 s6_130;
	word32 s7_131;
	word32 s8_132;
	word32 s9_133;
	Eq_2 ra_50 = k_queue_free(ra, (word32) s0_10 + 0x0600, a3, a4_21, a5_22, mstatus, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, dwArg0148, dwArg0188, out s1_51, out a3_46, out a4_47, out a5_126, out s2_127, out s3_128, out s4_129, out s5_57, out s6_130, out s7_131, out s8_132, out s9_133);
	s1Out = s1_51;
	a3Out = a3_46;
	a4Out = a4_47;
	s5Out = s5_57;
	return ra_50;
}

// 23049FEE: Register Eq_2 bl_onchiphci_interface_init(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      init_work
Eq_2 bl_onchiphci_interface_init(Eq_2 ra, Eq_2 s0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & mstatusOut)
{
	Eq_2 a3_13;
	Eq_2 a4_14;
	Eq_2 a5_15;
	word32 t1_67;
	word32 a0_68;
	word32 a1_69;
	word32 a2_70;
	Eq_2 ra_16 = memset(ra, 0x420265B8, 0x00, 72, out t1_67, out a0_68, out a1_69, out a2_70, out a3_13, out a4_14, out a5_15);
	ptr32 s2_31;
	word32 a3_71;
	word32 a4_72;
	word32 a5_73;
	word32 s3_74;
	Eq_2 s1_30 = k_queue_init(ra_16, 0x09, a3_13, a4_14, a5_15, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out a3_71, out a4_72, out a5_73, out s2_31, out s3_74);
	ptr32 a0_42;
	ptr32 a3_45;
	ptr32 a4_46;
	ptr32 mstatus_48;
	ptr32 s1_51;
	Eq_2 ra_49 = bt_onchiphci_interface_init(ra_16, s0, s1_30, 587504870, out s1_51, out a0_42, out a3_45, out a4_46, out mstatus_48);
	s1Out = s1_51;
	a0Out = a0_42;
	a3Out = a3_45;
	a4Out = a4_46;
	s2Out = s2_31;
	mstatusOut = mstatus_48;
	return ra_49;
}

// 2304A022: Register Eq_2 bl_onchiphci_send_2_controller(Register Eq_2 ra, Register (ptr32 Eq_256251) a0, Register Eq_2 a3, Register Eq_2 s3, Stack word32 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128, Register out Eq_256258 s1Out, Register out ptr32 a1Out, Register out Eq_256260 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      hci_driver_send
Eq_2 bl_onchiphci_send_2_controller(Eq_2 ra, struct Eq_256251 * a0, Eq_2 a3, Eq_2 s3, word32 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgF8, word32 dwArg0128, union Eq_256258 & s1Out, ptr32 & a1Out, union Eq_256260 & a4Out, ptr32 & mstatusOut)
{
	Eq_2 a1_38;
	Eq_2 s1_26;
	Eq_2 s2_15 = (word32) a0->b0014;
	if (s2_15 != 0x00)
	{
		if (s2_15 != 0x02)
			goto l2304A03E;
		a4 = (word32) a0->w000C;
		if (a4 > 0x03)
		{
			a4 = (word32) *(union Eq_2 *) 0x03;
			uint32 s2_65 = (word32) *(union Eq_2 *) 0x06 << 8 | (word32) (*((union Eq_2 *) 0x05));
			s1 = (word32) *(union Eq_2 *) 0x04 << 8 | a4;
			word32 a5_248;
			net_buf_simple_pull((word32) *(union Eq_2 *) 11 + 8, 0x04, out a1, out a5_248);
			if ((word32) a0->w000C >= s2_65)
			{
				a1_38 = (word32) (word12) s1;
				s1_26 = s1 >> 0x0C;
				s2_15.u0 = 0x01;
				goto l2304A0B2;
			}
		}
	}
	else
	{
		Eq_256260 a5_17 = (word32) a0->w000C;
		a4.u0 = 0x02;
		if (a5_17 <= 0x02)
			goto l2304A03E;
		s3 = a0->t0008;
		a4 = (word32) *((word32) s3 + 2);
		if (a5_17 >= a4)
		{
			s1_26 = (word32) *((word32) s3 + 1) << 8 | (word32) (*s3);
			word32 a5_247;
			word32 a1_246;
			net_buf_simple_pull(&a0->t0008, 0x03, out a1_246, out a5_247);
			uint32 a5_33 = (word32) s1_26 - 0x02000013 << 16;
			a1_38.u0 = 0x00;
			if (a5_33 >> 16 <= 0x1F)
			{
				a1_38 = s2_15;
				if ((0x01 << (a5_33 >> 16) & 0xA000E1CD) != 0x00)
					a1_38 = (word32) *a3;
			}
l2304A0B2:
			ra = bt_onchiphci_send(ra, s1_26, s2_15, a1_38, fp + -44, s3, dwArgAC, dwArgC8, dwArgF8, out s1, out a1, out a4, out mstatus);
l2304A040:
			0x00 = dwArg0128;
			s1Out = s1;
			a1Out = a1;
			a4Out = a4;
			mstatusOut = mstatus;
			return ra;
		}
	}
l2304A03E:
	goto l2304A040;
}

// 2304A10E: void hci_driver_send(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_256251) a0, Register Eq_2 a3, Register Eq_2 s3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack word32 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void hci_driver_send(Eq_2 ra, Eq_2 s0, struct Eq_256251 * a0, Eq_2 a3, Eq_2 s3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, word32 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	if ((word32) a0->w000C == 0x00)
	{
		word32 s1_177;
		word32 a0_178;
		word32 a1_179;
		word32 a2_180;
		word32 a3_181;
		word32 a4_182;
		word32 a5_183;
		word32 a7_184;
		word32 s2_185;
		word32 s3_186;
		word32 s4_187;
		word32 s5_188;
		word32 s6_189;
		word32 s7_190;
		word32 s8_191;
		word32 s9_192;
		word32 s10_193;
		word32 s11_194;
		word32 t4_195;
		printf(ra, &g_t230BAAC4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_177, out a0_178, out a1_179, out a2_180, out a3_181, out a4_182, out a5_183, out a7_184, out s2_185, out s3_186, out s4_187, out s5_188, out s6_189, out s7_190, out s8_191, out s9_192, out s10_193, out s11_194, out t4_195);
	}
	else
	{
		Eq_2 a4_17;
		Eq_2 a1_24;
		ptr32 mstatus_28;
		Eq_2 s1_30;
		word32 s0_162;
		word32 s1_163;
		word32 a0_164;
		word32 a1_165;
		word32 a2_166;
		word32 a3_167;
		word32 a4_168;
		word32 a5_169;
		word32 s2_170;
		word32 s3_171;
		word32 s4_172;
		word32 s5_173;
		word32 s6_174;
		word32 s8_175;
		word32 mstatus_176;
		net_buf_unref(bl_onchiphci_send_2_controller(ra, a0, a3, s3, dwArg9C, dwArgB8, dwArgE8, dwArg0118, out s1_30, out a1_24, out a4_17, out mstatus_28), s1_30, s1_30, a1_24, a4_17, mstatus_28, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_162, out s1_163, out a0_164, out a1_165, out a2_166, out a3_167, out a4_168, out a5_169, out s2_170, out s3_171, out s4_172, out s5_173, out s6_174, out s8_175, out mstatus_176);
	}
}

// 2304A146: void hci_driver_open(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void hci_driver_open(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	Eq_2 s3_22;
	word32 a3_72;
	word32 a4_73;
	word32 a5_74;
	word32 s2_75;
	word32 s1_76;
	word32 a0_77;
	word32 a3_78;
	word32 a4_79;
	word32 a5_80;
	word32 s2_81;
	word32 s3_82;
	k_thread_create(ra, k_queue_init(ra, 0x14, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out a3_72, out a4_73, out a5_74, out s2_75, out s3_22), 0x4202660C, 0x00FFFC00, 0x1C, s3_22, mstatus, dwLoc10, dwLoc0C, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_76, out a0_77, out a3_78, out a4_79, out a5_80, out s2_81, out s3_82);
}

// 2304A184: void recv_thread(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void recv_thread(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, word32 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 s0_10 = 0x4200F000;
	ra_12 = ra;
	while (true)
	{
		Eq_2 ra_12;
		Eq_2 a0_18;
		Eq_2 s2_27;
		word32 s4_170;
		word32 a5_168;
		word32 a1_166;
		word32 s8_171;
		word32 s3_169;
		word32 a2_167;
		Eq_2 s1_26 = net_buf_get(ra_12, s0_10, (word32) s0_10 - 332, ~0x00, a3, a4, mstatus, dwArg28, dwArgD8, dwArg0118, out a0_18, out a1_166, out a2_167, out a3, out a4, out a5_168, out s2_27, out s3_169, out s4_170, out s8_171);
		if (a0_18 != 0x00)
			ra_12 = bt_recv(ra_12, s1_26, a0_18, a3, a4, s2_27, mstatus, dwLoc08, dwArg08, dwArg18, dwArg20, dwArg24, dwArg28, dwArg30, dwArg40, dwArg44, dwArg48, dwArg54, dwArg68, dwArg6C, ra, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s0_10, out a3, out a4, out mstatus);
		k_yield();
	}
}

// 2304A1A4: void hci_driver_enque_recvq(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void hci_driver_enque_recvq(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	word32 a0_38;
	word32 a1_39;
	word32 a3_40;
	word32 a4_41;
	word32 a5_42;
	word32 s2_43;
	word32 s3_44;
	word32 s4_45;
	word32 s5_46;
	word32 s6_47;
	word32 s8_48;
	net_buf_put(ra, s0, 0x4200EEB4, a0, a4, a5, mstatus, dwArgE8, dwArg0128, dwArg0168, out a0_38, out a1_39, out a3_40, out a4_41, out a5_42, out s2_43, out s3_44, out s4_45, out s5_46, out s6_47, out s8_48);
}

// 2304A1B2: Register word32 hci_driver_init(Register Eq_2 a3)
// Called from:
//      cmd_stack_ble
word32 hci_driver_init(Eq_2 a3)
{
	return bt_hci_driver_register(a3);
}

// 2304A1CA: Register Eq_2 atomic_test_bit(Register Eq_2 a0, Register word32 a1)
// Called from:
//      notify_le_param_updated
//      bt_conn_create_le
//      bt_conn_le_param_update
//      bt_conn_init
Eq_2 atomic_test_bit(Eq_2 a0, word32 a1)
{
	return atomic_get(a0) >> a1 & 0x01;
}

// 2304A1E2: Register word32 tx_free(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_256736 s2Out, Register out (ptr32 Eq_256737) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      send_frag
//      conn_cleanup
//      tx_notify
//      bt_l2cap_send_cb
word32 tx_free(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_256736 & s2Out, struct Eq_256737 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	*((word32) a0 + 4) = 0x00;
	*((word32) a0 + 8) = 0x00;
	*((word32) a0 + 0x0C) = 0x00;
	ptr32 a1_14;
	ptr32 a3_16;
	ptr32 a4_17;
	ptr32 a5_18;
	word32 s1_22;
	Eq_256736 s2_23;
	struct Eq_256737 * s3_24;
	ptr32 s4_25;
	ptr32 s5_26;
	ptr32 s6_27;
	ptr32 s8_28;
	word32 a0_51;
	word32 a2_52;
	k_queue_append(0x4200EEC0, a4, a5, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_22, out a0_51, out a1_14, out a2_52, out a3_16, out a4_17, out a5_18, out s2_23, out s3_24, out s4_25, out s5_26, out s6_27, out s8_28);
	a1Out = a1_14;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_18;
	s2Out = s2_23;
	s3Out = s3_24;
	s4Out = s4_25;
	s5Out = s5_26;
	s6Out = s6_27;
	s8Out = s8_28;
	return s1_22;
}

// 2304A1FC: Register Eq_2 send_frag(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_256824) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_process_tx
Eq_2 send_frag(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0168, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, struct Eq_256824 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 a5_103;
	Eq_2 a4_191;
	Eq_2 a3_190;
	Eq_2 a1_105;
	struct Eq_256824 * s2_197;
	Eq_2 s6_201;
	ptr32 s4_106;
	ui32 s2_43;
	word32 a0_639;
	word32 a1_640;
	word32 a4_641;
	word32 s8_644;
	word32 a5_642;
	word32 s4_643;
	Eq_2 a3_165;
	Eq_2 s3_198;
	Eq_2 s1_196;
	Eq_2 s0_41 = k_sem_take(&g_t4200DDE4, ~0x00, a2, a3, a4, a5, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_196, out a0_639, out a1_640, out a3_165, out a4_641, out a5_642, out s2_43, out s3_198, out s4_643, out s8_644);
	ptr32 s5_128 = 0x4200E000;
	Eq_2 a4_166 = (word32) *((word32) s0_41 + 0x0D);
	Eq_2 a5_167 = 0x04;
	if (a4_166 == 0x04)
	{
		Eq_2 a4_55;
		Eq_2 a0_53 = net_buf_simple_push(0x04, 0x04, out a4_55);
		s2_197 = (word32) *s0_41;
		uint32 a2_61 = (word32) (word16) (s2_43 << 0x0C | s2_197);
		*a0_53 = (byte) a2_61;
		*((word32) a0_53 + 1) = (byte) (a2_61 >> 8);
		uint32 a5_67 = (word32) *((word32) s3_198 + 0x0C) + ~0x03 << 16;
		*((word32) a0_53 + 2) = (byte) (a5_67 >> 16);
		*((word32) a0_53 + 3) = (byte) (a5_67 >> 24);
		word32 a4_652;
		word32 a2_651;
		struct Eq_256960 * a5_75;
		irq_lock(a4_55, mstatus, out a2_651, out a4_652, out a5_75);
		if (s1_196 != 0x00)
		{
			*s1_196 = null;
			word32 s0_86 = a5_75->dw0018;
			if (a5_75 == null)
			{
				*((word32) s1_196 + 24) = s0_86;
				*((word32) s1_196 + 20) = s0_86;
				s6_201 = s6;
			}
			else
			{
				*s1_196 = a5_75;
				*((word32) s1_196 + 24) = s0_86;
				s6_201 = s6;
			}
		}
		else
		{
			word32 s0_76 = a5_75->dw0018;
			if (a5_75 != null)
			{
				s6_201 = &a5_75->ptr000C;
				a5_75 = a5_75->ptr000C;
			}
			else
				s6_201 = s0_76 + 28;
			*s6_201 = (char *) a5_75 + 1;
		}
		word32 a5_675;
		a3_190 = irq_unlock(a3_165, mstatus, out a4_191, out a5_675);
		*((word32) s3_198 + 20) = 0x02;
		a5_103 = bt_send();
		a1_105 = s3_198;
		if (s3_198 == 0x00)
		{
			s4_106 = 0x01;
			goto l2304A2DC;
		}
		Eq_2 a3_118;
		Eq_2 a4_119;
		struct Eq_256999 * s1_122;
		int32 * s6_129;
		word32 s7_661;
		word32 s8_662;
		word32 s9_663;
		word32 s10_664;
		word32 s11_665;
		word32 t4_666;
		word32 a1_654;
		word32 a2_655;
		word32 a5_656;
		word32 a7_657;
		word32 s2_658;
		word32 s3_659;
		word32 s4_660;
		word32 a0_653;
		ra = printf(ra, &g_t230BACB4, a3_190, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_122, out a0_653, out a1_654, out a2_655, out a3_118, out a4_119, out a5_656, out a7_657, out s2_658, out s3_659, out s4_660, out s5_128, out s6_129, out s7_661, out s8_662, out s9_663, out s10_664, out s11_665, out t4_666);
		word32 a4_668;
		word32 a2_667;
		struct Eq_256999 * a5_138;
		irq_lock(a4_119, mstatus, out a2_667, out a4_668, out a5_138);
		if (s1_122 != null)
		{
			struct Eq_256999 * a4_143 = null;
			for (; a5_138 != null; a5_138 = a5_138->ptr0000)
			{
				if (s1_122 == a5_138)
				{
					struct Eq_256999 * s1_149 = a5_138->ptr0000;
					if (a4_143 == null)
					{
						word32 s0_154 = a4_143->dw0018;
						a5_138->dw0014 = s0_154;
						if (s1_149 == a4_143)
							a5_138->dw0018 = s0_154;
					}
					else
					{
						a5_138->ptr0000 = a4_143;
						word32 s0_152 = a5_138->dw0018;
						if (s1_149 == a5_138)
							a4_143->dw0018 = s0_152;
					}
					s1_149->ptr0000 = null;
					break;
				}
				a4_143 = a5_138;
			}
		}
		else
			*s6_129 += ~0x00;
		a3_165 = irq_unlock(a3_118, mstatus, out a4_166, out a5_167);
	}
	word32 s0_645;
	word32 a0_646;
	word32 a2_647;
	word32 s11_650;
	word32 s8_648;
	word32 s10_649;
	ra = k_sem_give(ra, s5_128 + -540, a3_165, a4_166, a5_167, mstatus, dwLoc0C, dwLoc08, dwArg40, dwArg44, s1, dwArg74, dwArg8C, dwArgE8, dwArg0128, dwArg0168, out s0_645, out s1_196, out a0_646, out a1_105, out a2_647, out a3_190, out a4_191, out a5_103, out s2_197, out s3_198, out s4_106, out s5_128, out s6_201, out s7, out s8_648, out s9, out s10_649, out s11_650);
	if (s1_196 != 0x00)
	{
		word32 s8_669;
		s1_196 = tx_free(s1_196, a4_191, a5_103, mstatus, s4, s3, dwArgD8, dwArg0118, dwArg0158, out a1_105, out a3_190, out a4_191, out a5_103, out s2_197, out s3_198, out s4_106, out s5_128, out s6_201, out s8_669);
	}
	if (s4_106 != 0x00)
	{
		word32 s0_670;
		word32 a0_671;
		word32 a2_672;
		word32 s4_673;
		word32 s8_674;
		ra = net_buf_unref(ra, s1_196, s3_198, a1_105, a4_191, mstatus, s6, s4, s2, dwArg08, dwArg58, s3, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_670, out s1_196, out a0_671, out a1_105, out a2_672, out a3_190, out a4_191, out a5_103, out s2_197, out s3_198, out s4_673, out s5_128, out s6_201, out s8_674, out mstatus);
		s4_106 = 0x00;
	}
l2304A2DC:
	0x00 = (int8) dwArgA8;
	s0Out = s1;
	s1Out = s1_196;
	a0Out = s4_106;
	a1Out = a1_105;
	a3Out = a3_190;
	a4Out = a4_191;
	a5Out = a5_103;
	s2Out = s2_197;
	s3Out = s3_198;
	s4Out = dwArg04;
	s5Out = s5_128;
	s6Out = s6_201;
	s7Out = s7;
	s9Out = s9;
	mstatusOut = mstatus;
	return ra;
}

