pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304A334: void notify_connected(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8)
void notify_connected(Eq_2 ra, Eq_2 s0, Eq_2 a0, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8)
{
	<anonymous> * a5_18 = &g_t4200F000;
	struct Eq_257192 * s0_17 = g_ptr4200F454;
	Eq_2 s1_13 = a0;
	while (true)
	{
		word32 a1_16 = (word32) *((word32) s1_13 + 0x0C);
		if (s0_17 == null)
			break;
		struct Eq_257196 * s0_19 = *a5_18;
		if (a5_18 != null)
		{
			word32 a3_88;
			word32 a4_89;
			word32 a6_90;
			word32 a7_91;
			word32 s10_92;
			word32 s2_93;
			word32 s3_94;
			word32 s4_95;
			word32 s5_96;
			word32 s6_97;
			word32 s7_98;
			word32 s8_99;
			word32 s9_100;
			word32 t0_101;
			word32 t1_102;
			word32 t3_103;
			word32 t4_104;
			word32 t5_105;
			word32 t6_106;
			a5_18();
		}
		s0_17 = s0_19->ptr0018;
	}
	if (a1_16 != 0x00)
		return;
	bt_gatt_connected(ra, s0, s1_13, s11, mstatus, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg48, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8);
}

// 2304A372: Register Eq_2 bt_conn_reset_rx_state(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_257283 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      conn_cleanup
//      bt_conn_recv
Eq_2 bt_conn_reset_rx_state(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s1Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_257283 & s2Out, ptr32 & mstatusOut)
{
	if ((word32) *((word32) a0 + 0x0E) == 0x00)
	{
		s1Out = s1;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a1_18;
		ptr32 a3_20;
		Eq_2 a4_21;
		ptr32 mstatus_25;
		struct Eq_257297 * s0_27;
		Eq_2 s1_28;
		Eq_257283 s2_29;
		word32 a0_113;
		word32 a2_114;
		word32 a5_115;
		word32 s3_116;
		word32 s4_117;
		word32 s5_118;
		word32 s6_119;
		word32 s8_120;
		Eq_2 ra_26 = net_buf_unref(ra, s1, *((word32) a0 + 16), a1, a4, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_27, out s1_28, out a0_113, out a1_18, out a2_114, out a3_20, out a4_21, out a5_115, out s2_29, out s3_116, out s4_117, out s5_118, out s6_119, out s8_120, out mstatus_25);
		s0_27->dw0010 = 0x00;
		s0_27->w000E = 0x00;
		s1Out = s1_28;
		a1Out = a1_18;
		a3Out = a3_20;
		a4Out = a4_21;
		s2Out = s2_29;
		mstatusOut = mstatus_25;
		return ra_26;
	}
}

// 2304A398: Register Eq_2 conn_cleanup(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_2 s9Out, Register out Eq_2 mstatusOut)
// Called from:
//      bt_conn_prepare_events
//      bt_conn_process_tx
Eq_2 conn_cleanup(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & s1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_2 & s9Out, union Eq_2 & mstatusOut)
{
	Eq_2 s0_13 = a0;
	Eq_2 s2_14 = (word32) a0 + 52;
	ra_19 = ra;
	while (true)
	{
		Eq_2 ra_19;
		Eq_2 a0_25;
		Eq_2 a5_30;
		word32 a2_396;
		word32 a3_397;
		word32 s2_398;
		word32 s3_399;
		word32 s4_400;
		word32 s8_401;
		Eq_2 a1_26;
		Eq_2 a4_29;
		net_buf_get(ra_19, s0_13, s2_14, 0x00, a3, a4, mstatus, dwArg28, dwArgD8, dwArg0118, out a0_25, out a1_26, out a2_396, out a3_397, out a4_29, out a5_30, out s2_398, out s3_399, out s4_400, out s8_401);
		if (a0_25 == 0x00)
			break;
		Eq_2 s1_46 = *((word32) a0_25 + 20);
		if (a0_25 != 0x00)
		{
			word32 s8_395;
			word32 s6_394;
			word32 s5_393;
			word32 s4_392;
			word32 s3_391;
			word32 s2_390;
			word32 a5_389;
			word32 a3_388;
			s1_46 = tx_free(a0_25, a4_29, a5_30, mstatus, s0, ra, dwArgE8, dwArg0128, dwArg0168, out a1_26, out a3_388, out a4_29, out a5_389, out s2_390, out s3_391, out s4_392, out s5_393, out s6_394, out s8_395);
		}
		word32 s8_387;
		word32 s6_386;
		word32 s5_385;
		word32 s4_384;
		word32 s3_383;
		word32 a5_382;
		word32 a2_381;
		word32 a0_379;
		word32 a1_380;
		word32 s1_378;
		ra_19 = net_buf_unref(ra_19, s1_46, s1_46, a1_26, a4_29, mstatus, s2, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_13, out s1_378, out a0_379, out a1_380, out a2_381, out a3, out a4, out a5_382, out s2_14, out s3_383, out s4_384, out s5_385, out s6_386, out s8_387, out mstatus);
	}
	Eq_2 a3_108;
	Eq_2 a4_109;
	ptr32 mstatus_112;
	word32 a1_365;
	word32 s2_366;
	word32 s1_364;
	Eq_2 ra_113 = bt_conn_reset_rx_state(ra_19, s0_13, a0_25, s0_13, a1_26, a4_29, mstatus, dwArg08, dwArg58, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s1_364, out a1_365, out a3_108, out a4_109, out s2_366, out mstatus_112);
	Eq_2 a3_133;
	Eq_2 a4_134;
	Eq_2 a5_135;
	Eq_2 s2_138;
	word32 s8_375;
	word32 s5_373;
	word32 s6_374;
	word32 s3_371;
	word32 s4_372;
	word32 a1_369;
	word32 a2_370;
	word32 s1_367;
	word32 a0_368;
	k_delayed_work_submit(0x00, a3_108, a4_109, mstatus_112, s0, dwLoc08, dwArg14, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s1_367, out a0_368, out a1_369, out a2_370, out a3_133, out a4_134, out a5_135, out s2_138, out s3_371, out s4_372, out s5_373, out s6_374, out s8_375);
	ptr32 a3_158;
	Eq_2 a4_159;
	Eq_2 a5_160;
	Eq_2 s1_163;
	ptr32 s2_166;
	ptr32 s3_167;
	ptr32 s4_168;
	ptr32 s5_169;
	ptr32 s6_170;
	word32 s7_171;
	ptr32 s8_172;
	word32 s9_173;
	k_queue_free(ra_113, s2_138, a3_133, a4_134, a5_135, mstatus_112, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, dwArg0138, dwArg0178, out s1_163, out a3_158, out a4_159, out a5_160, out s2_166, out s3_167, out s4_168, out s5_169, out s6_170, out s7_171, out s8_172, out s9_173);
	((word32) *((word32) a5_160 + 92) + 52)->u0 = 0x00;
	if (a5_160 == 0x00)
	{
		0x00 = (int8) dwArg38;
		s1Out = s1_163;
		a3Out = a3_158;
		a4Out = a4_159;
		a5Out = a5_160;
		s2Out = s2_166;
		s3Out = s3_167;
		s4Out = s4_168;
		s5Out = s5_169;
		s6Out = s6_170;
		s7Out.u0 = <invalid>;
		s8Out = s8_172;
		s9Out.u0 = <invalid>;
		mstatusOut.u0 = <invalid>;
		return <invalid>;
	}
	else
	{
		0x00 = (int8) dwArg38;
		ptr32 a3_193;
		Eq_2 a4_194;
		Eq_2 a5_195;
		ptr32 s2_199;
		ptr32 s3_200;
		ptr32 s4_201;
		ptr32 s5_202;
		ptr32 s6_203;
		ptr32 s8_204;
		word32 a2_377;
		word32 a0_376;
		s1Out = k_delayed_work_del_timer(s1_163, a4_159, a5_160, mstatus_112, dwArg34, dwArgA8, dwArgB8, dwArgE8, dwArg0128, out a0_376, out a2_377, out a3_193, out a4_194, out a5_195, out s2_199, out s3_200, out s4_201, out s5_202, out s6_203, out s8_204);
		a3Out = a3_193;
		a4Out = a4_194;
		a5Out = a5_195;
		s2Out = s2_199;
		s3Out = s3_200;
		s4Out = s4_201;
		s5Out = s5_202;
		s6Out = s6_203;
		s7Out.u0 = <invalid>;
		s8Out = s8_204;
		s9Out.u0 = <invalid>;
		mstatusOut.u0 = <invalid>;
		return <invalid>;
	}
}

// 2304A400: Register Eq_2 tx_notify(Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out)
// Called from:
//      tx_complete_work
//      bt_conn_recv
Eq_2 tx_notify(Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out)
{
	while (true)
	{
		struct Eq_257594 * a5_19;
		word32 a2_168;
		word32 a4_169;
		Eq_2 a0_16 = irq_lock(a4, mstatus, out a2_168, out a4_169, out a5_19);
		Eq_2 s1_22 = *((word32) s0 + 32);
		if (s0 == 0x00)
			break;
		Eq_2 s0_24 = a5_19->t0000;
		Eq_2 s1_26 = *((word32) a3 + 36);
		a5_19->t0020 = s1_26;
		if (s0_24 == a3)
			a5_19->t0024 = s1_26;
		word32 a4_34;
		word32 a5_35;
		irq_unlock(a3, mstatus, out a4_34, out a5_35);
		word32 a4_49;
		word32 a5_50;
		<anonymous> * s2_55;
		s2_55();
	}
	ptr32 a4_99;
	word32 a5_160;
	Eq_2 a3_98 = irq_unlock(a3, mstatus, out a4_99, out a5_160);
	s1Out = s1_22;
	a0Out = a0_16;
	a1Out = a1;
	a3Out = a3_98;
	a4Out = a4_99;
	return s0;
}

// 2304A44C: void tx_complete_work(Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void tx_complete_work(Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	word32 s1_37;
	word32 a0_38;
	word32 a1_39;
	word32 a3_40;
	word32 a4_41;
	tx_notify(s0, a1, a3, a4, mstatus, dwArgD8, dwArg0118, dwArg0158, out s1_37, out a0_38, out a1_39, out a3_40, out a4_41);
}

