pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304A454: Register word32 bt_conn_get_pkts()
// Called from:
//      hci_num_completed_packets
word32 bt_conn_get_pkts()
{
	return 0x4200DDE4;
}

// 2304A45E: Register Eq_2 notify_le_param_updated(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Register out Eq_2 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      le_conn_update_complete
Eq_2 notify_le_param_updated(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, union Eq_2 & a4Out, ptr32 & mstatusOut)
{
	Eq_2 s0_11 = a0;
	if (atomic_test_bit((word32) a0 + 4, 0x09) != 0x00)
	{
		Eq_2 a5_18 = (word32) *((word32) a0 + 0x0086);
		a4 = (word32) *((word32) a0 + 0x0088);
		if (a5_18 >= a4)
		{
			a4 = (word32) *((word32) a0 + 0x008A);
			if (a4 >= a5_18)
			{
				a4 = *((word32) a0 + 0x008C);
				if (a4 == *((word32) a0 + 144))
				{
					word32 s4_127;
					word32 s8_128;
					word32 a1_124;
					word32 a5_126;
					word32 a2_125;
					word32 a0_123;
					atomic_and(a0, -513, a3, a4, mstatus, out a0_123, out a1_124, out a2_125, out a3, out a4, out a5_126, out s4_127, out s8_128);
				}
			}
		}
	}
	struct Eq_257677 * a5_37 = &g_t4200F000;
	struct Eq_257192 * s1_39 = g_ptr4200F454;
	while (s1_39 != null)
	{
		Eq_2 a4_59;
		struct Eq_257723 * s1_43 = a5_37->ptr000C;
		if (a5_37 != null)
		{
			word32 s4_65;
			word32 s8_66;
			a5_37();
			a4 = a4_59;
		}
		s1_39 = s1_43->ptr0018;
	}
	a4Out = a4;
	mstatusOut = mstatus;
	return a3;
}

// 2304A4CC: Register Eq_2 le_param_req(Register Eq_2 ra, Register ptr32 a0, Register (ptr32 Eq_257738) a1, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_257743) a5Out, Register out ptr32 s3Out)
// Called from:
//      le_conn_param_req
Eq_2 le_param_req(Eq_2 ra, ptr32 a0, struct Eq_257738 * a1, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_257743 & a5Out, ptr32 & s3Out)
{
	ptr32 s1_27;
	ptr32 s3_109 = a0;
	struct Eq_257738 * s2_18 = a1;
	ptr32 a3_23;
	ptr32 a4_100;
	struct Eq_257743 * a5_101;
	ptr32 a0_19 = bt_le_conn_params_valid(a1, out a3_23, out a4_100, out a5_101);
	if (a0_19 == 0x00)
	{
l2304A4E4:
		s1_27 = 0x00;
	}
	else
	{
		a5_101 = (struct Eq_257743 *) &g_t4200F000;
		struct Eq_257192 * s0_26 = g_ptr4200F454;
		s1_27 = a0_19;
		while (s0_26 != null)
		{
			struct Eq_257769 * s0_31 = a5_101->ptr0008;
			if (a5_101 != null)
			{
				word32 a0_41;
				a5_101();
				if (a0_41 == 0x00 || bt_le_conn_params_valid(s2_18, out a3_23, out a4_100, out a5_101) == 0x00)
					goto l2304A4E4;
			}
			s0_26 = s0_31->ptr0018;
		}
	}
	s1Out = s1_27;
	a0Out = s1_27;
	a3Out = a3_23;
	a4Out = a4_100;
	a5Out = a5_101;
	s3Out = s3_109;
	return ra;
}

// 2304A51C: Register ptr32 le_check_valid_conn(Register out ptr32 a5Out)
// Called from:
//      bt_disable
ptr32 le_check_valid_conn(ptr32 & a5Out)
{
	ptr32 a5_12 = 0x01;
	if (atomic_get(0x42015514) == 0x00)
		a5_12 = (word32) (atomic_get(0x420155B4) != 0x00);
	a5Out = a5_12;
	return a5_12;
}

// 2304A54C: Register Eq_2 bt_conn_identity_resolved(Register Eq_2 ra, Register Eq_2 a0, Register out Eq_2 s0Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      smp_ident_addr_info
Eq_2 bt_conn_identity_resolved(Eq_2 ra, Eq_2 a0, union Eq_2 & s0Out, ptr32 & s2Out, ptr32 & s3Out)
{
	Eq_2 s0_16 = a0;
	ptr32 s2_17 = (word32) a0 + 0x007E;
	if ((word32) *((word32) a0 + 3) != 0x00)
		s2_17 = (word32) a0 + 0x0077;
	struct Eq_257820 * a5_19 = &g_t4200F000;
	struct Eq_257192 * s1_21 = g_ptr4200F454;
	ptr32 s3_23 = (word32) a0 + 112;
	while (s1_21 != null)
	{
		struct Eq_257830 * s1_27 = a5_19->ptr0010;
		if (a5_19 != null)
			a5_19();
		s1_21 = s1_27->ptr0018;
	}
	s0Out = s0_16;
	s2Out = s2_17;
	s3Out = s3_23;
	return ra;
}

// 2304A594: Register Eq_2 bt_conn_le_start_encryption(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out Eq_257871 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_257874) s2Out, Register out Eq_2 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      smp_security_request
//      smp_pairing_random
//      bt_smp_start_security
Eq_2 bt_conn_le_start_encryption(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & s0Out, union Eq_257871 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, struct Eq_257874 & s2Out, union Eq_2 & s3Out, ptr32 & mstatusOut)
{
	ptr32 a3_37;
	Eq_2 a4_38;
	ptr32 mstatus_42;
	Eq_2 s1_45;
	struct Eq_257874 * s2_46;
	Eq_2 s3_47;
	Eq_2 s4_48;
	Eq_2 s5_49;
	uint16 * s6_50;
	word32 s0_295;
	word32 a1_296;
	word32 a5_297;
	word32 s8_298;
	Eq_2 ra_139 = bt_hci_cmd_create(ra, 0x1C, a3, a4, a5, mstatus, dwArg74, dwArg88, dwArgC8, dwArgE8, out s0_295, out s1_45, out a1_296, out a3_37, out a4_38, out a5_297, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s8_298, out mstatus_42);
	if (false)
	{
		0x00 = (int8) dwArgA8;
		s0Out = s1;
		a0Out.u0 = -55;
		a3Out = a3_37;
		a4Out = a4_38;
		s2Out = s2_46;
		s3Out = s3_47;
		mstatusOut = mstatus_42;
		return ra_139;
	}
	else
	{
		word32 a1_299;
		word32 a5_300;
		Eq_2 a0_71 = net_buf_simple_add(0x02000021, 0x1C, a4_38, out a1_299, out a5_300);
		uint32 a5_74 = (word32) *s6_50;
		*a0_71 = (byte) a5_74;
		*((word32) a0_71 + 1) = (byte) (a5_74 >> 8);
		word32 a1_301;
		word32 a2_302;
		word32 a3_303;
		word32 a4_304;
		word32 a5_305;
		word32 a6_306;
		word32 a7_307;
		memcpy((word32) a0_71 + 2, s5_49, 0x08, out a1_301, out a2_302, out a3_303, out a4_304, out a5_305, out a6_306, out a7_307);
		word32 a1_308;
		word32 a2_309;
		word32 a3_310;
		word32 a4_311;
		word32 a5_312;
		word32 a6_313;
		word32 a7_314;
		memcpy((word32) a0_71 + 0x0A, s4_48, 0x02, out a1_308, out a2_309, out a3_310, out a4_311, out a5_312, out a6_313, out a7_314);
		word32 a1_315;
		word32 a2_316;
		word32 a5_317;
		word32 a6_318;
		word32 a7_319;
		Eq_2 a4_115;
		Eq_2 a3_120;
		memcpy((word32) a0_71 + 0x0C, s3_47, s1_45, out a1_315, out a2_316, out a3_120, out a4_115, out a5_317, out a6_318, out a7_319);
		Eq_2 a5_128 = 0x0F;
		if (s1_45 <= 0x0F)
		{
			word32 t1_320;
			word32 a0_321;
			word32 a1_322;
			word32 a2_323;
			ra_139 = memset(ra_139, (word32) s1_45 + ((word32) a0_71 + 0x0C), 0x00, 0x10 - s1_45, out t1_320, out a0_321, out a1_322, out a2_323, out a3_120, out a4_115, out a5_128);
		}
		0x00 = (int8) dwArgA8;
		Eq_257871 a0_163;
		ptr32 a3_166;
		Eq_2 a4_167;
		ptr32 mstatus_171;
		Eq_2 s0_173;
		struct Eq_257874 * s2_177;
		Eq_2 s3_178;
		word32 s1_324;
		word32 a1_325;
		word32 a2_326;
		word32 a5_327;
		word32 s4_328;
		word32 s5_329;
		word32 s6_330;
		word32 s7_331;
		word32 s8_332;
		word32 s9_333;
		word32 s10_334;
		word32 s11_335;
		Eq_2 ra_172 = bt_hci_cmd_send_sync(ra_139, s1, 0x02000019, 0x02000019, a3_120, a4_115, a5_128, s5_49, mstatus_42, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg54, s1, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_173, out s1_324, out a0_163, out a1_325, out a2_326, out a3_166, out a4_167, out a5_327, out s2_177, out s3_178, out s4_328, out s5_329, out s6_330, out s7_331, out s8_332, out s9_333, out s10_334, out s11_335, out mstatus_171);
		s0Out = s0_173;
		a0Out = a0_163;
		a3Out = a3_166;
		a4Out = a4_167;
		s2Out = s2_177;
		s3Out = s3_178;
		mstatusOut = mstatus_171;
		return ra_172;
	}
}

// 2304A642: Register Eq_2 bt_conn_security_changed(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Register out (ptr32 Eq_257192) s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out Eq_258141 a4Out, Register out Eq_2 s2Out)
// Called from:
//      hci_encrypt_key_refresh_complete
//      hci_encrypt_change
//      smp_pairing_complete
//      bt_smp_request_ltk
Eq_2 bt_conn_security_changed(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 dwArg28, Eq_2 dwArg38, struct Eq_257192 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, union Eq_258141 & a4Out, union Eq_2 & s2Out)
{
	struct Eq_258143 * a5_19 = &g_t4200F000;
	struct Eq_257192 * s1_18 = g_ptr4200F454;
	Eq_2 s0_15 = a0;
	Eq_2 s2_17 = a1;
	while (s1_18 != null)
	{
		ptr32 a3_40;
		Eq_258141 a4_37;
		struct Eq_258152 * s1_21 = a5_19->ptr0014;
		if (a5_19 != null)
		{
			a5_19();
			a3 = a3_40;
			a4 = a4_37;
		}
		s1_18 = s1_21->ptr0018;
	}
	if (s2_17 == 0x00)
	{
		a4 = (word32) *((word32) s0_15 + 9);
		if (a4 > 0x01)
		{
			Eq_258169 a0_52 = (word32) *((word32) s0_15 + 8);
			0x00 = (int8) dwArg38;
			Eq_2 a1_53 = (word32) s0_15 + 112;
			Eq_2 a0_58;
			ptr32 a3_61;
			Eq_258141 a4_62;
			Eq_2 s2_65;
			s1Out = bt_keys_update_usage(a0_52, a1_53, dwArg28, out a0_58, out a3_61, out a4_62, out s2_65);
			a0Out = a0_58;
			a3Out = a3_61;
			a4Out = a4_62;
			s2Out = s2_65;
			return <invalid>;
		}
	}
	0x00 = (int8) dwArg38;
	s1Out = s1_18;
	a0Out = a0;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2_17;
	return <invalid>;
}

// 2304A69C: Register Eq_2 bt_conn_set_security(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register up32 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out Eq_258245 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_gatt_connected
//      ble_security
//      att_error_rsp
Eq_2 bt_conn_set_security(Eq_2 ra, Eq_2 s0, Eq_2 a0, up32 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, ptr32 & s1Out, union Eq_258245 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 a4_193 = (word32) *((word32) a0 + 0x0D);
	if (a4_193 != 0x04)
	{
		s1Out = s1;
		a0Out.u0 = -57;
		a3Out = a3;
		a4Out = a4_193;
		s2Out = s2;
		s3Out = s3;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_258245 a0_17 = 0x00;
		if ((word32) *((word32) a0 + 9) < a1 && (word32) (*((word32) a0 + 0x0A)) < a1)
		{
			Eq_2 a3_31;
			Eq_2 s4_35;
			Eq_2 s1_34;
			if ((int32) (byte) a1 < 0x00)
			{
				word32 a0_271;
				word32 a1_272;
				word32 a2_273;
				word32 a4_274;
				word32 a5_275;
				word32 s8_276;
				s1_34 = atomic_or(a0, 0x00FFF800, a3, a4_193, mstatus, out a0_271, out a1_272, out a2_273, out a3_31, out a4_274, out a5_275, out s4_35, out s8_276);
			}
			else
			{
				word32 a0_265;
				word32 a1_266;
				word32 a2_267;
				word32 a4_268;
				word32 a5_269;
				word32 s8_270;
				s1_34 = atomic_and(a0, ~0x00FFF800, a3, a4_193, mstatus, out a0_265, out a1_266, out a2_267, out a3_31, out a4_268, out a5_269, out s4_35, out s8_270);
			}
			*((word32) a0 + 0x0A) = (byte) (s1_34 & 0x007F);
			struct Eq_258313 * s0_73;
			ra = bt_smp_start_security(ra, a0, a0, a3_31, s2, s3, s4_35, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg58, dwArg5C, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD4, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_73, out s1, out a0_17, out a3, out a4_193, out s2, out s3, out mstatus);
			if (a0_17 != 0x00)
				s0_73->t000A = (byte) (word32) s0_73->b0009;
		}
		s1Out = s1;
		a0Out = a0_17;
		a3Out = a3;
		a4Out = a4_193;
		s2Out = s2;
		s3Out = s3;
		mstatusOut = mstatus;
		return ra;
	}
}

// 2304A710: Register Eq_2 bt_conn_get_security(Register Eq_2 a0)
// Called from:
//      bt_gatt_check_perm
//      update_ccc
//      bt_gatt_connected
Eq_2 bt_conn_get_security(Eq_2 a0)
{
	return (word32) *((word32) a0 + 9);
}

// 2304A716: Register word32 bt_conn_cb_register(Register (ptr32 word32) a0, Register Eq_2 a4)
// Called from:
//      blsync_ble_start
//      bt_mesh_proxy_init
//      ble_init
//      ble_tp_init
//      bl_ble_sync_start
word32 bt_conn_cb_register(word32 * a0, Eq_2 a4)
{
	word32 a5_6 = *a4;
	*a0 = a5_6;
	*((word32) a4 + 24) = a0;
	return a5_6;
}

