pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304A726: Register Eq_2 bt_conn_recv(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack word32 dwArg10, Stack word32 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_258460) a4Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_recv
Eq_2 bt_conn_recv(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, word32 dwArg10, word32 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & a3Out, struct Eq_258460 & a4Out, ptr32 & mstatusOut)
{
	Eq_2 a4_180;
	Eq_2 a1_177;
	Eq_2 ra_184;
	Eq_2 s1_185;
	struct Eq_258466 * a5_101;
	Eq_2 a4_122;
	Eq_2 a1_119;
	Eq_2 s1_125;
	Eq_2 ra_124;
	struct Eq_258471 * a0_21;
	Eq_2 a1_22;
	struct Eq_258473 * s1_30;
	struct Eq_258460 * a4_235;
	Eq_2 a3_234;
	Eq_2 s0_102 = tx_notify(a0, a1, a3, a4, mstatus, dwArgB8, dwArgF8, dwArg0138, out s1_30, out a0_21, out a1_22, out a3_234, out a4_235);
	if (a2 != 0x01)
	{
		if (a2 == 0x02)
		{
			struct Eq_258534 * s1_199 = a4_235->ptr0008;
			ui32 s2_203 = (word32) a4_235->b0001 << 8 | (word32) a4_235->b0000;
			if ((word32) *((word32) s0_102 + 0x0E) != 0x00)
			{
				Eq_2 a1_210;
				Eq_2 a4_213;
				Eq_2 s1_216;
				word32 a1_688;
				word32 s11_686;
				word32 t4_687;
				word32 s9_684;
				word32 s10_685;
				word32 s7_682;
				word32 s8_683;
				word32 s5_680;
				word32 s6_681;
				word32 s3_678;
				word32 s4_679;
				word32 a7_676;
				word32 s2_677;
				word32 a3_674;
				word32 a5_675;
				word32 a0_672;
				word32 a2_673;
				ra = bt_conn_reset_rx_state(printf(ra, &g_t230BAB64, a3_234, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_216, out a0_672, out a1_210, out a2_673, out a3_674, out a4_213, out a5_675, out a7_676, out s2_677, out s3_678, out s4_679, out s5_680, out s6_681, out s7_682, out s8_683, out s9_684, out s10_685, out s11_686, out t4_687), s0_102, s1_216, s0_102, a1_210, a4_213, mstatus, dwLoc08, dwArg48, s1, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_199, out a1_688, out a3_234, out a4_235, out s2_203, out mstatus);
			}
			uint32 a5_260 = s2_203 - (word32) s1_199->w000C + 0x04 << 16;
			*((word32) s0_102 + 0x0E) = (word16) (a5_260 >> 16);
			a5_101 = a5_260 >> 16;
			if (a5_260 >> 16 != 0x00)
			{
				s1_199->t0010 = s0_102;
				goto l2304A786;
			}
			goto l2304A814;
		}
		word32 s11_670;
		word32 t4_671;
		word32 s9_668;
		word32 s10_669;
		word32 s7_666;
		word32 s8_667;
		word32 s5_664;
		word32 s6_665;
		word32 s3_662;
		word32 s4_663;
		word32 a7_660;
		word32 s2_661;
		word32 a3_658;
		word32 a5_659;
		word32 a0_656;
		word32 a2_657;
		ra_124 = printf(ra, &g_t230BABE8, a3_234, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_125, out a0_656, out a1_119, out a2_657, out a3_658, out a4_122, out a5_659, out a7_660, out s2_661, out s3_662, out s4_663, out s5_664, out s6_665, out s7_666, out s8_667, out s9_668, out s10_669, out s11_670, out t4_671);
	}
	else
	{
		struct Eq_274 * a0_106;
		Eq_2 a5_46 = (word32) *((word32) s0_102 + 0x0E);
		if (a5_46 == 0x00)
			a0_106 = (struct Eq_274 *) &g_t230BAB84;
		else
		{
			Eq_2 s2_47 = (word32) s1_30->w000C;
			if (a5_46 < s2_47)
				a0_106 = (struct Eq_274 *) &g_t230BABA4;
			else
			{
				s0_102 = a0_21->t0010;
				Eq_2 a4_51;
				Eq_2 a0_50 = net_buf_simple_tailroom((char *) a0_21 + 8, out a4_51);
				if (a0_50 >= s2_47)
				{
					struct Eq_258789 * s0_53 = *((word32) a0_50 + 16);
					Eq_2 s1_55 = *((word32) a1_22 + 8);
					Eq_2 a1_58;
					word32 a2_734;
					word32 a3_735;
					word32 a4_736;
					word32 a5_737;
					net_buf_simple_add_mem((word32) a0_50 + 8, a1_22, (word32) s1_30->w000C, a4_51, out a1_58, out a2_734, out a3_735, out a4_736, out a5_737);
					Eq_2 a4_72 = (word32) *((word32) s1_55 + 0x0C);
					s0_53->w000E = (word16) ((word32) s0_53->w000E - a4_72);
					struct Eq_258829 * s1_87;
					word32 a0_738;
					word32 a1_739;
					word32 a2_740;
					word32 a5_741;
					word32 s2_742;
					word32 s3_743;
					word32 s4_744;
					word32 s5_745;
					word32 s6_746;
					word32 s8_747;
					ra = net_buf_unref(ra, s1_55, s1_55, a1_58, a4_72, mstatus, dwLoc20, dwLoc1C, s2, dwArg08, dwArg58, a2, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_102, out s1_87, out a0_738, out a1_739, out a2_740, out a3_234, out a4_235, out a5_741, out s2_742, out s3_743, out s4_744, out s5_745, out s6_746, out s8_747, out mstatus);
					a5_101 = (word32) *((word32) s0_102 + 0x0E);
					if (a5_101 != null)
					{
l2304A786:
						s0Out = s0_102;
						a3Out = a3_234;
						a4Out = a4_235;
						mstatusOut = mstatus;
						return ra;
					}
					s0_102 = s1_87->t0010;
					((word32) s0_102 + 0x0E)->u2 = 0x00;
					*((word32) s0_102 + 16) = 0x00;
l2304A814:
					Eq_2 s1_266 = a5_101->t0008;
					if (((word32) a5_101->b0001 << 8 | (word32) a5_101->b0000) + 4 == (word32) (*((word32) s1_266 + 0x0C)))
					{
						Eq_2 a3_292;
						struct Eq_258460 * a4_293;
						ptr32 mstatus_297;
						Eq_2 s0_299;
						Eq_2 ra_298 = bt_l2cap_recv(ra, s0_102, s1_266, a3_234, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg28, dwArg38, dwArg60, a2, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA4, dwArgAC, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out s0_299, out a3_292, out a4_293, out mstatus_297);
						s0Out = s0_299;
						a3Out = a3_292;
						a4Out = a4_293;
						mstatusOut = mstatus_297;
						return ra_298;
					}
					word32 a0_718;
					word32 a2_719;
					word32 a3_720;
					word32 a5_721;
					word32 a7_722;
					word32 s2_723;
					word32 s3_724;
					word32 s4_725;
					word32 s5_726;
					word32 s6_727;
					word32 s7_728;
					word32 s8_729;
					word32 s9_730;
					word32 s10_731;
					word32 s11_732;
					word32 t4_733;
					ra_184 = printf(ra, &g_t230BAC08, a3_234, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_185, out a0_718, out a1_177, out a2_719, out a3_720, out a4_180, out a5_721, out a7_722, out s2_723, out s3_724, out s4_725, out s5_726, out s6_727, out s7_728, out s8_729, out s9_730, out s10_731, out s11_732, out t4_733);
l2304A7AA:
					Eq_2 a3_358;
					struct Eq_258460 * a4_359;
					ptr32 mstatus_363;
					Eq_2 s0_365;
					word32 s8_699;
					word32 s6_698;
					word32 s4_696;
					word32 s5_697;
					word32 s2_694;
					word32 s3_695;
					word32 a2_692;
					word32 a5_693;
					word32 a0_690;
					word32 a1_691;
					word32 s1_689;
					Eq_2 ra_364 = net_buf_unref(ra_184, s1_185, s1_185, a1_177, a4_180, mstatus, dwArg00, dwArg04, dwArg08, dwArg28, dwArg78, dwArg84, dwArg98, dwArgA4, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out s0_365, out s1_689, out a0_690, out a1_691, out a2_692, out a3_358, out a4_359, out a5_693, out s2_694, out s3_695, out s4_696, out s5_697, out s6_698, out s8_699, out mstatus_363);
					s0Out = s0_365;
					a3Out = a3_358;
					a4Out = a4_359;
					mstatusOut = mstatus_363;
					return ra_364;
				}
				a0_106 = (struct Eq_274 *) &g_t230BABBC;
			}
		}
		word32 a5_703;
		word32 a3_702;
		word32 a2_701;
		word32 a0_700;
		word32 a7_704;
		word32 s2_705;
		word32 s3_706;
		word32 s4_707;
		word32 s5_708;
		word32 s6_709;
		word32 s7_710;
		word32 s8_711;
		word32 s9_712;
		word32 s10_713;
		word32 s11_714;
		word32 t4_715;
		ra_124 = printf(ra, a0_106, a3_234, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_125, out a0_700, out a1_119, out a2_701, out a3_702, out a4_122, out a5_703, out a7_704, out s2_705, out s3_706, out s4_707, out s5_708, out s6_709, out s7_710, out s8_711, out s9_712, out s10_713, out s11_714, out t4_715);
	}
	word32 a3_716;
	word32 s2_717;
	ra_184 = bt_conn_reset_rx_state(ra_124, s0_102, s1_125, s0_102, a1_119, a4_122, mstatus, dwLoc08, dwArg48, s1, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_185, out a1_177, out a3_716, out a4_180, out s2_717, out mstatus);
	goto l2304A7AA;
}

// 2304A85E: Register Eq_2 bt_conn_send_cb(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_258956 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_l2cap_send_cb
Eq_2 bt_conn_send_cb(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_258956 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 s9_120;
	ptr32 s8_108;
	ptr32 s7_119;
	ptr32 s6_107;
	ptr32 s5_106;
	ptr32 s4_105;
	ptr32 a1_174;
	Eq_258956 a0_121;
	ptr32 a3_176;
	ptr32 a4_177;
	ptr32 a5_178;
	Eq_2 ra_116;
	Eq_2 s1_102;
	ptr32 s10_117;
	ptr32 s11_118;
	ptr32 s2_103;
	ptr32 s3_104;
	Eq_2 a5_16 = 0x04;
	Eq_2 s0_18 = a1;
	if ((word32) *((word32) a0 + 0x0D) != 0x04)
	{
		Eq_2 a1_252;
		Eq_2 a4_255;
		Eq_2 s1_258;
		word32 a0_442;
		word32 a2_443;
		word32 a3_444;
		word32 a5_445;
		word32 a7_446;
		word32 s2_447;
		word32 s3_448;
		word32 s4_449;
		word32 s5_450;
		word32 s6_451;
		word32 s8_452;
		word32 t4_453;
		word32 s0_454;
		word32 a0_455;
		word32 a2_456;
		ra_116 = net_buf_unref(printf(ra, &g_t230BAC28, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_258, out a0_442, out a1_252, out a2_443, out a3_444, out a4_255, out a5_445, out a7_446, out s2_447, out s3_448, out s4_449, out s5_450, out s6_451, out s7_119, out s8_452, out s9_120, out s10_117, out s11_118, out t4_453), s1_258, a1, a1_252, a4_255, mstatus, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_454, out s1_102, out a0_455, out a1_174, out a2_456, out a3_176, out a4_177, out a5_178, out s2_103, out s3_104, out s4_105, out s5_106, out s6_107, out s8_108, out mstatus);
		goto l2304A888;
	}
	Eq_2 s2_23 = a0;
	if (a2 != 0x00)
	{
		struct Eq_259065 * a0_30;
		Eq_2 a3_33;
		Eq_2 s3_41;
		word32 s1_457;
		word32 a1_458;
		word32 a2_459;
		word32 a5_460;
		word32 s4_461;
		word32 s8_462;
		k_queue_get(0x4200EEC0, ~0x00, a3, a4, mstatus, a2, a3, dwArgC8, dwArg0108, out s1_457, out a0_30, out a1_458, out a2_459, out a3_33, out a4, out a5_460, out s2_23, out s3_41, out s4_461, out s8_462);
		s0_18 = a3;
		if (a0_30 == null)
		{
			Eq_2 a1_201;
			Eq_2 a4_204;
			Eq_2 s1_207;
			word32 a0_463;
			word32 a2_464;
			word32 a3_465;
			word32 a5_466;
			word32 a7_467;
			word32 s2_468;
			word32 s3_469;
			word32 s4_470;
			word32 s5_471;
			word32 s6_472;
			word32 s8_473;
			word32 t4_474;
			word32 s0_475;
			word32 a0_476;
			word32 a2_477;
			ra_116 = net_buf_unref(printf(ra, &g_t230BAC3C, a3_33, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_207, out a0_463, out a1_201, out a2_464, out a3_465, out a4_204, out a5_466, out a7_467, out s2_468, out s3_469, out s4_470, out s5_471, out s6_472, out s7_119, out s8_473, out s9_120, out s10_117, out s11_118, out t4_474), s1_207, a3, a1_201, a4_204, mstatus, dwLoc30, a2, dwLoc28, dwLoc08, dwArg48, a3, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_475, out s1_102, out a0_476, out a1_174, out a2_477, out a3_176, out a4_177, out a5_178, out s2_103, out s3_104, out s4_105, out s5_106, out s6_107, out s8_108, out mstatus);
			a0_121.u0 = -55;
			goto l2304A8C2;
		}
		a5_16 = (word32) *((word32) s2_23 + 0x0D);
		if (a5_16 != s3_41)
		{
			Eq_2 a1_127;
			Eq_2 a4_130;
			Eq_2 s1_133;
			Eq_2 a4_151;
			Eq_2 a5_152;
			Eq_2 s1_158;
			word32 a0_478;
			word32 a2_479;
			word32 a3_480;
			word32 a5_481;
			word32 a7_482;
			word32 s2_483;
			word32 s3_484;
			word32 s4_485;
			word32 s5_486;
			word32 s6_487;
			word32 s8_488;
			word32 t4_489;
			word32 s0_490;
			word32 a0_491;
			word32 a1_492;
			word32 a2_493;
			word32 a3_494;
			word32 s2_495;
			word32 s3_496;
			word32 s4_497;
			word32 s5_498;
			word32 s6_499;
			word32 s8_500;
			ra_116 = net_buf_unref(printf(ra, &g_t230BAC5C, a3_33, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_133, out a0_478, out a1_127, out a2_479, out a3_480, out a4_130, out a5_481, out a7_482, out s2_483, out s3_484, out s4_485, out s5_486, out s6_487, out s7_119, out s8_488, out s9_120, out s10_117, out s11_118, out t4_489), s1_133, a3, a1_127, a4_130, mstatus, dwLoc30, a2, dwLoc28, dwLoc08, dwArg48, a3, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_490, out s1_158, out a0_491, out a1_492, out a2_493, out a3_494, out a4_151, out a5_152, out s2_495, out s3_496, out s4_497, out s5_498, out s6_499, out s8_500, out mstatus);
			s1_102 = tx_free(s1_158, a4_151, a5_152, mstatus, a2, a3, dwArgC8, dwArg0108, dwArg0148, out a1_174, out a3_176, out a4_177, out a5_178, out s2_103, out s3_104, out s4_105, out s5_106, out s6_107, out s8_108);
l2304A888:
			a0_121.u0 = -57;
			goto l2304A8C2;
		}
		*((word32) dwArg74 + 4) = a0_30;
		*((word32) a3_33 + 8) = a0_30;
		a0_30->dw000C = 0x00;
		a0_30->t0014 = a3;
	}
	else
		*((word32) a1 + 20) = 0x00;
	Eq_2 a3_72;
	Eq_2 a4_73;
	Eq_2 a5_74;
	word32 a0_501;
	word32 a1_502;
	word32 s2_503;
	word32 s3_504;
	word32 s4_505;
	word32 s5_506;
	word32 s6_507;
	word32 s8_508;
	net_buf_put(ra, s0_18, (word32) s2_23 + 52, s0_18, a4, a5_16, mstatus, dwArgB8, dwArgF8, dwArg0138, out a0_501, out a1_502, out a3_72, out a4_73, out a5_74, out s2_503, out s3_504, out s4_505, out s5_506, out s6_507, out s8_508);
	word32 s0_509;
	word32 a0_510;
	word32 a2_511;
	ra_116 = k_sem_give(ra, 0x42026644, a3_72, a4_73, a5_74, mstatus, s0, dwLoc18, dwArg30, dwArg34, dwArg58, ra, dwArg7C, dwArgD8, dwArg0118, dwArg0158, out s0_509, out s1_102, out a0_510, out a1_174, out a2_511, out a3_176, out a4_177, out a5_178, out s2_103, out s3_104, out s4_105, out s5_106, out s6_107, out s7_119, out s8_108, out s9_120, out s10_117, out s11_118);
	a0_121.u0 = 0x00;
l2304A8C2:
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_102;
	a0Out = a0_121;
	a1Out = a1_174;
	a3Out = a3_176;
	a4Out = a4_177;
	a5Out = a5_178;
	s2Out = s2_103;
	s3Out = s3_104;
	s4Out = s4_105;
	s5Out = s5_106;
	s6Out = s6_107;
	s7Out = s7_119;
	s8Out = s8_108;
	s9Out = s9_120;
	s10Out = s10_117;
	s11Out = s11_118;
	mstatusOut = mstatus;
	return ra_116;
}

// 2304A91C: Register Eq_2 bt_conn_prepare_events(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      hci_tx_thread
Eq_2 bt_conn_prepare_events(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	g_dw4200DD30 = 0x00;
	ptr32 a5_121;
	Eq_2 a4_104 = k_poll_event_init(0x01, 0x00, &g_t4200DD28, out a5_121);
	Eq_2 a3_105 = 0x4200DD28;
	Eq_2 s2_131 = a0;
	Eq_2 s1_113 = 0x01;
	if (atomic_get(0x42015514) != 0x00)
	{
		if ((word32) g_b420154D9 != 0x00)
		{
l2304A960:
			a4_104 = (word32) g_b420154D9;
			a5_121 = 0x04;
			s1_113.u0 = 0x01;
			if (a4_104 == 0x04)
			{
				a4_104 = k_poll_event_init(0x03, 0x00, &g_t42015500, out a5_121);
				((word32) a0 + 32)->u0 = 0x01;
				a3_105.u0 = 0x42015500;
				s1_113.u0 = 0x02;
			}
			goto l2304A982;
		}
		ui32 a0_37;
		Eq_2 a4_41;
		word32 a1_388;
		word32 a2_389;
		word32 a5_390;
		word32 s8_392;
		word32 s4_391;
		atomic_and(0x420154CC, -65, 0x4200DD28, a4_104, mstatus, out a0_37, out a1_388, out a2_389, out a3_105, out a4_41, out a5_390, out s4_391, out s8_392);
		if ((a0_37 & 64) == 0x00)
			goto l2304A960;
		word32 s1_408;
		word32 s3_409;
		word32 s4_410;
		word32 s5_411;
		word32 s7_413;
		word32 s6_412;
		word32 s8_414;
		word32 s9_415;
		ra = conn_cleanup(ra, 0x420154CC, 0x420154CC, a3_105, a4_41, a0, mstatus, s2, dwLoc0C, dwLoc08, dwArg08, dwArg14, dwArg18, dwArg38, dwArg40, dwArg44, dwArg48, dwArg58, s3, s1, dwArg74, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s1_408, out a3_105, out a4_104, out a5_121, out s2_131, out s3_409, out s4_410, out s5_411, out s6_412, out s7_413, out s8_414, out s9_415, out mstatus);
		s1_113.u0 = 0x01;
	}
l2304A982:
	if (atomic_get(0x420155B4) == 0x00)
	{
l2304A9AC:
		s0Out = 0x420154CC;
		s1Out = s1_113;
		a4Out = a4_104;
		a5Out = a5_121;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		if ((word32) g_b42015579 == 0x00)
		{
			ui32 a0_107;
			Eq_2 a3_110;
			Eq_2 a4_111;
			word32 a1_393;
			word32 a2_394;
			word32 s4_396;
			word32 a5_395;
			word32 s8_397;
			s1_113 = atomic_and(0x420154CC, -65, a3_105, a4_104, mstatus, out a0_107, out a1_393, out a2_394, out a3_110, out a4_111, out a5_395, out s4_396, out s8_397);
			if ((a0_107 & 64) != 0x00)
			{
				word32 a3_398;
				word32 s3_400;
				word32 s2_399;
				word32 s4_401;
				word32 s5_402;
				word32 s7_404;
				word32 s6_403;
				word32 s8_405;
				word32 s9_406;
				ra = conn_cleanup(ra, 0x420154CC, 1107383660, a3_110, a4_111, s2_131, mstatus, s2, dwLoc0C, dwLoc08, dwArg08, dwArg14, dwArg18, dwArg38, dwArg40, dwArg44, dwArg48, dwArg58, s3, s1, dwArg74, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s1_113, out a3_398, out a4_104, out a5_121, out s2_399, out s3_400, out s4_401, out s5_402, out s6_403, out s7_404, out s8_405, out s9_406, out mstatus);
				goto l2304A9AC;
			}
		}
		a4_104 = (word32) g_b42015579;
		a5_121 = 0x04;
		if (a4_104 == 0x04)
		{
			word32 a5_407;
			a4_104 = k_poll_event_init(0x03, 0x00, &g_t420155A0, out a5_407);
			(word32) s2_131 + ((byte) s1_113.u0 + 20) + 0x0C = (word32) 0x01;
			s1_113 = (byte) s1_113.u0 + 1;
			a5_121 = 0x01;
		}
		goto l2304A9AC;
	}
}

