pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304AA04: Register Eq_2 bt_conn_add_le(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out (ptr32 Eq_259533) a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_259533) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      bt_conn_create_le
//      enh_conn_complete
Eq_2 bt_conn_add_le(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0108, union Eq_2 & s1Out, struct Eq_259533 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_259533 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	struct Eq_259533 * s2_126;
	Eq_2 s3_174 = a1;
	Eq_2 a0_23 = atomic_get(0x42015514);
	Eq_2 s1_173 = 0x420154CC;
	if (a0_23 != 0x00)
	{
		s2_126 = null;
		if (atomic_get(0x420155B4) != 0x00)
		{
l2304AAAC:
			s1Out = s1_173;
			a0Out = s2_126;
			a3Out = a3;
			a4Out = a4;
			s2Out = s2_126;
			s3Out = s3_174;
			s4Out = dwArg04;
			return ra;
		}
		a0_23.u0 = 0x01;
	}
	Eq_2 s0_31 = (word32) a0_23 + 0x00A0;
	Eq_2 a3_41;
	Eq_2 a4_42;
	word32 t1_196;
	word32 a0_197;
	word32 a1_198;
	word32 a2_199;
	word32 a5_200;
	ra = memset(ra, (word32) s0_31 + 1107383500, 0x00, 0x00A0, out t1_196, out a0_197, out a1_198, out a2_199, out a3_41, out a4_42, out a5_200);
	Eq_2 a3_58;
	Eq_2 a4_59;
	Eq_2 a3_77;
	Eq_2 a4_78;
	word32 a0_201;
	word32 a5_202;
	word32 s4_203;
	word32 s5_204;
	word32 a5_205;
	s1_173 = k_work_init((word32) k_delayed_work_init(ra, s0_31, (word32) s0_31 + 0x42015518, a3_41, a4_42, mstatus, dwArg74, dwArgA8, dwArgC8, dwArg0108, out a0_201, out a3_58, out a4_59, out a5_202, out s2_126, out s3_174, out s4_203, out s5_204) + ((word32) s0_31 + 40), a3_58, a4_59, mstatus, out a3_77, out a4_78, out a5_205);
	word32 s4_94;
	word32 a0_206;
	word32 a3_207;
	word32 a4_208;
	word32 s8_209;
	word32 s0_93 = atomic_set(s1_173, (word32 *) 0x01, a3_77, a4_78, mstatus, out a0_206, out a3_207, out a4_208, out s4_94, out s8_209);
	s2_126->b0008 = (byte) s4_94;
	word32 a1_210;
	word32 a2_211;
	word32 a5_212;
	word32 a6_213;
	word32 a7_214;
	memcpy((word32) s1_173 + (s0_93 + 112), s3_174, 0x07, out a1_210, out a2_211, out a3, out a4, out a5_212, out a6_213, out a7_214);
	s2_126->b0009 = 0x01;
	s2_126->b000A = 0x01;
	s2_126->b0002 = 0x01;
	s2_126->dw0088 = 0x00280018;
	goto l2304AAAC;
}

// 2304AABE: Register Eq_2 bt_conn_set_state(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_259682) s0Out, Register out Eq_259683 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_259686 a5Out, Register out (ptr32 Eq_259687) s2Out, Register out (ptr32 Eq_259688) s3Out, Register out Eq_259689 s4Out, Register out ptr32 s5Out, Register out Eq_259691 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_disconnect
//      bt_conn_create_le
//      bt_conn_init
//      hci_disconn_complete
//      le_adv_report
//      enh_conn_complete
Eq_2 bt_conn_set_state(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArg0118, struct Eq_259682 & s0Out, union Eq_259683 & s1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_259686 & a5Out, struct Eq_259687 & s2Out, struct Eq_259688 & s3Out, union Eq_259689 & s4Out, ptr32 & s5Out, union Eq_259691 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 s1_13 = (word32) *((word32) a0 + 0x0D);
	if (s1_13 != a1)
	{
		Eq_2 a0_22;
		*((word32) a0 + 0x0D) = (byte) a1;
		Eq_2 s2_17 = a1;
		if (s1_13 != 0x00)
		{
			a0_22 = a0;
			if (s1_13 == 0x03)
			{
				Eq_2 a4_30 = (word32) *((word32) a0 + 2);
				a0_22 = a0;
				if (a4_30 == 0x01)
				{
					word32 a2_249;
					word32 a4_250;
					word32 a5_251;
					word32 s3_252;
					word32 s4_253;
					word32 s5_254;
					word32 s6_255;
					word32 s8_256;
					s1_13 = k_delayed_work_cancel((word32) a0 + 76, a3, a4_30, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_22, out a1, out a2_249, out a3, out a4_250, out a5_251, out s2_17, out s3_252, out s4_253, out s5_254, out s6_255, out s8_256);
				}
			}
		}
		else
		{
			word32 a4_248;
			s1_13 = atomic_inc(a0, a3, a4, mstatus, out a0_22, out a3, out a4_248);
		}
		uint32 a5_57 = (word32) *((word32) a0 + 0x0D);
		if (a5_57 > 0x05)
		{
			0x00 = (int8) dwArg38;
			Eq_259686 a5_71;
			ptr32 a3_75;
			ptr32 a4_76;
			Eq_259683 s1_79;
			struct Eq_259687 * s2_82;
			struct Eq_259688 * s3_83;
			Eq_259689 s4_84;
			ptr32 s5_85;
			Eq_259691 s6_86;
			ptr32 s8_88;
			word32 a0_257;
			word32 a1_258;
			word32 a2_259;
			word32 a7_260;
			word32 s7_261;
			word32 s9_262;
			word32 s10_263;
			word32 s11_264;
			word32 t4_265;
			Eq_2 ra_78 = printf(ra, &g_t230BAC94, a3, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_79, out a0_257, out a1_258, out a2_259, out a3_75, out a4_76, out a5_71, out a7_260, out s2_82, out s3_83, out s4_84, out s5_85, out s6_86, out s7_261, out s8_88, out s9_262, out s10_263, out s11_264, out t4_265);
			s0Out = s0;
			s1Out = s1_79;
			a3Out = a3_75;
			a4Out = a4_76;
			a5Out = a5_71;
			s2Out = s2_82;
			s3Out = s3_83;
			s4Out = s4_84;
			s5Out = s5_85;
			s6Out = s6_86;
			s8Out = s8_88;
			mstatusOut = mstatus;
			return ra_78;
		}
		else
		{
			<anonymous> * a5_96 = *((char *) g_a230BAAE4 + a5_57 * 0x04);
			Eq_2 ra_102;
			struct Eq_259682 * s0_103;
			Eq_259683 s1_104;
			struct Eq_259687 * s2_105;
			Eq_259686 a5_110;
			ptr32 a4_111;
			ptr32 mstatus_112;
			ptr32 a3_113;
			word32 a6_114;
			struct Eq_259688 * s3_116;
			Eq_259689 s4_117;
			ptr32 s5_118;
			Eq_259691 s6_119;
			ptr32 s8_120;
			word32 t1_122;
			word32 t5_125;
			word32 t6_126;
			a5_96();
			s0Out = s0_103;
			s1Out = s1_104;
			a3Out = a3_113;
			a4Out = a4_111;
			a5Out = a5_110;
			s2Out = s2_105;
			s3Out = s3_116;
			s4Out = s4_117;
			s5Out = s5_118;
			s6Out = s6_119;
			s8Out = s8_120;
			mstatusOut = mstatus_112;
			return ra_102;
		}
	}
	else
	{
		0x00 = (int8) dwArg38;
		Eq_259686 a5_138;
		ptr32 a3_142;
		ptr32 a4_143;
		Eq_259683 s1_146;
		struct Eq_259687 * s2_149;
		struct Eq_259688 * s3_150;
		Eq_259689 s4_151;
		ptr32 s5_152;
		Eq_259691 s6_153;
		ptr32 s8_155;
		word32 a0_239;
		word32 a1_240;
		word32 a2_241;
		word32 a7_242;
		word32 s7_243;
		word32 s9_244;
		word32 s10_245;
		word32 s11_246;
		word32 t4_247;
		Eq_2 ra_145 = printf(ra, &g_t230BAC84, a3, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_146, out a0_239, out a1_240, out a2_241, out a3_142, out a4_143, out a5_138, out a7_242, out s2_149, out s3_150, out s4_151, out s5_152, out s6_153, out s7_243, out s8_155, out s9_244, out s10_245, out s11_246, out t4_247);
		s0Out = s0;
		s1Out = s1_146;
		a3Out = a3_142;
		a4Out = a4_143;
		a5Out = a5_138;
		s2Out = s2_149;
		s3Out = s3_150;
		s4Out = s4_151;
		s5Out = s5_152;
		s6Out = s6_153;
		s8Out = s8_155;
		mstatusOut = mstatus;
		return ra_145;
	}
}

// 2304AC8A: Register Eq_2 bt_conn_lookup_handle(Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out Eq_259869 a0Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_259869 s2Out, Register out Eq_2 s3Out, Register out Eq_259874 s4Out)
// Called from:
//      le_remote_feat_complete
//      le_conn_update_complete
//      hci_num_completed_packets
//      hci_encrypt_key_refresh_complete
//      hci_encrypt_change
//      hci_disconn_complete
//      le_ltk_request
//      le_conn_param_req
//      bt_recv
Eq_2 bt_conn_lookup_handle(Eq_2 a0, Eq_2 a3, ptr32 mstatus, union Eq_2 & s1Out, union Eq_259869 & a0Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_259869 & s2Out, union Eq_2 & s3Out, union Eq_259874 & s4Out)
{
	Eq_259869 s2_32;
	int32 s2_27;
	Eq_2 s0_10 = 0x42015514;
	Eq_2 s1_106 = 0x420154CC;
	if (atomic_get(0x42015514) != 0x00)
	{
		a4 = 0x01;
		if (((word32) g_b420154D9 + ~0x03 & 0x00FF) <= 0x01 && (word32) g_w420154CC == a0)
		{
			s2_27 = 0x00;
			goto l2304ACF2;
		}
	}
	s0_10.u0 = 0x420155B4;
	s2_32.u0 = 0x00;
	if (atomic_get(0x420155B4) == 0x00)
		goto l2304ACFA;
	a4 = 0x01;
	if (((word32) g_b42015579 + ~0x03 & 0x00FF) > 0x01 || (word32) g_w4201556C != a0)
	{
l2304ACFA:
		s1Out = s1_106;
		a0Out = s2_32;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2_32;
		s3Out = a0;
		s4Out = dwArg04;
		return s0_10;
	}
	s2_27 = 0x00A0;
l2304ACF2:
	s2_32 = s2_27 + 0x420154CC;
	word32 a0_119;
	s1_106 = atomic_inc(s0_10, a3, 0x01, mstatus, out a0_119, out a3, out a4);
	goto l2304ACFA;
}

// 2304AD0E: Register Eq_2 bt_conn_addr_le_cmp(Register Eq_2 a0, Register Eq_2 a1, Stack Eq_2 dwArg10, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_259941) a5Out)
// Called from:
//      bt_conn_lookup_addr_le
//      bt_conn_lookup_state_le
//      find_ccc_cfg
//      disconnected_cb
//      update_ccc
//      bt_gatt_subscribe
//      bt_gatt_unsubscribe
//      bt_gatt_notification
//      bt_gatt_connected
//      bt_gatt_disconnected
Eq_2 bt_conn_addr_le_cmp(Eq_2 a0, Eq_2 a1, Eq_2 dwArg10, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_259941 & a5Out)
{
	struct Eq_259941 * a5_18;
	ptr32 a3_19;
	ptr32 a4_20;
	word32 a1_68;
	word32 a2_69;
	Eq_2 a0_17 = memcmp(a1, (word32) a0 + 112, 0x07, out a1_68, out a2_69, out a3_19, out a4_20, out a5_18);
	if (a0_17 == 0x00)
	{
		a0Out = a0_17;
		a3Out = a3_19;
		a4Out = a4_20;
		a5Out = a5_18;
		return <invalid>;
	}
	else
	{
		Eq_2 a1_29 = (word32) a0 + 0x007E;
		if ((word32) *((word32) a0 + 3) != 0x00)
			a1_29 = (word32) a0 + 0x0077;
		struct Eq_259941 * a5_41;
		ptr32 a3_42;
		ptr32 a4_43;
		word32 a1_70;
		word32 a2_71;
		a0Out = memcmp(a1, a1_29, dwArg10, out a1_70, out a2_71, out a3_42, out a4_43, out a5_41);
		a3Out = a3_42;
		a4Out = a4_43;
		a5Out = a5_41;
		return <invalid>;
	}
}

// 2304AD50: Register word32 bt_conn_lookup_state_le.part.7(Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a3, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      bt_conn_lookup_state_le
word32 bt_conn_lookup_state_le.part.7(Eq_2 a0, ptr32 a1, Eq_2 a3, ptr32 mstatus, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 s1_179;
	Eq_2 s0_71;
	int32 a5_44;
	if (atomic_get(0x42015514) != 0x00)
	{
		a4 = (word32) g_b420154CE;
		a5 = 0x01;
		if (a4 != 0x01)
			goto l2304AD9E;
		if (a0 != 0x00)
		{
			word32 a0_30;
			bt_conn_addr_le_cmp(0x420154CC, a0, dwLoc10, out a0_30, out a3, out a4, out a5);
			if (a0_30 != 0x00)
				goto l2304AD9E;
		}
		a5 = (word32) g_b420154D9;
		if (a5 == a1)
		{
			a5_44 = 0x00;
l2304ADE2:
			s0_71 = a5_44 + 0x420154CC;
			word32 a0_206;
			s1_179 = atomic_inc(s0_71, a3, a4, mstatus, out a0_206, out a3, out a4);
			goto l2304ADE8;
		}
	}
l2304AD9E:
	s1_179.u0 = 0x42015000;
	if (atomic_get(0x420155B4) != 0x00)
	{
		a4 = (word32) g_b4201556E;
		a5 = 0x01;
		if (a4 != 0x01)
			goto l2304ADD8;
		if (a0 == 0x00)
		{
l2304ADBA:
			a5 = (word32) g_b42015579;
			if (a5 == a1)
			{
				a5_44 = 0x00A0;
				goto l2304ADE2;
			}
			goto l2304ADD8;
		}
		word32 a0_58;
		s1_179 = bt_conn_addr_le_cmp(1107383660, a0, dwLoc10, out a0_58, out a3, out a4, out a5);
		if (a0_58 == 0x00)
			goto l2304ADBA;
	}
l2304ADD8:
	s0_71.u0 = 0x00;
l2304ADE8:
	s1Out = s1_179;
	a0Out = s0_71;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = a0;
	s3Out = 0x42015000;
	s4Out = dwArg04;
	s8Out = s4;
	return s1;
}

