pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304ADFA: Register word32 bt_conn_lookup_addr_le(Register Eq_257674 a0, Register Eq_2 a1, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_260083) s2Out, Register out (ptr32 Eq_260084) s3Out, Register out ptr32 s4Out, Register out Eq_257674 s5Out, Register out ptr32 s8Out)
// Called from:
//      bt_conn_create_le
//      disconnected_cb
//      notify_cb
//      bt_unpair
//      ble_select_conn
//      ble_disconnect
word32 bt_conn_lookup_addr_le(Eq_257674 a0, Eq_2 a1, ptr32 mstatus, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_260083 & s2Out, struct Eq_260084 & s3Out, ptr32 & s4Out, union Eq_257674 & s5Out, ptr32 & s8Out)
{
	Eq_2 s1_154;
	Eq_2 s0_41;
	if (atomic_get(0x42015514) != 0x00)
	{
		a4 = (word32) g_b420154CE;
		if (a4 == 0x01 && (word32) g_b420154D4 == a0)
		{
			word32 a0_33;
			word32 a5_176;
			bt_conn_addr_le_cmp(0x420154CC, a1, dwLoc10, out a0_33, out a3, out a4, out a5_176);
			if (a0_33 == 0x00)
			{
				s0_41.u0 = 0x420154CC;
				goto l2304AE70;
			}
		}
	}
	s1_154.u0 = 0x420155B4;
	if (atomic_get(0x420155B4) != 0x00)
	{
		a4 = (word32) g_b4201556E;
		if (a4 == 0x01 && (word32) g_b42015574 == a0)
		{
			s0_41.u0 = 1107383660;
			word32 a0_56;
			word32 a5_177;
			s1_154 = bt_conn_addr_le_cmp(1107383660, a1, dwLoc10, out a0_56, out a3, out a4, out a5_177);
			if (a0_56 == 0x00)
			{
l2304AE70:
				word32 a0_178;
				s1_154 = atomic_inc(s0_41, a3, a4, mstatus, out a0_178, out a3, out a4);
l2304AE76:
				s1Out = s1_154;
				a0Out = s0_41;
				a2Out = dwArg48;
				a3Out = a3;
				a4Out = a4;
				s2Out = (struct Eq_260083 *) &g_w420154CC;
				s3Out = (struct Eq_260084 *) &g_w420154CC;
				s4Out = dwArg04;
				s5Out = a0;
				s8Out = s4;
				return s1;
			}
		}
	}
	s0_41.u0 = 0x00;
	goto l2304AE76;
}

// 2304AE94: Register word32 bt_conn_lookup_state_le(Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a3, Register ptr32 mstatus, Register out (ptr32 Eq_260164) s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_260169) s2Out, Register out (ptr32 Eq_260170) s3Out, Register out Eq_260171 s4Out, Register out ptr32 s8Out)
// Called from:
//      notify_cb
//      sc_indicate
//      find_pending_connect
//      bt_id_add
//      bt_id_del
//      bt_le_scan_update
//      le_adv_report
word32 bt_conn_lookup_state_le(Eq_2 a0, ptr32 a1, Eq_2 a3, ptr32 mstatus, struct Eq_260164 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_260169 & s2Out, struct Eq_260170 & s3Out, union Eq_260171 & s4Out, ptr32 & s8Out)
{
	ptr32 a0_7;
	struct Eq_260164 * s1_11;
	struct Eq_260169 * s2_12;
	struct Eq_260170 * s3_13;
	Eq_260171 s4_14;
	ptr32 s8_15;
	ptr32 a4_17;
	ptr32 a5_18;
	ptr32 a3_20;
	word32 s0_10 = bt_conn_lookup_state_le.part.7(a0, a1, a3, mstatus, out s1_11, out a0_7, out a3_20, out a4_17, out a5_18, out s2_12, out s3_13, out s4_14, out s8_15);
	s1Out = s1_11;
	a0Out = a0_7;
	a3Out = a3_20;
	a4Out = a4_17;
	a5Out = a5_18;
	s2Out = s2_12;
	s3Out = s3_13;
	s4Out = s4_14;
	s8Out = s8_15;
	return s0_10;
}

// 2304AE98: Register Eq_2 bt_conn_foreach(Register Eq_2 ra, Register Eq_2 s1, Register ui32 a0, Register (ptr32 code) a1, Register ptr32 a2, Register Eq_2 s4, Stack word32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Register out ptr32 s3Out)
// Called from:
//      bt_conn_disconnect_all
Eq_2 bt_conn_foreach(Eq_2 ra, Eq_2 s1, ui32 a0, <anonymous> * a1, ptr32 a2, Eq_2 s4, word32 dwArg00, word32 dwArg04, Eq_2 dwArg28, Eq_2 dwArg48, ptr32 & s3Out)
{
	word32 s1_32 = 0x42015000;
	ui32 s4_10 = a0;
	<anonymous> * s2_22 = a1;
	ptr32 s3_24 = a2;
	struct Eq_260211 * s0_26 = &g_w420154CC;
	if (atomic_get(0x42015514) != 0x00 && ((word32) g_b420154CE & a0) != 0x00)
	{
		word32 a5_41;
		word32 t1_44;
		a1();
	}
	if (atomic_get(&s0_26->b00A2 + 70) == 0x00 || ((word32) s0_26->b00A2 & s4_10) == 0x00)
	{
		s3Out = s3_24;
		return ra;
	}
	else
	{
		ptr32 s3_83;
		Eq_2 ra_84;
		word32 a5_87;
		word32 t1_90;
		s2_22();
		s3Out = s3_83;
		return ra_84;
	}
}

// 2304AF10: Register Eq_2 bt_conn_disconnect_all(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s4, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Register out ptr32 s3Out)
// Called from:
//      bt_unpair
Eq_2 bt_conn_disconnect_all(Eq_2 ra, Eq_2 s1, Eq_2 s4, Eq_2 dwArg08, Eq_2 dwArg28, ptr32 & s3Out)
{
	ptr32 s3_20;
	Eq_2 ra_26 = bt_conn_foreach(ra, s1, 0x07, &g_t2304B100, fp + ~0x10, s4, dwLoc20, dwLoc1C, dwArg08, dwArg28, out s3_20);
	s3Out = s3_20;
	return ra_26;
}

// 2304AF30: Register Eq_2 bt_conn_ref(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      bt_mesh_pb_gatt_open
//      proxy_connected
Eq_2 bt_conn_ref(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a3Out, ptr32 & a4Out)
{
	ptr32 a3_16;
	ptr32 a4_17;
	word32 a0_30;
	Eq_2 s1_19 = atomic_inc(a0, a3, a4, mstatus, out a0_30, out a3_16, out a4_17);
	a3Out = a3_16;
	a4Out = a4_17;
	return s1_19;
}

// 2304AF4A: Register word32 bt_conn_unref(Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a3Out, Register out (ptr32 Eq_227090) a4Out, Register out (ptr32 Eq_227091) a5Out)
// Called from:
//      bt_mesh_pb_gatt_close
//      proxy_disconnected
//      disconnected_cb
//      notify_cb
//      sc_indicate
//      le_remote_feat_complete
//      le_conn_update_complete
//      hci_num_completed_packets
//      hci_encrypt_key_refresh_complete
//      hci_encrypt_change
//      hci_disconn_complete
//      bt_unpair
//      bt_id_add
//      bt_id_del
//      bt_le_scan_update
//      le_adv_report
//      le_ltk_request
//      le_conn_param_req
//      enh_conn_complete
//      bt_recv
//      ble_select_conn
//      ble_disconnect
word32 bt_conn_unref(Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a3Out, struct Eq_227090 & a4Out, struct Eq_227091 & a5Out)
{
	ptr32 a3_11;
	struct Eq_227090 * a4_12;
	struct Eq_227091 * a5_13;
	word32 s1_14 = atomic_dec(s0, a3, a4, mstatus, out a3_11, out a4_12, out a5_13);
	a3Out = a3_11;
	a4Out = a4_12;
	a5Out = a5_13;
	return s1_14;
}

