pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304AF52: Register word32 bt_conn_get_dst(Register word32 a0)
// Called from:
//      blsync_connected
//      connected
//      disconnected
//      security_changed
//      auth_passkey_display
//      auth_passkey_entry
//      auth_passkey_confirm
//      auth_cancel
//      auth_pairing_confirm
//      auth_pairing_complete
//      auth_pairing_failed
word32 bt_conn_get_dst(word32 a0)
{
	return a0 + 112;
}

// 2304AF58: Register word32 bt_conn_get_info(Register (ptr32 Eq_260286) a0, Register Eq_2 a1)
// Called from:
//      bt_conn_get_remote_dev_info
word32 bt_conn_get_info(struct Eq_260286 * a0, Eq_2 a1)
{
	*a1 = (byte) (word32) a0->b0002;
	*((word32) a1 + 1) = (byte) (word32) a0->b0003;
	*((word32) a1 + 2) = (byte) (word32) a0->b0008;
	if ((word32) a0->b0002 != 0x01)
		return a3;
	a0->t0078 = a1;
	*((char *) g_a4200DD6B + (word32) a0->b0008) = (union Eq_2 *) a1;
	word32 a3_24 = (word32) a0->b0003;
	if (a3_24 == 0x00)
	{
		a0->t0083 = a1;
		a0->t008E = a1;
	}
	else
	{
		a0->t008A = a1;
		a0->t0087 = a1;
	}
	*((word32) a1 + 20) = (word16) (word32) a0->w0086;
	*((word32) a1 + 22) = (word16) (word32) a0->w008C;
	*((word32) a1 + 24) = (word16) (word32) a0->t008E;
	return a3_24;
}

// 2304AFCE: Register Eq_2 bt_conn_get_remote_dev_info(Register Eq_2 a0, Register out ptr32 a3Out)
// Called from:
//      ble_get_all_conn_info
Eq_2 bt_conn_get_remote_dev_info(Eq_2 a0, ptr32 & a3Out)
{
	Eq_2 a0_19 = atomic_get(0x42015514);
	Eq_2 s0_21 = a0_19;
	if (a0_19 != 0x00)
	{
		a3 = bt_conn_get_info(&g_w420154CC, a0);
		s0_21.u0 = 0x01;
	}
	if (atomic_get(0x420155B4) != 0x00)
	{
		s0_21 = (byte) s0_21.u0 + 1;
		a3 = bt_conn_get_info(&g_w4201556C, (word32) a0 + ((word32) s0_21 + 28));
	}
	a3Out = a3;
	return s0_21;
}

// 2304B02C: Register Eq_2 bt_conn_disconnect(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      proxy_sar_timeout
//      bt_mesh_proxy_prov_disable
//      bt_mesh_proxy_gatt_disconnect
//      disconnect_all
//      update_sec_level
//      bt_unpair
//      ble_disconnect
Eq_2 bt_conn_disconnect(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 s1_109;
	Eq_2 a4_105 = 0x04;
	Eq_2 a5_106 = (word32) *((word32) a0 + 0x0D) + ~0x00 & 0x00FF;
	if (a5_106 <= 0x04)
	{
		a4_105.u0 = 587967228;
		a5_106 = *((char *) g_a230BAAFC + a5_106 * 0x04);
		s2 = a1;
		s0 = a0;
		switch (a5_106)
		{
		case 0x00:
			*((word32) a0 + 0x0C) = (byte) a1;
			Eq_2 a3_260;
			Eq_2 a4_261;
			Eq_2 a5_262;
			Eq_2 s2_268;
			Eq_2 s3_269;
			ptr32 mstatus_281;
			Eq_2 s0_282;
			word32 s1_495;
			word32 s4_496;
			word32 s5_497;
			word32 s6_498;
			word32 s8_499;
			word32 s1_500;
			word32 a0_501;
			word32 s4_502;
			word32 s6_503;
			word32 s7_504;
			word32 s8_505;
			word32 s9_506;
			ra = bt_le_scan_update(bt_conn_set_state(ra, s1, a0, 0x00, a3, 587967228, mstatus, s2, dwLoc10, dwLoc0C, dwArg04, dwArg08, dwArg18, dwArg78, dwArg88, dwArg9C, dwArgB8, dwArgF8, out s0_282, out s1_495, out a3_260, out a4_261, out a5_262, out s2_268, out s3_269, out s4_496, out s5_497, out s6_498, out s8_499, out mstatus_281), s0_282, a3_260, a4_261, a5_262, s2_268, s3_269, mstatus_281, dwLoc20, dwLoc1C, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, dwArg4C, dwArg58, dwArg5C, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0, out s1_500, out a0_501, out a3, out a4_105, out a5_106, out s2, out s3, out s4_502, out s5, out s6_503, out s7_504, out s8_505, out s9_506, out mstatus);
			goto l2304B080;
		case 0x01:
			*((word32) a0 + 0x0C) = (byte) a1;
			Eq_2 a3_195;
			Eq_2 a4_196;
			ptr32 mstatus_216;
			Eq_2 s0_217;
			word32 s1_507;
			word32 a5_508;
			word32 s2_509;
			word32 s3_510;
			word32 s4_511;
			word32 s5_512;
			word32 s6_513;
			word32 s8_514;
			Eq_2 ra_199 = bt_conn_set_state(ra, s1, a0, 0x00, a3, 587967228, mstatus, s2, dwLoc10, dwLoc0C, dwArg04, dwArg08, dwArg18, dwArg78, dwArg88, dwArg9C, dwArgB8, dwArgF8, out s0_217, out s1_507, out a3_195, out a4_196, out a5_508, out s2_509, out s3_510, out s4_511, out s5_512, out s6_513, out s8_514, out mstatus_216);
			Eq_2 a3_229;
			Eq_2 a4_230;
			Eq_2 a5_231;
			ptr32 mstatus_234;
			Eq_2 s1_236;
			Eq_2 s2_239;
			Eq_2 s3_240;
			Eq_2 s4_241;
			ptr32 s5_242;
			Eq_2 a0_254;
			word32 s6_536;
			word32 s7_537;
			word32 s8_538;
			word32 s9_539;
			Eq_2 ra_235 = bt_le_adv_stop(ra_199, s0_217, a3_195, a4_196, mstatus_216, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, s3, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s1_236, out a0_254, out a3_229, out a4_230, out a5_231, out s2_239, out s3_240, out s4_241, out s5_242, out s6_536, out s7_537, out s8_538, out s9_539, out mstatus_234);
			s0Out = s0_217;
			s1Out = s1_236;
			a0Out = a0_254;
			a3Out = a3_229;
			a4Out = a4_230;
			a5Out = a5_231;
			s2Out = s2_239;
			s3Out = s3_240;
			s4Out = s4_241;
			s5Out = s5_242;
			mstatusOut = mstatus_234;
			return ra_235;
		case 0x02:
			Eq_2 a3_133;
			Eq_2 a4_134;
			Eq_2 a5_135;
			Eq_2 s2_137;
			word32 a0_515;
			word32 a1_516;
			word32 a2_517;
			word32 s3_518;
			word32 s4_519;
			word32 s5_520;
			word32 s6_521;
			word32 s8_522;
			k_delayed_work_cancel((word32) a0 + 76, a3, 587967228, mstatus, dwArg14, dwArg18, dwArg88, dwArg98, dwArgC8, dwArg0108, out a0_515, out a1_516, out a2_517, out a3_133, out a4_134, out a5_135, out s2_137, out s3_518, out s4_519, out s5_520, out s6_521, out s8_522);
			Eq_2 a0_162;
			Eq_2 a3_165;
			Eq_2 a4_166;
			Eq_2 a5_167;
			Eq_2 s1_171;
			Eq_2 s2_174;
			Eq_2 s3_175;
			Eq_2 s4_176;
			ptr32 s5_177;
			ptr32 mstatus_189;
			Eq_2 ra_170 = bt_hci_cmd_send(ra, a0, 0x0200000E, 0x00, a3_133, a4_134, a5_135, s2_137, mstatus, dwArg04, dwArg08, dwArg18, dwArg38, dwArg50, dwArg54, dwArg60, s3, s1, dwArg78, dwArg84, dwArg88, dwArg94, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, out s1_171, out a0_162, out a3_165, out a4_166, out a5_167, out s2_174, out s3_175, out s4_176, out s5_177, out mstatus_189);
			s0Out = a0;
			s1Out = s1_171;
			a0Out = a0_162;
			a3Out = a3_165;
			a4Out = a4_166;
			a5Out = a5_167;
			s2Out = s2_174;
			s3Out = s3_175;
			s4Out = s4_176;
			s5Out = s5_177;
			mstatusOut = mstatus_189;
			return ra_170;
		case 0x03:
			word32 s1_523;
			word32 a1_524;
			word32 s3_525;
			word32 s4_526;
			word32 s6_527;
			word32 s8_528;
			ra = bt_hci_cmd_create(ra, 0x03, a3, 587967228, a5_106, mstatus, dwArg74, dwArg88, dwArgC8, dwArgE8, out s0, out s1_523, out a1_524, out a3, out a4_105, out a5_106, out s2, out s3_525, out s4_526, out s5, out s6_527, out s8_528, out mstatus);
			s3.u0 = 1030;
			s1_109.u0 = -55;
			if (true)
			{
				word32 a1_529;
				word32 a5_530;
				Eq_2 a0_60 = net_buf_simple_add(0x040E, 0x03, a4_105, out a1_529, out a5_530);
				uint32 a5_63 = (word32) *s0;
				*((word32) a0_60 + 2) = (byte) s2;
				*a0_60 = (byte) a5_63;
				*((word32) a0_60 + 1) = (byte) (a5_63 >> 8);
				Eq_2 a0_70;
				word32 s1_531;
				word32 s4_532;
				ra = bt_hci_cmd_send(ra, s0, 1030, 1030, a3, a4_105, a5_63 >> 8, s2, mstatus, dwLoc1C, s2, dwLoc08, dwArg18, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg58, s3, s1, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s1_531, out a0_70, out a3, out a4_105, out a5_106, out s2, out s3, out s4_532, out s5, out mstatus);
				s1_109 = a0_70;
				if (a0_70 == 0x00)
				{
					word32 s4_533;
					word32 s6_534;
					word32 s8_535;
					ra = bt_conn_set_state(ra, a0_70, s0, 0x05, a3, a4_105, mstatus, s2, dwLoc10, dwLoc0C, dwArg04, dwArg08, dwArg18, dwArg78, dwArg88, dwArg9C, dwArgB8, dwArgF8, out s0, out s1_109, out a3, out a4_105, out a5_106, out s2, out s3, out s4_533, out s5, out s6_534, out s8_535, out mstatus);
				}
			}
			break;
		case 0x04:
l2304B080:
			s1_109.u0 = 0x00;
			break;
		}
	}
	else
		s1_109.u0 = -57;
	s0Out = s0;
	s1Out = s1_109;
	a0Out = s1_109;
	a3Out = a3;
	a4Out = a4_105;
	a5Out = a5_106;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	mstatusOut = mstatus;
	return ra;
}

// 2304B100: void disconnect_all(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 byte) a1, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
void disconnect_all(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, byte * a1, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	Eq_2 a3_5 = (word32) *((word32) a0 + 8);
	if (a3_5 != (word32) (*a1) || (word32) (*((word32) a0 + 0x0D)) != 0x04)
		return;
	word32 mstatus_182;
	word32 s5_181;
	word32 s3_179;
	word32 s4_180;
	word32 s2_178;
	word32 a5_177;
	word32 a4_176;
	word32 a3_175;
	word32 a0_174;
	word32 s1_173;
	word32 s0_172;
	bt_conn_disconnect(ra, s0, s1, a0, 0x13, a3_5, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg60, dwArg74, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg8C, dwArg94, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, out s0_172, out s1_173, out a0_174, out a3_175, out a4_176, out a5_177, out s2_178, out s3_179, out s4_180, out s5_181, out mstatus_182);
}

// 2304B11E: Register Eq_2 bt_conn_create_le(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_257738) a1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out Eq_2 a3Out)
// Called from:
//      ble_connect
Eq_2 bt_conn_create_le(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, struct Eq_257738 * a1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, union Eq_2 & a0Out, union Eq_2 & a3Out)
{
	Eq_2 s0_151;
	byte bLoc18_289 = (byte) s2;
	word24 nLoc17_301 = SLICE(s2, word24, 8);
	if (atomic_test_bit(0x4200DDCC, 0x01) == 0x00)
	{
l2304B13C:
		s0_151.u0 = 0x00;
		goto l2304B180;
	}
	word32 a5_497;
	word32 a4_496;
	if (bt_le_conn_params_valid(a1, out a3, out a4_496, out a5_497) == 0x00 || atomic_test_bit(0x4200DDCC, 11) != 0x00)
		goto l2304B13C;
	Eq_257674 a0_36 = atomic_test_bit(0x4200DDCC, 0x0F);
	if (a0_36 != 0x00)
		goto l2304B13C;
	Eq_2 a4_132;
	Eq_2 s1_138;
	Eq_2 a0_41;
	struct Eq_260978 * s1_45;
	Eq_2 s2_46;
	word32 a4_499;
	word32 a2_498;
	word32 s4_501;
	word32 s3_500;
	word32 s8_503;
	word32 s5_502;
	bt_conn_lookup_addr_le(a0_36, a0, mstatus, out s1_45, out a0_41, out a2_498, out a3, out a4_499, out s2_46, out s3_500, out s4_501, out s5_502, out s8_503);
	s0_151 = a0_41;
	Eq_2 dwLoc18_302 = s2;
	if (a0_41 != 0x00)
	{
		word32 a5_152 = (word32) *((word32) a0_41 + 0x0D);
		if (a5_152 == 0x01)
		{
			*((word32) a0_41 + 0x0088) = (word16) (word32) s1_45->w0000;
			((word32) a0_41 + 0x008A)->u2 = (word16) (word32) s1_45->w0002;
			*((word32) a0_41 + 0x008C) = (word16) (word32) s1_45->w0004;
			((word32) a0_41 + 0x008E)->u2 = (word16) (word32) s1_45->w0006;
			goto l2304B180;
		}
		if (a5_152 != 0x00)
		{
			if ((a5_152 + ~0x02 & 0x00FF) > 0x01)
			{
				word32 a4_520;
				word32 a5_521;
				atomic_dec(a0_41, a3, 0x01, mstatus, out a3, out a4_520, out a5_521);
				goto l2304B13C;
			}
			goto l2304B180;
		}
		word32 s2_509;
		word32 a7_508;
		word32 a5_507;
		word32 a2_506;
		word32 a1_505;
		word32 a0_504;
		word32 s3_510;
		word32 s4_511;
		word32 s5_512;
		word32 s6_513;
		word32 s7_514;
		word32 s8_515;
		word32 s9_516;
		word32 s10_517;
		word32 s11_518;
		word32 t4_519;
		ra = printf(ra, &g_t230BAB10, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_138, out a0_504, out a1_505, out a2_506, out a3, out a4_132, out a5_507, out a7_508, out s2_509, out s3_510, out s4_511, out s5_512, out s6_513, out s7_514, out s8_515, out s9_516, out s10_517, out s11_518, out t4_519);
	}
	else
	{
		if (((word32) *s2_46 + ~0x01 & 0x00FF) <= 0x01)
		{
			word32 a1_535;
			word32 a2_536;
			word32 a3_537;
			word32 a4_538;
			word32 a5_539;
			word32 a6_540;
			word32 a7_541;
			memcpy(fp + ~0x17, s2_46, 0x07, out a1_535, out a2_536, out a3_537, out a4_538, out a5_539, out a6_540, out a7_541);
			dwLoc18_302 = SEQ(nLoc17_301, (byte) ((word32) bLoc18_289 + ~0x01));
		}
		else
		{
			Eq_2 a0_63;
			word32 s1_522;
			word32 s2_523;
			word32 s3_524;
			word32 s4_525;
			word32 s5_526;
			word32 s8_527;
			ra = bt_lookup_id_addr(ra, a0_41, s2_46, out s1_522, out a0_63, out s2_523, out s3_524, out s4_525, out s5_526, out s8_527);
			word32 a1_528;
			word32 a2_529;
			word32 a3_530;
			word32 a4_531;
			word32 a5_532;
			word32 a6_533;
			word32 a7_534;
			memcpy(fp + ~0x17, a0_63, 0x07, out a1_528, out a2_529, out a3_530, out a4_531, out a5_532, out a6_533, out a7_534);
		}
		Eq_2 a0_128;
		word32 s2_560;
		word32 s3_561;
		word32 s4_562;
		ra = bt_conn_add_le(ra, mstatus, dwArg54, dwArg88, dwArgA8, dwArgE8, out s1_138, out a0_128, out a3, out a4_132, out s2_560, out s3_561, out s4_562);
		s0_151 = a0_128;
		if (a0_128 == 0x00)
			goto l2304B13C;
	}
	*((byte) s0_151.u0 + 0x0088) = (word16) (word32) *s1_138;
	((byte) s0_151.u0 + 0x008A)->u2 = (word16) (word32) *((word32) s1_138 + 2);
	*((byte) s0_151.u0 + 0x008C) = (word16) (word32) *((word32) s1_138 + 4);
	((byte) s0_151.u0 + 0x008E)->u2 = (word16) (word32) *((word32) s1_138 + 6);
	Eq_2 a3_207;
	Eq_2 a4_208;
	Eq_2 a5_209;
	Eq_2 s2_215;
	Eq_2 s3_216;
	ptr32 mstatus_228;
	Eq_2 s0_229;
	word32 s1_542;
	word32 s4_543;
	word32 s5_544;
	word32 s6_545;
	word32 s8_546;
	word32 s1_547;
	word32 a0_548;
	word32 a4_549;
	word32 a5_550;
	word32 s2_551;
	word32 s3_552;
	word32 s4_553;
	word32 s5_554;
	word32 s6_555;
	word32 s7_556;
	word32 s8_557;
	word32 s9_558;
	word32 mstatus_559;
	ra = bt_le_scan_update(bt_conn_set_state(ra, s1_138, s0_151, 0x01, a3, a4_132, mstatus, dwLoc18_302, dwLoc10, dwLoc0C, dwArg04, dwArg08, dwArg18, dwArg78, dwArg88, dwArg9C, dwArgB8, dwArgF8, out s0_229, out s1_542, out a3_207, out a4_208, out a5_209, out s2_215, out s3_216, out s4_543, out s5_544, out s6_545, out s8_546, out mstatus_228), s0_229, a3_207, a4_208, a5_209, s2_215, s3_216, mstatus_228, dwLoc20, dwLoc1C, dwLoc18_302, s0, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, dwArg4C, dwArg58, dwArg5C, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_151, out s1_547, out a0_548, out a3, out a4_549, out a5_550, out s2_551, out s3_552, out s4_553, out s5_554, out s6_555, out s7_556, out s8_557, out s9_558, out mstatus_559);
l2304B180:
	a0Out = s0_151;
	a3Out = a3;
	return ra;
}

