pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304B23A: Register Eq_2 bt_conn_le_conn_update(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_261317) s1Out, Register out Eq_261318 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_le_param_update
Eq_2 bt_conn_le_conn_update(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, struct Eq_261317 & s1Out, union Eq_261318 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & mstatusOut)
{
	ptr32 a3_29;
	Eq_2 a4_30;
	ptr32 mstatus_34;
	struct Eq_261317 * s1_37;
	word32 s2_38;
	uint16 * s4_40;
	Eq_2 s5_41;
	word32 s0_206;
	word32 a1_207;
	word32 a5_208;
	word32 s3_209;
	word32 s6_210;
	word32 s8_211;
	Eq_2 ra_35 = bt_hci_cmd_create(ra, 0x0E, a3, a4, a5, mstatus, dwArg74, dwArg88, dwArgC8, dwArgE8, out s0_206, out s1_37, out a1_207, out a3_29, out a4_30, out a5_208, out s2_38, out s3_209, out s4_40, out s5_41, out s6_210, out s8_211, out mstatus_34);
	if (false)
	{
		s1Out = s1_37;
		a0Out.u0 = -55;
		a3Out = a3_29;
		a4Out = a4_30;
		mstatusOut = mstatus_34;
		return s1;
	}
	else
	{
		word32 a1_212;
		word32 a5_213;
		Eq_2 a0_62 = net_buf_simple_add(0x0200001B, 0x0E, a4_30, out a1_212, out a5_213);
		Eq_2 a3_71;
		Eq_2 a4_72;
		word32 t1_214;
		word32 a0_215;
		word32 a1_216;
		word32 a2_217;
		word32 a5_218;
		Eq_2 ra_74 = memset(ra_35, a0_62, 0x00, 0x0E, out t1_214, out a0_215, out a1_216, out a2_217, out a3_71, out a4_72, out a5_218);
		uint32 a5_77 = (word32) *s4_40;
		*a0_62 = (byte) a5_77;
		*((word32) a0_62 + 1) = (byte) (a5_77 >> 8);
		uint32 a5_83 = (word32) s1_37->w0000;
		*((word32) a0_62 + 2) = (byte) a5_83;
		*((word32) a0_62 + 3) = (byte) (a5_83 >> 8);
		uint32 a5_87 = (word32) s1_37->w0002;
		*((word32) a0_62 + 4) = (byte) a5_87;
		*((word32) a0_62 + 5) = (byte) (a5_87 >> 8);
		uint32 a5_91 = (word32) s1_37->w0004;
		*((word32) a0_62 + 6) = (byte) a5_91;
		*((word32) a0_62 + 7) = (byte) (a5_91 >> 8);
		uint32 a5_95 = (word32) s1_37->w0006;
		*((word32) a0_62 + 8) = (byte) a5_95;
		*((word32) a0_62 + 9) = (byte) (a5_95 >> 8);
		Eq_261318 a0_106;
		ptr32 a3_109;
		Eq_2 a4_110;
		ptr32 mstatus_114;
		Eq_2 s0_116;
		struct Eq_261317 * s1_117;
		word32 a1_219;
		word32 a2_220;
		word32 a5_221;
		word32 s2_222;
		word32 s3_223;
		word32 s4_224;
		word32 s5_225;
		word32 s6_226;
		word32 s7_227;
		word32 s8_228;
		word32 s9_229;
		word32 s10_230;
		word32 s11_231;
		bt_hci_cmd_send_sync(ra_74, s1, s2_38 + 19, 0x02000013, a3_71, a4_72, a5_95 >> 8, s5_41, mstatus_34, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg54, s1, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_116, out s1_117, out a0_106, out a1_219, out a2_220, out a3_109, out a4_110, out a5_221, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_227, out s8_228, out s9_229, out s10_230, out s11_231, out mstatus_114);
		s1Out = s1_117;
		a0Out = a0_106;
		a3Out = a3_109;
		a4Out = a4_110;
		mstatusOut = mstatus_114;
		return s0_116;
	}
}

// 2304B2E2: Register Eq_2 send_conn_le_param_update(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      conn_update_timeout
//      bt_conn_le_param_update
Eq_2 send_conn_le_param_update(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & mstatusOut)
{
	Eq_2 a5_19;
	if (((word32) g_b4200DDD0 & 0x02) != 0x00)
	{
		ui32 a5_18 = (word32) *((word32) a0 + 0x0094);
		a5_19 = a5_18 & 0x02;
		if ((a5_18 & 0x02) != 0x00 && atomic_test_bit((word32) a0 + 4, 0x0A) == 0x00)
		{
l2304B322:
			Eq_2 a0_48;
			Eq_2 a3_51;
			Eq_2 a4_52;
			ptr32 mstatus_56;
			struct Eq_261623 * s1_59;
			struct Eq_261624 * s0_58 = bt_conn_le_conn_update(ra, a1, a3, a4, a5_19, mstatus, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg44, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s1_59, out a0_48, out a3_51, out a4_52, out mstatus_56);
			if (a0_48 == 0x00)
			{
				s0_58->w0090 = (word16) (word32) s1_59->w0004;
				s0_58->w0092 = (word16) (word32) s1_59->w0006;
			}
			a0Out = a0_48;
			a3Out = a3_51;
			a4Out = a4_52;
			mstatusOut = mstatus_56;
			return ra_57;
		}
	}
	a5_19 = (word32) *((word32) a0 + 3);
	if (a5_19 != 0x00)
	{
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg16 = <invalid>;
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg32 = <invalid>;
		Eq_2 stackArg36 = <invalid>;
		Eq_2 stackArg40 = <invalid>;
		Eq_2 stackArg48 = <invalid>;
		Eq_2 stackArg52 = <invalid>;
		Eq_2 stackArg56 = <invalid>;
		Eq_2 stackArg84 = <invalid>;
		Eq_2 stackArg88 = <invalid>;
		Eq_2 stackArg92 = <invalid>;
		Eq_2 stackArg124 = <invalid>;
		Eq_2 stackArg132 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg152 = <invalid>;
		Eq_2 stackArg168 = <invalid>;
		Eq_2 stackArg184 = <invalid>;
		Eq_2 stackArg200 = <invalid>;
		Eq_2 stackArg216 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		Eq_2 stackArg264 = <invalid>;
		Eq_2 stackArg280 = <invalid>;
		Eq_2 stackArg296 = <invalid>;
		Eq_2 stackArg312 = <invalid>;
		word32 a3_297;
		word32 a4_298;
		word32 mstatus_299;
		bt_l2cap_update_conn_param(ra, s1, a3, s2, s5, mstatus, stackArg16, stackArg20, stackArg32, stackArg36, stackArg40, stackArg48, stackArg52, stackArg56, stackArg84, stackArg88, stackArg92, stackArg124, stackArg132, stackArg136, stackArg152, stackArg168, stackArg184, stackArg200, stackArg216, stackArg232, stackArg248, stackArg264, stackArg280, stackArg296, stackArg312, out a3_297, out a4_298, out mstatus_299);
		a0Out = a0;
		a3Out = a3;
		a4Out = a4;
		mstatusOut = mstatus;
		return ra;
	}
	goto l2304B322;
}

