pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304B346: void conn_update_timeout(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void conn_update_timeout(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg64, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	word32 a5_13 = (word32) *((word32) a0 - 63);
	Eq_2 s0_14 = a0;
	if (a5_13 == 0x00)
	{
		Eq_2 a3_132;
		Eq_2 a4_133;
		word32 s1_137 = bt_l2cap_disconnected(ra, a0, a4, a5_13, mstatus, dwArg04, dwArg78, dwArg88, dwArgB8, dwArgF8, out a3_132, out a4_133);
		struct Eq_257192 * s2_152;
		for (s2_152 = g_ptr4200F454; s2_152 != null; s2_152 = s2_152->ptr0018)
		{
			<anonymous> * a5_155 = s2_152->ptr0004;
			if (a5_155 != null)
			{
				word32 a2_180;
				word32 a7_181;
				word32 s10_182;
				word32 s11_183;
				word32 s3_184;
				word32 s5_185;
				word32 s6_186;
				word32 s7_187;
				word32 s9_188;
				word32 t0_189;
				word32 t1_190;
				word32 t4_191;
				word32 t5_192;
				word32 t6_193;
				word32 tp_194;
				a5_155();
			}
		}
		word32 a4_435;
		word32 a5_436;
		word32 a3_434;
		atomic_dec(s0_14, a3_132, a4_133, mstatus, out a3_434, out a4_435, out a5_436);
	}
	else
	{
		Eq_2 a4_16 = (word32) *((word32) a0 - 74);
		if (a4_16 == 0x01)
		{
			Eq_2 a5_18 = (word32) *((word32) a0 - 73);
			if (a5_18 == 0x00)
			{
				word32 mstatus_450;
				word32 s5_449;
				word32 s4_448;
				word32 s3_447;
				word32 s2_446;
				word32 a5_445;
				word32 a4_444;
				word32 a3_443;
				word32 a0_442;
				word32 s1_441;
				bt_hci_cmd_send(ra, a0, 0x0200000E, 0x00, a3, a4_16, a5_18, s2, mstatus, dwLoc1C, s2, dwLoc08, dwArg18, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg58, dwArg64, s1, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s1_441, out a0_442, out a3_443, out a4_444, out a5_445, out s2_446, out s3_447, out s4_448, out s5_449, out mstatus_450);
			}
			else
			{
				Eq_2 a1_38;
				ui32 a0_24;
				Eq_2 a3_27;
				Eq_2 a4_28;
				struct Eq_261772 * a5_29;
				word32 s8_440;
				word32 a1_437;
				word32 a2_438;
				word32 s4_439;
				Eq_2 s1_30 = atomic_and(a0, -513, a3, a4_16, mstatus, out a0_24, out a1_437, out a2_438, out a3_27, out a4_28, out a5_29, out s4_439, out s8_440);
				if ((a0_24 & 0x0200) != 0x00)
				{
					a1_38 = fp + ~0x1F;
					s0_14 = a5_29->t0044;
				}
				else
					a1_38 = fp + ~0x17;
				Eq_2 a3_58;
				Eq_2 a4_59;
				ptr32 mstatus_63;
				word32 a0_451;
				send_conn_le_param_update(ra, s1_30, a1_38, a3_27, a4_28, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out a0_451, out a3_58, out a4_59, out mstatus_63);
				word32 a2_454;
				word32 a1_453;
				word32 a0_452;
				word32 a3_455;
				word32 a4_456;
				word32 a5_457;
				word32 s4_458;
				word32 s8_459;
				atomic_or(s0_14, 0x0100, a3_58, a4_59, mstatus_63, out a0_452, out a1_453, out a2_454, out a3_455, out a4_456, out a5_457, out s4_458, out s8_459);
			}
		}
	}
}

// 2304B3F6: Register Eq_2 bt_conn_le_param_update(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_257674 a0Out, Register out ptr32 a3Out)
// Called from:
//      ble_conn_update
Eq_2 bt_conn_le_param_update(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_257674 & a0Out, ptr32 & a3Out)
{
	ptr32 a3_112;
	Eq_257674 s2_119;
	Eq_2 a5_15 = (word32) *((word32) a0 + 0x0086);
	Eq_2 a4_17 = (word32) *a1;
	if (a5_15 >= a4_17)
	{
		a4_17 = (word32) *((word32) a1 + 2);
		if (a4_17 >= a5_15)
		{
			a4_17 = (word32) *((word32) a0 + 0x008C);
			if (a4_17 == (word32) (*((word32) a1 + 4)))
			{
				a4_17 = (word32) *((word32) a0 + 0x008E);
				if (a4_17 == (word32) (*((word32) a1 + 6)))
				{
					word32 s8_307;
					word32 a5_305;
					word32 s4_306;
					word32 a2_303;
					word32 a4_304;
					word32 a0_301;
					word32 a1_302;
					atomic_and(a0, -513, a3, a4_17, mstatus, out a0_301, out a1_302, out a2_303, out a3_112, out a4_304, out a5_305, out s4_306, out s8_307);
					s2_119.u0 = -69;
					goto l2304B440;
				}
			}
		}
	}
	if ((word32) *((word32) a0 + 3) != 0x00)
	{
		Eq_257674 a0_31 = atomic_test_bit((word32) a0 + 4, 0x08);
		s2_119 = a0_31;
		if (a0_31 == 0x00)
		{
			*((word32) a0 + 0x0088) = (word16) (word32) *a1;
			((word32) a0 + 0x008A)->u2 = (word16) (word32) *((word32) a1 + 2);
			*((word32) a0 + 144) = (word16) (word32) *((word32) a1 + 4);
			*((word32) a0 + 0x0092) = (word16) (word32) *((word32) a1 + 6);
			word32 a1_309;
			word32 a2_310;
			word32 a0_308;
			word32 a5_312;
			word32 a4_311;
			word32 s8_314;
			word32 s4_313;
			atomic_or(a0, 0x0200, a3, a4_17, mstatus, out a0_308, out a1_309, out a2_310, out a3_112, out a4_311, out a5_312, out s4_313, out s8_314);
l2304B440:
			a0Out = s2_119;
			a3Out = a3_112;
			return ra;
		}
	}
	Eq_257674 a0_79;
	ptr32 a3_82;
	word32 mstatus_316;
	word32 a4_315;
	Eq_2 ra_88 = send_conn_le_param_update(ra, a0, a1, a3, a4_17, mstatus, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg44, s3, s1, ra, dwArg78, dwArg7C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out a0_79, out a3_82, out a4_315, out mstatus_316);
	a0Out = a0_79;
	a3Out = a3_82;
	return ra_88;
}

