pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304B4A6: Register Eq_2 bt_conn_create_pdu_timeout(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_262059) s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      create_frag.isra.11
//      l2cap_create_le_sig_pdu.isra.7
//      bt_l2cap_create_pdu_timeout
//      l2cap_chan_le_send
Eq_2 bt_conn_create_pdu_timeout(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0108, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, struct Eq_262059 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a1_128;
	ptr32 a0_31;
	Eq_2 a5_36;
	ptr32 mstatus_39;
	word32 s0_174;
	word32 a1_175;
	word32 s4_176;
	word32 s8_177;
	ptr32 s1_137;
	Eq_2 a3_130;
	ptr32 a4_131;
	struct Eq_262059 * s2_144;
	ptr32 s3_145;
	ptr32 s5_146;
	ptr32 s6_147;
	Eq_2 ra_136 = net_buf_alloc_fixed(ra, a2, a3, a4, a5, s5, mstatus, dwArg94, dwArgA8, dwArgE8, dwArg0108, out s0_174, out s1_137, out a0_31, out a1_175, out a3_130, out a4_131, out a5_36, out s2_144, out s3_145, out s4_176, out s5_146, out s6_147, out s8_177, out mstatus_39);
	Eq_2 a2_129 = a2;
	if (a0_31 == 0x00)
	{
		word32 a0_178;
		word32 a5_179;
		word32 a7_180;
		word32 s4_181;
		word32 s8_182;
		word32 s10_183;
		word32 t4_184;
		ra_136 = printf(ra_136, &g_t230BAB3C, a3_130, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_137, out a0_178, out a1_128, out a2_129, out a3_130, out a4_131, out a5_179, out a7_180, out s2_144, out s3_145, out s4_181, out s5_146, out s6_147, out s7, out s8_182, out s9, out s10_183, out s11, out t4_184);
	}
	else
		a1_128 = net_buf_simple_reserve(s1_137 + 5, a5_36);
	s0Out = a0_31;
	s1Out = s1_137;
	a1Out = a1_128;
	a2Out = a2_129;
	a3Out = a3_130;
	a4Out = a4_131;
	s2Out = s2_144;
	s3Out = s3_145;
	s5Out = s5_146;
	s6Out = s6_147;
	s7Out = s7;
	s9Out = s9;
	s11Out = s11;
	mstatusOut = mstatus_39;
	return ra_136;
}

// 2304B4EE: Register Eq_2 create_frag.isra.11(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_262172 s2Out, Register out (ptr32 Eq_262173) s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_process_tx
Eq_2 create_frag.isra.11(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_262172 & s2Out, struct Eq_262173 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_262172 s2_114;
	ptr32 a5_101;
	ptr32 a4_106;
	Eq_2 s1_113;
	Eq_2 a1_28;
	Eq_2 s1_37;
	ptr32 s7_54;
	ptr32 s9_55;
	word32 s0_224;
	word32 a2_225;
	word32 a3_226;
	word32 a4_227;
	word32 s2_228;
	word32 s5_229;
	word32 s11_230;
	ptr32 mstatus_110;
	struct Eq_262173 * s3_115;
	ptr32 s6_118;
	Eq_2 ra_111 = bt_conn_create_pdu_timeout(ra, 0x00, ~0x00, a3, a4, a5, s5, mstatus, s2, dwArg30, dwArg34, dwArg58, dwArg74, dwArg7C, dwArg88, dwArgC8, dwArgE8, out s0_224, out s1_37, out a1_28, out a2_225, out a3_226, out a4_227, out s2_228, out s3_115, out s5_229, out s6_118, out s7_54, out s9_55, out s11_230, out mstatus_110);
	Eq_2 a4_56 = (word32) *s1_37;
	if (a4_56 != 0x04)
	{
		word32 s0_231;
		word32 a0_232;
		word32 a1_233;
		word32 a2_234;
		word32 a3_235;
		word32 s4_236;
		word32 s5_237;
		word32 s8_238;
		ra_111 = net_buf_unref(ra_111, s1_37, 0x00, a1_28, a4_56, mstatus_110, dwLoc20, s4, s2, dwArg08, dwArg58, s3, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_231, out s1_113, out a0_232, out a1_233, out a2_234, out a3_235, out a4_106, out a5_101, out s2_114, out s3_115, out s4_236, out s5_237, out s6_118, out s8_238, out mstatus_110);
	}
	else
	{
		((union Eq_2 *) 20)->u0 = 0x00;
		s2_114.u0 = 8;
		Eq_2 a4_66;
		if ((word32) g_w4200DDE0 < net_buf_simple_tailroom(8, out a4_66))
			s1_113 = (word32) g_w4200DDE0;
		else
			s1_113 = (word32) (word16) net_buf_simple_tailroom(8, out a4_66);
		word32 a1_239;
		word32 a2_240;
		word32 a3_241;
		word32 a5_242;
		net_buf_simple_add_mem(8, s3_115->t0008, s1_113, a4_66, out a1_239, out a2_240, out a3_241, out a4_106, out a5_242);
		word32 a1_243;
		net_buf_simple_pull(&s3_115->t0008, s1_113, out a1_243, out a5_101);
	}
	s1Out = s1_113;
	a0Out = 0x00;
	a4Out = a4_106;
	a5Out = a5_101;
	s2Out = s2_114;
	s3Out = s3_115;
	s4Out = dwArg04;
	s6Out = s6_118;
	s7Out = s7_54;
	s9Out = s9_55;
	mstatusOut = mstatus_110;
	return ra_111;
}

// 2304B576: Register Eq_2 bt_conn_process_tx(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_262349) a5Out, Register out (ptr32 Eq_262350) s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      hci_tx_thread
Eq_2 bt_conn_process_tx(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a3Out, union Eq_2 & a4Out, struct Eq_262349 & a5Out, struct Eq_262350 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	if ((word32) *((word32) a0 + 0x0D) == 0x00)
	{
		ui32 a0_22;
		word32 a2_595;
		word32 a5_596;
		word32 a1_594;
		word32 s4_597;
		word32 s8_598;
		atomic_and(a0, -65, a3, a4, mstatus, out a0_22, out a1_594, out a2_595, out a3, out a4, out a5_596, out s4_597, out s8_598);
		if ((a0_22 & 64) != 0x00)
		{
			ptr32 a3_303;
			Eq_2 a4_304;
			struct Eq_262349 * a5_305;
			ptr32 mstatus_308;
			Eq_2 s1_310;
			struct Eq_262350 * s2_313;
			ptr32 s3_314;
			Eq_2 s4_315;
			ptr32 s5_316;
			ptr32 s6_317;
			ptr32 s7_318;
			ptr32 s8_319;
			ptr32 s9_320;
			Eq_2 ra_309 = conn_cleanup(ra, a0, a0, a3, a4, s2, mstatus, dwArg08, dwArg14, dwArg18, dwArg28, dwArg34, dwArg38, dwArg58, dwArg60, s3, s1, dwArg78, dwArg84, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, out s1_310, out a3_303, out a4_304, out a5_305, out s2_313, out s3_314, out s4_315, out s5_316, out s6_317, out s7_318, out s8_319, out s9_320, out mstatus_308);
			s0Out = a0;
			s1Out = s1_310;
			a3Out = a3_303;
			a4Out = a4_304;
			a5Out = a5_305;
			s2Out = s2_313;
			s3Out = s3_314;
			s4Out = s4_315;
			s5Out = s5_316;
			s6Out = s6_317;
			s7Out = s7_318;
			s8Out = s8_319;
			s9Out = s9_320;
			mstatusOut = mstatus_308;
			return ra_309;
		}
	}
	Eq_2 a0_42;
	Eq_2 a4_46;
	word32 s8_593;
	word32 a5_591;
	word32 a2_589;
	word32 s2_592;
	word32 a3_590;
	word32 a1_588;
	Eq_2 s3_144;
	Eq_2 s4_145;
	net_buf_get(ra, a0, (word32) a0 + 52, 0x00, a3, a4, mstatus, dwArg18, dwArgC8, dwArg0108, out a0_42, out a1_588, out a2_589, out a3_590, out a4_46, out a5_591, out s2_592, out s3_144, out s4_145, out s8_593);
	Eq_2 s1_121 = a0_42;
	if (a0_42 == 0x00)
	{
		word32 a5_599;
		user_vAssertCalled(a4_46, mstatus, out a5_599);
	}
	ptr32 s7_102;
	ptr32 s9_104;
	Eq_2 a4_126;
	Eq_2 a1_112;
	Eq_2 ra_120;
	Eq_2 a2_196;
	Eq_2 a5_160 = 0x4200E000;
	Eq_2 a3_69 = (word32) *((word32) a0_42 + 0x0C);
	Eq_2 a4_159 = (word32) g_w4200DDE0;
	Eq_2 s2_143 = 0x4200DD60;
	if (a4_159 >= a3_69)
	{
		a2_196.u0 = 0x00;
		ra_120 = ra;
l2304B5DA:
		word32 a0_219;
		ptr32 a3_222;
		struct Eq_262349 * a5_224;
		Eq_2 s0_228;
		struct Eq_262350 * s2_232;
		ptr32 s3_233;
		ptr32 s5_235;
		ptr32 s6_236;
		word32 s4_603;
		ra_120 = send_frag(ra_120, s1_121, a2_196, 0x00, a4_159, a5_160, s2_143, s3_144, s4_145, s6, mstatus, s2, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, s3, ra, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, out s0_228, out s1_121, out a0_219, out a1_112, out a3_222, out a4_126, out a5_224, out s2_232, out s3_233, out s4_603, out s5_235, out s6_236, out s7_102, out s9_104, out mstatus);
		if (a0_219 != 0x00)
		{
			s0Out = s0_228;
			s1Out = s1_121;
			a3Out = a3_222;
			a4Out = a4_126;
			a5Out = a5_224;
			s2Out = s2_232;
			s3Out = s3_233;
			s4Out = dwArg04;
			s5Out = s5_235;
			s6Out = s6_236;
			s7Out = s7_102;
			s8Out = dwLoc1C;
			s9Out = s9_104;
			mstatusOut = mstatus;
			return ra_120;
		}
	}
	else
	{
		Eq_2 a0_83;
		Eq_2 s2_117;
		Eq_2 s3_118;
		Eq_2 s4_119;
		Eq_2 s6_101;
		Eq_2 a5_127;
		ra_120 = create_frag.isra.11(ra, a3_69, a4_159, 0x4200E000, 0x4200DD60, (word32) a0 + 0x0D, s4_145, s5, mstatus, s2, dwArg10, dwArg14, dwArg38, dwArg54, dwArg58, dwArg5C, s3, s1, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_121, out a0_83, out a4_126, out a5_127, out s2_117, out s3_118, out s4_119, out s6_101, out s7_102, out s9_104, out mstatus);
		a1_112 = a0_83;
		if (a0_83 != 0x00)
		{
			Eq_2 a2_114 = 0x00;
			while (true)
			{
				word32 a0_130;
				Eq_2 a3_133;
				Eq_2 s5_146;
				word32 a5_605;
				word32 s0_604;
				ra_120 = send_frag(ra_120, s1_121, a2_114, 0x01, a4_126, a5_127, s2_117, s3_118, s4_119, s6_101, mstatus, s2, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, s3, ra, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, out s0_604, out s1_121, out a0_130, out a1_112, out a3_133, out a4_126, out a5_605, out s2_143, out s3_144, out s4_145, out s5_146, out s6, out s7_102, out s9_104, out mstatus);
				if (a0_130 == 0x00)
					break;
				a4_159 = (word32) *((word32) s1_121 + 0x0C);
				a5_160 = (word32) *((word32) s2_143 + 0x0080);
				if (a5_160 >= a4_159)
				{
					a2_196.u0 = 0x01;
					goto l2304B5DA;
				}
				Eq_2 a0_163;
				ra_120 = create_frag.isra.11(ra_120, a3_133, a4_159, a5_160, s2_143, s3_144, s4_145, s5_146, mstatus, s2, dwArg10, dwArg14, dwArg38, dwArg54, dwArg58, dwArg5C, s3, s1, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_121, out a0_163, out a4_126, out a5_127, out s2_117, out s3_118, out s4_119, out s6_101, out s7_102, out s9_104, out mstatus);
				a1_112 = a0_163;
				if (a0_163 == 0x00)
					break;
				a2_114.u0 = 0x01;
			}
		}
	}
	ptr32 a3_265;
	Eq_2 a4_266;
	struct Eq_262349 * a5_267;
	ptr32 mstatus_270;
	Eq_2 s0_272;
	Eq_2 s1_273;
	struct Eq_262350 * s2_274;
	ptr32 s3_275;
	Eq_2 s4_276;
	ptr32 s5_277;
	ptr32 s6_278;
	ptr32 s8_279;
	word32 a2_602;
	word32 a0_600;
	word32 a1_601;
	Eq_2 ra_271 = net_buf_unref(ra_120, s1_121, s1_121, a1_112, a4_126, mstatus, dwArg00, dwArg04, dwArg08, dwArg28, dwArg78, dwArg84, dwArg98, dwArgA4, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out s0_272, out s1_273, out a0_600, out a1_601, out a2_602, out a3_265, out a4_266, out a5_267, out s2_274, out s3_275, out s4_276, out s5_277, out s6_278, out s8_279, out mstatus_270);
	s0Out = s0_272;
	s1Out = s1_273;
	a3Out = a3_265;
	a4Out = a4_266;
	a5Out = a5_267;
	s2Out = s2_274;
	s3Out = s3_275;
	s4Out = s4_276;
	s5Out = s5_277;
	s6Out = s6_278;
	s7Out = s7_102;
	s8Out = s8_279;
	s9Out = s9_104;
	mstatusOut = mstatus_270;
	return ra_271;
}

// 2304B644: Register int32 bt_conn_auth_cb_register(Register int32 a0, Register out Eq_2 a3Out)
// Called from:
//      ble_auth
int32 bt_conn_auth_cb_register(int32 a0, union Eq_2 & a3Out)
{
	int32 a5_10;
	if (a0 == 0x00)
		g_t42026610.u0 = 0x00;
	else
	{
		a3 = g_t42026610;
		a5_10 = -69;
		if (a3 != 0x00)
			goto l2304B650;
		Eq_2 a0_13 = *(union Eq_2 *) -53;
		if (false)
		{
			a5_10 = ~0x15;
			if (a3 != 0x00 || (a3 != 0x00 || a3 != 0x00))
				goto l2304B650;
			a0_13 = *((word32) a3 + 20);
			if (a3 != 0x00)
			{
l2304B650:
				a3Out = a3;
				return a5_10;
			}
		}
		g_t42026610 = a0_13;
	}
	a5_10 = 0x00;
	goto l2304B650;
}

