pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304B67A: void bt_conn_auth_passkey_entry(Register Eq_2 a0)
// Called from:
//      ble_auth_passkey
void bt_conn_auth_passkey_entry(Eq_2 a0)
{
	if (g_t42026610 == 0x00 || (word32) (*((word32) a0 + 2)) != 0x01)
		return;
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg0 = <invalid>;
	Eq_2 stackArg4 = <invalid>;
	Eq_2 stackArg8 = <invalid>;
	Eq_2 stackArg24 = <invalid>;
	Eq_2 stackArg36 = <invalid>;
	Eq_2 stackArg40 = <invalid>;
	Eq_2 stackArg44 = <invalid>;
	Eq_2 stackArg48 = <invalid>;
	Eq_2 stackArg52 = <invalid>;
	Eq_2 stackArg56 = <invalid>;
	Eq_2 stackArg60 = <invalid>;
	Eq_2 stackArg72 = <invalid>;
	Eq_2 stackArg76 = <invalid>;
	Eq_2 stackArg84 = <invalid>;
	Eq_2 stackArg88 = <invalid>;
	Eq_2 stackArg104 = <invalid>;
	Eq_2 stackArg120 = <invalid>;
	Eq_2 stackArg124 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg152 = <invalid>;
	Eq_2 stackArg168 = <invalid>;
	Eq_2 stackArg184 = <invalid>;
	Eq_2 stackArg200 = <invalid>;
	Eq_2 stackArg216 = <invalid>;
	Eq_2 stackArg232 = <invalid>;
	Eq_2 stackArg248 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	Eq_2 stackArg280 = <invalid>;
	Eq_2 stackArg296 = <invalid>;
	Eq_2 stackArg312 = <invalid>;
	bt_smp_auth_passkey_entry(ra, s0, a0, a3, s2, mstatus, stackArg0, stackArg4, stackArg8, stackArg24, stackArg36, stackArg40, stackArg44, stackArg48, stackArg52, stackArg56, stackArg60, stackArg72, stackArg76, stackArg84, stackArg88, stackArg104, stackArg120, stackArg124, stackArg136, stackArg152, stackArg168, stackArg184, stackArg200, stackArg216, stackArg232, stackArg248, stackArg264, stackArg280, stackArg296, stackArg312);
}

// 2304B6A8: void bt_conn_auth_passkey_confirm(Register Eq_2 a0)
// Called from:
//      ble_auth_passkey_confirm
void bt_conn_auth_passkey_confirm(Eq_2 a0)
{
	if (g_t42026610 == 0x00 || (word32) (*((word32) a0 + 2)) != 0x01)
		return;
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg0 = <invalid>;
	Eq_2 stackArg4 = <invalid>;
	Eq_2 stackArg8 = <invalid>;
	Eq_2 stackArg16 = <invalid>;
	Eq_2 stackArg20 = <invalid>;
	Eq_2 stackArg24 = <invalid>;
	Eq_2 stackArg36 = <invalid>;
	Eq_2 stackArg40 = <invalid>;
	Eq_2 stackArg56 = <invalid>;
	Eq_2 stackArg68 = <invalid>;
	Eq_2 stackArg76 = <invalid>;
	Eq_2 stackArg80 = <invalid>;
	Eq_2 stackArg84 = <invalid>;
	Eq_2 stackArg104 = <invalid>;
	Eq_2 stackArg120 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg152 = <invalid>;
	Eq_2 stackArg156 = <invalid>;
	Eq_2 stackArg168 = <invalid>;
	Eq_2 stackArg184 = <invalid>;
	Eq_2 stackArg196 = <invalid>;
	Eq_2 stackArg200 = <invalid>;
	Eq_2 stackArg216 = <invalid>;
	Eq_2 stackArg224 = <invalid>;
	Eq_2 stackArg228 = <invalid>;
	Eq_2 stackArg232 = <invalid>;
	Eq_2 stackArg248 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	Eq_2 stackArg280 = <invalid>;
	Eq_2 stackArg296 = <invalid>;
	bt_smp_auth_passkey_confirm(ra, s0, a0, a3, mstatus, stackArg0, stackArg4, stackArg8, stackArg16, stackArg20, stackArg24, stackArg36, stackArg40, stackArg56, stackArg68, stackArg76, stackArg80, stackArg84, stackArg104, stackArg120, stackArg136, stackArg152, stackArg156, stackArg168, stackArg184, stackArg196, stackArg200, stackArg216, stackArg224, stackArg228, stackArg232, stackArg248, stackArg264, stackArg280, stackArg296);
}

// 2304B6C4: void bt_conn_auth_cancel(Register Eq_2 a0)
// Called from:
//      ble_auth_cancel
void bt_conn_auth_cancel(Eq_2 a0)
{
	if (g_t42026610 == 0x00 || (word32) (*((word32) a0 + 2)) != 0x01)
		return;
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg8 = <invalid>;
	Eq_2 stackArg16 = <invalid>;
	Eq_2 stackArg80 = <invalid>;
	Eq_2 stackArg84 = <invalid>;
	Eq_2 stackArg120 = <invalid>;
	Eq_2 stackArg156 = <invalid>;
	bt_smp_auth_cancel(ra, a0, a3, mstatus, stackArg8, stackArg16, stackArg80, stackArg84, stackArg120, stackArg156);
}

