pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304B6E0: void bt_conn_auth_pairing_confirm(Register Eq_2 a0)
// Called from:
//      ble_auth_pairing_confirm
void bt_conn_auth_pairing_confirm(Eq_2 a0)
{
	if (g_t42026610 == 0x00 || (word32) (*((word32) a0 + 2)) != 0x01)
		return;
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg0 = <invalid>;
	Eq_2 stackArg4 = <invalid>;
	Eq_2 stackArg8 = <invalid>;
	Eq_2 stackArg16 = <invalid>;
	Eq_2 stackArg20 = <invalid>;
	Eq_2 stackArg24 = <invalid>;
	Eq_2 stackArg32 = <invalid>;
	Eq_2 stackArg36 = <invalid>;
	Eq_2 stackArg40 = <invalid>;
	Eq_2 stackArg52 = <invalid>;
	Eq_2 stackArg56 = <invalid>;
	Eq_2 stackArg60 = <invalid>;
	Eq_2 stackArg68 = <invalid>;
	Eq_2 stackArg72 = <invalid>;
	Eq_2 stackArg76 = <invalid>;
	Eq_2 stackArg80 = <invalid>;
	Eq_2 stackArg84 = <invalid>;
	Eq_2 stackArg88 = <invalid>;
	Eq_2 stackArg92 = <invalid>;
	Eq_2 stackArg100 = <invalid>;
	Eq_2 stackArg104 = <invalid>;
	Eq_2 stackArg108 = <invalid>;
	Eq_2 stackArg120 = <invalid>;
	Eq_2 stackArg132 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg152 = <invalid>;
	Eq_2 stackArg156 = <invalid>;
	Eq_2 stackArg168 = <invalid>;
	Eq_2 stackArg184 = <invalid>;
	Eq_2 stackArg200 = <invalid>;
	Eq_2 stackArg216 = <invalid>;
	Eq_2 stackArg232 = <invalid>;
	Eq_2 stackArg248 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	Eq_2 stackArg280 = <invalid>;
	Eq_2 stackArg296 = <invalid>;
	Eq_2 stackArg312 = <invalid>;
	Eq_2 stackArg344 = <invalid>;
	bt_smp_auth_pairing_confirm(ra, s0, a0, a3, s2, mstatus, stackArg0, stackArg4, stackArg8, stackArg16, stackArg20, stackArg24, stackArg32, stackArg36, stackArg40, stackArg52, stackArg56, stackArg60, stackArg68, stackArg72, stackArg76, stackArg80, stackArg84, stackArg88, stackArg92, stackArg100, stackArg104, stackArg108, stackArg120, stackArg132, stackArg136, stackArg152, stackArg156, stackArg168, stackArg184, stackArg200, stackArg216, stackArg232, stackArg248, stackArg264, stackArg280, stackArg296, stackArg312, stackArg344);
}

// 2304B6FC: Register Eq_2 bt_conn_index(Register Eq_2 a0)
// Called from:
//      update_ccc
//      bt_recv
Eq_2 bt_conn_index(Eq_2 a0)
{
	return (a0 - 0x420154CC >> 5) + ~0x33333332 & 0x00FF;
}

// 2304B71A: Register Eq_2 bt_conn_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      init_work
Eq_2 bt_conn_init(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 a5_26 = (word32) g_b4200F47C;
	if (a5_26 == 0x00)
	{
		word32 s3_418;
		word32 s2_417;
		k_queue_init(ra, 0x02, a3, a4, a5_26, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out a3, out a4, out a5_26, out s2_417, out s3_418);
	}
	word32 s3_416;
	word32 s2_415;
	word32 a3_414;
	Eq_2 a4_51;
	Eq_2 a5_52;
	Eq_2 s1_54 = k_queue_init(ra, 0x14, a3, a4, a5_26, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out a3_414, out a4_51, out a5_52, out s2_415, out s3_416);
	do
	{
		s1_436 = s1_54;
		a4_437 = a4_51;
		a5_438 = a5_52;
		Eq_2 a3_75;
		union Eq_2 * s2_82;
		word32 s8_426;
		word32 s5_424;
		word32 s6_425;
		word32 s3_422;
		word32 s4_423;
		word32 a1_420;
		word32 a2_421;
		word32 a0_419;
	} while (s2_82 != k_queue_append((word32) s1_436 - 320, a4_437, a5_438, mstatus, s0, ra, dwArgE8, dwArg0128, dwArg0168, out s1_54, out a0_419, out a1_420, out a2_421, out a3_75, out a4_51, out a5_52, out s2_82, out s3_422, out s4_423, out s5_424, out s6_425, out s8_426));
	Eq_2 a3_99;
	Eq_2 a4_100;
	Eq_2 a5_101;
	ptr32 a0_112;
	Eq_2 a3_115;
	ptr32 s5_128;
	ptr32 s3_126;
	Eq_2 s1_122;
	ptr32 mstatus_120;
	Eq_2 a4_116;
	Eq_2 ra_121 = bt_smp_init(ra, bt_att_init(ra, a3_75, a4_51, mstatus, dwArg24, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a3_99, out a4_100, out a5_101), a3_99, a4_100, a5_101, mstatus, dwLoc08, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s1_122, out a0_112, out a3_115, out a4_116, out s3_126, out s5_128, out mstatus_120);
	ptr32 s2_140 = a0_112;
	if (a0_112 == 0x00)
	{
		bt_l2cap_init();
		s1_122.u0 = 0x42015000;
		struct Eq_263151 * s0_145 = &g_w420154CC;
		if (atomic_get(0x42015514) != 0x00 && atomic_test_bit(0x420154D0, 0x00) != 0x00)
		{
			g_b420154D4 = 0x00;
			word32 s8_430;
			word32 s4_428;
			word32 s6_429;
			word32 a5_427;
			ra_121 = bt_conn_set_state(ra_121, 0x42015000, 0x420154CC, 0x01, a3_115, a4_116, mstatus_120, dwLoc08, dwArg00, dwArg04, dwArg14, dwArg18, dwArg28, dwArg88, dwArg98, dwArgAC, dwArgC8, dwArg0108, out s0_145, out s1_122, out a3_115, out a4_116, out a5_427, out s2_140, out s3_126, out s4_428, out s5_128, out s6_429, out s8_430, out mstatus_120);
		}
		if (atomic_get(&s0_145->b00A8 + 64) != 0x00 && atomic_test_bit((char *) s0_145 + 0x00A4, 0x00) != 0x00)
		{
			s0_145->b00A8 = 0x00;
			word32 s6_434;
			word32 s8_435;
			word32 a5_432;
			word32 s4_433;
			word32 s0_431;
			ra_121 = bt_conn_set_state(ra_121, s1_122, (char *) s0_145 + 0x00A0, 0x01, a3_115, a4_116, mstatus_120, dwLoc08, dwArg00, dwArg04, dwArg14, dwArg18, dwArg28, dwArg88, dwArg98, dwArgAC, dwArgC8, dwArg0108, out s0_431, out s1_122, out a3_115, out a4_116, out a5_432, out s2_140, out s3_126, out s4_433, out s5_128, out s6_434, out s8_435, out mstatus_120);
		}
	}
	0x00 = (int8) dwArg38;
	s1Out = s1_122;
	a0Out = s2_140;
	a3Out = a3_115;
	a4Out = a4_116;
	s2Out = s2_140;
	s3Out = s3_126;
	s5Out = s5_128;
	mstatusOut = mstatus_120;
	return ra_121;
}

// 2304B7D8: Register word32 bt_rand(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_64398) a2, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      prov_confirm
//      prov_start
//      bt_mesh_proxy_adv_start
//      le_set_private_addr.isra.19
//      bt_addr_le_create_static
//      display_passkey
//      legacy_request_tk
//      bt_smp_distribute_keys
//      smp_init
word32 bt_rand(Eq_2 a0, Eq_2 a1, struct Eq_64398 * a2, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ptr32 a1_10;
	ptr32 a3_12;
	ptr32 a4_13;
	ptr32 a5_14;
	ptr32 s4_16;
	ptr32 s8_17;
	word32 s1_15 = k_get_random_byte_array(a0, a1, a2, out a1_10, out a3_12, out a4_13, out a5_14, out s4_16, out s8_17);
	a0Out = 0x00;
	a1Out = a1_10;
	a3Out = a3_12;
	a4Out = a4_13;
	a5Out = a5_14;
	s4Out = s4_16;
	s8Out = s8_17;
	return s1_15;
}

// 2304B7E8: Register Eq_2 bt_encrypt_le(Register Eq_2 ra, Register ptr32 a0, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      smp_c1
//      smp_pairing_random
//      bt_rpa_irk_matches
Eq_2 bt_encrypt_le(Eq_2 ra, ptr32 a0, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	struct Eq_263257 * a4_25 = fp + -0x00D0;
	struct Eq_263261 * a5_12 = a0 + 0x0F;
	ptr32 s2_168 = fp + -0x00D0;
	do
	{
		a5_12 = (struct Eq_263261 *) ((char *) a5_12 - 1);
		++a4_25;
		a4_25[0x0FFF] = (struct Eq_263257) (byte) (word32) a5_12[1];
	} while (a0 + ~0x00 != a5_12);
	ptr32 a0_107;
	word32 a0_33;
	word32 s8_222;
	word32 a3_221;
	word32 a1_220;
	ptr32 a4_151;
	ptr32 s1_165;
	ptr32 s4_176;
	Eq_2 s0_162 = tc_aes128_set_encrypt_key(fp + -0x00C0, fp + -0x00D0, out s1_165, out a0_33, out a1_220, out a3_221, out a4_151, out s4_176, out s8_222);
	if (a0_33 != 0x00)
	{
		struct Eq_263305 * a5_51 = s1_165 + 0x0F;
		struct Eq_263308 * a4_52 = fp + -0x00D0;
		do
		{
			a5_51 = (struct Eq_263305 *) ((char *) a5_51 - 1);
			++a4_52;
			a4_52[0x0FFF] = (struct Eq_263308) (byte) (word32) a5_51[1];
		} while (a5_51 != s1_165 + ~0x00);
		word32 a0_70;
		word32 s8_226;
		word32 a5_225;
		word32 a3_224;
		word32 a1_223;
		ra = tc_aes_encrypt(ra, s0_162, fp + -0x00D0, fp + -0x00C0, out s0_162, out s1_165, out a0_70, out a1_223, out a3_224, out a4_151, out a5_225, out s2_168, out s3, out s4_176, out s5, out s8_226);
		if (a0_70 != 0x00)
		{
			Eq_2 a2_100 = s0_162;
			struct Eq_263352 * a5_102 = (word32) s0_162 + 0x0F;
			a4_151 = (word32) s0_162 + 7;
			do
			{
				word32 a3_101 = (word32) *a2_100;
				*a2_100 = (byte) (word32) a5_102->b0000;
				a5_102 = (struct Eq_263352 *) ((char *) a5_102 - 1);
				a5_102[1] = (struct Eq_263352) (byte) a3_101;
				a2_100 = (word32) a2_100 + 1;
			} while ((word32) s0_162 + 7 != a5_102);
			a0_107 = 0x00;
l2304B862:
			s0Out = s0_162;
			s1Out = s1_165;
			a0Out = a0_107;
			a1Out = dwLocCC;
			a4Out = a4_151;
			a5Out = dwLocB0;
			s2Out = s2_168;
			s3Out = s3;
			s4Out = s4_176;
			s5Out = s5;
			return ra;
		}
	}
	a0_107 = ~0x15;
	goto l2304B862;
}

// 2304B872: Register Eq_2 bt_encrypt_be(Register Eq_2 ra, Register Eq_2 a0, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_213828) a0Out, Register out ptr32 a1Out, Register out Eq_213830 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_213828) a5Out, Register out (ptr32 Eq_213833) s2Out, Register out Eq_213834 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 s10Out)
// Called from:
//      bt_mesh_ccm_encrypt
//      bt_mesh_ccm_decrypt
//      bt_mesh_net_obfuscate
//      bt_mesh_proxy_adv_start
Eq_2 bt_encrypt_be(Eq_2 ra, Eq_2 a0, union Eq_2 & s0Out, union Eq_2 & s1Out, struct Eq_213828 & a0Out, ptr32 & a1Out, union Eq_213830 & a3Out, ptr32 & a4Out, struct Eq_213828 & a5Out, struct Eq_213833 & s2Out, union Eq_213834 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & s10Out)
{
	struct Eq_213828 * a5_61;
	word32 a0_17;
	Eq_213830 a3_20;
	ptr32 a1_18;
	ptr32 a4_21;
	Eq_2 s1_101;
	ptr32 s4_109;
	ptr32 s8_114;
	Eq_2 s0_100 = tc_aes128_set_encrypt_key(fp + -0x00C0, a0, out s1_101, out a0_17, out a1_18, out a3_20, out a4_21, out s4_109, out s8_114);
	if (a0_17 != 0x00)
	{
		word32 a0_38;
		word32 a5_143;
		ra = tc_aes_encrypt(ra, s0_100, s1_101, fp + -0x00C0, out s0_100, out s1_101, out a0_38, out a1_18, out a3_20, out a4_21, out a5_143, out s2, out s3, out s4_109, out s5, out s8_114);
		a5_61 = null;
		if (a0_38 != 0x00)
		{
l2304B898:
			s0Out = s0_100;
			s1Out = s1_101;
			a0Out = a5_61;
			a1Out = a1_18;
			a3Out = a3_20;
			a4Out = a4_21;
			a5Out = a5_61;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4_109;
			s5Out = s5;
			s6Out = dwArg74;
			s8Out = s8_114;
			s10Out = dwArg54;
			return ra;
		}
	}
	a5_61 = (struct Eq_213828 *) ~0x15;
	goto l2304B898;
}

