pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304B8A4: void sys_slist_remove(Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5)
// Called from:
//      gatt_subscription_remove
//      bt_gatt_service_unregister
//      bt_gatt_unsubscribe
void sys_slist_remove(Eq_2 a1, Eq_2 a4, Eq_2 a5)
{
	Eq_2 a2_5 = *a5;
	if (a1 == 0x00)
	{
		Eq_2 a0_11 = *((word32) a4 + 4);
		*a5 = a0_11;
		if (a4 == a2_5)
			*((word32) a5 + 4) = a0_11;
	}
	else
	{
		*a5 = a1;
		Eq_2 a0_8 = *((word32) a5 + 4);
		if (a5 == a2_5)
			*((word32) a1 + 4) = a0_8;
	}
	*a2_5 = 0x00;
}

// 2304B8C4: void found_attr(Register (ptr32 word32) a0, Register word32 a1)
void found_attr(word32 * a0, word32 a1)
{
	*a0 = a1;
}

// 2304B8CA: Register Eq_2 find_static_attr(Register Eq_2 a0, Register out Eq_2 a1Out, Register out (ptr32 Eq_263474) a2Out, Register out Eq_263475 a3Out, Register out Eq_2 a4Out)
// Called from:
//      bt_gatt_attr_value_handle
//      bt_gatt_notify_cb
//      bt_gatt_indicate
Eq_2 find_static_attr(Eq_2 a0, union Eq_2 & a1Out, struct Eq_263474 & a2Out, union Eq_263475 & a3Out, union Eq_2 & a4Out)
{
	struct Eq_263477 * a5_31 = g_a4200EF74;
	Eq_2 a7_32 = 0x01;
	while (true)
	{
		Eq_2 a4_11;
		if (a5_31 >= &g_t4200EF84)
			break;
		Eq_263475 t1_13 = a5_31->dw0004;
		a3.u0 = 0x00;
		while (true)
		{
			a4_11 = CONVERT(SLICE(a7_32 + a3, word16, 0), word16, word32);
			if (a3 == t1_13)
				break;
			a1 = (word32) a3.u0 + 20 + a5_31->dw0000;
			if (a0 == a1)
				goto l2304B90E;
			a3 = (word32) a3.u0 + 1;
		}
		++a5_31;
		a7_32 = a4_11;
	}
	a4_11.u0 = 0x00;
l2304B90E:
	a1Out = a1;
	a2Out = (struct Eq_263474 *) &g_t4200EF84;
	a3Out = a3;
	a4Out = a4_11;
	return a4_11;
}

// 2304B912: void gatt_ccc_changed(Register (ptr32 Eq_263508) a1)
// Called from:
//      bt_gatt_attr_write_ccc
//      update_ccc
void gatt_ccc_changed(struct Eq_263508 * a1)
{
	uint32 a3_5 = (word32) a1->w0012;
	uint32 a4_12 = (word32) a1->w0008;
	if (a4_12 < a3_5)
		a4_12 = a3_5;
	uint32 a1_13 = a4_12 << 0x10;
	if ((word32) a1->w0014 == a1_13 >> 16)
		return;
	<anonymous> * t1_15 = a1->ptr0018;
	a1->w0014 = (word16) a4_12;
	if (t1_15 == null)
		return;
	word32 t1_23;
	t1_15();
}

// 2304B940: void gatt_indicate_rsp(Register word32 a1, Register (ptr32 Eq_263542) a4)
void gatt_indicate_rsp(word32 a1, struct Eq_263542 * a4)
{
	a4->ptr0020();
}

// 2304B94A: void sc_restore_rsp()
void sc_restore_rsp()
{
}

// 2304B94C: Register Eq_2 gatt_subscription_remove(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Stack Eq_2 dwArg10, Stack word32 dwArg14, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_263558) a5Out)
// Called from:
//      gatt_write_ccc_rsp
//      bt_gatt_disconnected
Eq_2 gatt_subscription_remove(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, Eq_2 dwArg10, word32 dwArg14, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_263558 & a5Out)
{
	sys_slist_remove(a1, a4, a5);
	ptr32 s1_32;
	Eq_2 ra_36;
	ptr32 a3_40;
	struct Eq_263558 * a5_41;
	ptr32 a4_42;
	(*((word32) a2 + 32))();
	s1Out = s1_32;
	a3Out = a3_40;
	a4Out = a4_42;
	a5Out = a5_41;
	return ra_36;
}

word32 g_dw2304B96A = 0x85A20204;
// 2304B97E: void gatt_mtu_rsp(Register (ptr32 Eq_263570) a4)
void gatt_mtu_rsp(struct Eq_263570 * a4)
{
	a4->ptr0018();
}

// 2304B986: void gatt_write_rsp(Register (ptr32 Eq_263574) a4)
void gatt_write_rsp(struct Eq_263574 * a4)
{
	a4->ptr0018();
}

// 2304B98E: Register Eq_2 find_ccc_cfg(Register Eq_2 a0, Register (ptr32 Eq_263508) a1, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s4Out)
// Called from:
//      bt_gatt_attr_read_ccc
//      bt_gatt_attr_write_ccc
Eq_2 find_ccc_cfg(Eq_2 a0, struct Eq_263508 * a1, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s4Out)
{
	ptr32 a4_141;
	ptr32 a0_120;
	word32 a0_67;
	Eq_2 a0_33;
	if (a0 == 0x00)
	{
		word32 a1_169;
		word32 a2_170;
		word32 a5_171;
		if (memcmp(&a1->b0000 + 1, fp + ~0x17, 0x07, out a1_169, out a2_170, out a3, out a4_141, out a5_171) == 0x00)
			goto l2304B9B2;
		word32 a1_172;
		word32 a2_173;
		word32 a5_174;
		a0_33 = memcmp(&a1->b000A + 1, fp + ~0x17, 0x07, out a1_172, out a2_173, out a3, out a4_141, out a5_174);
	}
	else
	{
		s1 = a0;
		if ((word32) *((word32) a0 + 8) == (word32) a1->b0000)
		{
			word32 a0_17;
			word32 a5_175;
			s1 = bt_conn_addr_le_cmp(a0, &a1->b0000 + 1, dwLoc10, out a0_17, out a3, out a4_141, out a5_175);
			if (a0_17 == 0x00)
			{
l2304B9B2:
				a0_67 = 0x00;
				goto l2304B9B4;
			}
		}
		a4_141 = (word32) *((word32) s1 + 8);
		if (a4_141 != (word32) a1->b000A)
		{
l2304B9F2:
			a0_120 = 0x00;
			goto l2304B9B6;
		}
		word32 a5_176;
		s1 = bt_conn_addr_le_cmp(s1, &a1->b000A + 1, dwLoc10, out a0_33, out a3, out a4_141, out a5_176);
	}
	if (a0_33 == 0x00)
	{
		a0_67 = 0x0A;
l2304B9B4:
		a0_120 = a1 + a0_67 / 32;
l2304B9B6:
		a0Out = a0_120;
		a3Out = a3;
		a4Out = a4_141;
		s4Out = dwArg04;
		return s1;
	}
	goto l2304B9F2;
}

// 2304BA0E: Register Eq_2 gatt_notify(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_263724) a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out Eq_263729 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      notify_cb
//      bt_gatt_notify_cb
Eq_2 gatt_notify(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD0, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, struct Eq_263724 & a4Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, union Eq_263729 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a3_31;
	Eq_2 a4_32;
	struct Eq_263738 * s0_36;
	uint32 s1_37;
	Eq_2 s5_43;
	Eq_2 a0_51;
	ptr32 mstatus_53;
	word32 a2_257;
	word32 a5_258;
	word32 s2_259;
	word32 s3_260;
	word32 s4_261;
	word32 s6_262;
	word32 s11_263;
	Eq_2 ra_35 = bt_att_create_pdu(ra, a1, a0, (word32) *((word32) a2 + 0x0C) + 0x02, a3, mstatus, s2, dwArg10, dwArg14, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg7C, dwArgA8, dwArgC8, out s0_36, out s1_37, out a0_51, out a2_257, out a3_31, out a4_32, out a5_258, out s2_259, out s3_260, out s4_261, out s5_43, out s6_262, out s11_263, out mstatus_53);
	if (a0_51 == 0x00)
	{
		ptr32 a1_63;
		ptr32 a3_65;
		struct Eq_263724 * a4_66;
		ptr32 s1_69;
		ptr32 s10_70;
		ptr32 s11_71;
		ptr32 s2_72;
		ptr32 s3_73;
		ptr32 s5_75;
		Eq_263729 s6_76;
		ptr32 s7_77;
		ptr32 s9_79;
		word32 a0_264;
		word32 a2_265;
		word32 a5_266;
		word32 a7_267;
		word32 s4_268;
		word32 s8_269;
		word32 t4_270;
		Eq_2 ra_68 = printf(ra_35, &g_t230BAE88, a3_31, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_69, out a0_264, out a1_63, out a2_265, out a3_65, out a4_66, out a5_266, out a7_267, out s2_72, out s3_73, out s4_268, out s5_75, out s6_76, out s7_77, out s8_269, out s9_79, out s10_70, out s11_71, out t4_270);
		s0Out = s1;
		s1Out = s1_69;
		a0Out = ~0x0B;
		a1Out = a1_63;
		a3Out = a3_65;
		a4Out = a4_66;
		s2Out = s2_72;
		s3Out = s3_73;
		s4Out = dwArg04;
		s5Out = s5_75;
		s6Out = s6_76;
		s7Out = s7_77;
		s8Out = s4;
		s9Out = s9_79;
		s10Out = s10_70;
		s11Out = s11_71;
		mstatusOut = mstatus_53;
		return ra_68;
	}
	else
	{
		word32 a1_271;
		word32 a5_272;
		Eq_2 a0_95 = net_buf_simple_add((word32) a0_51 + 8, 0x02, a4_32, out a1_271, out a5_272);
		*a0_95 = (byte) s1_37;
		*((word32) a0_95 + 1) = (byte) (s1_37 >> 8);
		Eq_2 a1_105;
		word32 a5_273;
		net_buf_simple_add((word32) a0_51 + 8, (word32) s0_36->w000C, a4_32, out a1_105, out a5_273);
		Eq_2 a3_115;
		word32 a1_274;
		word32 a2_275;
		word32 a4_276;
		word32 a5_277;
		word32 a6_278;
		word32 a7_279;
		memcpy((word32) a0_95 + 2, a1_105, (word32) s0_36->w000C, out a1_274, out a2_275, out a3_115, out a4_276, out a5_277, out a6_278, out a7_279);
		ptr32 a1_135;
		ptr32 a3_137;
		struct Eq_263724 * a4_138;
		ptr32 mstatus_142;
		Eq_2 s0_144;
		ptr32 s1_145;
		ptr32 s10_146;
		ptr32 s11_147;
		ptr32 s2_148;
		ptr32 s3_149;
		Eq_2 s4_150;
		ptr32 s5_151;
		Eq_263729 s6_152;
		ptr32 s7_153;
		ptr32 s8_154;
		ptr32 s9_155;
		ptr32 a0_163;
		Eq_2 ra_143 = bt_att_send(ra_35, s1, s5_43, a0_51, a3_115, a0_95, mstatus_53, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg4C, dwArg58, s1, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD0, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0158, out s0_144, out s1_145, out a0_163, out a1_135, out a3_137, out a4_138, out s2_148, out s3_149, out s4_150, out s5_151, out s6_152, out s7_153, out s8_154, out s9_155, out s10_146, out s11_147, out mstatus_142);
		s0Out = s0_144;
		s1Out = s1_145;
		a0Out = a0_163;
		a1Out = a1_135;
		a3Out = a3_137;
		a4Out = a4_138;
		s2Out = s2_148;
		s3Out = s3_149;
		s4Out = s4_150;
		s5Out = s5_151;
		s6Out = s6_152;
		s7Out = s7_153;
		s8Out = s8_154;
		s9Out = s9_155;
		s10Out = s10_146;
		s11Out = s11_147;
		mstatusOut = mstatus_142;
		return ra_143;
	}
}

// 2304BAA0: void gatt_read_multiple_rsp(Register word32 ra, Register word32 a0, Register word32 a1, Register word32 a2, Register word32 a3, Register (ptr32 Eq_264010) a4)
void gatt_read_multiple_rsp(word32 ra, word32 a0, word32 a1, word32 a2, word32 a3, struct Eq_264010 * a4)
{
	word32 a1_38;
	ptr32 sp_22 = fp + ~0x0F;
	word32 s1_11 = a0;
	<anonymous> * t1_16 = a4->ptr0018;
	if (a1 == 0x00 && a3 != 0x00)
	{
		struct Eq_264025 * s0_23;
		t1_16();
		t1_16 = s0_23->ptr0018;
		a1_38 = 0x00;
	}
	else
		a1_38 = a1;
	t1_16();
}

// 2304BAE0: void gatt_write_ccc_rsp(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg10, Stack word32 dwArg14, Stack word32 dwArgA4)
void gatt_write_ccc_rsp(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, word32 dwArg00, word32 dwArg04, Eq_2 dwArg10, word32 dwArg14, word32 dwArgA4)
{
	Eq_2 a4_24;
	word32 s8_153;
	word32 a5_151;
	word32 s4_152;
	word32 a2_149;
	word32 a3_150;
	word32 a0_148;
	Eq_2 a1_21;
	Eq_2 s1_26 = atomic_and(a0, ~0x02, a3, a4, mstatus, out a0_148, out a1_21, out a2_149, out a3_150, out a4_24, out a5_151, out s4_152, out s8_153);
	if (s1_26 == 0x00)
	{
		word32 t1_53;
		word32 tp_100;
		(*((word32) a4_24 + 32))();
	}
	else
	{
		if (g_t4200F468 == 0x00)
			return;
		Eq_2 a5_57 = *a1_21;
		while (a5_57 != (word32) a4_24 + 48)
		{
			if (a1_21 == 0x00)
				return;
			a5_57 = a1_21;
			a1_21 = *a1_21;
		}
		word32 a5_157;
		word32 a4_156;
		word32 a3_155;
		word32 s1_154;
		gatt_subscription_remove(ra, a0, a0, a1_21, a4_24, a4_24, a5_57, dwArg10, dwArg14, out s1_154, out a3_155, out a4_156, out a5_157);
	}
}

// 2304BB48: Register Eq_2 gatt_send.constprop.28(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_264139) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      gatt_indicate
//      bt_gatt_exchange_mtu
//      gatt_read_type_rsp
//      bt_gatt_read
//      bt_gatt_write
//      gatt_prepare_write_rsp
//      bt_gatt_unsubscribe
Eq_2 gatt_send.constprop.28(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, ptr32 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, struct Eq_264139 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	if (a3 != 0x00)
	{
		*((word32) a1 + 16) = a3;
		*((word32) a2 + 4) = a3;
		*((word32) a3 + 8) = 0x00;
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg8 = <invalid>;
		Eq_2 stackArg16 = <invalid>;
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg32 = <invalid>;
		Eq_2 stackArg36 = <invalid>;
		Eq_2 stackArg40 = <invalid>;
		Eq_2 stackArg52 = <invalid>;
		Eq_2 stackArg56 = <invalid>;
		Eq_2 stackArg64 = <invalid>;
		Eq_2 stackArg68 = <invalid>;
		Eq_2 stackArg84 = <invalid>;
		Eq_2 stackArg88 = <invalid>;
		Eq_2 stackArg92 = <invalid>;
		Eq_2 stackArg104 = <invalid>;
		Eq_2 stackArg116 = <invalid>;
		Eq_2 stackArg120 = <invalid>;
		Eq_2 stackArg132 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg140 = <invalid>;
		Eq_2 stackArg152 = <invalid>;
		Eq_2 stackArg168 = <invalid>;
		Eq_2 stackArg184 = <invalid>;
		Eq_2 stackArg200 = <invalid>;
		Eq_2 stackArg216 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		Eq_2 stackArg264 = <invalid>;
		Eq_2 stackArg280 = <invalid>;
		Eq_2 stackArg296 = <invalid>;
		Eq_2 stackArg312 = <invalid>;
		Eq_2 stackArg344 = <invalid>;
		bt_att_req_send(ra, a0, a1, a3, mstatus, stackArg8, stackArg16, stackArg20, stackArg32, stackArg36, stackArg40, stackArg52, stackArg56, stackArg64, stackArg68, stackArg84, stackArg88, stackArg92, stackArg104, stackArg116, stackArg120, stackArg132, stackArg136, stackArg140, stackArg152, stackArg168, stackArg184, stackArg200, stackArg216, stackArg232, stackArg248, stackArg264, stackArg280, stackArg296, stackArg312, stackArg344);
	}
	else
	{
		word32 s0_257;
		word32 a1_258;
		word32 s5_259;
		word32 s8_260;
		word32 s9_261;
		word32 s10_262;
		word32 s11_263;
		ra = bt_att_send(ra, s0, a0, a1, a3, s3, mstatus, dwLoc10, s0, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, out s0_257, out s1, out a0, out a1_258, out a3, out a4, out s2, out s3, out s4, out s5_259, out s6, out s7, out s8_260, out s9_261, out s10_262, out s11_263, out mstatus);
	}
	if (a0 != 0x00)
	{
		word32 a0_246;
		word32 a1_247;
		word32 a2_248;
		word32 a5_249;
		word32 a7_250;
		word32 s5_251;
		word32 s8_252;
		word32 s9_253;
		word32 s10_254;
		word32 s11_255;
		word32 t4_256;
		ra = printf(ra, &g_t230BAEE0, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_246, out a1_247, out a2_248, out a3, out a4, out a5_249, out a7_250, out s2, out s3, out s4, out s5_251, out s6, out s7, out s8_252, out s9_253, out s10_254, out s11_255, out t4_256);
	}
	s1Out = s1;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s6Out = s6;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

