pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304BB84: Register Eq_2 gatt_indicate(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_264346) a4Out, Register out Eq_264347 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      notify_cb
//      bt_gatt_indicate
Eq_2 gatt_indicate(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, struct Eq_264346 & a4Out, union Eq_264347 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 a3_31;
	Eq_2 a4_32;
	struct Eq_264352 * s0_36;
	uint32 s3_41;
	Eq_2 s5_43;
	Eq_2 a0_51;
	ptr32 mstatus_53;
	word32 s1_291;
	word32 a2_292;
	word32 a5_293;
	word32 s2_294;
	word32 s4_295;
	word32 s6_296;
	word32 s11_297;
	Eq_2 ra_35 = bt_att_create_pdu(ra, s1, a0, (word32) *((word32) a2 + 40) + 0x02, a3, mstatus, s2, dwArg10, dwArg14, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg7C, dwArgA8, dwArgC8, out s0_36, out s1_291, out a0_51, out a2_292, out a3_31, out a4_32, out a5_293, out s2_294, out s3_41, out s4_295, out s5_43, out s6_296, out s11_297, out mstatus_53);
	if (a0_51 == 0x00)
	{
		ptr32 a3_65;
		struct Eq_264346 * a4_66;
		ptr32 s1_69;
		Eq_264347 s6_76;
		ptr32 s7_77;
		word32 a0_298;
		word32 a1_299;
		word32 a2_300;
		word32 a5_301;
		word32 a7_302;
		word32 s2_303;
		word32 s3_304;
		word32 s4_305;
		word32 s5_306;
		word32 s8_307;
		word32 s9_308;
		word32 s10_309;
		word32 s11_310;
		word32 t4_311;
		Eq_2 ra_68 = printf(ra_35, &g_t230BAE5C, a3_31, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_69, out a0_298, out a1_299, out a2_300, out a3_65, out a4_66, out a5_301, out a7_302, out s2_303, out s3_304, out s4_305, out s5_306, out s6_76, out s7_77, out s8_307, out s9_308, out s10_309, out s11_310, out t4_311);
		s0Out.u0 = <invalid>;
		s1Out = s1_69;
		a0Out.u0 = ~0x0B;
		a3Out = a3_65;
		a4Out = a4_66;
		s6Out = s6_76;
		s7Out = s7_77;
		mstatusOut = mstatus_53;
		return ra_68;
	}
	else
	{
		Eq_2 a3_125;
		word32 a1_312;
		word32 a5_313;
		Eq_2 a0_95 = net_buf_simple_add((word32) a0_51 + 8, 0x02, a4_32, out a1_312, out a5_313);
		*a0_95 = (byte) s3_41;
		*((word32) a0_95 + 1) = (byte) (s3_41 >> 0x08);
		Eq_2 a1_105;
		word32 a5_314;
		net_buf_simple_add((word32) a0_51 + 8, (word32) s0_36->w0028, a4_32, out a1_105, out a5_314);
		struct Eq_264464 * a5_111;
		word32 a1_315;
		word32 a2_316;
		word32 a3_317;
		word32 a4_318;
		word32 a6_319;
		word32 a7_320;
		memcpy((word32) a0_95 + 2, a1_105, (word32) s0_36->w0028, out a1_315, out a2_316, out a3_317, out a4_318, out a5_111, out a6_319, out a7_320);
		Eq_2 s0_123 = a5_111->t0020;
		if (a5_111 == null)
			a3_125.u0 = 0x00;
		else
			a3_125 = s0_123;
		ptr32 a3_149;
		struct Eq_264346 * a4_150;
		ptr32 mstatus_154;
		ptr32 s1_156;
		Eq_264347 s6_163;
		ptr32 s7_164;
		word32 s2_321;
		word32 s3_322;
		word32 s4_323;
		Eq_2 ra_155 = gatt_send.constprop.28(ra_35, s1, s5_43, a0_51, dwArg48, a3_125, s3_41 >> 0x08, mstatus_53, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg58, s5, s3, s1, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, out s1_156, out a3_149, out a4_150, out s2_321, out s3_322, out s4_323, out s6_163, out s7_164, out mstatus_154);
		s0Out.u0 = <invalid>;
		s1Out = s1_156;
		a0Out = s5_43;
		a3Out = a3_149;
		a4Out = a4_150;
		s6Out = s6_163;
		s7Out = s7_164;
		mstatusOut = mstatus_154;
		return ra_155;
	}
}

// 2304BC28: void match_uuid(Register (ptr32 word32) a0, Register word32 a1)
void match_uuid(word32 * a0, word32 a1)
{
	*a0 = a1;
}

// 2304BC2E: void sc_indicate_rsp(Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void sc_indicate_rsp(Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_21;
	Eq_2 a4_22;
	word32 a0_119;
	word32 a1_120;
	word32 a2_121;
	word32 a5_122;
	word32 s4_123;
	word32 s8_124;
	if ((atomic_get(atomic_and(0x4201584C, ~0x02, a3, a4, mstatus, out a0_119, out a1_120, out a2_121, out a3_21, out a4_22, out a5_122, out s4_123, out s8_124)) & 0x01) == 0x00)
		return;
	word32 s1_125;
	word32 a0_126;
	word32 a1_127;
	word32 a2_128;
	word32 a3_129;
	word32 a4_130;
	word32 a5_131;
	word32 s2_132;
	word32 s3_133;
	word32 s4_134;
	word32 s5_135;
	word32 s6_136;
	word32 s8_137;
	k_delayed_work_submit(0x00, a3_21, a4_22, mstatus, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_125, out a0_126, out a1_127, out a2_128, out a3_129, out a4_130, out a5_131, out s2_132, out s3_133, out s4_134, out s5_135, out s6_136, out s8_137);
}

