pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304BC70: void disconnected_cb(Register word32 ra, Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 s6, Register ptr32 mstatus, Stack word32 dwArg0198)
void disconnected_cb(word32 ra, Eq_2 a1, Eq_2 a4, Eq_2 s6, ptr32 mstatus, word32 dwArg0198)
{
	struct Eq_264600 * a0_5 = *((word32) a4 + 8);
	if (a4 != 0x2304C23A)
		return;
	struct Eq_264606 * s3_28 = a0_5->ptr000C;
	if ((word32) s3_28[2] != 0x00)
	{
		Eq_2 s1_114 = a1;
		struct Eq_264600 * s2_115 = a0_5;
		Eq_2 s0_113 = (char *) s3_28 + 1;
		word32 s4_117 = 0x00;
		Eq_2 s5_118 = (word32) a1 + 112;
		s3_116 = s3_28;
		do
		{
			struct Eq_264606 * s3_116;
			if ((word32) *((word32) s0_113 + 7) != 0x00)
			{
				if ((word32) *((word32) s1_114 + 8) != (word32) (*((word32) s0_113 - 1)))
				{
l2304BCC2:
					struct Eq_264655 * a0_110;
					Eq_2 a3_125;
					word32 s8_383;
					word32 a2_382;
					s0_113 = bt_conn_lookup_addr_le((word32) *((word32) s0_113 - 1), s0_113, mstatus, out s1_114, out a0_110, out a2_382, out a3_125, out a4, out s2_115, out s3_116, out s4_117, out s5_118, out s8_383);
					if (a0_110 != null)
					{
						if ((word32) a0_110->b000D == 0x04)
							s4_117 = 0x01;
						word32 a3_384;
						word32 a5_385;
						s1_114 = bt_conn_unref(s0_113, a3_125, a4, mstatus, out a3_384, out a4, out a5_385);
					}
					goto l2304BCCE;
				}
				word32 a0_47;
				word32 a3_379;
				word32 a4_380;
				word32 a5_381;
				Eq_2 s1_53 = bt_conn_addr_le_cmp(s1_114, s0_113, s6, out a0_47, out a3_379, out a4_380, out a5_381);
				if (a0_47 != 0x00)
					goto l2304BCC2;
				word32 a0_58;
				word32 a5_388;
				word32 a3_386;
				word32 a4_387;
				s1_114 = bt_addr_le_is_bonded((word32) *((word32) s1_53 + 8), s5_118, dwLoc18, out a0_58, out a3_386, out a4_387, out a5_388, out s2_115);
				if (a0_58 == 0x00)
				{
					word32 a6_399;
					word32 a7_400;
					word32 a1_395;
					word32 a5_398;
					word32 a2_396;
					word32 a3_397;
					memcpy(s0_113, fp + -56, 0x07, out a1_395, out a2_396, out a3_397, out a4, out a5_398, out a6_399, out a7_400);
					*((word32) s0_113 + 0x0FFF) = 0x00;
					((word32) s0_113 + 7)->u2 = 0x00;
				}
				else
				{
					word32 a7_394;
					word32 a1_389;
					word32 a2_390;
					word32 a6_393;
					word32 a3_391;
					word32 a5_392;
					memcpy(s0_113, s5_118, 0x07, out a1_389, out a2_390, out a3_391, out a4, out a5_392, out a6_393, out a7_394);
				}
			}
l2304BCCE:
			s0_113 = (word32) s0_113 + 0x0A;
		} while (s0_113 != (char *) (&s3_28->w0014) + 1);
		if (s4_117 == 0x00)
		{
			<anonymous> * a5_155 = s3_116->dw0018;
			s3_116[2] = (struct Eq_264606) 0x00;
			if (a5_155 != null)
			{
				word32 a2_190;
				word32 t3_191;
				word32 s8_192;
				word32 a6_193;
				word32 tp_194;
				word32 a3_195;
				word32 a7_196;
				word32 t0_197;
				word32 t1_198;
				word32 t4_199;
				word32 t5_200;
				word32 t6_201;
				word32 mstatus_202;
				a5_155();
			}
		}
	}
	0x00 = dwArg0198;
}

// 2304BD54: Register word32 find_sc_cfg(Register (ptr32 Eq_264793) a0, Register Eq_2 a1, Stack word32 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_264800) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out)
// Called from:
//      sc_save
//      sc_ccc_cfg_write
//      update_ccc
word32 find_sc_cfg(struct Eq_264793 * a0, Eq_2 a1, word32 dwArg0128, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_264800 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out)
{
	struct Eq_264800 * s2_135 = &g_t420158A4;
	ptr32 s1_134;
	for (s1_134 = 0x00; s1_134 != 0x04; ++s1_134)
	{
		ptr32 a0_120;
		if ((word32) s2_135->b0000 == a0)
		{
			word32 s7_42 = s1_134 + 0x0C;
			word32 a1_150;
			word32 a2_151;
			word32 a4_152;
			word32 a5_153;
			if (memcmp(&s2_135->b0000 + 1, a1, 0x07, out a1_150, out a2_151, out a3, out a4_152, out a5_153) == 0x00)
			{
				a0_120 = s7_42 + 1107384484;
				goto l2304BD9C;
			}
		}
		++s2_135;
	}
	a0_120 = 0x00;
l2304BD9C:
	0x00 = dwArg0128;
	s1Out = s1_134;
	a0Out = a0_120;
	a2Out = dwArgB8;
	a3Out = a3;
	s2Out = s2_135;
	s3Out = 0x04;
	s4Out = dwArg78;
	s5Out = a1;
	return dwArgE4;
}

// 2304BDBE: Register Eq_2 gatt_write_ccc.constprop.21(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_264873) s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 mstatusOut)
// Called from:
//      bt_gatt_subscribe
//      bt_gatt_unsubscribe
//      bt_gatt_connected
Eq_2 gatt_write_ccc.constprop.21(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg7C, Eq_2 dwArgA8, Eq_2 dwArgC8, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & a5Out, union Eq_2 & s2Out, struct Eq_264873 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & mstatusOut)
{
	Eq_2 a3_31;
	Eq_2 a4_32;
	ptr32 a5_33;
	uint32 s0_36;
	Eq_2 s1_37;
	Eq_2 s2_40;
	struct Eq_264873 * s3_41;
	Eq_2 s5_43;
	word32 s6_44;
	word32 a0_51;
	ptr32 mstatus_53;
	word32 s11_176;
	word32 s4_175;
	word32 a2_174;
	bt_att_create_pdu(ra, s1, a0, 0x04, a3, mstatus, s2, dwArg10, dwArg14, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg7C, dwArgA8, dwArgC8, out s0_36, out s1_37, out a0_51, out a2_174, out a3_31, out a4_32, out a5_33, out s2_40, out s3_41, out s4_175, out s5_43, out s6_44, out s11_176, out mstatus_53);
	if (a0_51 == 0x00)
	{
		s0Out.u0 = <invalid>;
		s1Out = s1_37;
		a0Out = ~0x0B;
		a3Out = a3_31;
		a5Out = a5_33;
		s2Out.u0 = <invalid>;
		s3Out = s3_41;
		s4Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		s6Out.u0 = <invalid>;
		mstatusOut.u0 = <invalid>;
		return <invalid>;
	}
	else
	{
		Eq_2 a5_73;
		word32 a1_177;
		Eq_2 a0_71 = net_buf_simple_add(a0_51 + 8, 0x02, a4_32, out a1_177, out a5_73);
		*a0_71 = (byte) s0_36;
		*((word32) a0_71 + 1) = (byte) (s0_36 >> 8);
		Eq_2 a4_81;
		word32 a5_178;
		net_buf_simple_add_le16(a0_51 + 8, s5_43, a5_73, out a4_81, out a5_178);
		ptr32 a5_90;
		word32 a0_179;
		word32 a1_180;
		word32 a2_181;
		word32 a3_182;
		word32 a4_183;
		word32 s4_184;
		word32 s8_185;
		Eq_2 s1_91 = atomic_or(s0_36 >> 8, 0x02, a3_31, a4_81, mstatus_53, out a0_179, out a1_180, out a2_181, out a3_182, out a4_183, out a5_90, out s4_184, out s8_185);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg0 = <invalid>;
		Eq_2 stackArg4 = <invalid>;
		Eq_2 stackArg8 = <invalid>;
		Eq_2 stackArg12 = <invalid>;
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg24 = <invalid>;
		Eq_2 stackArg32 = <invalid>;
		Eq_2 stackArg36 = <invalid>;
		Eq_2 stackArg40 = <invalid>;
		Eq_2 stackArg44 = <invalid>;
		Eq_2 stackArg52 = <invalid>;
		Eq_2 stackArg56 = <invalid>;
		Eq_2 stackArg60 = <invalid>;
		Eq_2 stackArg72 = <invalid>;
		Eq_2 stackArg88 = <invalid>;
		Eq_2 stackArg96 = <invalid>;
		Eq_2 stackArg100 = <invalid>;
		Eq_2 stackArg104 = <invalid>;
		Eq_2 stackArg108 = <invalid>;
		Eq_2 stackArg120 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg152 = <invalid>;
		Eq_2 stackArg168 = <invalid>;
		Eq_2 stackArg172 = <invalid>;
		Eq_2 stackArg184 = <invalid>;
		Eq_2 stackArg192 = <invalid>;
		Eq_2 stackArg200 = <invalid>;
		Eq_2 stackArg216 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		Eq_2 stackArg264 = <invalid>;
		Eq_2 stackArg280 = <invalid>;
		Eq_2 stackArg312 = <invalid>;
		Eq_2 stackArg328 = <invalid>;
		word32 s1_220;
		word32 a3_221;
		word32 a4_222;
		word32 s2_223;
		word32 s3_224;
		word32 s4_225;
		word32 s6_226;
		word32 s7_227;
		word32 mstatus_228;
		gatt_send.constprop.28(ra, s0, a0, a1, a2, a3, s3, mstatus, stackArg0, stackArg4, stackArg8, stackArg12, stackArg20, stackArg24, stackArg32, stackArg36, stackArg40, stackArg44, stackArg52, stackArg56, stackArg60, stackArg72, stackArg88, stackArg96, stackArg100, stackArg104, stackArg108, stackArg120, stackArg136, stackArg152, stackArg168, stackArg172, stackArg184, stackArg192, stackArg200, stackArg216, stackArg232, stackArg248, stackArg264, stackArg280, stackArg312, stackArg328, out s1_220, out a3_221, out a4_222, out s2_223, out s3_224, out s4_225, out s6_226, out s7_227, out mstatus_228);
		s0Out.u0 = <invalid>;
		s1Out = s1_91;
		a0Out = dwArg04;
		a3Out = s2_40;
		a5Out = a5_90;
		s2Out.u0 = <invalid>;
		s3Out = a0_51 + 8;
		s4Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		s6Out.u0 = <invalid>;
		mstatusOut.u0 = <invalid>;
		return <invalid>;
	}
}

// 2304BE40: void read_appearance(Register Eq_2 a2, Register Eq_2 a3, Register Eq_265022 a4)
void read_appearance(Eq_2 a2, Eq_2 a3, Eq_265022 a4)
{
	if (a4 <= 0x02)
	{
		Eq_2 s0_13 = 0x02 - a4;
		if (a3 < s0_13)
			s0_13 = a3;
		word32 a1_75;
		word32 a2_76;
		word32 a3_77;
		word32 a4_78;
		word32 a5_79;
		word32 a6_80;
		word32 a7_81;
		memcpy(a2, (word32) a4 + (fp + ~0x11), s0_13, out a1_75, out a2_76, out a3_77, out a4_78, out a5_79, out a6_80, out a7_81);
	}
}

