pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304BE7A: void read_ppcp(Register Eq_2 a2, Register Eq_2 a3, Register Eq_265051 a4)
void read_ppcp(Eq_2 a2, Eq_2 a3, Eq_265051 a4)
{
	if (a4 <= 0x08)
	{
		Eq_2 s0_16 = 0x08 - a4;
		if (a3 < s0_16)
			s0_16 = a3;
		word32 a1_78;
		word32 a2_79;
		word32 a3_80;
		word32 a4_81;
		word32 a5_82;
		word32 a6_83;
		word32 a7_84;
		memcpy(a2, (word32) a4 + (fp + ~0x17), s0_16, out a1_78, out a2_79, out a3_80, out a4_81, out a5_82, out a6_83, out a7_84);
	}
}

// 2304BEB8: void read_name(Register Eq_2 a2)
void read_name(Eq_2 a2)
{
	Eq_2 a0_18 = bt_get_name();
	int32 a3_21;
	uint32 a4_22;
	word32 a2_108;
	word32 a1_107;
	word32 a5_109;
	Eq_2 a0_20 = strlen(a0_18, out a1_107, out a2_108, out a3_21, out a4_22, out a5_109);
	if ((word32) (word16) a0_20 >= a4_22)
	{
		int32 s0_34 = (a0_20 & 0x0FFFFFFF) - a4_22;
		if (a3_21 < s0_34)
			s0_34 = a3_21;
		word32 a1_110;
		word32 a2_111;
		word32 a3_112;
		word32 a4_113;
		word32 a5_114;
		word32 a6_115;
		word32 a7_116;
		memcpy(a2, (word32) a0_18 + a4_22, s0_34 & 0x0FFFFFFF, out a1_110, out a2_111, out a3_112, out a4_113, out a5_114, out a6_115, out a7_116);
	}
}

// 2304BF0E: void bt_gatt_attr_read_ccc(Register Eq_2 a0, Register (ptr32 Eq_265123) a1)
void bt_gatt_attr_read_ccc(Eq_2 a0, struct Eq_265123 * a1)
{
	word32 a0_19;
	Eq_265125 a4_20;
	Eq_2 a3_29;
	word32 s4_130;
	Eq_2 s1_23 = find_ccc_cfg(a0, a1->ptr000C, out a0_19, out a3_29, out a4_20, out s4_130);
	if (a4_20 <= 0x02)
	{
		Eq_2 s0_41 = 0x02 - a4_20;
		if (a3_29 < s0_41)
			s0_41 = a3_29;
		word32 a6_136;
		word32 a7_137;
		word32 a5_135;
		word32 a4_134;
		word32 a3_133;
		word32 a2_132;
		word32 a1_131;
		memcpy(s1_23, (word32) a4_20 + (fp + -18), s0_41, out a1_131, out a2_132, out a3_133, out a4_134, out a5_135, out a6_136, out a7_137);
	}
}

// 2304BF60: void bt_gatt_attr_read_service(Register (ptr32 Eq_265167) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_265170 a4)
void bt_gatt_attr_read_service(struct Eq_265167 * a1, Eq_2 a2, Eq_2 a3, Eq_265170 a4)
{
	Eq_2 a2_21;
	Eq_2 a1_24;
	byte * a1_9 = a1->ptr000C;
	if ((word32) *a1_9 == 0x00)
	{
		if (a4 > 0x02)
			return;
		Eq_2 s0_29 = 0x02 - a4;
		if (a3 < s0_29)
			s0_29 = a3;
		a2_21 = s0_29;
		a1_24 = (word32) a4 + (fp + ~0x11);
	}
	else
	{
		if (a4 > 0x10)
			return;
		Eq_2 s0_17 = 0x10 - a4;
		if (a3 < s0_17)
			s0_17 = a3;
		a2_21 = s0_17;
		a1_24 = a1_9 + 0x01 + a4;
	}
	word32 a1_100;
	word32 a2_101;
	word32 a3_102;
	word32 a4_103;
	word32 a5_104;
	word32 a6_105;
	word32 a7_106;
	memcpy(a2, a1_24, a2_21, out a1_100, out a2_101, out a3_102, out a4_103, out a5_104, out a6_105, out a7_106);
}

// 2304BFBC: Register Eq_2 sc_save(Register Eq_2 ra, Register (ptr32 Eq_264793) a0, Register Eq_2 a1, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArgF8, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_265229 s4Out, Register out ptr32 s5Out)
// Called from:
//      sc_ccc_cfg_write
//      notify_cb
Eq_2 sc_save(Eq_2 ra, struct Eq_264793 * a0, Eq_2 a1, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArgF8, word32 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, union Eq_265229 & s4Out, ptr32 & s5Out)
{
	struct Eq_264793 * a0_24;
	word32 s3_279;
	word32 a3_278;
	word32 a2_277;
	up32 s2_30;
	ptr32 s1_108;
	Eq_265229 s4_113;
	ptr32 s5_114;
	find_sc_cfg(a0, a1, dwArgF8, out s1_108, out a0_24, out a2_277, out a3_278, out s2_30, out s3_279, out s4_113, out s5_114);
	struct Eq_264793 * s0_42 = a0_24;
	if (a0_24 == null)
	{
		struct Eq_264793 * a0_47;
		Eq_2 s3_54;
		Eq_2 a3_62;
		word32 a2_280;
		find_sc_cfg(a0_24, fp + -40, dwArgF8, out s1_108, out a0_47, out a2_280, out a3_62, out s2_30, out s3_54, out s4_113, out s5_114);
		s0_42 = a0_47;
		if (a0_47 == null)
		{
			word32 s11_302;
			word32 t4_303;
			word32 s10_301;
			word32 s8_299;
			word32 s9_300;
			word32 s7_298;
			word32 s6_297;
			word32 s3_296;
			word32 s2_295;
			word32 a7_294;
			word32 a5_293;
			word32 a4_292;
			word32 a3_291;
			word32 a2_290;
			word32 a1_289;
			word32 a0_288;
			ra = printf(ra, &g_t230BAEFC, a3_62, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_108, out a0_288, out a1_289, out a2_290, out a3_291, out a4_292, out a5_293, out a7_294, out s2_295, out s3_296, out s4_113, out s5_114, out s6_297, out s7_298, out s8_299, out s9_300, out s10_301, out s11_302, out t4_303);
			goto l2304BFFA;
		}
		a0_47->b0000 = (byte) s4_113;
		word32 a7_287;
		word32 a6_286;
		word32 a4_284;
		word32 a5_285;
		word32 a3_283;
		word32 a2_282;
		word32 a1_281;
		memcpy(&a0_47->b0000 + 1, s3_54, 0x07, out a1_281, out a2_282, out a3_283, out a4_284, out a5_285, out a6_286, out a7_287);
	}
	up32 a4_85 = (word32) s0_42->w0008;
	ptr32 a5_86 = (word32) s0_42->w000A;
	if (a4_85 == 0x00)
	{
		if (a5_86 == 0x00)
		{
			s0_42->w0008 = (word16) s2_30;
l2304C028:
			s0_42->w000A = (word16) s1_108;
l2304BFFA:
			0x00 = dwArg0128;
			s0Out = dwArgE4;
			s1Out = s1_108;
			s4Out = s4_113;
			s5Out = s5_114;
			return ra;
		}
	}
	else if (s2_30 < a4_85)
		s0_42->w0008 = (word16) s2_30;
	if (a5_86 >= s1_108)
		goto l2304BFFA;
	goto l2304C028;
}

// 2304C03E: void sc_ccc_cfg_write(Register Eq_2 ra, Register (ptr32 Eq_265366) a0, Register word32 a2, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack word32 dwArgE8, Stack word32 dwArg0118)
void sc_ccc_cfg_write(Eq_2 ra, struct Eq_265366 * a0, word32 a2, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, word32 dwArgE8, word32 dwArg0118)
{
	struct Eq_264793 * a0_9 = (word32) a0->b0008;
	if (a2 == 0x02)
	{
		word32 s0_127;
		word32 s1_128;
		word32 s4_129;
		word32 s5_130;
		sc_save(ra, a0_9, &a0->b0008 + 0x0068, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgE8, dwArg0118, out s0_127, out s1_128, out s4_129, out s5_130);
	}
	else
	{
		Eq_2 a0_12;
		word32 s1_120;
		word32 a2_121;
		word32 a3_122;
		word32 s2_123;
		word32 s3_124;
		word32 s4_125;
		word32 s5_126;
		find_sc_cfg(a0_9, &a0->b0008 + 0x0068, dwArg0118, out s1_120, out a0_12, out a2_121, out a3_122, out s2_123, out s3_124, out s4_125, out s5_126);
		if (a0_12 != 0x00)
		{
			word32 t1_131;
			word32 a0_132;
			word32 a1_133;
			word32 a2_134;
			word32 a3_135;
			word32 a4_136;
			word32 a5_137;
			memset(ra, a0_12, 0x00, 0x0C, out t1_131, out a0_132, out a1_133, out a2_134, out a3_135, out a4_136, out a5_137);
		}
	}
}

// 2304C072: void notify_cb(Register Eq_2 ra, Register Eq_2 a1, Register (ptr32 Eq_265435) a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack word32 dwArgB8, Stack word32 dwArgE8, Stack word32 dwArg0198)
void notify_cb(Eq_2 ra, Eq_2 a1, struct Eq_265435 * a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, word32 dwArgB8, word32 dwArgE8, word32 dwArg0198)
{
	struct Eq_265444 * a0_5 = a4->ptr0008;
	if (a4 != &g_t2304C23A)
		return;
	struct Eq_265450 * sp_161 = fp + -64;
	int32 s4_102 = a0_5->dw000C;
	Eq_2 s1_133 = a1;
	if (s4_102 == 0x4200DD38)
	{
		Eq_2 s0_119 = 1107384484;
		Eq_2 s5_103 = 0x420158D4;
		do
		{
			Eq_2 s3_39 = (word32) s0_119 + 1;
			Eq_2 a3_49;
			word32 a4_685;
			word32 a5_686;
			word32 a2_684;
			word32 a1_683;
			if (memcmp(s3_39, fp + -56, 0x07, out a1_683, out a2_684, out a3_49, out a4_685, out a5_686) != 0x00)
			{
				word32 a0_56;
				Eq_2 a3_59;
				Eq_2 a4_60;
				Eq_2 s3_66;
				word32 s2_667;
				word32 s8_668;
				word32 a5_666;
				word32 s1_665;
				s0_119 = bt_conn_lookup_state_le(s3_39, 0x04, a3_49, mstatus, out s1_665, out a0_56, out a3_59, out a4_60, out a5_666, out s2_667, out s3_66, out s4_102, out s8_668);
				if (a0_56 == 0x00)
					ra = sc_save(ra, (word32) *s0_119, s3_66, dwArg00, dwArg04, dwArg28, s7, dwArgB8, dwArgE8, out s0_119, out s1_133, out s4_102, out s5_103);
				else
				{
					word32 a5_671;
					word32 a3_669;
					word32 a4_670;
					s1_133 = bt_conn_unref(s0_119, a3_59, a4_60, mstatus, out a3_669, out a4_670, out a5_671);
				}
			}
			s0_119 = (word32) s0_119 + 0x0C;
		} while (s0_119 != s5_103);
	}
	Eq_2 s0_126 = s4_102 + 1;
	Eq_2 s6_127 = s4_102 + 21;
	word32 s7_128 = 0x04;
	do
	{
		if ((word32) *((word32) s0_126 + 7) == (word32) (*((word32) s1_133 + 4)))
		{
			Eq_2 a0_138;
			struct Eq_265477 * s4_145;
			word32 s3_661;
			Eq_2 s2_143;
			Eq_2 a2_139;
			word32 s8_147;
			Eq_2 s5_146;
			Eq_2 a4_150;
			Eq_2 a3_153;
			s0_126 = bt_conn_lookup_addr_le((word32) *((word32) s0_126 - 1), s0_126, mstatus, out s1_133, out a0_138, out a2_139, out a3_153, out a4_150, out s2_143, out s3_661, out s4_145, out s5_146, out s8_147);
			Eq_2 s3_154 = a0_138;
			if (a0_138 == 0x00)
				goto l2304C0E0;
			ptr32 mstatus_182;
			Eq_2 a3_178;
			if ((word32) *((word32) a0_138 + 0x0D) == s7_128)
			{
				Eq_2 a2_177;
				<anonymous> * a5_157 = s4_145->ptr0020;
				if (a5_157 == null)
				{
l2304C174:
					Eq_2 a3_212;
					Eq_2 a4_213;
					int32 a0_209;
					Eq_2 s1_198 = *((word32) a2_139 + 8);
					uint32 a1_200 = (word32) *((word32) s2_143 + 16) + ~0x00 << 16;
					if ((word32) *((word32) s1_133 + 4) == s8_147)
					{
						word32 s1_682;
						ra = gatt_indicate(ra, s1_198, s3_154, a2_139, a3_153, s2_143, s3_154, s5_146, mstatus, sp_161->dw0000, sp_161->dw0004, sp_161->dw0008, sp_161->dw000C, sp_161->dw0010, sp_161[2], sp_161->dw0018, sp_161->dw0020, sp_161->dw0024, sp_161[4], sp_161->dw002C, sp_161->dw0030, sp_161->dw0034, sp_161->dw0038, sp_161[6], sp_161->dw0048, sp_161[8], sp_161->dw0054, sp_161->dw0058, sp_161->dw005C, sp_161[0x0C], sp_161->dw007C, sp_161->dw0088, sp_161->dw0098, sp_161->dw009C, sp_161->dw00A8, sp_161->dw00AC, sp_161->dw00B8, sp_161->dw00C0, sp_161[20], sp_161->dw00D8, sp_161->dw00E8, sp_161->dw00F8, sp_161->dw0108, sp_161[28], sp_161->dw0138, sp_161->dw0148, out s0_126, out s1_682, out a0_209, out a3_212, out a4_213, out s6_127, out s7_128, out mstatus);
					}
					else
					{
						word32 s9_679;
						word32 a1_673;
						word32 s10_680;
						word32 s11_681;
						word32 s8_678;
						word32 s2_674;
						word32 s5_677;
						word32 s3_675;
						word32 s4_676;
						word32 s1_672;
						ra = gatt_notify(ra, s1_198, s3_154, a1_200 >> 16, a2_139, a3_153, s2_143, mstatus, sp_161->dw0000, sp_161->dw0004, sp_161->dw0008, sp_161->dw0010, sp_161[2], sp_161->dw0018, sp_161->dw001C, sp_161->dw0020, sp_161->dw0024, sp_161[4], sp_161->dw0030, sp_161->dw0034, sp_161->dw0038, sp_161[6], sp_161->dw0044, sp_161->dw0048, sp_161->dw004C, sp_161[8], sp_161->dw0054, sp_161->dw0058, sp_161->dw005C, sp_161->dw0074, sp_161[0x0C], sp_161->dw007C, sp_161->dw0088, sp_161->dw0098, sp_161->dw009C, sp_161->dw00A8, sp_161->dw00B8, sp_161[20], sp_161->dw00D0, sp_161->dw00D8, sp_161->dw00E8, sp_161->dw00F8, sp_161->dw0108, sp_161[28], sp_161->dw0128, sp_161->dw0148, sp_161->dw0158, out s0_126, out s1_672, out a0_209, out a1_673, out a3_212, out a4_213, out s2_674, out s3_675, out s4_676, out s5_677, out s6_127, out s7_128, out s8_678, out s9_679, out s10_680, out s11_681, out mstatus);
					}
					word32 a5_689;
					word32 a3_687;
					word32 a4_688;
					s1_133 = bt_conn_unref(s0_126, a3_212, a4_213, mstatus, out a3_687, out a4_688, out a5_689);
					if (a0_209 < 0x00)
						break;
					*s1_133 = 0x00;
					goto l2304C0E0;
				}
				word32 a0_163;
				word32 t3_179;
				word32 a6_180;
				word32 tp_181;
				word32 a7_183;
				word32 s10_184;
				word32 s11_185;
				word32 s9_186;
				word32 t0_187;
				word32 t1_188;
				word32 t4_189;
				word32 t5_190;
				word32 t6_191;
				a5_157();
				a2_139 = a2_177;
				a3_153 = a3_178;
				mstatus = mstatus_182;
				if (a0_163 != 0x00)
					goto l2304C174;
				mstatus = mstatus_182;
				a3_153 = a3_178;
			}
			word32 a3_662;
			word32 a4_663;
			word32 a5_664;
			s1_133 = bt_conn_unref(s0_126, a3_153, a4_150, mstatus, out a3_662, out a4_663, out a5_664);
			goto l2304C0E0;
		}
l2304C0E0:
		s0_126 = (word32) s0_126 + 0x0A;
	} while (s6_127 != s0_126);
	0x00 = dwArg0198;
}

// 2304C1AA: Register Eq_2 sc_indicate(Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out Eq_2 a3Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s5Out)
// Called from:
//      bt_gatt_service_unregister
//      bt_gatt_service_register
Eq_2 sc_indicate(Eq_2 s1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, union Eq_2 & a3Out, union Eq_2 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s5Out)
{
	Eq_2 a5_225;
	Eq_2 a4_46;
	ptr32 a0_23;
	Eq_2 a4_27;
	Eq_2 s3_33;
	word32 s8_305;
	word32 a5_302;
	word32 s2_303;
	word32 s4_304;
	Eq_2 s1_238;
	Eq_2 a3_221;
	Eq_2 s0_30 = bt_conn_lookup_state_le(0x00, 0x04, a3, mstatus, out s1_238, out a0_23, out a3_221, out a4_27, out a5_302, out s2_303, out s3_33, out s4_304, out s8_305);
	if (a0_23 != 0x00)
	{
		ui32 a0_42;
		word32 s8_309;
		word32 a1_306;
		word32 a2_307;
		word32 s4_308;
		s1_238 = atomic_or((word32) s0_30 - 0x07B4, 0x01, a3_221, a4_27, mstatus, out a0_42, out a1_306, out a2_307, out a3_221, out a4_46, out a5_225, out s4_308, out s8_309);
		if ((a0_42 & 0x01) == 0x00)
		{
			((word32) s0_30 - 0x0788)->u2 = (word16) s3_33;
			goto l2304C1E0;
		}
	}
	a4_46 = (word32) *((word32) s0_30 - 0x0788);
	a5_225 = (word32) *((word32) s0_30 - 0x0786);
	if (s3_33 >= a4_46)
	{
		if (a5_225 >= s1_238)
			goto l2304C222;
	}
	else
	{
		((word32) s0_30 - 0x0788)->u2 = (word16) s3_33;
		if (a5_225 >= s1_238)
			goto l2304C1E4;
	}
l2304C1E0:
	((word32) s0_30 - 0x0786)->u2 = (word16) s1_238;
l2304C1E4:
	if ((atomic_get((word32) s0_30 - 1888) >> 1 & 0x01) == 0x00 && a0_23 != 0x00)
	{
		word32 s8_317;
		word32 a2_313;
		word32 a5_314;
		Eq_2 a3_96;
		Eq_2 a4_97;
		ptr32 s2_101;
		Eq_2 s3_102;
		ptr32 s5_110;
		word32 s4_315;
		word32 s6_316;
		word32 s1_310;
		word32 a0_311;
		word32 a1_312;
		Eq_2 s0_99 = k_delayed_work_submit(0x0A, a3_221, a4_46, mstatus, dwLoc1C, s2, dwArg04, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s1_310, out a0_311, out a1_312, out a2_313, out a3_96, out a4_97, out a5_314, out s2_101, out s3_102, out s4_315, out s5_110, out s6_316, out s8_317);
		word32 a4_318;
		Eq_2 a3_126;
		Eq_2 a5_128;
		Eq_2 s1_129 = bt_conn_unref(s0_99, a3_96, a4_97, mstatus, out a3_126, out a4_318, out a5_128);
		a3Out = a3_126;
		a5Out = a5_128;
		s2Out = s2_101;
		s3Out = s3_102;
		s5Out = s5_110;
		return s1_129;
	}
l2304C222:
	a3Out = a3_221;
	a5Out = a5_225;
	s2Out = a0_23;
	s3Out = s3_33;
	s5Out = s5;
	return s1_238;
}

// 2304C23A: void bt_gatt_attr_write_ccc(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_266070) a1, Register word32 a3, Register word32 a4, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArg0128)
void bt_gatt_attr_write_ccc(Eq_2 ra, Eq_2 a0, struct Eq_266070 * a1, word32 a3, word32 a4, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArg0128)
{
	struct Eq_266078 * sp_107 = fp + -48;
	struct Eq_263508 * s5_114 = a1->ptr000C;
	if (a4 == 0x00 && (word32) ((word16) (a3 + -1)) <= 0x01)
	{
		Eq_2 a0_44;
		word32 s4_49;
		word32 a4_103;
		word32 a3_104;
		Eq_2 s1_111 = find_ccc_cfg(a0, s5_114, out a0_44, out a3_104, out a4_103, out s4_49);
		Eq_2 s0_102 = a0_44;
		if (a0_44 == 0x00)
		{
			if (s1_111 == 0x00)
				goto l2304C298;
			Eq_2 a0_58;
			Eq_2 a3_68;
			word32 a4_374;
			s1_111 = find_ccc_cfg(a0_44, s5_114, out a0_58, out a3_68, out a4_374, out s4_49);
			s0_102 = a0_58;
			if (a0_58 == 0x00)
			{
				word32 a3_384;
				word32 s6_392;
				word32 s5_391;
				word32 s4_390;
				word32 s7_393;
				word32 s11_397;
				word32 s3_389;
				word32 s10_396;
				word32 t4_398;
				word32 s9_395;
				word32 s8_394;
				word32 s2_388;
				word32 a4_385;
				word32 a5_386;
				word32 a7_387;
				word32 a2_383;
				word32 s1_380;
				word32 a0_381;
				word32 a1_382;
				printf(ra, &g_t230BADCC, a3_68, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_380, out a0_381, out a1_382, out a2_383, out a3_384, out a4_385, out a5_386, out a7_387, out s2_388, out s3_389, out s4_390, out s5_391, out s6_392, out s7_393, out s8_394, out s9_395, out s10_396, out s11_397, out t4_398);
				goto l2304C298;
			}
			word32 a7_379;
			word32 a6_378;
			word32 a1_375;
			word32 a2_376;
			word32 a5_377;
			memcpy((word32) a0_58 + 1, (word32) a0 + 112, 0x07, out a1_375, out a2_376, out a3_104, out a4_103, out a5_377, out a6_378, out a7_379);
			*a0_58 = (byte) (word32) *((word32) a0 + 8);
		}
		<anonymous> * a5_92 = s5_114->ptr001C;
		if (a5_92 != null)
		{
			word32 s9_220;
			word32 s7_219;
			word32 s6_218;
			word32 s10_216;
			word32 s11_217;
			word32 a6_118;
			word32 a0_120;
			word32 a5_124;
			word32 a7_125;
			word32 t0_126;
			word32 t1_127;
			word32 t4_128;
			word32 t5_129;
			word32 t6_130;
			a5_92();
			if (a0_120 == 0x00)
				goto l2304C298;
		}
		*((word32) s0_102 + 8) = (word16) s1_111;
		if ((word32) s5_114->w0014 != s1_111)
			gatt_ccc_changed(s5_114);
		if (s1_111 == 0x00)
		{
			sp_107->dw0004 = 0x00;
			sp_107->w000C = 0x00;
			sp_107->b000E = 0x00;
			word32 a4_402;
			word32 a2_400;
			word32 a3_401;
			word32 a5_403;
			word32 a1_399;
			word32 a7_405;
			word32 a6_404;
			memcpy((word32) s0_102 + 1, &sp_107->dw0004 + 1, 0x07, out a1_399, out a2_400, out a3_401, out a4_402, out a5_403, out a6_404, out a7_405);
			*s0_102 = 0x00;
			*((word32) s0_102 + 8) = 0x00;
		}
	}
l2304C298:
	0x00 = dwArg0128;
}

