pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304C314: Register Eq_2 bt_gatt_init(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s5Out)
// Called from:
//      bt_gatt_service_register
//      bt_att_init
Eq_2 bt_gatt_init(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0128, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s5Out)
{
	ptr32 a0_13;
	ptr32 a3_15;
	ptr32 a4_16;
	ptr32 a5_17;
	Eq_2 s0_18 = atomic_cas(0x00, a3, a4, mstatus, dwArg34, out a0_13, out a3_15, out a4_16, out a5_17);
	if (a0_13 == 0x00)
	{
		a0Out = a0_13;
		a3Out = a3_15;
		a4Out = a4_16;
		a5Out = a5_17;
		s2Out = s2;
		s5Out = s5;
		return <invalid>;
	}
	else
	{
		Eq_2 a4_26 = (word32) g_w4200F464;
		struct Eq_266308 * a1_27 = null;
		up32 a5_28 = 0x4200EF74;
		while (a5_28 < 0x4200EF84)
		{
			a5_28 = a1_27->dw0004 + 0x08;
			a4_26 = CONVERT(SLICE(a4_26 + a1_27, word16, 0), word16, word32);
			a1_27 = (struct Eq_266308 *) 0x01;
		}
		if (a1_27 != null)
			g_w4200F464 = (word16) a4_26;
		ptr32 a0_61;
		ptr32 a3_64;
		ptr32 a4_65;
		ptr32 a5_66;
		ptr32 s2_69;
		ptr32 s5_72;
		word32 s3_123;
		word32 s4_124;
		k_delayed_work_init(ra, s0_18, 1107384444, 0x4200F464, a4_26, mstatus, dwArg94, dwArgC8, dwArgE8, dwArg0128, out a0_61, out a3_64, out a4_65, out a5_66, out s2_69, out s3_123, out s4_124, out s5_72);
		a0Out = a0_61;
		a3Out = a3_64;
		a4Out = a4_65;
		a5Out = a5_66;
		s2Out = s2_69;
		s5Out = s5_72;
		return <invalid>;
	}
}

// 2304C37E: Register word32 bt_gatt_deinit(Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      bt_disable
word32 bt_gatt_deinit(Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0128, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	word32 a2_11;
	ptr32 a3_12;
	ptr32 a4_13;
	ptr32 a5_14;
	word32 a0_39;
	word32 s2_40;
	word32 s3_41;
	word32 s4_42;
	word32 s5_43;
	word32 s6_44;
	word32 s8_45;
	k_delayed_work_del_timer(1107384444, a4, a5, mstatus, dwArg34, dwArgA8, dwArgB8, dwArgE8, dwArg0128, out a0_39, out a2_11, out a3_12, out a4_13, out a5_14, out s2_40, out s3_41, out s4_42, out s5_43, out s6_44, out s8_45);
	a3Out = a3_12;
	a4Out = a4_13;
	a5Out = a5_14;
	return a2_11;
}

// 2304C38A: Register Eq_2 bt_gatt_service_unregister(Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      bt_mesh_proxy_prov_disable
//      bt_mesh_proxy_gatt_disable
//      bl_ble_sync_stop
Eq_2 bt_gatt_service_unregister(Eq_2 s0, Eq_2 s1, word32 a0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	Eq_2 a5_13 = g_t4200F458;
	Eq_2 a1_11 = 0x00;
	while (a5_13 != 0x00)
	{
		if (a0 + 8 == a5_13)
		{
			sys_slist_remove(a1_11, 0x4200F000, a5_13);
			ptr32 a3_45;
			Eq_2 a5_47;
			Eq_2 s2_51;
			ptr32 s3_52;
			ptr32 s5_58;
			Eq_2 s1_50 = sc_indicate(s1, 0x14, s2, mstatus, s0, dwArg48, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out a3_45, out a5_47, out s2_51, out s3_52, out s5_58);
			a2Out = dwArg10;
			a3Out = a3_45;
			a5Out = a5_47;
			s2Out = s2_51;
			s3Out = s3_52;
			s5Out = s5_58;
			return s1_50;
		}
		a1_11 = a5_13;
		a5_13 = *a5_13;
	}
	a2Out = a0 + 8;
	a3Out = a3;
	a5Out = a5_13;
	s2Out = s2;
	s3Out = s3;
	s5Out = s5;
	return s1;
}

// 2304C3DA: Register word32 bt_gatt_attr_read(Register Eq_2 a2, Register Eq_232797 a3, Register up32 a4, Register word32 a5, Register up32 a6)
// Called from:
//      proxy_ccc_read
//      read_data
word32 bt_gatt_attr_read(Eq_2 a2, Eq_232797 a3, up32 a4, word32 a5, up32 a6)
{
	if (a6 >= a4)
	{
		Eq_232797 s0_11 = a6 - a4;
		if (a3 < s0_11)
			s0_11 = a3;
		word32 a1_74;
		word32 a2_75;
		word32 a3_76;
		word32 a4_77;
		word32 a6_78;
		word32 a7_79;
		memcpy(a2, a5 + a4, (word32) (word16) s0_11, out a1_74, out a2_75, out a3_76, out a4_77, out a5, out a6_78, out a7_79);
	}
	return a5;
}

// 2304C40A: Register word32 bt_gatt_attr_value_handle(Register word32 a0, Register Eq_2 a2, Register out ptr32 a1Out, Register out ptr32 a3Out)
// Called from:
//      bt_gatt_attr_read_chrc
//      bt_gatt_notify_cb
//      bt_gatt_indicate
word32 bt_gatt_attr_value_handle(word32 a0, Eq_2 a2, ptr32 & a1Out, ptr32 & a3Out)
{
	word32 a5_10;
	if (a0 != 0x00)
	{
		a3 = 0x2304C450;
		a5_10 = 0x00;
		if (a2 == 0x2304C450)
		{
			Eq_2 a0_11 = *(union Eq_2 *) 0x0C;
			a5_10 = (word32) *(union Eq_2 *) 0x04;
			if (a5_10 == 0x00)
			{
				word32 a5_13 = (word32) *((word32) a0_11 + 16);
				if (a5_13 == 0x00)
				{
					ptr32 a1_23;
					ptr32 a3_24;
					word32 a4_70;
					word32 a2_69;
					word32 a0_31 = (word32) (word16) ((word32) find_static_attr(a0_11, out a1_23, out a2_69, out a3_24, out a4_70) + 1);
					a1Out = a1_23;
					a3Out = a3_24;
					return a0_31;
				}
				a5_10 = (word32) (word16) (a5_13 + 0x01);
			}
		}
	}
	else
		a5_10 = 0x00;
	a1Out = a1;
	a3Out = a3;
	return a5_10;
}

// 2304C450: void bt_gatt_attr_read_chrc(Register (ptr32 Eq_266492) s0, Register Eq_2 a2, Register int32 a3, Register Eq_266495 a4)
void bt_gatt_attr_read_chrc(struct Eq_266492 * s0, Eq_2 a2, int32 a3, Eq_266495 a4)
{
	Eq_266495 a5_55;
	byte * a1_27;
	word32 a3_161;
	bt_gatt_attr_value_handle(s0->dw000C, a2, out a1_27, out a3_161);
	if ((word32) *a1_27 == 0x00)
		a5_55.u0 = 0x05;
	else
	{
		word32 a3_164;
		word32 a2_163;
		word32 a1_162;
		word32 a4_165;
		word32 a5_166;
		word32 a6_167;
		word32 a7_168;
		memcpy(fp + -49, a1_27 + 1, 0x10, out a1_162, out a2_163, out a3_164, out a4_165, out a5_166, out a6_167, out a7_168);
		a5_55.u0 = 0x13;
	}
	if (a5_55 >= a4)
	{
		int32 s0_64 = a5_55 - a4;
		if (a3 < s0_64)
			s0_64 = a3;
		word32 a1_169;
		word32 a2_170;
		word32 a3_171;
		word32 a4_172;
		word32 a5_173;
		word32 a6_174;
		word32 a7_175;
		memcpy(a2, (word32) a4 + (fp + -52), (word32) (word16) s0_64, out a1_169, out a2_170, out a3_171, out a4_172, out a5_173, out a6_174, out a7_175);
	}
}

// 2304C4D6: Register Eq_2 bt_gatt_foreach_attr_type(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 code) a5, Register Eq_266569 a6, Register (ptr32 Eq_2096) s11, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out (ptr32 Eq_2096) s11Out)
// Called from:
//      bt_gatt_foreach_attr
//      bt_gatt_notify_cb
//      bt_gatt_indicate
//      bt_gatt_foreach_attr
Eq_2 bt_gatt_foreach_attr_type(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, <anonymous> * a5, Eq_266569 a6, struct Eq_2096 * s11, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, union Eq_2 & s10Out, struct Eq_2096 & s11Out)
{
	struct Eq_266589 * sp_164 = fp + -96;
	Eq_2 s2_166 = a0;
	Eq_2 s7_169 = a1;
	Eq_2 s3_167 = a2;
	Eq_2 s4_114 = a3;
	<anonymous> * s8_103 = a5;
	Eq_266569 s9_127 = a6;
	Eq_2 s0_102 = a4;
	if (a4 == 0x00)
		s0_102.u0 = 0x0FFFFFFF;
	Eq_2 s10_176;
	Eq_2 a5_101;
	if ((word32) g_w4200F464 >= a0)
	{
		s6.u0 = 0x01;
		struct Eq_2096 * s5_148 = &g_t4200EF84;
		for (s11 = (struct Eq_2096 *) g_a4200EF74; s11 < s5_148; s11 += 8)
		{
			Eq_2 s1_195;
			word32 s1_60 = Mem57[s11 + 4:int32] + s6;
			if (s1_60 < s2_166)
				s1_195 = (word32) (word16) s1_60;
			else
			{
				s10_176.u0 = 0x00;
				while (true)
				{
					a4 = s11[4];
					s1_195 = CONVERT(SLICE(s6 + s10_176, word16, 0), word16, word32);
					if (s10_176 >= a4)
						break;
					a0 = sp_164 + 0x0C;
					word32 a7_827;
					memcpy(a0, (word32) s11->t0000 + ((byte) s10_176.u0 + 20), 0x14, out a1, out a2, out a3, out a4, out a5_101, out a6, out a7_827);
					sp_164[28] = (struct Eq_266589) (word16) s1_195;
					if (s7_169 < s1_195)
						goto l2304C5AA;
					if (s1_195 >= s2_166)
					{
						if (s3_167 != 0x00)
						{
							s0_102 = bt_uuid_cmp(s3_167, a1, out a0, out a1, out a2, out a3, out a4, out a5_101, out a6, out s8_103);
							if (a0 != 0x00)
								goto l2304C560;
						}
						if (s4_114 == 0x00)
						{
l2304C59A:
							word32 t1_189;
							word32 t5_190;
							word32 t6_191;
							s8_103();
							if (s0_102 == 0x00 || a0 == 0x00)
								goto l2304C5AA;
							goto l2304C560;
						}
						s8_103 = (<anonymous> *) sp_164[0x00C4];
						if (s4_114 == a4)
							goto l2304C59A;
						goto l2304C560;
					}
l2304C560:
					s10_176 = (byte) s10_176.u0 + 1;
				}
			}
			s6 = s1_195;
		}
	}
	a5_101 = g_t4200F458;
	s10_176.u0 = 0x14;
	int32 s1_204 = (word32) a5_101 - 8;
	if (a5_101 != 0x00)
	{
		while (s1_204 != 0x00)
		{
			struct Eq_266619 * s1_208 = *((word32) a5_101 + 8);
			if (a5_101 != 0x00)
			{
				a4 = (word32) a5_101 - 8;
				if (a4 == 0x00)
					goto l2304C53A;
				a5_101 = (word32) *((word32) *((word32) a5_101 - 8) + 16);
				if (s2_166 < a5_101)
					goto l2304C53A;
			}
			else
			{
l2304C53A:
				Eq_2 s5_213 = 0x00;
				while (true)
				{
					s1_208 = (struct Eq_266619 *) *((word32) a5_101 + 4);
					if (s5_213 >= a5_101)
						break;
					s6 = s5_213 + s10_176 + a5_101;
					word32 s1_220 = *a5_101;
					a5_101 = (word32) *((word32) s6 + 16);
					if (s7_169 < a5_101)
						goto l2304C5AA;
					if (a5_101 >= s2_166)
					{
						if (s3_167 != 0x00)
						{
							s0_102 = bt_uuid_cmp(s3_167, *s6, out a0, out a1, out a2, out a3, out a4, out a5_101, out a6, out s8_103);
							if (a0 != 0x00)
								goto l2304C622;
						}
						if (s4_114 == 0x00)
						{
l2304C604:
							word32 t1_325;
							word32 t5_326;
							word32 t6_327;
							s8_103();
							if (s0_102 == 0x00 || a0 == 0x00)
								goto l2304C5AA;
							goto l2304C622;
						}
						a5_101 = *((word32) s6 + 0x0C);
						if (s4_114 == a5_101)
							goto l2304C604;
						goto l2304C622;
					}
l2304C622:
					s5_213 = (word32) s5_213 + 1;
				}
			}
			word32 s1_332 = s1_208->dw0008;
			if (s1_332 == 0x00)
				break;
			s1_204 = s1_332 + ~0x07;
		}
	}
l2304C5AA:
	s0Out = s0_102;
	s1Out = dwArg28;
	a0Out = a0;
	a1Out = a1;
	a2Out = dwArg011C;
	a3Out = dwArg08;
	a4Out = a4;
	a5Out = a5_101;
	s2Out = s2_166;
	s3Out = s3_167;
	s4Out = dwArgDC;
	s5Out = s4;
	s6Out = s6;
	s7Out = s7_169;
	s8Out = dwArgBC;
	s9Out = dwLoc5C;
	s10Out = s10_176;
	s11Out = s11;
	return dwArg68;
}

// 2304C63C: Register Eq_2 bt_gatt_foreach_attr(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 code) a2, Register Eq_266569 a3, Register (ptr32 Eq_2096) s11, Register out ptr32 s0Out, Register out (ptr32 Eq_266800) s1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_266803) a4Out, Register out (ptr32 Eq_266804) a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_266806) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s11Out)
// Called from:
//      bt_gatt_service_register
//      bt_gatt_connected
//      bt_gatt_encrypt_change
//      bt_gatt_disconnected
Eq_2 bt_gatt_foreach_attr(Eq_2 ra, Eq_2 a0, Eq_2 a1, <anonymous> * a2, Eq_266569 a3, struct Eq_2096 * s11, ptr32 & s0Out, struct Eq_266800 & s1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_266803 & a4Out, struct Eq_266804 & a5Out, ptr32 & s2Out, struct Eq_266806 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s11Out)
{
	ptr32 a2_16;
	ptr32 a3_17;
	struct Eq_266803 * a4_18;
	struct Eq_266804 * a5_19;
	ptr32 s0_23;
	struct Eq_266800 * s1_24;
	ptr32 s11_26;
	ptr32 s2_27;
	struct Eq_266806 * s3_28;
	ptr32 s4_29;
	ptr32 s5_30;
	ptr32 s6_31;
	word32 a0_53;
	word32 a1_54;
	word32 s7_55;
	word32 s8_56;
	word32 s9_57;
	word32 s10_58;
	Eq_2 ra_22 = bt_gatt_foreach_attr_type(ra, a0, a1, 0x00, 0x00, 0x00, a2, a3, s11, out s0_23, out s1_24, out a0_53, out a1_54, out a2_16, out a3_17, out a4_18, out a5_19, out s2_27, out s3_28, out s4_29, out s5_30, out s6_31, out s7_55, out s8_56, out s9_57, out s10_58, out s11_26);
	s0Out = s0_23;
	s1Out = s1_24;
	a2Out = a2_16;
	a3Out = a3_17;
	a4Out = a4_18;
	a5Out = a5_19;
	s2Out = s2_27;
	s3Out = s3_28;
	s4Out = s4_29;
	s5Out = s5_30;
	s6Out = s6_31;
	s11Out = s11_26;
	return ra_22;
}

// 2304C64A: Register Eq_2 bt_gatt_service_register(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register word32 s6, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_proxy_prov_enable
//      bt_mesh_proxy_gatt_enable
//      ble_tp_init
//      bl_ble_sync_start
Eq_2 bt_gatt_service_register(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s5, word32 s6, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 a0_25;
	union Eq_2 * a5_30;
	Eq_2 s2_36;
	word32 a3_726;
	word32 a4_727;
	ptr32 s5_194;
	bt_gatt_init(ra, a3, a4, mstatus, dwArg04, ra, dwArg98, dwArgB8, dwArgF8, out a0_25, out a3_726, out a4_727, out a5_30, out s2_36, out s5_194);
	Eq_2 s1_157 = *a5_30;
	byte bLoc27_378 = SLICE(s6, byte, 8);
	Eq_2 a0_48;
	union Eq_2 * a5_52;
	word32 s8_732;
	word32 a1_728;
	word32 a4_730;
	word32 a2_729;
	word32 a6_731;
	Eq_2 a3_124;
	Eq_2 s0_53 = bt_uuid_cmp(a0_25, fp + -44, out a0_48, out a1_728, out a2_729, out a3_124, out a4_730, out a5_52, out a6_731, out s8_732);
	Eq_2 dwLoc2C_383 = SEQ(0xF800, bLoc2B, 0x00);
	if (a0_48 == 0x00)
	{
l2304C67C:
		goto l2304C680;
	}
	s1_157 = *a5_52;
	Eq_2 a0_70;
	Eq_2 a2_78;
	word32 s8_735;
	word32 a5_733;
	word32 a6_734;
	Eq_2 a4_126;
	Eq_2 a1_137;
	bt_uuid_cmp(a0_48, fp + -40, out a0_70, out a1_137, out a2_78, out a3_124, out a4_126, out a5_733, out a6_734, out s8_735);
	Eq_2 dwLoc28_379 = SEQ((word16) ((word32) s0_53 - 0x07FF), bLoc27_378, 0x00);
	if (a0_70 == 0x00)
		goto l2304C67C;
	Eq_2 s2_128;
	struct Eq_266935 * a5_127;
	Eq_2 s5_129;
	Eq_2 a5_87 = g_t4200F458;
	struct Eq_266940 * s3_134 = *s1_157;
	word32 s4_135 = (word32) *((word32) s1_157 + 4);
	if (a5_87 == 0x00)
	{
		a5_127 = (struct Eq_266935 *) &g_t4200F000;
		s2_128 = (word32) g_w4200F464;
		s5_129.u0 = 0x00;
	}
	else
	{
		Eq_2 s0_91 = *((word32) a5_87 + 4);
		if (a5_87 == 0x00)
		{
			__ebreak();
			Eq_2 a3_97;
			ptr32 s0_103;
			Eq_2 s1_104;
			ptr32 s5_110;
			ptr32 mstatus_122;
			word32 s10_768;
			word32 s11_769;
			word32 s7_765;
			word32 s9_767;
			word32 s8_766;
			word32 s6_764;
			word32 s3_762;
			word32 a1_758;
			word32 a5_760;
			word32 s2_761;
			word32 a0_757;
			word32 a4_759;
			word32 s4_763;
			Eq_2 ra_102 = bt_gatt_notify_cb(ra, s0_91, a0_70, a2_78, a4_126, s2_36, s11, mstatus, dwLoc30, dwLoc2C_383, dwLoc28_379, s4, s0, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg3C, dwArg48, s5, dwArg68, dwArg70, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, out s0_103, out s1_104, out a0_757, out a1_758, out a3_97, out a4_759, out a5_760, out s2_761, out s3_762, out s4_763, out s5_110, out s6_764, out s7_765, out s8_766, out s9_767, out s10_768, out s11_769, out mstatus_122);
			s0Out = s0_103;
			s1Out = s1_104;
			a3Out = a3_97;
			s5Out = s5_110;
			mstatusOut = mstatus_122;
			return ra_102;
		}
		int32 a4_123 = *((word32) a5_87 - 4);
		a5_127 = (word32) *((word32) a5_87 - 8) + (a4_123 + 0x14);
		s2_128 = (word32) a5_127->wFFFFFFFC;
		a3_124.u0 = 0x14;
		a4_126 = a4_123 + 0x14;
		s5_129 = s2_128;
	}
	word32 s6_133 = 0x2304C000;
	while (s3_134 != null && s4_135 != 0x00)
	{
		a1_137 = (word32) s3_134->w0010;
		if (a1_137 == 0x00)
		{
			a1_137 = (word32) (word16) ((word32) s2_128 + 1);
			s3_134->w0010 = (word16) a1_137;
		}
		else if (s2_128 >= a1_137)
		{
			Eq_2 s2_160;
			word32 a2_740;
			word32 s0_739;
			ra = bt_gatt_foreach_attr(ra, a1_137, a1_137, s6_133 + -0x073C, fp + -36, s11, out s0_739, out s1_157, out a2_740, out a3_124, out a4_126, out a5_127, out s2_160, out s3_134, out s4_135, out s5_129, out s6_133, out s11);
			if (a5_127 != null)
			{
				word32 s4_749;
				word32 s2_747;
				word32 a2_743;
				word32 a5_745;
				word32 a7_746;
				word32 a1_742;
				word32 a4_744;
				word32 a0_741;
				word32 s7_751;
				word32 s11_755;
				word32 s3_748;
				word32 s8_752;
				word32 s9_753;
				word32 s10_754;
				word32 s6_750;
				word32 t4_756;
				ra = printf(ra, &g_t230BAE24, a3_124, dwLoc28_379, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_157, out a0_741, out a1_742, out a2_743, out a3_124, out a4_744, out a5_745, out a7_746, out s2_747, out s3_748, out s4_749, out s5_194, out s6_750, out s7_751, out s8_752, out s9_753, out s10_754, out s11_755, out t4_756);
				goto l2304C680;
			}
			a1_137 = s2_160;
		}
		++s3_134;
		s4_135 = (word32) (word16) (s4_135 + ~0x00);
		s2_128 = a1_137;
	}
	struct Eq_266964 * a5_242;
	Eq_2 s0_244;
	if (s5_129 != 0x00)
	{
		s1_157 = a5_127->dw0000;
		Eq_2 a2_224 = (word32) a5_127->w0010;
		if (s5_129 >= a2_224)
		{
			if (a3_124 != 0x00)
			{
				ptr32 a5_230 = (byte) a3_124.u0 - 8;
				a4_126.u0 = 0x00;
				while (a5_230 != 0x00)
				{
					a1_137 = (word32) *((word32) a1_137 + 16);
					if (a2_224 < a1_137)
					{
						a5_242 = (word32) s1_157 + 8;
						if (a4_126 == 0x00)
						{
							s0_244 = *((byte) a4_126.u0 + 4);
							*((byte) a3_124.u0 + 8) = s1_157;
							*((word32) s1_157 + 8) = s0_244;
							if (a4_126 == 0x00)
								goto l2304C7A4;
							break;
						}
						else
						{
							a4_126 = *((byte) a3_124.u0 + 8);
							if (a3_124 == 0x00)
								goto l2304C726;
							*((byte) a3_124.u0 + 8) = s1_157;
							*((word32) s1_157 + 16) = a4_126;
							break;
						}
					}
					Eq_2 a5_238 = *((word32) a1_137 + 8);
					if (a1_137 == 0x00)
						break;
					a4_126 = a5_238;
					a5_230 = (word32) a1_137 - 8;
				}
			}
			goto l2304C732;
		}
	}
	a5_242 = (word32) s1_157 + 8;
l2304C726:
	s0_244 = *((byte) a4_126.u0 + 4);
	*((word32) s1_157 + 8) = 0x00;
	if (a4_126 == 0x00)
	{
		a5_242->t0004 = s0_244;
		a5_242->t0000 = s0_244;
	}
	else
	{
		a5_242->t0000 = a4_126;
l2304C7A4:
		a5_242->t0004 = s0_244;
	}
l2304C732:
	word32 s2_737;
	word32 a5_736;
	word32 s3_738;
	s1_157 = sc_indicate(*a4_126, 0x14, s2_128, mstatus, dwLoc2C_383, dwArg28, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, out a3_124, out a5_736, out s2_737, out s3_738, out s5_194);
l2304C680:
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_157;
	a3Out = a3_124;
	s5Out = s5_194;
	mstatusOut = mstatus;
	return ra;
}

