pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304C7C4: Register Eq_2 bt_gatt_notify_cb(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 s2, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_233807 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_233807 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_233815) s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out (ptr32 Eq_2096) s11Out, Register out ptr32 mstatusOut)
// Called from:
//      proxy_send
//      bt_gatt_service_register
//      ble_tp_notify_task
Eq_2 bt_gatt_notify_cb(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 s2, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA0, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_233807 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_233807 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, struct Eq_233815 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, struct Eq_2096 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a3_113;
	Eq_233807 a5_130;
	Eq_2 a1_112 = *((word32) a4 + 4);
	Eq_2 dwLoc2C_255 = a4;
	if (a0 != 0x00)
	{
		a2 = (word32) *((word32) a0 + 0x0D);
		a3_113.u0 = 0x04;
		a5_130.u0 = -57;
		if (a2 != 0x04)
			goto l2304C7F8;
	}
	Eq_2 s0_21 = (word32) *((word32) a4 + 16);
	s1 = a1_112;
	s2 = a0;
	if (s0_21 == 0x00)
	{
		a0 = find_static_attr(a4, out a1_112, out a2, out a3_113, out a4);
		s0_21 = a0;
		if (a0 == 0x00)
			goto l2304C7F6;
	}
	s1 = *a2;
	if (a2 == 0x00)
	{
l2304C838:
		word32 a0_111;
		struct Eq_267263 * a5_115;
		Eq_2 a2_119;
		word32 a4_592;
		word32 a6_593;
		Eq_2 s0_116 = bt_uuid_cmp(a0, fp + -36, out a0_111, out a1_112, out a2_119, out a3_113, out a4_592, out a5_115, out a6_593, out s8);
		if (a0_111 == 0x00)
		{
			ui32 a4_129 = (word32) a5_115->b0006;
			word32 a0_128 = a5_115->dw000C;
			a5_130.u0 = ~0x15;
			a4 = a4_129 & 0x10;
			if ((a4_129 & 0x10) == 0x00)
				goto l2304C7F8;
			word32 a1_598;
			s0_116 = bt_gatt_attr_value_handle(a0_128, a2_119, out a1_598, out a3_113);
		}
		if (s2 != 0x00)
		{
			Eq_233807 a0_210;
			word32 s0_603;
			ra = gatt_notify(ra, s1, s2, s0_116, s1, a3_113, s2, mstatus, dwLoc30, dwLoc2C_255, dwLoc28, s2, s0, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA0, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, out s0_603, out s1, out a0_210, out a1_112, out a3_113, out a4, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out mstatus);
			a5_130 = a0_210;
		}
		else
		{
			word32 a2_601;
			word32 s4_602;
			word32 s0_599;
			word32 a0_600;
			ra = bt_gatt_foreach_attr_type(ra, s0_116, 0x0FFFFFFF, fp + -32, 0x00, 0x01, &g_t2304C072, fp + -28, s11, out s0_599, out s1, out a0_600, out a1_112, out a2_601, out a3_113, out a4, out a5_130, out s2, out s3, out s4_602, out s5, out s6, out s7, out s8, out s9, out s10, out s11);
			s4 = dwArgB4;
		}
l2304C7F8:
		0x00 = (int8) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1;
		a0Out = a5_130;
		a1Out = a1_112;
		a3Out = a3_113;
		a4Out = a4;
		a5Out = a5_130;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		dwLoc2C_255.u0 = 0x00;
		word32 s0_594;
		word32 a2_595;
		word32 a5_596;
		ra = bt_gatt_foreach_attr_type(ra, s0_21, 0x0FFFFFFF, a2, 0x00, 0x01, &g_t2304BC28, fp + -40, s11, out s0_594, out s1, out a0, out a1_112, out a2_595, out a3_113, out a4, out a5_596, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11);
		if (a0 != 0x00)
		{
			if ((word32) *((word32) a0 + 16) != 0x00)
				goto l2304C838;
			word32 a2_597;
			a0 = find_static_attr(a0, out a1_112, out a2_597, out a3_113, out a4);
			if (a0 != 0x00)
				goto l2304C838;
		}
l2304C7F6:
		a5_130.u0 = ~0x01;
		goto l2304C7F8;
	}
}

// 2304C8B4: Register Eq_2 bt_gatt_indicate(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg90, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_267452 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      sc_process
//      update_ccc
Eq_2 bt_gatt_indicate(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s5, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg90, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_267452 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & mstatusOut)
{
	Eq_2 a3_113;
	Eq_267452 a5_130;
	Eq_2 a1_13 = *((word32) a4 + 28);
	Eq_2 dwLoc2C_265 = a4;
	if (a0 != 0x00)
	{
		a2 = (word32) *((word32) a0 + 0x0D);
		a3_113.u0 = 0x04;
		a5_130.u0 = -57;
		if (a2 != 0x04)
			goto l2304C8E8;
	}
	Eq_2 s0_21 = (word32) *((word32) a4 + 16);
	s1 = a1_13;
	Eq_2 s2_144 = a0;
	if (s0_21 == 0x00)
	{
		word32 a1_581;
		a0 = find_static_attr(a4, out a1_581, out a2, out a3_113, out a4);
		s0_21 = a0;
		if (a0 == 0x00)
			goto l2304C8E6;
	}
	s1 = *((word32) a2 + 24);
	if (a2 == 0x00)
	{
l2304C928:
		struct Eq_267499 * a0_111;
		struct Eq_267500 * a5_115;
		Eq_2 a2_119;
		word32 a1_582;
		word32 a4_583;
		word32 s8_585;
		word32 a6_584;
		Eq_2 s0_116 = bt_uuid_cmp(a0, fp + -36, out a0_111, out a1_582, out a2_119, out a3_113, out a4_583, out a5_115, out a6_584, out s8_585);
		Eq_2 dwLoc24_399 = SEQ(0xF803, bLoc23, 0x00);
		if (a0_111 == null)
		{
			ui32 a4_129 = (word32) a5_115->b0006;
			s1 = a0_111->t001C;
			word32 a0_128 = a5_115->dw000C;
			a5_130.u0 = ~0x15;
			a4 = a4_129 & 32;
			if ((a4_129 & 32) == 0x00)
				goto l2304C8E8;
			word32 a1_598;
			s0_116 = bt_gatt_attr_value_handle(a0_128, a2_119, out a1_598, out a3_113);
		}
		if (s2_144 != 0x00)
		{
			Eq_267452 a0_220;
			word32 s0_613;
			word32 s6_614;
			word32 s7_615;
			ra = gatt_indicate(ra, s1, s2_144, s1, a3_113, s2_144, s3, s5, mstatus, dwLoc30, dwLoc2C_265, dwLoc28, dwLoc24_399, s2, s0, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg90, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, out s0_613, out s1, out a0_220, out a3_113, out a4, out s6_614, out s7_615, out mstatus);
			a5_130 = a0_220;
		}
		else
		{
			word32 s11_612;
			word32 s7_608;
			word32 s8_609;
			word32 s9_610;
			word32 s10_611;
			word32 s4_605;
			word32 s5_606;
			word32 s6_607;
			word32 a1_601;
			word32 a2_602;
			word32 s2_603;
			word32 s3_604;
			word32 s0_599;
			word32 a0_600;
			ra = bt_gatt_foreach_attr_type(ra, s0_116, 0x0FFFFFFF, fp + -32, 0x00, 0x01, &g_t2304C072, fp + -28, s11, out s0_599, out s1, out a0_600, out a1_601, out a2_602, out a3_113, out a4, out a5_130, out s2_603, out s3_604, out s4_605, out s5_606, out s6_607, out s7_608, out s8_609, out s9_610, out s10_611, out s11_612);
		}
l2304C8E8:
		0x00 = dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1;
		a0Out = a5_130;
		a3Out = a3_113;
		a4Out = a4;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		dwLoc2C_265.u0 = 0x00;
		word32 s8_593;
		word32 s9_594;
		word32 s10_595;
		word32 s6_591;
		word32 s7_592;
		word32 a1_587;
		word32 s0_586;
		word32 a5_589;
		word32 a2_588;
		word32 s4_590;
		ra = bt_gatt_foreach_attr_type(ra, s0_21, 0x0FFFFFFF, a2, 0x00, 0x01, &g_t2304BC28, fp + -40, s11, out s0_586, out s1, out a0, out a1_587, out a2_588, out a3_113, out a4, out a5_589, out s2_144, out s3, out s4_590, out s5, out s6_591, out s7_592, out s8_593, out s9_594, out s10_595, out s11);
		if (a0 != 0x00)
		{
			if ((word32) *((word32) a0 + 16) != 0x00)
				goto l2304C928;
			word32 a2_597;
			word32 a1_596;
			a0 = find_static_attr(a0, out a1_596, out a2_597, out a3_113, out a4);
			if (a0 != 0x00)
				goto l2304C928;
		}
l2304C8E6:
		a5_130.u0 = ~0x01;
		goto l2304C8E8;
	}
}

