pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304C9A6: void sc_process(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0108)
void sc_process(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s5, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0108)
{
	Eq_2 a2_25;
	Eq_2 a4_27;
	word32 s8_161;
	word32 s4_160;
	word32 a5_159;
	word32 a3_158;
	word32 a1_157;
	word32 a0_156;
	atomic_and(a0, ~0x01, a3, a4, mstatus, out a0_156, out a1_157, out a2_25, out a3_158, out a4_27, out a5_159, out s4_160, out s8_161);
	*((word32) a0 + 0x0FEC) = 587967768;
	*((word32) a0 + 0x0FF0) = 587512878;
	*((word32) a0 + 0x0FF4) = fp + ~0x13;
	*((word32) a0 + 0x0FFC) = 0x00;
	*((word32) a0 + 0x0FFE) = 0x00;
	*((word32) a0 + 0x0FF8) = 0x04;
	word32 a0_50;
	Eq_2 a3_53;
	Eq_2 a4_54;
	Eq_2 s0_59;
	ptr32 mstatus_78;
	word32 s1_162;
	bt_gatt_indicate(ra, a0, 0x00, a2_25, a4_27, (word32) a0 - 48, s3, s5, s11, mstatus, dwLoc20, dwLoc1C, s2, s0, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg4C, dwArg58, dwArg5C, s1, dwArg70, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out s0_59, out s1_162, out a0_50, out a3_53, out a4_54, out mstatus_78);
	if (a0_50 == 0x00)
	{
		word32 s8_170;
		word32 s4_169;
		word32 a5_168;
		word32 a4_167;
		word32 a3_166;
		word32 a2_165;
		word32 a1_164;
		word32 a0_163;
		atomic_or(s0_59, 0x02, a3_53, a4_54, mstatus_78, out a0_163, out a1_164, out a2_165, out a3_166, out a4_167, out a5_168, out s4_169, out s8_170);
	}
}

// 2304CA12: Register Eq_2 bt_gatt_get_mtu(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      proxy_segment_and_send
//      exchange_func
//      ble_tp_tx_mtu_size
//      __bl_ble_sync_task
Eq_2 bt_gatt_get_mtu(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 a0_7;
	ptr32 a3_10;
	ptr32 a4_11;
	ptr32 s10_16;
	ptr32 s11_17;
	ptr32 s2_18;
	ptr32 s3_19;
	ptr32 s4_20;
	word32 s1_42;
	word32 a2_43;
	Eq_2 ra_14 = bt_att_get_mtu(ra, a0, a3, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_42, out a0_7, out a2_43, out a3_10, out a4_11, out s2_18, out s3_19, out s4_20, out s10_16, out s11_17);
	a0Out = a0_7;
	a3Out = a3_10;
	a4Out = a4_11;
	s2Out = s2_18;
	s3Out = s3_19;
	s4Out = s4_20;
	s10Out = s10_16;
	s11Out = s11_17;
	return ra_14;
}

// 2304CA16: Register Eq_2 bt_gatt_check_perm(Register Eq_2 a0, Register Eq_2 a1, Register int32 a2, Register out ptr32 a2Out, Register out Eq_267835 a4Out, Register out Eq_2 a5Out)
// Called from:
//      update_ccc
//      read_type_cb
//      write_cb
//      read_cb
Eq_2 bt_gatt_check_perm(Eq_2 a0, Eq_2 a1, int32 a2, ptr32 & a2Out, union Eq_267835 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_15;
	ui32 s0_13 = (word32) *((word32) a1 + 18);
	if ((a2 & 1) != 0x00)
	{
		a4 = s0_13 & 21;
		a5_15.u0 = 0x02;
		if ((s0_13 & 21) == 0x00 || (s0_13 & 21) == 0x00)
			goto l2304CA56;
	}
	if ((a2 & 2) != 0x00)
	{
		a4 = s0_13 & 42;
		a5_15.u0 = 0x03;
		if ((s0_13 & 42) == 0x00 || (s0_13 & 42) == 0x00)
			goto l2304CA56;
	}
	ui32 s0_26 = s0_13 & a2;
	if ((s0_26 & 48) != 0x00)
	{
		a4.u0 = 0x02;
		a5_15.u0 = 0x05;
		if (bt_conn_get_security(a0) <= 0x02)
			goto l2304CA56;
	}
	a5_15 = s0_26 & 0x0C;
	if ((s0_26 & 0x0C) != 0x00)
	{
		a4 = (word32) *((word32) a0 + 11);
		a5_15.u0 = 0x00;
		if (a4 == 0x00)
			a5_15.u0 = 0x0F;
	}
l2304CA56:
	a2Out = dwArg10;
	a4Out = a4;
	a5Out = a5_15;
	return a5_15;
}

// 2304CA7C: void update_ccc(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_267900) a4, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s9, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack word32 dwArgE8, Stack word32 dwArg0198)
void update_ccc(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_267900 * a4, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s9, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, word32 dwArgE8, word32 dwArg0198)
{
	struct Eq_267926 * a0_5 = a4->ptr0008;
	if (a4 != &g_t2304C23A)
		return;
	struct Eq_263508 * s5_238 = a0_5->ptr000C;
	struct Eq_267936 * s4_217 = *s0;
	Eq_2 s2_235 = &s5_238->b0000 + 1;
	Eq_2 s6_239 = (char *) &s5_238->w0014 + 1;
	struct Eq_267946 * s7_240 = (struct Eq_267946 *) 0x03;
	struct Eq_267946 * s8_241 = (struct Eq_267946 *) 0x05;
	word32 s9_221 = 0x230BB000;
	do
	{
		word32 a0_47;
		Eq_2 a3_50;
		word32 a4_677;
		word32 a5_678;
		Eq_2 s1_53 = bt_conn_addr_le_cmp(s0, s2_235, s6, out a0_47, out a3_50, out a4_677, out a5_678);
		if (a0_47 == 0x00)
		{
			word32 a5_634;
			word32 a2_632;
			word32 a4_633;
			struct Eq_267946 * a0_58 = bt_gatt_check_perm(s0, s1_53, 42, out a2_632, out a4_633, out a5_634);
			if (a0_58 != null)
			{
				if (a0_58 == s7_240)
				{
					word32 a0_636;
					word32 s1_635;
					word32 a2_638;
					word32 a5_641;
					word32 a1_637;
					word32 a3_639;
					word32 a4_640;
					word32 s3_643;
					word32 a7_642;
					word32 s10_644;
					word32 t4_645;
					ra = printf(ra, s9_221 + -224, a3_50, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_635, out a0_636, out a1_637, out a2_638, out a3_639, out a4_640, out a5_641, out a7_642, out s2_235, out s3_643, out s4_217, out s5_238, out s6_239, out s7_240, out s8_241, out s9_221, out s10_644, out s11, out t4_645);
					goto l2304CAE2;
				}
				up32 s3_66 = 0x02;
				if (a0_58 == s8_241)
					s3_66 = 0x03;
				if (bt_conn_get_security(s0) >= s3_66)
					goto l2304CB0A;
				if ((word32) s4_217->b0004 < s3_66)
					s4_217->b0004 = (byte) s3_66;
			}
			else
			{
l2304CB0A:
				if ((word32) *((word32) s2_235 + 7) != 0x00)
				{
					gatt_ccc_changed(s5_238);
					if (s5_238 == &g_t4200DD38)
					{
						struct Eq_268025 * a0_97;
						Eq_2 a2_98;
						Eq_2 s2_103;
						Eq_2 s3_104;
						Eq_2 s5_106;
						word32 s1_646;
						word32 a3_647;
						word32 s4_648;
						Eq_2 s0_101 = find_sc_cfg((word32) *((word32) s0 + 8), (word32) s0 + 112, dwArgE8, out s1_646, out a0_97, out a2_98, out a3_647, out s2_103, out s3_104, out s4_648, out s5_106);
						if (a0_97 != null)
						{
							Eq_2 a4_116 = (word32) a0_97->w0008;
							ui32 a5_117 = (word32) a0_97->w000A;
							if ((a4_116 | a5_117) != 0x00)
							{
								struct Eq_268065 * a0_122 = bt_conn_index(s0_101);
								g_dw230BAD34 = (char *) a0_122 + 0x42015900;
								g_dw2304B96A = (char *) a0_122 + 0x42015900;
								a0_122->w42015928 = 0x04;
								word32 a0_149;
								Eq_2 a3_152;
								word32 mstatus_651;
								word32 s0_649;
								word32 a4_650;
								word32 s1_159;
								Eq_2 ra_157 = bt_gatt_indicate(ra, s0_101, s0_101, a2_98, a4_116, s2_103, s3_104, s5_106, s11, mstatus, dwLoc40, dwLoc3C, dwLoc38, SEQ((word16) a5_117, (word16) a4_116), s2, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwArg08, dwArg0C, dwArg18, dwArg28, dwArg2C, dwArg38, dwArg3C, s9, s5, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, out s0_649, out s1_159, out a0_149, out a3_152, out a4_650, out mstatus_651);
								if (a0_149 != 0x00)
								{
									word32 s11_675;
									word32 t4_676;
									word32 s9_673;
									word32 s10_674;
									word32 s7_671;
									word32 s8_672;
									word32 s5_669;
									word32 s6_670;
									word32 s3_667;
									word32 s4_668;
									word32 a7_665;
									word32 s2_666;
									word32 a4_663;
									word32 a5_664;
									word32 a2_661;
									word32 a3_662;
									word32 a1_660;
									word32 a0_659;
									ra_157 = printf(ra_157, &g_t230BAF38, a3_152, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_159, out a0_659, out a1_660, out a2_661, out a3_662, out a4_663, out a5_664, out a7_665, out s2_666, out s3_667, out s4_668, out s5_669, out s6_670, out s7_671, out s8_672, out s9_673, out s10_674, out s11_675, out t4_676);
								}
								word32 a0_653;
								word32 a3_656;
								word32 a4_657;
								word32 t1_652;
								word32 a1_654;
								word32 a2_655;
								word32 a5_658;
								memset(ra_157, s1_159 + 8, 0x00, 0x04, out t1_652, out a0_653, out a1_654, out a2_655, out a3_656, out a4_657, out a5_658);
							}
						}
					}
					break;
				}
			}
		}
l2304CAE2:
		s2_235 = (word32) s2_235 + 0x0A;
	} while (s2_235 != s6_239);
	0x00 = dwArg0198;
}

// 2304CBC0: Register Eq_2 bt_gatt_exchange_mtu(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 a0Out, Register out Eq_2 a3Out)
// Called from:
//      ble_exchange_mtu
//      ble_tp_connected
//      blsync_connected
Eq_2 bt_gatt_exchange_mtu(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & a0Out, union Eq_2 & a3Out)
{
	Eq_2 a3_5 = (word32) *((word32) a0 + 0x0D);
	if (a3_5 != 0x04)
	{
		a0Out.u0 = -57;
		a3Out = a3_5;
		return ra;
	}
	else
	{
		Eq_2 a3_25;
		Eq_2 a4_26;
		Eq_2 s0_30;
		Eq_2 s2_34;
		Eq_2 s3_35;
		Eq_2 a0_45;
		ptr32 mstatus_47;
		word32 s1_199;
		word32 a2_200;
		word32 a5_201;
		word32 s4_202;
		word32 s5_203;
		word32 s6_204;
		word32 s11_205;
		Eq_2 ra_29 = bt_att_create_pdu(ra, s1, a0, 0x02, a3_5, mstatus, dwLoc08, dwArg20, dwArg24, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg8C, dwArgB8, dwArgD8, out s0_30, out s1_199, out a0_45, out a2_200, out a3_25, out a4_26, out a5_201, out s2_34, out s3_35, out s4_202, out s5_203, out s6_204, out s11_205, out mstatus_47);
		if (a0_45 == 0x00)
		{
			0x00 = (int8) dwArg38;
			a0Out.u0 = ~0x0B;
			a3Out = a3_25;
			return ra_29;
		}
		else
		{
			word32 a1_206;
			word32 a5_207;
			Eq_2 a0_60 = net_buf_simple_add((word32) a0_45 + 8, 0x02, a4_26, out a1_206, out a5_207);
			*a0_60 = ~0x08;
			*((word32) a0_60 + 1) = 0x00;
			0x00 = (int8) dwArg38;
			Eq_2 a3_77;
			word32 s1_208;
			word32 a4_209;
			word32 s2_210;
			word32 s3_211;
			word32 s4_212;
			word32 s6_213;
			word32 s7_214;
			word32 mstatus_215;
			Eq_2 ra_83 = gatt_send.constprop.28(ra_29, s0, s0_30, a0_45, 587512190, s2_34, s3_35, mstatus_47, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg60, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, out s1_208, out a3_77, out a4_209, out s2_210, out s3_211, out s4_212, out s6_213, out s7_214, out mstatus_215);
			a0Out = s0_30;
			a3Out = a3_77;
			return ra_83;
		}
	}
}

// 2304CC26: Register Eq_2 bt_gatt_discover(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack word32 dwArgD4, Stack word32 dwArgF0, Stack word32 dwArgF4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_268334 a0Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out)
// Called from:
//      gatt_discover_next
//      ble_discover
Eq_2 bt_gatt_discover(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, word32 dwArgD4, word32 dwArgF0, word32 dwArgF4, Eq_2 dwArg0118, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_268334 & a0Out, union Eq_2 & a3Out, union Eq_2 & s2Out, union Eq_2 & s3Out)
{
	if ((word32) *((word32) a0 + 0x0D) != 0x04)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out.u0 = -57;
		a3Out = a3;
		s2Out = s2;
		s3Out = s3;
		return ra;
	}
	else if ((word32) *((word32) a1 + 40) > 0x05)
	{
		Eq_2 a3_32;
		Eq_2 s1_36;
		Eq_2 s2_39;
		Eq_2 s3_40;
		word32 a0_146;
		word32 a1_147;
		word32 a2_148;
		word32 a4_149;
		word32 a5_150;
		word32 a7_151;
		word32 s4_152;
		word32 s5_153;
		word32 s6_154;
		word32 s7_155;
		word32 s8_156;
		word32 s9_157;
		word32 s10_158;
		word32 s11_159;
		word32 t4_160;
		Eq_2 ra_35 = printf(ra, &g_t230BAE04, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_36, out a0_146, out a1_147, out a2_148, out a3_32, out a4_149, out a5_150, out a7_151, out s2_39, out s3_40, out s4_152, out s5_153, out s6_154, out s7_155, out s8_156, out s9_157, out s10_158, out s11_159, out t4_160);
		s0Out = a1;
		s1Out = s1_36;
		a0Out.u0 = ~0x15;
		a3Out = a3_32;
		s2Out = s2_39;
		s3Out = s3_40;
		return ra_35;
	}
	else
	{
		Eq_268334 a0_62;
		Eq_2 s0_64;
		Eq_2 s1_65;
		Eq_2 ra_66;
		Eq_2 s2_67;
		Eq_2 s3_68;
		word32 t3_70;
		word32 s8_71;
		word32 s4_72;
		word32 a6_73;
		word32 a2_74;
		Eq_2 a3_75;
		word32 a7_76;
		word32 s10_77;
		word32 s11_78;
		word32 s5_79;
		word32 s6_80;
		word32 s7_81;
		word32 s9_82;
		word32 t0_83;
		word32 t4_84;
		g_t230BACD8();
		s0Out = s0_64;
		s1Out = s1_65;
		a0Out = a0_62;
		a3Out = a3_75;
		s2Out = s2_67;
		s3Out = s3_68;
		return ra_66;
	}
}

// 2304CE96: void gatt_discover_next(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Stack Eq_2 dwArg00, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg5C, Stack word32 dwArgB4, Stack word32 dwArgD0, Stack word32 dwArgD4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
// Called from:
//      gatt_find_type_rsp
//      gatt_read_group_rsp
//      gatt_read_type_rsp
//      read_included_uuid_cb
//      gatt_find_info_rsp
void gatt_discover_next(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 dwArg00, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg5C, word32 dwArgB4, word32 dwArgD0, word32 dwArgD4, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	Eq_2 s0_45 = a0;
	if (a1 != 0x00)
	{
		if (a1 == 0x0FFFFFFF)
			((word32) a2 + 32)->u0 = ~0x00;
		else
		{
			uint32 a1_14 = (word32) a1 + 1 << 16;
			uint32 a5_16 = (word32) *((word32) a2 + 38);
			*((word32) a2 + 32) = (word16) (a1_14 >> 16);
			if (a5_16 >= a1_14 >> 16)
				goto l2304CEA0;
		}
l2304CEC4:
		word32 t1_85;
		(*((word32) a2 + 28))();
	}
	else
	{
l2304CEA0:
		word32 a0_36;
		ra = bt_gatt_discover(ra, s1, a0, a2, a3, s2, s3, dwArg10, dwArg14, dwArg5C, dwArgB4, dwArgD0, dwArgD4, dwArgF8, dwArg0118, out s0_45, out s1, out a0_36, out a3, out s2, out s3);
		if (a0_36 == 0x00)
			return;
		goto l2304CEC4;
	}
}

// 2304CEE8: void gatt_find_type_rsp(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register ui32 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_268487) a5, Register Eq_2 s2, Register Eq_2 s3, Register ui32 s4, Register Eq_2 s5, Register word32 s6, Register Eq_2 s7, Register word32 s9)
void gatt_find_type_rsp(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, ui32 a1, word32 a2, Eq_2 a3, Eq_2 a4, struct Eq_268487 * a5, Eq_2 s2, Eq_2 s3, ui32 s4, Eq_2 s5, word32 s6, Eq_2 s7, word32 s9)
{
	struct Eq_268495 * sp_101 = fp + -112;
	Eq_2 s8_102 = a0;
	if (a1 == 0x00)
	{
		a5 = (struct Eq_268487 *) 0x03000000;
		s4 = a1;
		s9 = a2;
		s0.u0 = 0x00;
		s5.u0 = 0x03;
		s6 = 0x02FFF801;
		s7 = fp + -80;
		s1.u0 = 0x02FFF800;
		s2 = fp + -84;
		s3 = fp + -76;
		while (true)
		{
			struct Eq_268487 * a5_115;
			if (s5 >= a3)
				break;
			struct Eq_268518 * a5_45 = (s4 << 0x02) + s9;
			ui32 s0_49 = (word32) a5_45->b0003;
			ui32 a2_51 = (word32) a5_45->b0001 << 8 | (word32) a5_45->b0000;
			ui32 a1_52 = (word32) a5_45->b0002;
			struct Eq_268544 * a5_54 = (word32) *((word32) a4 + 40);
			sp_101->dw0018 = 0x00;
			sp_101->dw0098 = 0x00;
			sp_101->dw009C = 0x00;
			ui32 s0_60 = s0_49 << 8 | a1_52;
			if (a5_54 == null)
			{
				sp_101->t001C.u0 = 0x00;
				sp_101->w001E = (word16) s1;
				sp_101->t0094 = s2;
			}
			else
			{
				sp_101->b0020 = 0x00;
				sp_101->w0022 = (word16) s6;
				sp_101->t0094 = s7;
			}
			sp_101->w003C = (word16) a2_51;
			sp_101->w0028 = (word16) s0_60;
			sp_101->ptr0090 = a5_54;
			word32 a4_80 = a5_54->dw001C;
			sp_101->t001C = s3;
			sp_101->t0084 = a3;
			sp_101->dw0004 = a4_80;
			word32 s4_108;
			word32 a0_113;
			word32 a3_117;
			a5_54();
			if (a0_113 == 0x00)
				return;
			s4 = s4_108 + 0x01 & 0x00FF;
			a3 = (word32) (word16) (a3_117 + ~0x03);
			s0 = sp_101->t00C4;
			a5 = a5_115;
		}
		if (a3 == 0x00)
		{
			gatt_discover_next(ra, s1, s8_102, s0, a4, a3, s2, s3, sp_101->t0000, sp_101->t0010, sp_101->t0014, sp_101->t005C, sp_101->dw00B4, sp_101->dw00D0, sp_101->dw00D4, sp_101->t00F8, sp_101->t0118);
			return;
		}
	}
	word32 a4_133 = a5->dw001C;
	word32 a3_166;
	a5();
}

// 2304CFC8: void gatt_read_group_rsp(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_268671) a5, Register Eq_2 s3, Register word32 s4, Register Eq_2 s5, Register word32 s6, Register ptr32 s7, Register ptr32 s8, Register Eq_268678 s9, Register Eq_2 s10, Register Eq_2 s11, Stack Eq_2 dwArg18)
void gatt_read_group_rsp(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, struct Eq_268671 * a5, Eq_2 s3, word32 s4, Eq_2 s5, word32 s6, ptr32 s7, ptr32 s8, Eq_268678 s9, Eq_2 s10, Eq_2 s11, Eq_2 dwArg18)
{
	Eq_2 a2_263;
	struct Eq_268683 * sp_174 = fp + -0x0080;
	Eq_2 s2_102 = a4;
	if (a1 != 0x00)
	{
		a4 = a5->t001C;
		a2_263 = a4;
	}
	else
	{
		word32 a1_34 = (word32) *a2;
		s5 = a0;
		s3 = a2;
		if (a1_34 != 0x06 && a1_34 != 0x14)
		{
			word32 a0_546;
			word32 a1_547;
			word32 a2_548;
			word32 a5_549;
			word32 a7_550;
			word32 t4_551;
			ra = printf(ra, &g_t230BAEB4, a3, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18, ra, out s1, out a0_546, out a1_547, out a2_548, out a3, out a4, out a5_549, out a7_550, out s2_102, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out t4_551);
		}
		else
		{
			a3 = (word32) a3 - 1;
			s6 = 0x02FFF801;
			s1 = (word32) (word16) ((word32) a3 - 1);
			s10 = (word32) a2 + 1;
			s0.u0 = 0x00;
			s7 = fp + -0x0078;
			s4 = 0x02FFF800;
			s8 = fp + -116;
			s9 = fp + -0x0068;
			while (s1 >= (word32) (*s3))
			{
				ui32 s11_63 = (word32) *((word32) s10 + 1);
				ui32 a5_64 = (word32) *s10;
				sp_174->ptr0094 = 0x00;
				sp_174->t0018.u1 = 0x00;
				sp_174->dw0098 = 0x00;
				sp_174->ptr001C = null;
				sp_174->dw009C = 0x00;
				s11 = s11_63 << 8 | a5_64;
				if (s11 == 0x00)
					goto l2304D02E;
				s0 = (word32) *((word32) s10 + 3) << 8 | (word32) (*((word32) s10 + 2));
				if (s0 == 0x00 || s0 < s11)
					goto l2304D02E;
				word32 a4_170;
				Eq_2 a2_78;
				Eq_2 a0_80;
				Eq_2 a1_79;
				word32 a5_77 = (word32) sp_174->t0018;
				if (a5_77 != 0x00)
				{
					a4_170 = 0x02;
					if (a5_77 != 0x02)
						goto l2304D0BC;
					a2_78.u0 = 0x10;
					a1_79 = (word32) s10 + 4;
					a0_80 = (char *) &sp_174->t0018 + 1;
				}
				else
				{
					a2_78.u0 = 0x02;
					a1_79 = (word32) s10 + 4;
					a0_80 = (char *) &sp_174->t0018 + 2;
				}
				word32 a5_554;
				word32 a6_555;
				word32 a7_556;
				word32 a2_553;
				word32 a1_552;
				memcpy(a0_80, a1_79, a2_78, out a1_552, out a2_553, out a3, out a4_170, out a5_554, out a6_555, out a7_556);
l2304D0BC:
				if ((word32) *((word32) s2_102 + 40) == 0x00)
				{
					sp_174->b000C = 0x00;
					sp_174->w000E = (word16) s4;
					sp_174->ptr0094 = s8;
				}
				else
				{
					sp_174->t0008.u0 = 0x00;
					sp_174->w000A = (word16) s6;
					sp_174->ptr0094 = s7;
				}
				sp_174->ptr001C = (word32 *) &sp_174->t0010;
				struct Eq_268671 * a5_131 = *((word32) s2_102 + 28);
				sp_174->t0014 = (word16) s0;
				sp_174->t0008 = s9;
				sp_174->w003C = (word16) s11;
				word32 s1_178;
				word32 s10_186;
				word32 a0_196;
				word32 t5_200;
				word32 t6_201;
				a5_131();
				if (a0_196 == 0x00)
					return;
				word32 a5_202 = (word32) *s3;
				s1 = (word32) (word16) (s1_178 - a5_202);
				s10 = s10_186 + a5_202;
			}
			if (s1 == 0x00 && s0 != 0x00)
			{
				gatt_discover_next(ra, s1, s5, s0, s2_102, a3, s2_102, s3, sp_174->t0000, sp_174->t0010, sp_174->t0014, sp_174->t005C, sp_174->dw00B4, sp_174->dw00D0, sp_174->dw00D4, sp_174->t00F8, sp_174->t0118);
				return;
			}
		}
l2304D02E:
		a5 = (struct Eq_268671 *) *((word32) s2_102 + 28);
		a2_263 = s2_102;
		a0 = s5;
	}
	word32 t5_335;
	word32 t6_336;
	a5();
}

