pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304D11E: void gatt_read_type_rsp(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register (ptr32 byte) a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_268951) a5, Register Eq_2 s2, Register Eq_2 s4, Register (ptr32 byte) s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s9, Register ptr32 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C)
void gatt_read_type_rsp(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, word32 a1, byte * a2, Eq_2 a3, Eq_2 a4, struct Eq_268951 * a5, Eq_2 s2, Eq_2 s4, byte * s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s9, ptr32 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg4C)
{
	Eq_2 a2_481;
	Eq_2 a4_101;
	struct Eq_268967 * sp_169 = fp + -112;
	Eq_2 s3_170 = a4;
	if (a1 != 0x00)
	{
		a4_101 = a5->t001C;
		a2_481 = a4_101;
		goto l2304D142;
	}
	a4_101 = (word32) *((word32) a4 + 40);
	s4 = a0;
	s5 = a2;
	word32 a1_37 = (word32) *a2;
	if (a4_101 == 0x02)
	{
		if (a1_37 != 0x06 && a1_37 != 0x08)
			goto l2304D2B6;
		s1 = (word32) (word16) ((word32) a3 - 1);
		s2 = a2 + 1;
		s0.u0 = 0x00;
		s7 = fp + -0x0044;
		s8.u0 = 0x02;
		s6.u0 = 0x02FFF802;
		s9 = fp + -0x0068;
		s10 = fp + -96;
		while (s1 >= (word32) (*s5))
		{
			s0 = (word32) *((word32) s2 + 1) << 8 | (word32) (*s2);
			if (s0 == 0x00)
				goto l2304D2C2;
			a4_101 = (word32) *((word32) s2 + 3) << 8 | (word32) (*((word32) s2 + 2));
			sp_169->t0014 = (word16) a4_101;
			ui32 a5_269 = (word32) *((word32) s2 + 5) << 8 | (word32) (*((word32) s2 + 4));
			a3 = (word32) sp_169->t002C;
			sp_169->t0016 = (word16) a5_269;
			if (a3 != 0x00)
			{
				if (a3 == s8)
				{
					*((word32) s3_170 + 32) = (word16) s0;
					*((word32) s3_170 + 0x0022) = (word16) a4_101;
					*((word32) s3_170 + 36) = (word16) a5_269;
					Eq_2 a4_293;
					Eq_2 a0_312;
					ptr32 mstatus_314;
					word32 s6_1024;
					word32 s11_1025;
					word32 a2_1021;
					word32 a5_1022;
					word32 s5_1023;
					word32 s0_1020;
					ra = bt_att_create_pdu(ra, s1, s4, 0x02, a3, mstatus, sp_169->t0008, sp_169->t0030, sp_169->t0034, sp_169->t0040, sp_169->t0044, sp_169->t0050, sp_169->t0054, sp_169->t0058, sp_169->t0074, sp_169->t0078, sp_169->t007C, sp_169->t0088, sp_169->t008C, sp_169->t009C, sp_169->t00C8, sp_169->t00E8, out s0_1020, out s1, out a0_312, out a2_1021, out a3, out a4_293, out a5_1022, out s2, out s3_170, out s4, out s5_1023, out s6_1024, out s11_1025, out mstatus_314);
					if (a0_312 == 0x00)
					{
						s0.u0 = 0xFFF4;
						goto l2304D294;
					}
					else
					{
						word32 a1_1030;
						word32 a5_1031;
						Eq_2 a0_325 = net_buf_simple_add((word32) a0_312 + 8, 0x02, a4_293, out a1_1030, out a5_1031);
						uint32 a5_328 = (word32) *((word32) s3_170 + 0x0022);
						*a0_325 = (byte) a5_328;
						*((word32) a0_325 + 1) = (byte) (a5_328 >> 8);
						word32 mstatus_1035;
						word32 a4_1032;
						word32 s6_1033;
						word32 s7_1034;
						ra = gatt_send.constprop.28(ra, a0_312, s4, a0_312, 587518886, s3_170, s3_170, mstatus_314, sp_169->t0000, sp_169->t0004, sp_169->t0008, sp_169->t000C, sp_169->t0014, sp_169->t0018, sp_169->t0020, sp_169->t0024, sp_169->t0028, sp_169->t002C, sp_169->t0034, sp_169->t0038, sp_169->t003C, sp_169->t0048, sp_169->t0058, sp_169->t0060, sp_169->t0064, sp_169->t0068, sp_169->t006C, sp_169->t0078, sp_169->t0088, sp_169->t0098, sp_169->t00A8, sp_169->t00AC, sp_169->t00B8, sp_169->t00C0, sp_169->t00C8, sp_169->t00D8, sp_169->t00E8, sp_169->t00F8, sp_169->t0108, sp_169->t0118, sp_169->t0138, sp_169->t0148, out s1, out a3, out a4_1032, out s2, out s3_170, out s4, out s6_1033, out s7_1034, out mstatus_1035);
						s0 = (word32) (word16) s4;
						if (s0 == 0x00)
							return;
						goto l2304D294;
					}
				}
			}
			else
			{
				sp_169->t0008 = s7;
				a4_101 = (word32) *((word32) s2 + 6);
				sp_169->w002E = (word16) ((word32) *((word32) s2 + 7) << 8 | a4_101);
			}
			ptr32 mstatus_459;
			Eq_2 a1_368 = *((word32) s3_170 + 24);
			if (a1_368 == 0x00)
			{
l2304D1E2:
				struct Eq_268951 * a5_389 = *((word32) s3_170 + 28);
				sp_169->t0014.u0 = 0x00;
				sp_169->t008C.u0 = 0x00;
				sp_169->t0010.u0 = 0x00;
				sp_169->t0008.u0 = 0x00;
				sp_169->w000A = (word16) s6;
				sp_169->t000C = s9;
				sp_169->ptr0090 = s10;
				sp_169->t0028 = (word16) s0;
				word32 a5_446;
				word32 a0_448;
				word32 t5_456;
				word32 t6_457;
				word32 tp_460;
				a5_389();
				mstatus = mstatus_459;
				if (a0_448 == 0x00)
					return;
				goto l2304D206;
			}
			word32 a0_371;
			word32 a6_1029;
			word32 a1_1026;
			word32 a2_1027;
			word32 a5_1028;
			s0 = bt_uuid_cmp(s7, a1_368, out a0_371, out a1_1026, out a2_1027, out a3, out a4_101, out a5_1028, out a6_1029, out s8);
			if (a0_371 == 0x00)
				goto l2304D1E2;
l2304D206:
			int32 a5_463 = (word32) *s5;
			s1 = (word32) (word16) (s1 - a5_463);
			s2 = (word32) s2 + a5_463;
		}
	}
	else
	{
		a4_101.u0 = 0x07;
		if (a1_37 != 0x07)
		{
			a4_101.u0 = 0x15;
			if (a1_37 != 0x15)
			{
l2304D2B6:
				word32 a0_1013;
				word32 a7_1017;
				word32 s11_1018;
				word32 t4_1019;
				word32 a1_1014;
				word32 a2_1015;
				word32 a5_1016;
				ra = printf(ra, &g_t230BAEB4, a3, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1, out a0_1013, out a1_1014, out a2_1015, out a3, out a4_101, out a5_1016, out a7_1017, out s2, out s3_170, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11_1018, out t4_1019);
				goto l2304D2C2;
			}
		}
		s1 = (word32) (word16) ((word32) a3 - 1);
		s2 = a2 + 1;
		s0.u0 = 0x00;
		s8 = fp + -88;
		s6.u0 = 0x02FFF803;
		s9 = fp + -100;
		s7.u0 = 0x2304C450;
		s10 = fp + -96;
		while (s1 >= (word32) (*s5))
		{
			s0 = (word32) *((word32) s2 + 1) << 8 | (word32) (*s2);
			if (s0 == 0x00)
				goto l2304D2C2;
			word32 a5_68 = (word32) sp_169->t0018;
			if (a5_68 != 0x00)
			{
				if (a5_68 == 0x02)
				{
					word32 a5_1039;
					word32 a6_1040;
					word32 a7_1041;
					word32 a1_1036;
					word32 a2_1037;
					word32 a4_1038;
					memcpy((char *) &sp_169->t0018 + 1, (word32) s2 + 5, 0x10, out a1_1036, out a2_1037, out a3, out a4_1038, out a5_1039, out a6_1040, out a7_1041);
				}
			}
			else
				sp_169->w001A = (word16) ((word32) *((word32) s2 + 6) << 8 | (word32) (*((word32) s2 + 5)));
			Eq_2 a1_94 = *((word32) s3_170 + 24);
			if (a1_94 == 0x00)
			{
l2304D322:
				sp_169->t009C.u0 = 0x00;
				sp_169->t0098.u0 = 0x00;
				sp_169->t000C.u0 = 0x00;
				sp_169->w000E = (word16) s6;
				sp_169->t0094 = s9;
				sp_169->t0018 = s7;
				sp_169->t0008 = s8;
				ui32 a5_135 = (word32) *((word32) s2 + 4);
				ui32 a4_136 = (word32) *((word32) s2 + 3);
				sp_169->ptr001C = s10;
				sp_169->t0014 = (word16) (a5_135 << 8 | a4_136);
				word32 a5_144 = (word32) *((word32) s2 + 2);
				sp_169->t003C = (word16) s0;
				sp_169->t0016 = (byte) a5_144;
				sp_169->b003E = 0x01;
				struct Eq_268951 * a5_153 = *((word32) s3_170 + 28);
				word32 a0_186;
				word32 t5_194;
				word32 t6_195;
				word32 tp_675;
				a5_153();
				if (a0_186 == 0x00)
					return;
				goto l2304D366;
			}
			word32 a0_98;
			word32 a2_1043;
			word32 a5_1044;
			word32 a6_1045;
			word32 a1_1042;
			s0 = bt_uuid_cmp(s8, a1_94, out a0_98, out a1_1042, out a2_1043, out a3, out a4_101, out a5_1044, out a6_1045, out s8);
			if (a0_98 == 0x00)
				goto l2304D322;
l2304D366:
			Eq_269619 a5_198 = (word32) *s5;
			s1 = (word32) (word16) (s1 - a5_198);
			s2 += a5_198;
		}
	}
	if (s1 == 0x00 && s0 != 0x00)
	{
l2304D294:
		gatt_discover_next(ra, s1, s4, s0, s3_170, a3, s2, s3_170, sp_169->t0000, sp_169->t0010, sp_169->t0014, sp_169->t005C, sp_169->dw00B4, sp_169->dw00D0, sp_169->dw00D4, sp_169->t00F8, sp_169->t0118);
		return;
	}
l2304D2C2:
	a5 = (struct Eq_268951 *) *((word32) s3_170 + 28);
	a2_481 = s3_170;
	a0 = s4;
l2304D142:
	word32 t5_604;
	word32 t6_605;
	word32 mstatus_607;
	word32 tp_608;
	a5();
}

