pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304D3A6: void read_included_uuid_cb(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register word32 a3, Register Eq_2 s3, Stack word32 dwArg20, Stack word32 dwArg24, Stack word32 dwArg48, Stack word32 dwArg6C)
void read_included_uuid_cb(Eq_2 ra, Eq_2 a0, Eq_2 a2, word32 a3, Eq_2 s3, word32 dwArg20, word32 dwArg24, word32 dwArg48, word32 dwArg6C)
{
	struct Eq_269657 * sp_117 = fp + -80;
	Eq_2 s1_109 = a0;
	if (a3 != 0x10)
	{
		<anonymous> * a5_147;
		word32 a3_151;
		word32 s1_155;
		a5_147();
		return;
	}
	Eq_2 a1_33;
	word32 a7_282;
	word32 a2_279;
	word32 a6_281;
	word32 a5_280;
	word32 a4_30;
	Eq_2 a3_116;
	memcpy(fp + -55, a2, 0x10, out a1_33, out a2_279, out a3_116, out a4_30, out a5_280, out a6_281, out a7_282);
	Eq_2 s2_112 = fp + -56;
	Eq_2 s0_105 = *((word32) a1_33 + 24);
	if (a1_33 != 0x00)
	{
		word32 a0_45;
		word32 a1_299;
		word32 a2_300;
		word32 a5_301;
		word32 a6_302;
		word32 s8_303;
		s0_105 = bt_uuid_cmp(fp + -56, a1_33, out a0_45, out a1_299, out a2_300, out a3_116, out a4_30, out a5_301, out a6_302, out s8_303);
		if (a0_45 != 0x00)
			goto l2304D43A;
	}
	struct Eq_269714 * a5_70 = (word32) *((word32) s0_105 + 32);
	word32 s0_74 = a5_70->dw001C;
	word32 a0_91;
	word32 a6_98;
	word32 t1_99;
	word32 t5_102;
	word32 t6_103;
	a5_70();
	if (a0_91 == 0x00)
		return;
l2304D43A:
	gatt_discover_next(ra, s1_109, s1_109, (word32) *((word32) s0_105 + 32), s0_105, a3_116, s2_112, s3, sp_117->t0000, sp_117->t0010, sp_117->t0014, sp_117->t005C, sp_117->dw00B4, sp_117->dw00D0, sp_117->dw00D4, sp_117->t00F8, sp_117->t0118);
}

// 2304D452: void gatt_find_info_rsp(Register Eq_2 ra, Register uint32 s0, Register word32 s1, Register Eq_2 a0, Register word32 a1, Register (ptr32 byte) a2, Register Eq_2 a3, Register Eq_2 a4, Register word32 s2, Register word32 s3, Register Eq_269773 s5, Register Eq_2 s6, Register word32 s8, Register word32 s9, Register word32 s10, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C)
void gatt_find_info_rsp(Eq_2 ra, uint32 s0, word32 s1, Eq_2 a0, word32 a1, byte * a2, Eq_2 a3, Eq_2 a4, word32 s2, word32 s3, Eq_269773 s5, Eq_2 s6, word32 s8, word32 s9, word32 s10, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg4C)
{
	struct Eq_269782 * sp_257 = fp + -112;
	Eq_2 s7_232 = a0;
	Eq_2 s4_258 = a4;
	if (a1 == 0x00)
	{
		word32 a1_34 = (word32) *a2;
		if (a1_34 != 0x01)
		{
			if (a1_34 != 0x02)
			{
				word32 t4_660;
				word32 a5_657;
				word32 a0_654;
				word32 a7_658;
				word32 s11_659;
				word32 a1_655;
				word32 a2_656;
				ra = printf(ra, &g_t230BAE48, a3, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1, out a0_654, out a1_655, out a2_656, out a3, out a4, out a5_657, out a7_658, out s2, out s3, out s4_258, out s5, out s6, out s7_232, out s8, out s9, out s10, out s11_659, out t4_660);
				goto l2304D48E;
			}
			s5.u0 = 0x12;
		}
		else
			s5.u0 = 0x04;
		uint32 s0_44 = (word32) a3 - 1 << 16;
		s0 = s0_44 >> 16;
		if (s0_44 >> 16 >= s5)
		{
			Eq_2 s0_102 = s0_44 >> 16 >> s5;
			word32 s6_191 = 0x03000000;
			Eq_2 s1_262 = a2 + 1;
			word32 a5_284 = 0x00;
			Eq_2 s2_263 = 0x00;
			Eq_2 s3_264 = fp + -88;
			word32 s8_103 = 0x02FFF800;
			word32 s9_148 = 0x02FFF801;
			word32 s10_171 = 0x02FFF802;
			while (s0_102 != 0x00)
			{
				s2_263 = (word32) *((word32) s1_262 + 1) << 8 | (word32) (*s1_262);
				if (a5_284 != 0x00)
				{
l2304D4F2:
					a5_284 = 0x00;
					goto l2304D4F4;
				}
				word32 a5_67 = (word32) sp_257->t0018;
				if (a5_67 != 0x00)
				{
					if (a5_67 == 0x02)
					{
						word32 a7_666;
						word32 a4_663;
						word32 a5_664;
						word32 a6_665;
						word32 a1_661;
						word32 a2_662;
						memcpy((char *) &sp_257->t0018 + 1, (word32) s1_262 + 2, 0x10, out a1_661, out a2_662, out a3, out a4_663, out a5_664, out a6_665, out a7_666);
					}
				}
				else
					sp_257->w001A = (word16) ((word32) *((word32) s1_262 + 3) << 8 | (word32) (*((word32) s1_262 + 2)));
				Eq_2 a1_93 = *((word32) s4_258 + 24);
				if (a1_93 != 0x00)
				{
					word32 a0_97;
					word32 a4_669;
					word32 a5_670;
					word32 a6_671;
					word32 a1_667;
					word32 a2_668;
					s0_102 = bt_uuid_cmp(s3_264, a1_93, out a0_97, out a1_667, out a2_668, out a3, out a4_669, out a5_670, out a6_671, out s8_103);
					if (a0_97 != 0x00)
						goto l2304D4F2;
				}
				word32 a4_115 = (word32) *((word32) s4_258 + 40);
				if (a4_115 != 0x04)
				{
l2304D592:
					<anonymous> * a5_215 = *((word32) s4_258 + 28);
					sp_257->dw009C = 0x00;
					sp_257->t0018.u1 = 0x00;
					sp_257->dw0098 = 0x00;
					sp_257->dw001C = 0x00;
					sp_257->t0094 = s3_264;
					sp_257->w003C = (word16) s2_263;
					word32 a0_270;
					word32 t5_282;
					word32 t6_283;
					a5_215();
					if (a0_270 == 0x00)
						return;
					goto l2304D4F2;
				}
				sp_257->b0008 = 0x00;
				sp_257->w000A = (word16) s8_103;
				word32 a0_127;
				word32 a6_676;
				word32 a1_672;
				word32 a4_674;
				word32 a5_675;
				word32 a2_673;
				s0_102 = bt_uuid_cmp(s3_264, &sp_257->b0008, out a0_127, out a1_672, out a2_673, out a3, out a4_674, out a5_675, out a6_676, out s8_103);
				if (a0_127 == 0x00)
					goto l2304D4F2;
				sp_257->b000C = 0x00;
				sp_257->w000E = (word16) s9_148;
				word32 a0_150;
				word32 a2_678;
				word32 a4_679;
				word32 a5_680;
				word32 a6_681;
				word32 a1_677;
				s0_102 = bt_uuid_cmp(s3_264, &sp_257->b000C, out a0_150, out a1_677, out a2_678, out a3, out a4_679, out a5_680, out a6_681, out s8_103);
				if (a0_150 == 0x00)
					goto l2304D4F2;
				sp_257->t0010.u0 = 0x00;
				sp_257->w0012 = (word16) s10_171;
				word32 a0_173;
				word32 a5_685;
				word32 a6_686;
				word32 a2_683;
				word32 a4_684;
				word32 a1_682;
				s0_102 = bt_uuid_cmp(s3_264, &sp_257->t0010, out a0_173, out a1_682, out a2_683, out a3, out a4_684, out a5_685, out a6_686, out s8_103);
				if (a0_173 == 0x00)
					goto l2304D4F2;
				sp_257->t0014.u0 = 0x00;
				sp_257->w0016 = (word16) (s6_191 + -0x07FD);
				word32 a0_197;
				word32 a1_687;
				word32 a2_688;
				word32 a5_689;
				word32 a6_690;
				s0_102 = bt_uuid_cmp(s3_264, &sp_257->t0014, out a0_197, out a1_687, out a2_688, out a3, out a4_115, out a5_689, out a6_690, out s8_103);
				if (a0_197 != 0x00)
					goto l2304D592;
				a5_284 = 0x01;
l2304D4F4:
				s0_102 = (word32) s0_102 - 1;
				s1_262 += s5;
			}
			gatt_discover_next(ra, s1_262, s7_232, s2_263, s4_258, a3, s2_263, s3_264, sp_257->t0000, sp_257->t0010, sp_257->t0014, sp_257->t005C, sp_257->dw00B4, sp_257->dw00D0, sp_257->dw00D4, sp_257->t00F8, sp_257->t0118);
			return;
		}
	}
l2304D48E:
	word32 t5_406;
	word32 t6_407;
	(*((word32) s4_258 + 28))();
}

