pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304D5CA: Register Eq_2 bt_gatt_read(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      gatt_read_rsp
//      ble_read
Eq_2 bt_gatt_read(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & mstatusOut)
{
	if ((word32) *((word32) a0 + 0x0D) != 0x04)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out.u0 = -57;
		a3Out = a3;
		s2Out = s2;
		s3Out = s3;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 a3_119;
	ptr32 mstatus_141;
	Eq_2 ra_123;
	Eq_2 s1_125;
	Eq_2 s3_146;
	Eq_2 s2_101;
	Eq_2 a1_169;
	Eq_2 a3_166;
	Eq_2 s0_216;
	struct Eq_270203 * a1_22 = *((word32) a2 + 28);
	if (a2 != 0x00)
	{
		if (a2 > 0x01)
		{
			Eq_2 a0_139;
			word32 s5_559;
			word32 s11_561;
			word32 s6_560;
			word32 a4_556;
			word32 s4_558;
			word32 s3_557;
			word32 a2_555;
			word32 s0_554;
			struct Eq_270334 * a5_121;
			ra_123 = bt_att_create_pdu(ra, a0, a0, a2 << 1, a3, mstatus, s2, dwArg10, dwArg14, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg7C, dwArgA8, dwArgC8, out s0_554, out s1_125, out a0_139, out a2_555, out a3_119, out a4_556, out a5_121, out s2_101, out s3_557, out s4_558, out s5_559, out s6_560, out s11_561, out mstatus_141);
			s3_146 = a0_139;
			if (a0_139 != 0x00)
			{
				struct Eq_270334 * s2_147 = null;
				while (true)
				{
					Eq_2 s0_151 = a5_121->t001C;
					if (s2_147 >= a5_121)
						break;
					Eq_2 a5_157 = a5_121 + (s2_147 << 0x01) / 32;
					word32 a4_562;
					net_buf_simple_add_le16((word32) a0_139 + 8, (word32) *a5_157, a5_157, out a4_562, out a5_121);
					s2_147 = (char *) s2_147 + 1 & 0x00FF;
				}
				a3_166 = s0_151;
				a1_169 = a0_139;
l2304D686:
				Eq_2 a3_275;
				ptr32 mstatus_280;
				Eq_2 s1_282;
				Eq_2 s2_285;
				Eq_2 s3_286;
				word32 s6_565;
				word32 s7_566;
				word32 s4_564;
				word32 a4_563;
				Eq_2 ra_281 = gatt_send.constprop.28(ra_123, s1, s1_125, a1_169, dwArg48, a3_166, s3_146, mstatus_141, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg60, s3, s1, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, out s1_282, out a3_275, out a4_563, out s2_285, out s3_286, out s4_564, out s6_565, out s7_566, out mstatus_280);
				s0Out = s1;
				s1Out = s1_282;
				a0Out = s1_125;
				a3Out = a3_275;
				s2Out = s2_285;
				s3Out = s3_286;
				mstatusOut = mstatus_280;
				return ra_281;
			}
		}
		else if ((word32) a1_22->w0022 != 0x00)
		{
			Eq_2 a4_75;
			Eq_2 a0_94;
			word32 a2_574;
			word32 a5_575;
			word32 s2_576;
			word32 s4_577;
			word32 s5_578;
			word32 s6_579;
			word32 s11_580;
			ra_123 = bt_att_create_pdu(ra, a0, a0, 0x04, a3, mstatus, s2, dwArg10, dwArg14, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg7C, dwArgA8, dwArgC8, out s0_216, out s1_125, out a0_94, out a2_574, out a3_119, out a4_75, out a5_575, out s2_576, out s3_146, out s4_577, out s5_578, out s6_579, out s11_580, out mstatus_141);
			s2_101 = a0_94;
			if (a0_94 != 0x00)
			{
				word32 a1_581;
				word32 a5_582;
				Eq_2 a0_104 = net_buf_simple_add((word32) a0_94 + 8, 0x04, a4_75, out a1_581, out a5_582);
				uint32 a5_107 = (word32) *((word32) s0_216 + 32);
				*a0_104 = (byte) a5_107;
				*((word32) a0_104 + 1) = (byte) (a5_107 >> 8);
				uint32 a5_111 = (word32) *((word32) s0_216 + 0x0022);
				*((word32) a0_104 + 2) = (byte) a5_111;
				*((word32) a0_104 + 3) = (byte) (a5_111 >> 8);
				goto l2304D642;
			}
		}
		else
		{
			Eq_2 a4_34;
			Eq_2 a0_53;
			word32 s5_571;
			word32 s11_573;
			word32 s6_572;
			word32 a5_568;
			word32 s4_570;
			word32 s2_569;
			word32 a2_567;
			ra_123 = bt_att_create_pdu(ra, a0, a0, 0x02, a3, mstatus, s2, dwArg10, dwArg14, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg7C, dwArgA8, dwArgC8, out s0_216, out s1_125, out a0_53, out a2_567, out a3_119, out a4_34, out a5_568, out s2_569, out s3_146, out s4_570, out s5_571, out s6_572, out s11_573, out mstatus_141);
			s2_101 = a0_53;
			if (a0_53 != 0x00)
			{
				word32 a1_583;
				word32 a5_584;
				Eq_2 a0_63 = net_buf_simple_add((word32) a0_53 + 8, 0x02, a4_34, out a1_583, out a5_584);
				uint32 a5_66 = (word32) *((word32) s0_216 + 32);
				*a0_63 = (byte) a5_66;
				*((word32) a0_63 + 1) = (byte) (a5_66 >> 8);
				goto l2304D642;
			}
		}
l2304D5F6:
		s0Out = s1;
		s1Out = s1_125;
		a0Out.u0 = ~0x0B;
		a3Out = a3_119;
		s2Out = s2_101;
		s3Out = s3_146;
		mstatusOut = mstatus_141;
		return ra_123;
	}
	else
	{
		Eq_2 a4_175;
		struct Eq_270212 * s0_179;
		Eq_2 a0_194;
		word32 s6_544;
		word32 s11_545;
		word32 s2_541;
		word32 s5_543;
		word32 s4_542;
		word32 a5_540;
		word32 a2_539;
		ra_123 = bt_att_create_pdu(ra, a0, a0, 0x04, a3, mstatus, s2, dwArg10, dwArg14, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg7C, dwArgA8, dwArgC8, out s0_179, out s1_125, out a0_194, out a2_539, out a3_119, out a4_175, out a5_540, out s2_541, out s3_146, out s4_542, out s5_543, out s6_544, out s11_545, out mstatus_141);
		s2_101 = a0_194;
		if (a0_194 == 0x00)
			goto l2304D5F6;
		struct Eq_270240 * a1_206;
		word32 a5_546;
		Eq_2 a0_205 = net_buf_simple_add((word32) a0_194 + 8, 0x04, a4_175, out a1_206, out a5_546);
		uint32 a5_208 = (word32) s0_179->w0020;
		*a0_205 = (byte) a5_208;
		*((word32) a0_205 + 1) = (byte) (a5_208 >> 8);
		uint32 a5_212 = (word32) s0_179->w0022;
		*((word32) a0_205 + 2) = (byte) a5_212;
		*((word32) a0_205 + 3) = (byte) (a5_212 >> 8);
		s3_146 = (word32) a0_194 + 8;
		s0_216 = a1_206->t0024;
		Eq_2 a5_217 = (word32) a1_206->b0000;
		if (a5_217 == 0x00)
		{
			word32 a5_553;
			word32 a4_552;
			net_buf_simple_add_le16((word32) a0_194 + 8, (word32) a1_206->w0002, a5_217, out a4_552, out a5_553);
		}
		else
		{
			word32 a4_550;
			word32 a5_551;
			word32 a1_547;
			word32 a3_549;
			word32 a2_548;
			net_buf_simple_add_mem((word32) a0_194 + 8, &a1_206->b0000 + 1, 0x10, a4_175, out a1_547, out a2_548, out a3_549, out a4_550, out a5_551);
		}
l2304D642:
		a3_166 = s0_216;
		a1_169 = s2_101;
		goto l2304D686;
	}
}

// 2304D718: void gatt_read_rsp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 code) a1, Register Eq_2 a2, Register Eq_2 a3, Register (ptr32 Eq_270529) a4, Register Eq_2 s3, Register word32 s4, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack word32 dwArg48, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void gatt_read_rsp(Eq_2 ra, Eq_2 s1, Eq_2 a0, <anonymous> * a1, Eq_2 a2, Eq_2 a3, struct Eq_270529 * a4, Eq_2 s3, word32 s4, ptr32 mstatus, word32 dwArg00, word32 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, word32 dwArg48, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	<anonymous> * a1_153;
	<anonymous> * t1_149;
	struct Eq_270544 * sp_110 = fp + ~0x1F;
	Eq_2 s2_103 = a0;
	struct Eq_270529 * s0_112 = a4;
	if (a1 != null || a3 == 0x00)
	{
		t1_149 = a4->ptr0018;
		a1_153 = a1;
		goto l2304D73C;
	}
	s3 = a2;
	if (a1 == null)
	{
		s1 = (word32) (word16) ((word32) a3 - 1);
		struct Eq_270573 * s4_146 = (word32) a2 + 1;
		while (true)
		{
			sp_110 = fp - 32;
			if (s1 == 0x00)
				break;
			struct Eq_270699 * a5_85 = (word32) s4_146->b0001 << 8 | (word32) s4_146->b0000;
			if (a5_85 == null)
			{
				word32 s9_490;
				word32 t4_493;
				word32 s11_492;
				word32 s10_491;
				word32 s5_486;
				word32 s8_489;
				word32 s7_488;
				word32 s6_487;
				word32 a7_482;
				word32 s4_485;
				word32 s3_484;
				word32 s2_483;
				word32 a2_478;
				word32 a5_481;
				word32 a4_480;
				word32 a3_479;
				word32 a1_477;
				word32 a0_476;
				word32 s1_475;
				printf(ra, &g_t230BAECC, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_475, out a0_476, out a1_477, out a2_478, out a3_479, out a4_480, out a5_481, out a7_482, out s2_483, out s3_484, out s4_485, out s5_486, out s6_487, out s7_488, out s8_489, out s9_490, out s10_491, out s11_492, out t4_493);
				return;
			}
			Eq_270713 a4_88;
			Eq_2 a4_87 = (word32) *s3;
			if (s1 < a4_87)
				a4_88 = (word32) s1 - 2;
			else
				a4_88 = (word32) a4_87 - 2;
			s0_112->w0020 = (word16) a5_85;
			word32 s0_94 = a5_85->dw0018;
			word32 t5_334;
			word32 s4_117;
			word32 a0_118;
			word32 t1_123;
			word32 t6_335;
			word32 tp_336;
			a5_85();
			if (a0_118 == 0x00)
				return;
			if (s1 < (word32) (*s3))
				break;
			word32 a5_138 = (word32) s0_112->w0020;
			if ((word32) s0_112->w0022 == a5_138)
				goto l2304D7E2;
			s0_112->w0020 = (word16) (a5_138 + 0x01);
			Eq_270859 a5_142 = (word32) *s3;
			s1 = (word32) (word16) (s1 - a5_142);
			s4_146 = (word32) a5_142 + s4_117;
		}
	}
	else
	{
		Eq_2 s2_33;
		Eq_2 ra_34;
		word32 a0_38;
		Eq_2 a3_42;
		word32 t1_43;
		word32 tp_332;
		word32 t6_331;
		word32 t5_330;
		a1();
		if (a0_38 == 0x00)
			return;
		word32 a0_49;
		word32 s10_497;
		word32 s11_498;
		word32 a3_494;
		word32 s4_496;
		word32 a4_495;
		ra = bt_att_get_mtu(ra_34, s2_33, a3_42, sp_110->t0008, sp_110->t0050, sp_110->t0054, sp_110->t0078, sp_110->t009C, out s1, out a0_49, out a2, out a3_494, out a4_495, out s2_103, out s3, out s4_496, out s10_497, out s11_498);
		if (s1 < a0_49 + ~0x00)
		{
l2304D7E2:
			t1_149 = s0_112->ptr0018;
			a1_153 = null;
			goto l2304D73C;
		}
		a3 = (word32) s0_112->w0022;
		s1 += a3;
		s0_112->w0022 = (word16) s1;
	}
	int32 a0_171;
	struct Eq_270577 * s0_181;
	word32 a3_474;
	ra = bt_gatt_read(ra, s1, s2_103, a2, a3, s2_103, s3, mstatus, sp_110->t0000, sp_110->t0004, sp_110->t0008, sp_110->t000C, sp_110->t0010, sp_110->t0014, sp_110->t0018, sp_110->t0020, sp_110->t0024, sp_110->t0028, sp_110->t002C, sp_110->t0030, sp_110->t0034, sp_110->t0038, sp_110->t003C, sp_110->t0048, sp_110->t0054, sp_110->t0058, sp_110->t005C, sp_110->t0060, sp_110->t0078, sp_110->t007C, sp_110->t0088, sp_110->t0098, sp_110->t00A8, sp_110->t00AC, sp_110->t00B8, sp_110->t00C0, sp_110->t00C8, sp_110->t00D8, sp_110->t00E8, sp_110->t00F8, sp_110->t0108, sp_110->t0118, sp_110->t0138, sp_110->t0148, out s0_181, out s1, out a0_171, out a3_474, out s2_103, out s3, out mstatus);
	if (a0_171 >= 0x00)
		return;
	t1_149 = s0_181->ptr0018;
	a1_153 = (<anonymous> *) 0x0E;
l2304D73C:
	word32 t1_296;
	word32 t5_311;
	word32 t6_312;
	word32 tp_313;
	t1_149();
}

// 2304D838: Register Eq_2 bt_gatt_write_without_response_cb(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register word32 a4, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 a3Out)
// Called from:
//      ble_write_without_rsp
Eq_2 bt_gatt_write_without_response_cb(Eq_2 ra, Eq_2 a0, Eq_2 a3, word32 a4, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD0, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & a3Out)
{
	if ((word32) *((word32) a0 + 0x0D) != 0x04)
	{
		a3Out = a3;
		return ra;
	}
	else
	{
		uint32 a2_41;
		if ((word32) *((word32) a0 + 11) == 0x00 && a4 != 0x00)
			a2_41 = (word32) a3 + 0x0E;
		else
			a2_41 = (word32) a3 + 2;
		Eq_2 a3_63;
		Eq_2 a4_64;
		Eq_2 s0_68;
		Eq_2 s1_69;
		uint32 s2_72;
		Eq_2 s5_75;
		Eq_2 s6_76;
		Eq_2 a0_83;
		ptr32 mstatus_85;
		word32 s4_372;
		word32 s11_373;
		word32 a5_370;
		word32 s3_371;
		word32 a2_369;
		Eq_2 ra_67 = bt_att_create_pdu(ra, a3, a0, a2_41, a3, mstatus, s6, dwArg00, dwArg04, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg44, dwArg48, dwArg4C, s5, s3, dwArg6C, dwArg98, dwArgB8, out s0_68, out s1_69, out a0_83, out a2_369, out a3_63, out a4_64, out a5_370, out s2_72, out s3_371, out s4_372, out s5_75, out s6_76, out s11_373, out mstatus_85);
		if (a0_83 == 0x00)
		{
			0x00 = (int8) dwArg0128;
			a3Out = a3_63;
			return ra_67;
		}
		else
		{
			word32 a5_344;
			word32 a1_343;
			Eq_2 a0_104 = net_buf_simple_add((word32) a0_83 + 8, 0x02, a4_64, out a1_343, out a5_344);
			*a0_104 = (byte) s2_72;
			*((word32) a0_104 + 1) = (byte) (s2_72 >> 0x08);
			Eq_2 a4_113;
			word32 a7_350;
			word32 a5_348;
			word32 a6_349;
			word32 a2_346;
			word32 a3_347;
			word32 a1_345;
			memcpy((word32) a0_104 + 2, s6_76, s1_69, out a1_345, out a2_346, out a3_347, out a4_113, out a5_348, out a6_349, out a7_350);
			word32 a5_352;
			word32 a1_351;
			net_buf_simple_add((word32) a0_83 + 8, s1_69, a4_113, out a1_351, out a5_352);
			0x00 = (int8) dwArg0128;
			Eq_2 a3_146;
			word32 mstatus_368;
			word32 s10_366;
			word32 s11_367;
			word32 s8_364;
			word32 s9_365;
			word32 s6_362;
			word32 s7_363;
			word32 s4_360;
			word32 s5_361;
			word32 s2_358;
			word32 s3_359;
			word32 a1_356;
			word32 a4_357;
			word32 s1_354;
			word32 a0_355;
			word32 s0_353;
			Eq_2 ra_152 = bt_att_send(ra_67, dwArgE4, s0_68, a0_83, s5_75, a0_83, mstatus_85, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg4C, s5, dwArg68, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD0, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0158, out s0_353, out s1_354, out a0_355, out a1_356, out a3_146, out a4_357, out s2_358, out s3_359, out s4_360, out s5_361, out s6_362, out s7_363, out s8_364, out s9_365, out s10_366, out s11_367, out mstatus_368);
			a3Out = a3_146;
			return ra_152;
		}
	}
}

