pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304D8EE: Register Eq_2 bt_gatt_write(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_271056) a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 a0Out, Register out Eq_2 a3Out)
// Called from:
//      gatt_prepare_write_rsp
//      ble_write
Eq_2 bt_gatt_write(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_271056 * a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & a0Out, union Eq_2 & a3Out)
{
	if ((word32) *((word32) a0 + 0x0D) != 0x04)
	{
		a0Out.u0 = -57;
		a3Out = a3;
		return ra;
	}
	Eq_2 a3_191;
	Eq_2 ra_195;
	ptr32 mstatus_213;
	Eq_2 a1_119;
	Eq_2 s3_218;
	Eq_2 a3_117;
	Eq_2 s1_197;
	Eq_2 ra_125;
	Eq_2 s1_123 = a0;
	ra_125 = ra;
	if ((word32) a1->w001E == 0x00)
	{
		up32 a0_27;
		up32 s2_38;
		word32 s10_560;
		word32 s11_561;
		word32 s4_559;
		word32 s3_558;
		word32 a4_557;
		word32 a2_556;
		ra_125 = bt_att_get_mtu(ra, a0, a3, s2, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_123, out a0_27, out a2_556, out a3, out a4_557, out s2_38, out s3_558, out s4_559, out s10_560, out s11_561);
		if (a0_27 + ~0x02 >= s2_38)
		{
			Eq_2 a4_58;
			struct Eq_271350 * s0_62;
			Eq_2 a0_77;
			word32 s11_606;
			word32 s6_605;
			word32 s5_604;
			word32 s4_603;
			word32 s2_601;
			word32 s3_602;
			word32 a2_599;
			word32 a5_600;
			ra_195 = bt_att_create_pdu(ra_125, s1_123, s1_123, (word32) a1->w0024 + 0x02, a3, mstatus, s2, dwArg10, dwArg14, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg7C, dwArgA8, dwArgC8, out s0_62, out s1_197, out a0_77, out a2_599, out a3_191, out a4_58, out a5_600, out s2_601, out s3_602, out s4_603, out s5_604, out s6_605, out s11_606, out mstatus_213);
			if (a0_77 == 0x00)
				goto l2304D9A4;
			Eq_2 a1_89;
			word32 a5_607;
			Eq_2 a0_88 = net_buf_simple_add((word32) a0_77 + 8, 0x02, a4_58, out a1_89, out a5_607);
			uint32 a5_91 = (word32) s0_62->w001C;
			*((word32) a0_88 + 0x00001000) = (byte) a5_91;
			*((word32) a0_88 + 0x00001001) = (byte) (a5_91 >> 8);
			Eq_2 s0_97 = *((word32) a1_89 + 32);
			Eq_2 a4_98;
			word32 a1_608;
			word32 a2_609;
			word32 a3_610;
			word32 a5_611;
			word32 a6_612;
			word32 a7_613;
			memcpy((word32) a0_88 + 2, a1_89, (word32) s0_62->w0024, out a1_608, out a2_609, out a3_610, out a4_98, out a5_611, out a6_612, out a7_613);
			word32 a1_614;
			word32 a5_615;
			net_buf_simple_add((word32) a0_77 + 8, (word32) *((word32) s0_97 + 36), a4_98, out a1_614, out a5_615);
			s3_218 = (word32) a0_77 + 8;
			a3_117 = s0_97;
			a1_119 = a0_77;
			goto l2304DA18;
		}
	}
	word32 s2_151;
	up32 a0_128;
	up32 s2_139;
	word32 s11_567;
	word32 s3_564;
	word32 s4_565;
	word32 s10_566;
	word32 a4_563;
	word32 a2_562;
	Eq_2 s1_136;
	Eq_2 a3_131;
	Eq_2 ra_135 = bt_att_get_mtu(ra_125, s1_123, a3, s2, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_136, out a0_128, out a2_562, out a3_131, out a4_563, out s2_139, out s3_564, out s4_565, out s10_566, out s11_567);
	if (s2_139 >= a0_128 + ~0x04)
	{
		word32 a0_153;
		word32 s10_573;
		word32 s11_574;
		word32 s2_570;
		word32 s3_571;
		word32 s4_572;
		word32 a2_568;
		word32 a4_569;
		ra_135 = bt_att_get_mtu(ra_135, s1_136, a3_131, s2, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_136, out a0_153, out a2_568, out a3_131, out a4_569, out s2_570, out s3_571, out s4_572, out s10_573, out s11_574);
		s2_151 = (word32) (word16) (a0_153 + ~0x04);
	}
	else
		s2_151 = (word32) a1->w0024;
	Eq_2 a4_192;
	struct Eq_271200 * s0_196;
	Eq_2 s2_200;
	Eq_2 a0_211;
	word32 s11_581;
	word32 s6_580;
	word32 s5_579;
	word32 s4_578;
	word32 s3_577;
	word32 a5_576;
	word32 a2_575;
	ra_195 = bt_att_create_pdu(ra_135, s1_136, s1_136, s2_151 + 4, a3_131, mstatus, s2, dwArg10, dwArg14, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg7C, dwArgA8, dwArgC8, out s0_196, out s1_197, out a0_211, out a2_575, out a3_191, out a4_192, out a5_576, out s2_200, out s3_577, out s4_578, out s5_579, out s6_580, out s11_581, out mstatus_213);
	s3_218 = a0_211;
	if (a0_211 == 0x00)
	{
l2304D9A4:
		a0Out.u0 = ~0x0B;
		a3Out = a3_191;
		return ra_195;
	}
	Eq_2 a1_223;
	word32 a5_582;
	Eq_2 a0_222 = net_buf_simple_add((word32) a0_211 + 8, 0x04, a4_192, out a1_223, out a5_582);
	uint32 a5_225 = (word32) s0_196->w001C;
	*((word32) a0_222 + 0x00001000) = (byte) a5_225;
	*((word32) a0_222 + 0x00001001) = (byte) (a5_225 >> 8);
	uint32 a5_231 = (word32) s0_196->w001E;
	*((word32) a0_222 + 0x00001002) = (byte) a5_231;
	*((word32) a0_222 + 4099) = (byte) (a5_231 >> 8);
	Eq_2 s0_235 = *((word32) a1_223 + 32);
	Eq_2 a4_236;
	word32 a6_587;
	word32 a7_588;
	word32 a3_585;
	word32 a5_586;
	word32 a1_583;
	word32 a2_584;
	memcpy((word32) a0_222 + 4, a1_223, s2_200, out a1_583, out a2_584, out a3_585, out a4_236, out a5_586, out a6_587, out a7_588);
	word32 a1_589;
	word32 a5_590;
	net_buf_simple_add((word32) a0_211 + 8, s2_200, a4_236, out a1_589, out a5_590);
	word32 a0_255 = (word32) *((word32) s0_235 + 36);
	struct Eq_271304 * a5_257 = (word32) s2_200 + (word32) (*((word32) s0_235 + 30));
	*((word32) s0_235 + 30) = (word16) a5_257;
	Eq_2 s0_259 = a5_257->t0020;
	Mem264[a5_257 + s2_200 + 32:word32] = s0_259;
	*((word32) s0_259 + 36) = (word16) (a0_255 - s2_200);
	a3_117 = s0_259;
	a1_119 = a0_211;
l2304DA18:
	Eq_2 a3_285;
	word32 s7_597;
	word32 mstatus_598;
	word32 s4_595;
	word32 s6_596;
	word32 s2_593;
	word32 s3_594;
	word32 s1_591;
	word32 a4_592;
	Eq_2 ra_291 = gatt_send.constprop.28(ra_195, s1, s1_197, a1_119, dwArg48, a3_117, s3_218, mstatus_213, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg60, s3, s1, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, out s1_591, out a3_285, out a4_592, out s2_593, out s3_594, out s4_595, out s6_596, out s7_597, out mstatus_598);
	a0Out = s1_197;
	a3Out = a3_285;
	return ra_291;
}

// 2304DA32: void gatt_prepare_write_rsp(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register (ptr32 Eq_271056) a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void gatt_prepare_write_rsp(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 a3, struct Eq_271056 * a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	if (a1 == 0x00)
	{
		if ((word32) a4->w0024 != 0x00)
		{
			word32 a0_260;
			word32 a3_261;
			bt_gatt_write(ra, s1, a0, a4, a3, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg54, dwArg58, dwArg5C, dwArg60, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, out a0_260, out a3_261);
		}
		else
		{
			Eq_2 a4_57;
			Eq_2 s0_61;
			Eq_2 s1_62;
			Eq_2 s3_66;
			Eq_2 a0_76;
			ptr32 mstatus_78;
			word32 a2_241;
			word32 a3_242;
			word32 a5_243;
			word32 s2_244;
			word32 s4_245;
			word32 s5_246;
			word32 s6_247;
			word32 s11_248;
			Eq_2 ra_60 = bt_att_create_pdu(ra, a0, a0, 0x01, a3, mstatus, dwLoc08, dwArg20, dwArg24, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg8C, dwArgB8, dwArgD8, out s0_61, out s1_62, out a0_76, out a2_241, out a3_242, out a4_57, out a5_243, out s2_244, out s3_66, out s4_245, out s5_246, out s6_247, out s11_248, out mstatus_78);
			if (a0_76 == 0x00)
				0x00 = (int8) dwArg38;
			else
			{
				word32 a1_249;
				word32 a5_250;
				*net_buf_simple_add((word32) a0_76 + 8, 0x01, a4_57, out a1_249, out a5_250) = 0x01;
				0x00 = (int8) dwArg38;
				word32 s1_251;
				word32 a3_252;
				word32 a4_253;
				word32 s2_254;
				word32 s3_255;
				word32 s4_256;
				word32 s6_257;
				word32 s7_258;
				word32 mstatus_259;
				gatt_send.constprop.28(ra_60, s0, s1_62, a0_76, 587512198, s0_61, s3_66, mstatus_78, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg60, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, out s1_251, out a3_252, out a4_253, out s2_254, out s3_255, out s4_256, out s6_257, out s7_258, out mstatus_259);
			}
		}
	}
	else
		a4->ptr0018();
}

