pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304DA98: Register Eq_2 bt_gatt_subscribe(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Register out Eq_271603 a0Out, Register out ptr32 a3Out)
// Called from:
//      ble_subscribe
Eq_2 bt_gatt_subscribe(Eq_2 ra, Eq_2 a0, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg5C, Eq_2 dwArg88, Eq_2 dwArgA8, union Eq_271603 & a0Out, ptr32 & a3Out)
{
	if ((word32) *((word32) a0 + 0x0D) != 0x04)
	{
		a0Out.u0 = -57;
		a3Out = a3;
		return ra;
	}
	Eq_2 s0_14 = g_t4200F468;
	struct Eq_271616 * s2_131 = &g_t4200F468;
	if (s0_14 != 0x00)
		s0_14 = (word32) s0_14 - 48;
	Eq_2 s1_116 = a1;
	Eq_2 s3_114 = a0;
	word32 s4_30 = 0x00;
	while (true)
	{
		Eq_271603 a0_139;
		if (s0_14 == 0x00)
			break;
		if (s0_14 == s1_116)
		{
			a0_139.u0 = -69;
			goto l2304DB40;
		}
		word32 a0_39;
		word32 a5_435;
		word32 a4_434;
		s1_116 = bt_conn_addr_le_cmp(a0, (word32) s0_14 + 24, dwLoc10, out a0_39, out a3, out a4_434, out a5_435);
		if (a0_39 == 0x00 && ((word32) (*((word32) s0_14 + 36)) == (word32) (*((word32) s1_116 + 36)) && (word32) (*((word32) s0_14 + 40)) >= (word32) (*((word32) s1_116 + 40))))
			s4_30 = 0x01;
		if (s0_14 == 0x30)
			break;
		word32 s0_55 = *((word32) s0_14 + 48);
		if (s0_55 == 0x00)
			break;
		s0_14 = s0_55 + -48;
	}
	if (s4_30 == 0x00)
	{
		word32 mstatus_427;
		word32 s6_426;
		word32 a5_423;
		word32 s5_425;
		word32 s4_424;
		word32 s0_422;
		ra = gatt_write_ccc.constprop.21(ra, s1_116, a0, s1_116, 0x4200F468, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg5C, dwArg88, dwArgA8, out s0_422, out s1_116, out a0_139, out a3, out a5_423, out s2_131, out s3_114, out s4_424, out s5_425, out s6_426, out mstatus_427);
		if (a0_139 != 0x00)
			goto l2304DB40;
	}
	word32 a5_431;
	word32 a7_433;
	word32 a6_432;
	word32 a4_430;
	word32 a2_429;
	word32 a1_428;
	memcpy((word32) s1_116 + 24, (word32) s3_114 + 112, 0x07, out a1_428, out a2_429, out a3, out a4_430, out a5_431, out a6_432, out a7_433);
	struct Eq_271675 * a4_133 = s2_131->ptr0000;
	struct Eq_271675 * a5_134 = (word32) s1_116 + 48;
	s2_131->ptr0000 = a5_134;
	a4_133->t0030 = s1_116;
	if (s2_131->ptr0004 == null)
		s2_131->ptr0004 = a5_134;
	a0_139.u0 = 0x00;
l2304DB40:
	a0Out = a0_139;
	a3Out = a3;
	return ra;
}

// 2304DB62: Register Eq_2 bt_gatt_unsubscribe(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack word32 dwArgD4, Stack Eq_2 dwArgE8, Stack word32 dwArgF0, Stack ptr32 dwArgF4, Stack Eq_2 dwArg0108, Stack word32 dwArg0118, Stack Eq_2 dwArg0128, Stack word32 dwArg0138, Stack ptr32 dwArg0158, Stack word32 dwArg0178, Stack word32 dwArg0198, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_271779 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_gatt_notification
//      ble_unsubscribe
Eq_2 bt_gatt_unsubscribe(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, word32 dwArgD4, Eq_2 dwArgE8, word32 dwArgF0, ptr32 dwArgF4, Eq_2 dwArg0108, word32 dwArg0118, Eq_2 dwArg0128, word32 dwArg0138, ptr32 dwArg0158, word32 dwArg0178, word32 dwArg0198, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_271779 & a0Out, union Eq_2 & a3Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 a4_243 = (word32) *((word32) a0 + 0x0D);
	if (a4_243 != 0x04)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out.u0 = -57;
		a3Out = a3;
		a5Out.u0 = 0x04;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a5_111 = 0x4200F000;
		Eq_2 s0_116 = g_t4200F468;
		word32 s7_101 = 0x4200F000;
		Eq_2 s2_119 = 0x00;
		if (s0_116 != 0x00)
		{
			s2_119 = (word32) s0_116 - 48;
			if (s0_116 != ~0x2F)
			{
				s0_116 = *s0_116.u0;
				if (s0_116 != 0x00)
					s0_116 = (byte) s0_116.u0 - 48;
			}
			else
				s0_116.u0 = 0x00;
		}
		Eq_2 s1_190 = a1;
		Eq_2 s3_191 = a0;
		Eq_2 s4_108 = 0x00;
		ptr32 s5_110 = 0x00;
		Eq_2 s6_100 = 0x00;
		Eq_2 s8_102 = (word32) a1 + 44;
		ra_189 = ra;
		while (true)
		{
			Eq_2 ra_189;
			if (s2_119 == 0x00)
				break;
			Eq_2 a2_109;
			Eq_2 a2_47 = (word32) s2_119 + 48;
			if (s2_119 == s1_190)
			{
				sys_slist_remove(s4_108, a4_243, a5_111);
				if ((atomic_get(s8_102) & 0x02) != 0x00)
					ra_189 = bt_att_req_cancel(ra_189, s0_116, s3_191, s1_190, a3, mstatus, dwLoc38, s2, dwArg10, dwArg14, dwArg28, dwArg38, dwArg48, s3, ra, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s1_190, out a3, out a4_243, out s3_191, out s4_108, out s6_100, out s7_101, out s8_102);
				a2_109 = s4_108;
				s5_110 = 0x01;
			}
			else
			{
				word32 a0_54;
				word32 a5_603;
				s1_190 = bt_conn_addr_le_cmp(s3_191, (word32) s2_119 + 24, s6, out a0_54, out a3, out a4_243, out a5_603);
				a2_109 = a2_47;
				if (a0_54 == 0x00)
				{
					a4_243 = (word32) *((word32) s2_119 + 36);
					if (a4_243 == (word32) (*((word32) s1_190 + 36)))
						s6_100.u0 = 0x01;
				}
			}
			a5_111.u0 = 0x00;
			if (s0_116 != 0x00)
			{
				s0_116 = *(union Eq_2 *) 0x30;
				if (false)
					a5_111.u0 = -48;
			}
			s2_119 = s0_116;
			s4_108 = a2_109;
			s0_116 = a5_111;
		}
		Eq_271779 a0_128;
		if (s5_110 != 0x00)
		{
			if (s6_100 == 0x00)
			{
				((word32) s1_190 + 40)->u0 = 0x00;
				0x00 = dwArg0198;
				Eq_271779 a0_148;
				Eq_2 a3_151;
				Eq_2 a5_153;
				ptr32 mstatus_156;
				ptr32 s0_158;
				Eq_2 s1_159;
				Eq_2 s2_162;
				Eq_2 s3_163;
				ptr32 s4_164;
				ptr32 s5_165;
				Eq_2 s6_166;
				Eq_2 ra_157 = gatt_write_ccc.constprop.21(ra_189, s1_190, s3_191, s1_190, s2_119, mstatus, dwArg10, dwArg14, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, s3, s1, ra, dwArg7C, dwArgA8, dwArgC8, out s0_158, out s1_159, out a0_148, out a3_151, out a5_153, out s2_162, out s3_163, out s4_164, out s5_165, out s6_166, out mstatus_156);
				s0Out = s0_158;
				s1Out = s1_159;
				a0Out = a0_148;
				a3Out = a3_151;
				a5Out = a5_153;
				s2Out = s2_162;
				s3Out = s3_163;
				s4Out = s4_164;
				s5Out = s5_165;
				s6Out = s6_166;
				mstatusOut = mstatus_156;
				return ra_157;
			}
			Eq_2 s1_177 = *((word32) a5_111 + 32);
			word32 t3_199;
			word32 a6_200;
			word32 tp_201;
			word32 a7_203;
			word32 s10_204;
			word32 s11_205;
			word32 s9_206;
			word32 t0_207;
			word32 t4_208;
			word32 t1_209;
			word32 t5_210;
			word32 t6_211;
			a5_111();
			a0_128.u0 = 0x00;
		}
		else
			a0_128.u0 = ~0x15;
		0x00 = dwArg0198;
		s0Out = dwArg0158;
		s1Out = s1_190;
		a0Out = a0_128;
		a3Out = a3;
		a5Out = a5_111;
		s2Out = s2_119;
		s3Out = s3_191;
		s4Out = dwArgF4;
		s5Out = s5_110;
		s6Out = s6_100;
		mstatusOut = mstatus;
		return ra_189;
	}
}

