pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304DC72: Register Eq_2 bt_gatt_notification(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_271981) a2, Register Eq_2 a3, Register Eq_2 s6, Register ptr32 mstatus, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      att_notify
//      att_indicate
Eq_2 bt_gatt_notification(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, struct Eq_271981 * a2, Eq_2 a3, Eq_2 s6, ptr32 mstatus, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a5_5 = g_t4200F468;
	if (a5_5 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a3Out = a3;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		struct Eq_271995 * sp_110 = fp + ~0x1F;
		Eq_2 s1_125 = (word32) a5_5 - 48;
		if (a5_5 != ~0x2F)
		{
			Eq_2 s5_135 = a3;
			struct Eq_271981 * s4_137 = a2;
			Eq_2 s3_133 = a1;
			Eq_2 s2_129 = a0;
			if (s0 != 0x00)
				s0 = (word32) s0 - 48;
			while (true)
			{
				word32 a0_38;
				word32 a4_304;
				Eq_2 a5_121;
				s1_125 = bt_conn_addr_le_cmp(s2_129, (word32) s1_125 + 24, sp_110->t0010, out a0_38, out a3, out a4_304, out a5_121);
				if (a0_38 == 0x00)
				{
					a5_121 = (word32) *((word32) s1_125 + 36);
					if (a5_121 == s3_133)
					{
						Eq_2 s1_48 = *((word32) a5_121 + 32);
						word32 a0_69;
						word32 t3_70;
						word32 s8_71;
						word32 a6_72;
						word32 tp_73;
						word32 a4_74;
						word32 s11_158;
						word32 s10_157;
						word32 a7_156;
						word32 s7_155;
						word32 s9_159;
						word32 t0_160;
						word32 t1_161;
						word32 t4_162;
						word32 t5_163;
						word32 t6_164;
						a5_121();
						if (a0_69 == 0x00)
						{
							word32 a0_305;
							ra = bt_gatt_unsubscribe(ra, s1_125, s2_129, s1_125, a3, s2_129, s3_133, s6, mstatus, sp_110->t0010, sp_110->t0014, sp_110->t0020, sp_110->t0024, sp_110->t0028, sp_110->t0030, sp_110->t0034, sp_110->t0038, sp_110->t0048, sp_110->t0068, sp_110->t007C, sp_110->t0088, sp_110->t0098, sp_110->t00A8, sp_110->t00C8, sp_110->dw00D4, sp_110->t00E8, sp_110->dw00F0, sp_110->ptr00F4, sp_110->t0108, sp_110->dw0118, sp_110->t0128, sp_110->dw0138, sp_110->ptr0158, sp_110->dw0178, sp_110->dw0198, out s0, out s1_125, out a0_305, out a3, out a5_121, out s2_129, out s3_133, out s4_137, out s5_135, out s6, out mstatus);
						}
					}
				}
				if (s0 == 0x00)
					break;
				Eq_2 s0_122 = *((word32) a5_121 + 48);
				if (a5_121 != 0x00)
					a5_121 = (word32) a5_121 - 48;
				s1_125 = s0_122;
				s0 = a5_121;
			}
		}
		s0Out = s1;
		s1Out = s1_125;
		a3Out = a3;
		mstatusOut = mstatus;
		return ra;
	}
}

// 2304DCF0: void bt_gatt_connected(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8)
// Called from:
//      notify_connected
void bt_gatt_connected(Eq_2 ra, Eq_2 s0, Eq_2 a0, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8)
{
	word32 a0_19;
	word32 s2_485;
	word32 a4_483;
	word32 a5_484;
	struct Eq_272162 * a3_22;
	bt_addr_le_is_bonded((word32) *((word32) a0 + 8), (word32) a0 + 112, dwLoc28, out a0_19, out a3_22, out a4_483, out a5_484, out s2_485);
	Eq_2 dwLoc38_240 = SEQ(nLoc37, 0x01);
	if (a0_19 != 0x00)
	{
		Eq_2 a4_31 = 0x00;
		if (ra != 0x00)
		{
			a3_22 = u8_to_dec(fp + -64, 0x04, ra);
			a4_31 = fp + -64;
		}
		ra = bt_settings_encode_key(ra, fp + -52, 36, a3_22, a4_31, dwLoc38_240, dwLoc0C, dwArg14, a0, dwArg5C, out s11);
	}
	Eq_2 a3_92;
	Eq_2 s0_98;
	Eq_2 s3_103;
	word32 s6_491;
	word32 s11_492;
	word32 s4_489;
	word32 s5_490;
	word32 a4_487;
	word32 a5_488;
	word32 a2_486;
	Eq_2 s1_135;
	Eq_2 s2_102;
	Eq_2 ra_134 = bt_gatt_foreach_attr(ra, 0x01, 0x0FFFFFFF, &g_t2304CA7C, fp + -60, s11, out s0_98, out s1_135, out a2_486, out a3_92, out a4_487, out a5_488, out s2_102, out s3_103, out s4_489, out s5_490, out s6_491, out s11_492);
	Eq_2 dwLoc38_327 = SEQ(nLoc37, 0x01);
	if (bt_conn_get_security(s1_135) < 0x01)
	{
		word32 s3_496;
		word32 a4_495;
		word32 a0_493;
		word32 a3_494;
		ra_134 = bt_conn_set_security(ra_134, s0_98, s1_135, 0x01, a3_92, s2_102, s3_103, mstatus, dwLoc50, dwLoc4C, dwLoc48, dwLoc44, dwLoc40, dwLoc3C, dwLoc38_327, dwLoc34, dwLoc30, s0, dwLoc28, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc0C, dwLoc08, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg2C, a0, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, out s1_135, out a0_493, out a3_494, out a4_495, out s2_102, out s3_496, out mstatus);
	}
	Eq_2 a5_154 = g_t4200F468;
	Eq_2 s0_155 = (word32) a5_154 - 48;
	if (a5_154 != 0x00)
	{
		while (s0_155 != 0x00)
		{
			word32 a0_162;
			word32 a4_498;
			word32 a5_499;
			word32 a3_497;
			s1_135 = bt_conn_addr_le_cmp(s1_135, (word32) s0_155 + 24, dwLoc40, out a0_162, out a3_497, out a4_498, out a5_499);
			if (a0_162 == 0x00)
			{
				word32 s4_504;
				word32 s5_505;
				word32 s6_506;
				word32 a5_502;
				word32 s3_503;
				word32 a0_500;
				word32 a3_501;
				ra_134 = gatt_write_ccc.constprop.21(ra_134, s1_135, s1_135, s0_155, s2_102, mstatus, dwLoc40, dwLoc3C, dwLoc30, s0, dwLoc20, dwLoc1C, dwLoc18, dwArg04, dwArg08, dwArg0C, dwArg2C, dwArg58, dwArg78, out s0_155, out s1_135, out a0_500, out a3_501, out a5_502, out s2_102, out s3_503, out s4_504, out s5_505, out s6_506, out mstatus);
			}
			word32 s0_208 = *((word32) s0_155 + 48);
			if (s0_208 == 0x00)
				return;
			s0_155 = s0_208 + -48;
		}
	}
}

// 2304DDA4: Register Eq_2 bt_gatt_encrypt_change(Register Eq_2 ra, Register (ptr32 Eq_2096) s11, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a2Out, Register out ptr32 a3Out)
// Called from:
//      bt_att_encrypt_change
Eq_2 bt_gatt_encrypt_change(Eq_2 ra, struct Eq_2096 * s11, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a2Out, ptr32 & a3Out)
{
	ptr32 a2_19;
	ptr32 a3_20;
	ptr32 s0_26;
	ptr32 s1_27;
	word32 a4_54;
	word32 a5_55;
	word32 s2_56;
	word32 s3_57;
	word32 s4_58;
	word32 s5_59;
	word32 s6_60;
	word32 s11_61;
	Eq_2 ra_25 = bt_gatt_foreach_attr(ra, 0x01, 0x0FFFFFFF, &g_t2304CA7C, fp + ~0x17, s11, out s0_26, out s1_27, out a2_19, out a3_20, out a4_54, out a5_55, out s2_56, out s3_57, out s4_58, out s5_59, out s6_60, out s11_61);
	s0Out = s0_26;
	s1Out = s1_27;
	a2Out = a2_19;
	a3Out = a3_20;
	return ra_25;
}

