pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304DDCA: Register word32 bt_gatt_change_aware()
// Called from:
//      att_read_req
//      att_signed_write_cmd
word32 bt_gatt_change_aware()
{
	return 0x01;
}

// 2304DDCE: Register Eq_2 bt_gatt_disconnected(Register Eq_2 ra, Register Eq_266569 a0, Register (ptr32 Eq_2096) s11, Stack Eq_2 dwArg08, Register out ptr32 s0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out)
// Called from:
//      bt_att_disconnected
//      att_timeout
Eq_2 bt_gatt_disconnected(Eq_2 ra, Eq_266569 a0, struct Eq_2096 * s11, Eq_2 dwArg08, ptr32 & s0Out, ptr32 & a3Out, union Eq_2 & a4Out)
{
	word32 s1_37;
	Eq_2 s2_40;
	word32 s11_366;
	word32 s6_365;
	word32 s5_364;
	word32 s4_363;
	word32 s3_362;
	word32 a5_361;
	word32 a2_360;
	word32 s0_359;
	Eq_2 a4_126;
	ptr32 a3_101;
	Eq_2 ra_118 = bt_gatt_foreach_attr(ra, 0x01, 0x0FFFFFFF, &g_t2304BC70, a0, s11, out s0_359, out s1_37, out a2_360, out a3_101, out a4_126, out a5_361, out s2_40, out s3_362, out s4_363, out s5_364, out s6_365, out s11_366);
	Eq_2 a5_55 = g_t4200F468;
	if (a5_55 == 0x00)
	{
l2304DE6E:
		s0Out = s1;
		a3Out = a3_101;
		a4Out = a4_126;
		return ra_118;
	}
	Eq_2 s0_156 = (word32) a5_55 - 48;
	if (a5_55 == ~0x2F)
		goto l2304DE6E;
	Eq_2 s3_113 = 0x00;
	s2_161 = s2_40;
l2304DE12:
	Eq_2 s2_161;
	Eq_2 s5_63 = (word32) s0_156 + 24;
	word32 a0_69;
	struct Eq_272454 * a5_127;
	Eq_2 s1_130 = bt_conn_addr_le_cmp(s2_161, s5_63, dwLoc10, out a0_69, out a3_101, out a4_126, out a5_127);
	if (a0_69 == 0x00)
	{
		word32 a0_80;
		Eq_2 a5_85;
		s1_130 = bt_addr_le_is_bonded((word32) *((word32) s2_161 + 8), (word32) s2_40 + 112, dwArg08, out a0_80, out a3_101, out a4_126, out a5_85, out s2_161);
		if (a0_80 == 0x00 || (atomic_get((word32) s0_156 + 44) & 0x01) != 0x00)
		{
			*((word32) s0_156 + 40) = 0x00;
			ra_118 = gatt_subscription_remove(ra_118, s0_156, s2_161, s3_113, s0_156, a4_126, a5_85, dwLoc10, dwLoc0C, out s1_130, out a3_101, out a4_126, out a5_127);
l2304DE40:
			if (s1_130 != 0x00)
			{
				Eq_2 s1_153 = a5_127[1];
				s0_156 = s1_153;
				goto l2304DE12;
			}
			goto l2304DE6E;
		}
		a5_127 = (word32) *((word32) s0_156 + 24);
		if (a5_127 != null)
		{
			word32 a7_370;
			word32 a6_369;
			word32 a2_368;
			word32 a1_367;
			memcpy(s5_63, (word32) s2_40 + 112, 0x07, out a1_367, out a2_368, out a3_101, out a4_126, out a5_127, out a6_369, out a7_370);
		}
	}
	s3_113 = (word32) s0_156 + 48;
	goto l2304DE40;
}

// 2304DE80: void le_dhkey_complete(Register word32 ra, Stack word32 dwArg10)
void le_dhkey_complete(word32 ra, word32 dwArg10)
{
	<anonymous> * a4_5 = g_ptr4200F470;
	if (a4_5 == null)
		return;
	word32 * s0_23;
	word32 a0_25;
	word32 a3_26;
	a4_5();
	*s0_23 = 0x00;
}

// 2304DEB2: void hci_data_buf_overflow(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void hci_data_buf_overflow(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_39;
	word32 a0_40;
	word32 a1_41;
	word32 a2_42;
	word32 a3_43;
	word32 a4_44;
	word32 a5_45;
	word32 a7_46;
	word32 s2_47;
	word32 s3_48;
	word32 s4_49;
	word32 s5_50;
	word32 s6_51;
	word32 s7_52;
	word32 s8_53;
	word32 s9_54;
	word32 s10_55;
	word32 s11_56;
	word32 t4_57;
	printf(ra, &g_t230BB388, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_39, out a0_40, out a1_41, out a2_42, out a3_43, out a4_44, out a5_45, out a7_46, out s2_47, out s3_48, out s4_49, out s5_50, out s6_51, out s7_52, out s8_53, out s9_54, out s10_55, out s11_56, out t4_57);
}

// 2304DEC4: Register Eq_2 atomic_test_bit(Register Eq_2 a0, Register word32 a1, Register out ptr32 a2Out)
// Called from:
//      bt_conn_disconnect
//      slave_update_conn_param
//      set_le_scan_enable
//      hci_disconn_complete
//      bt_id_add
//      bt_id_del
//      bt_le_scan_update
//      le_adv_report
//      enh_conn_complete
//      bt_disable
//      bt_set_name
//      bt_setup_id_addr
//      init_work
//      bt_le_adv_start
//      bt_le_scan_start
//      bt_pub_key_get
//      bt_dh_key_gen
Eq_2 atomic_test_bit(Eq_2 a0, word32 a1, ptr32 & a2Out)
{
	Eq_2 a0_13 = atomic_get(a0) >> a1 & 0x01;
	a2Out = dwArg44;
	return a0_13;
}

// 2304DEDC: Register word32 bt_addr_le_copy(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_272594 a4Out, Register out ptr32 a5Out)
// Called from:
//      hci_id_add
//      bt_id_add
//      bt_id_del
//      id_create.isra.25
//      le_adv_report
//      enh_conn_complete
//      le_legacy_conn_complete
//      bt_get_local_public_address
//      bt_get_local_ramdon_address
//      bt_le_adv_start
word32 bt_addr_le_copy(Eq_2 a0, Eq_2 a1, union Eq_272594 & a4Out, ptr32 & a5Out)
{
	Eq_272594 a4_6;
	ptr32 a5_7;
	word32 a3_11;
	word32 a1_21;
	word32 a2_22;
	word32 a6_23;
	word32 a7_24;
	memcpy(a0, a1, 0x07, out a1_21, out a2_22, out a3_11, out a4_6, out a5_7, out a6_23, out a7_24);
	a4Out = a4_6;
	a5Out = a5_7;
	return a3_11;
}

// 2304DEE2: void le_pkey_complete(Register word32 ra, Register (ptr32 Eq_272614) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
void le_pkey_complete(word32 ra, struct Eq_272614 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	byte * s2_16 = a0->ptr0008;
	word32 s8_186;
	word32 a4_183;
	word32 s4_185;
	word32 a5_184;
	word32 a0_180;
	word32 a2_182;
	word32 a1_181;
	word32 a3_110;
	atomic_and(0x4200DDCC, -33, a3, a4, mstatus, out a0_180, out a1_181, out a2_182, out a3_110, out a4_183, out a5_184, out s4_185, out s8_186);
	if ((word32) *s2_16 == 0x00)
	{
		Eq_2 a4_38;
		Eq_2 a3_43;
		word32 a5_189;
		word32 a7_191;
		word32 a6_190;
		word32 a2_188;
		word32 a1_187;
		memcpy(1107388388, s2_16 + 1, 64, out a1_187, out a2_188, out a3_43, out a4_38, out a5_189, out a6_190, out a7_191);
		word32 a0_192;
		word32 a2_194;
		word32 a1_193;
		word32 a4_195;
		word32 a5_196;
		word32 s4_197;
		word32 s8_198;
		atomic_or(0x4200DDCC, 0x10, a3_43, a4_38, mstatus, out a0_192, out a1_193, out a2_194, out a3_110, out a4_195, out a5_196, out s4_197, out s8_198);
	}
	<anonymous> * a5_102 = &g_t4200F000;
	int32 s1_118 = g_dw4200F478;
	word32 * s0_67 = &g_dw4200F478;
	word32 s3_68 = 1107388388;
	while (s1_118 != 0x00)
	{
		word32 a4_72 = (word32) *s2_16;
		word32 s1_74 = *a5_102;
		word32 a0_76 = s3_68;
		if (a4_72 != 0x00)
			a0_76 = 0x00;
		struct Eq_272712 * s1_97;
		word32 a7_111;
		word32 t0_112;
		word32 t1_113;
		word32 t4_114;
		word32 t5_115;
		word32 t6_116;
		a5_102();
		s1_118 = s1_97->dw0004;
	}
	*s0_67 = 0x00;
}

// 2304DF60: Register Eq_2 atomic_set_bit_to(Register Eq_2 s0, Register ptr32 a1, Register ui32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_272734 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      hci_cmd_done
//      bt_le_scan_update
//      bt_le_adv_start
//      bt_le_scan_start
Eq_2 atomic_set_bit_to(Eq_2 s0, ptr32 a1, ui32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a1Out, ptr32 & a3Out, union Eq_272734 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	Eq_2 a1_6 = 0x01 << a1;
	if (a2 == 0x00)
	{
		int32 a1_12 = ~a1_6;
		ptr32 a1_18;
		ptr32 a3_20;
		Eq_272734 a4_21;
		ptr32 a5_22;
		ptr32 s4_24;
		word32 a0_56;
		word32 a2_57;
		word32 s8_58;
		Eq_2 s1_23 = atomic_and(s0, a1_12, a3, a4, mstatus, out a0_56, out a1_18, out a2_57, out a3_20, out a4_21, out a5_22, out s4_24, out s8_58);
		a1Out = a1_18;
		a3Out = a3_20;
		a4Out = a4_21;
		a5Out = a5_22;
		s4Out = s4_24;
		return s1_23;
	}
	else
	{
		ptr32 a1_28;
		ptr32 a3_30;
		Eq_272734 a4_31;
		ptr32 a5_32;
		ptr32 s4_34;
		word32 a0_53;
		word32 a2_54;
		word32 s8_55;
		Eq_2 s1_33 = atomic_or(s0, a1_6, a3, a4, mstatus, out a0_53, out a1_28, out a2_54, out a3_30, out a4_31, out a5_32, out s4_34, out s8_55);
		a1Out = a1_28;
		a3Out = a3_30;
		a4Out = a4_31;
		a5Out = a5_32;
		s4Out = s4_34;
		return s1_33;
	}
}

// 2304DF7C: Register Eq_2 slave_update_conn_param(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_272804) s2Out, Register out ptr32 s3Out)
// Called from:
//      le_remote_feat_complete
//      enh_conn_complete
Eq_2 slave_update_conn_param(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_272804 & s2Out, ptr32 & s3Out)
{
	word32 a2_112;
	if (atomic_test_bit((word32) a0 + 4, 0x08, out a2_112) != 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		return s0;
	}
	else
	{
		Eq_2 a3_29;
		Eq_2 a4_30;
		struct Eq_272804 * s2_34;
		ptr32 s3_35;
		word32 s1_113;
		word32 a0_114;
		word32 a1_115;
		word32 a2_116;
		word32 a5_117;
		word32 s4_118;
		word32 s5_119;
		word32 s6_120;
		word32 s8_121;
		Eq_2 s0_32 = k_delayed_work_submit(0x01000388, a3, a4, mstatus, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_113, out a0_114, out a1_115, out a2_116, out a3_29, out a4_30, out a5_117, out s2_34, out s3_35, out s4_118, out s5_119, out s6_120, out s8_121);
		a3Out = a3_29;
		a4Out = a4_30;
		s2Out = s2_34;
		s3Out = s3_35;
		return s0_32;
	}
}

// 2304DFAA: void le_remote_feat_complete(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_272851) a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void le_remote_feat_complete(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_272851 * a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	struct Eq_272871 * s2_13 = a0->ptr0008;
	Eq_2 a0_21;
	byte * s2_26;
	word32 s4_259;
	word32 s3_258;
	word32 s1_256;
	word32 a4_257;
	Eq_2 a3_33;
	bt_conn_lookup_handle((word32) s2_13->b0002 << 8 | (word32) s2_13->b0001, a3, mstatus, out s1_256, out a0_21, out a3_33, out a4_257, out s2_26, out s3_258, out s4_259);
	if (a0_21 != 0x00)
	{
		if ((word32) *s2_26 == 0x00)
		{
			word32 a1_279;
			word32 a2_280;
			word32 a4_281;
			word32 a5_282;
			word32 a6_283;
			word32 a7_284;
			memcpy((word32) a0_21 + 0x0094, s2_26 + 3, 0x08, out a1_279, out a2_280, out a3_33, out a4_281, out a5_282, out a6_283, out a7_284);
		}
		Eq_2 a4_55 = (word32) *((word32) a0_21 + 3);
		if (a4_55 == 0x01)
		{
			word32 s2_285;
			word32 s3_286;
			slave_update_conn_param(a0_21, a3_33, a4_55, mstatus, s0, dwLoc08, dwArg14, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out a3_33, out a4_55, out s2_285, out s3_286);
		}
		0x00 = dwArg38;
		word32 a3_287;
		word32 a4_288;
		word32 a5_289;
		bt_conn_unref(s0, a3_33, a4_55, mstatus, out a3_287, out a4_288, out a5_289);
	}
	else
	{
		0x00 = dwArg38;
		word32 s5_271;
		word32 s4_270;
		word32 s2_268;
		word32 s3_269;
		word32 a5_266;
		word32 a7_267;
		word32 a4_265;
		word32 a3_264;
		word32 a2_263;
		word32 a1_262;
		word32 a0_261;
		word32 s1_260;
		word32 s6_272;
		word32 s7_273;
		word32 s8_274;
		word32 s9_275;
		word32 s10_276;
		word32 s11_277;
		word32 t4_278;
		printf(ra, &g_t230BB510, a3_33, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_260, out a0_261, out a1_262, out a2_263, out a3_264, out a4_265, out a5_266, out a7_267, out s2_268, out s3_269, out s4_270, out s5_271, out s6_272, out s7_273, out s8_274, out s9_275, out s10_276, out s11_277, out t4_278);
	}
}

