pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304E01A: void le_conn_update_complete(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_273001) s1, Register Eq_2 a3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void le_conn_update_complete(Eq_2 ra, Eq_2 s0, struct Eq_273001 * s1, Eq_2 a3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 a1_14 = (word32) s1->b0002 << 8 | (word32) s1->b0001;
	Eq_2 a0_19;
	struct Eq_273040 * s1_23;
	Eq_2 s2_24;
	word32 a4_260;
	word32 s3_261;
	word32 s4_262;
	Eq_2 a3_106;
	bt_conn_lookup_handle(a1_14, a3, mstatus, out s1_23, out a0_19, out a3_106, out a4_260, out s2_24, out s3_261, out s4_262);
	if (a0_19 == 0x00)
	{
		word32 s1_263;
		word32 a0_264;
		word32 a1_265;
		word32 a2_266;
		word32 a3_267;
		word32 a4_268;
		word32 a5_269;
		word32 a7_270;
		word32 s2_271;
		word32 s3_272;
		word32 s4_273;
		word32 s5_274;
		word32 s6_275;
		word32 s7_276;
		word32 s8_277;
		word32 s9_278;
		word32 s10_279;
		word32 s11_280;
		word32 t4_281;
		printf(ra, &g_t230BB510, a3_106, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_263, out a0_264, out a1_265, out a2_266, out a3_267, out a4_268, out a5_269, out a7_270, out s2_271, out s3_272, out s4_273, out s5_274, out s6_275, out s7_276, out s8_277, out s9_278, out s10_279, out s11_280, out t4_281);
	}
	else
	{
		Eq_2 a4_107;
		word32 a5_34 = (word32) s1_23->b0000;
		Eq_2 s0_116 = a0_19;
		if (a5_34 == 0x00)
		{
			((word32) a0_19 + 0x0086)->u2 = (word16) ((word32) s1_23->b0004 << 8 | (word32) s1_23->b0003);
			*((word32) a0_19 + 0x008C) = (word16) ((word32) s1_23->b0006 << 8 | (word32) s1_23->b0005);
			((word32) a0_19 + 0x008E)->u2 = (word16) ((word32) s1_23->b0008 << 8 | (word32) s1_23->b0007);
			a3_106 = notify_le_param_updated(ra, a0_19, a3_106, mstatus, out a4_107, out mstatus);
		}
		else
		{
			a4_107.u0 = 0x1A;
			if (a5_34 == 0x1A)
			{
				a4_107 = (word32) *((word32) a0_19 + 3);
				if (a4_107 == 0x01)
				{
					ui32 a0_41;
					word32 a1_285;
					word32 a2_286;
					word32 a5_287;
					word32 s4_288;
					word32 s8_289;
					Eq_2 s1_47 = atomic_or(a0_19, 0x0400, a3_106, a4_107, mstatus, out a0_41, out a1_285, out a2_286, out a3_106, out a4_107, out a5_287, out s4_288, out s8_289);
					if ((a0_41 & 0x0400) == 0x00)
						s0_116 = bt_l2cap_update_conn_param(ra, s1_47, a3_106, s2_24, s5, mstatus, dwLoc20, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg24, dwArg28, dwArg2C, dwArg4C, a1_14, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out a3_106, out a4_107, out mstatus);
				}
			}
		}
		word32 a3_282;
		word32 a4_283;
		word32 a5_284;
		bt_conn_unref(s0_116, a3_106, a4_107, mstatus, out a3_282, out a4_283, out a5_284);
	}
}

// 2304E0CC: void hci_num_completed_packets(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_273208) a0, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void hci_num_completed_packets(Eq_2 ra, Eq_2 s0, struct Eq_273208 * a0, Eq_2 a3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	struct Eq_273229 * s4_199 = a0->ptr0008;
	int32 s3_26 = 0x00;
	word32 s6_183 = 0x230BB000;
	word32 s7_202 = 0x230BB000;
	ra_152 = ra;
	while (true)
	{
		Eq_2 ra_152;
		if (s3_26 >= (word32) s4_199->b0000)
			break;
		struct Eq_273240 * a5_35 = s4_199 + (s3_26 << 0x02) / 40;
		Eq_2 s1_40 = (word32) a5_35->b0002 << 8 | (word32) a5_35->b0001;
		word32 a2_640;
		word32 a4_641;
		word32 a5_642;
		irq_lock((word32) a5_35->b0003, mstatus, out a2_640, out a4_641, out a5_642);
		Eq_2 a0_52;
		Eq_2 a3_64;
		word32 a4_643;
		uint32 s2_266;
		Eq_2 s1_247;
		word32 s3_198;
		bt_conn_lookup_handle(s1_40, a3, mstatus, out s1_247, out a0_52, out a3_64, out a4_643, out s2_266, out s3_198, out s4_199);
		Eq_2 s0_103 = a0_52;
		if (a0_52 == 0x00)
		{
			word32 s11_659;
			word32 s2_654;
			word32 a2_650;
			word32 a5_646;
			word32 t4_660;
			word32 s8_656;
			word32 s5_655;
			word32 s10_658;
			word32 s9_657;
			word32 a5_652;
			word32 a4_651;
			word32 a7_653;
			word32 a0_648;
			word32 s1_647;
			word32 a1_649;
			word32 a4_645;
			ra_152 = printf(ra_152, s7_202 + 988, irq_unlock(a3_64, mstatus, out a4_645, out a5_646), s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_647, out a0_648, out a1_649, out a2_650, out a3, out a4_651, out a5_652, out a7_653, out s2_654, out s3_198, out s4_199, out s5_655, out s6_183, out s7_202, out s8_656, out s9_657, out s10_658, out s11_659, out t4_660);
		}
		else
		{
			word32 a5_644;
			Eq_2 a4_191;
			Eq_2 a3_190 = irq_unlock(a3_64, mstatus, out a4_191, out a5_644);
			Eq_2 s8_119 = (word32) a0_52 + 40;
			while (s2_266 != 0x00)
			{
				Eq_2 a3_156;
				Eq_2 a5_158;
				Eq_2 a4_157;
				Eq_2 a0_181;
				struct Eq_273357 * a5_78;
				word32 a4_664;
				word32 a2_663;
				irq_lock(a4_191, mstatus, out a2_663, out a4_664, out a5_78);
				word32 s0_80 = a5_78->dw001C;
				if (a5_78 != null)
				{
					a5_78->dw001B = s0_80;
					a3_156 = irq_unlock(a3_190, mstatus, out a4_157, out a5_158);
					a0_181 = bt_conn_get_pkts();
				}
				else
				{
					s0_103 = *((word32) s1_247 + 20);
					if (s1_247 != 0x00)
					{
						s1_247 = a5_78->t0000;
						s0_103 = *((word32) a3_190 + 24);
						a5_78->t0014 = s0_103;
						if (s1_247 == a3_190)
							a5_78->t0018 = s0_103;
					}
					Eq_2 a4_94;
					word32 a5_665;
					Eq_2 a3_93 = irq_unlock(a3_190, mstatus, out a4_94, out a5_665);
					if (s1_247 == 0x00)
					{
						word32 a0_669;
						word32 s2_674;
						word32 s11_679;
						word32 t4_680;
						word32 s8_676;
						word32 s5_675;
						word32 s10_678;
						word32 s9_677;
						word32 a2_671;
						word32 a1_670;
						word32 a7_673;
						word32 a5_672;
						word32 s1_668;
						ra_152 = printf(ra_152, s6_183 + 1020, a3_93, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_668, out a0_669, out a1_670, out a2_671, out a3_190, out a4_191, out a5_672, out a7_673, out s2_674, out s3_198, out s4_199, out s5_675, out s6_183, out s7_202, out s8_676, out s9_677, out s10_678, out s11_679, out t4_680);
						break;
					}
					struct Eq_273412 * a5_100;
					word32 a2_666;
					word32 a4_667;
					irq_lock(a4_94, mstatus, out a2_666, out a4_667, out a5_100);
					struct Eq_273420 * s1_102 = a5_100->ptr000C;
					a5_100->t001C = s0_103;
					s1_102->dw000C = 0x00;
					s1_102->ptr0000 = null;
					word32 s0_107 = a5_100->dw0024;
					if (a5_100 == null)
					{
						s1_102->dw0024 = s0_107;
						s1_102->dw0020 = s0_107;
					}
					else
					{
						s1_102->ptr0000 = a5_100;
						s1_102->dw0024 = s0_107;
					}
					Eq_2 a4_115;
					Eq_2 a3_128;
					Eq_2 a4_129;
					Eq_2 a5_130;
					word32 s2_693;
					word32 s3_694;
					word32 s4_695;
					word32 s5_696;
					word32 s6_697;
					word32 s8_698;
					word32 a5_689;
					word32 s1_690;
					word32 a0_691;
					word32 a1_692;
					k_work_submit(s8_119, irq_unlock(a3_93, mstatus, out a4_115, out a5_689), a4_115, mstatus, s8, s7, dwArgC8, dwArg0108, dwArg0148, out s1_690, out a0_691, out a1_692, out a3_128, out a4_129, out a5_130, out s2_693, out s3_694, out s4_695, out s5_696, out s6_697, out s8_698);
					word32 s5_166;
					word32 s7_708;
					word32 s8_709;
					word32 s9_710;
					word32 s10_711;
					word32 s11_712;
					word32 s6_707;
					word32 s1_700;
					word32 a0_701;
					word32 a1_702;
					word32 a2_703;
					word32 s2_704;
					word32 s3_705;
					word32 s4_706;
					word32 s0_699;
					ra_152 = k_sem_give(ra_152, bt_conn_get_pkts(), a3_128, a4_129, a5_130, mstatus, s0, dwLoc18, dwArg30, dwArg34, s5, ra, dwArg7C, dwArgD8, dwArg0118, dwArg0158, out s0_699, out s1_700, out a0_701, out a1_702, out a2_703, out a3_156, out a4_157, out a5_158, out s2_704, out s3_705, out s4_706, out s5_166, out s6_707, out s7_708, out s8_709, out s9_710, out s10_711, out s11_712);
					a0_181 = s5_166 + 0x0644;
				}
				uint32 s2_248;
				word32 s9_686;
				word32 s10_687;
				word32 s11_688;
				word32 a0_681;
				word32 a1_682;
				word32 a2_683;
				word32 a5_684;
				word32 s5_685;
				ra_152 = k_sem_give(ra_152, a0_181, a3_156, a4_157, a5_158, mstatus, s0, dwLoc18, dwArg30, dwArg34, s5, ra, dwArg7C, dwArgD8, dwArg0118, dwArg0158, out s0_103, out s1_247, out a0_681, out a1_682, out a2_683, out a3_190, out a4_191, out a5_684, out s2_248, out s3_198, out s4_199, out s5_685, out s6_183, out s7_202, out s8_119, out s9_686, out s10_687, out s11_688);
				s2_266 = s2_248 >> 0x10;
			}
			word32 a4_661;
			word32 a5_662;
			bt_conn_unref(s0_103, a3_190, a4_191, mstatus, out a3, out a4_661, out a5_662);
		}
		s3_26 = s3_198 + 0x01;
	}
	0x00 = dwArg0128;
}

// 2304E1EA: Register Eq_2 update_sec_level(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out (ptr32 Eq_273645) s1Out, Register out Eq_2 a3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      hci_encrypt_key_refresh_complete
//      hci_encrypt_change
Eq_2 update_sec_level(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & s0Out, struct Eq_273645 & s1Out, union Eq_2 & a3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	if ((word32) *((word32) a0 + 11) == 0x00)
	{
		*((word32) a0 + 9) = 0x01;
		s0Out = s0;
		s1Out = s1;
		a3Out = a3;
		s5Out = s5;
		mstatusOut = mstatus;
		return ra;
	}
	word32 a5_13;
	Eq_2 a4_6 = *((word32) a0 + 0x009C);
	if (a4_6 != 0x00)
	{
		ui32 a5_7 = (word32) *((word32) a4_6 + 9);
		a3 = a5_7 & 1;
		if ((a5_7 & 1) != 0x00)
		{
			if ((a5_7 & 0x10) != 0x00 && (word32) (*((word32) a4_6 + 8)) == 0x10)
				a5_13 = 0x04;
			else
				a5_13 = 0x03;
l2304E218:
			*((word32) a0 + 9) = (byte) a5_13;
			if ((word32) *((word32) a0 + 9) >= (word32) (*((word32) a0 + 0x0A)))
			{
				s0Out = s0;
				s1Out = s1;
				a3Out = a3;
				s5Out = s5;
				mstatusOut = mstatus;
				return ra;
			}
			else
			{
				Eq_2 a3_48;
				Eq_2 s1_52;
				Eq_2 s2_55;
				Eq_2 s3_56;
				word32 a0_423;
				word32 a2_425;
				word32 a4_426;
				word32 a1_424;
				word32 s4_429;
				word32 a7_428;
				word32 a5_427;
				word32 s5_430;
				word32 s6_431;
				word32 s7_432;
				word32 s9_434;
				word32 s10_435;
				word32 s8_433;
				word32 t4_437;
				word32 s11_436;
				Eq_2 ra_51 = printf(ra, &g_t230BB5E4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_52, out a0_423, out a1_424, out a2_425, out a3_48, out a4_426, out a5_427, out a7_428, out s2_55, out s3_56, out s4_429, out s5_430, out s6_431, out s7_432, out s8_433, out s9_434, out s10_435, out s11_436, out t4_437);
				struct Eq_273645 * s1_79;
				Eq_2 s0_83;
				Eq_2 a3_86;
				ptr32 mstatus_88;
				ptr32 s5_91;
				word32 a0_438;
				word32 s2_441;
				word32 a5_440;
				word32 a4_439;
				word32 s3_442;
				word32 s4_443;
				Eq_2 ra_89 = bt_conn_disconnect(ra_51, s0, s1_52, a0, 0x05, a3_48, s2_55, s3_56, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg60, ra, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg8C, dwArg94, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, out s0_83, out s1_79, out a0_438, out a3_86, out a4_439, out a5_440, out s2_441, out s3_442, out s4_443, out s5_91, out mstatus_88);
				s0Out = s0_83;
				s1Out = s1_79;
				a3Out = a3_86;
				s5Out = s5_91;
				mstatusOut = mstatus_88;
				return ra_89;
			}
		}
	}
	a5_13 = 0x02;
	goto l2304E218;
}

