pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304E254: void hci_encrypt_key_refresh_complete(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void hci_encrypt_key_refresh_complete(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	Eq_2 a1_14 = (word32) *((word32) s1 + 2) << 8 | (word32) (*((word32) s1 + 1));
	Eq_2 a0_19;
	Eq_2 s2_24;
	Eq_2 s3_25;
	word32 a4_341;
	word32 s4_342;
	Eq_2 s1_102;
	Eq_2 a3_108;
	bt_conn_lookup_handle(a1_14, a3, mstatus, out s1_102, out a0_19, out a3_108, out a4_341, out s2_24, out s3_25, out s4_342);
	if (a0_19 != 0x00)
	{
		ptr32 mstatus_118;
		Eq_2 a1_138;
		Eq_2 ra_119;
		Eq_2 s0_177 = a0_19;
		if ((word32) *s1_102 != 0x00)
		{
			struct Eq_273905 * a5_139 = (word32) *((word32) a0_19 + 9);
			*((word32) a0_19 + 0x0A) = (byte) a5_139;
			byte * s1_152;
			ra_119 = bt_l2cap_encrypt_change(ra, (word32) *s1_102, a3_108, a5_139, s5, mstatus, dwArg18, out s1_152, out mstatus_118);
			struct Eq_273933 * a4_170 = (word32) *s1_152;
			a1_138.u0 = 0x08;
			if (a4_170 <= (struct Eq_273933 *) 41)
				a1_138 = (word32) a4_170->b230BAF58;
		}
		else
		{
			if ((word32) *((word32) a0_19 + 2) == 0x01)
			{
				Eq_2 a3_40;
				Eq_2 s0_46;
				ptr32 mstatus_62;
				ra = update_sec_level(bt_smp_update_keys(ra, a0_19, s1_102, a0_19, a3_108, s2_24, s3_25, mstatus, dwLoc1C, dwLoc18, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg58, dwArg5C, a1_14, s1, ra, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_46, out a3_40, out mstatus_62), s0_46, s0_46, a3_40, mstatus_62, dwLoc20, dwLoc1C, dwLoc18, s0, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg58, dwArg5C, a1_14, s1, ra, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_177, out s1_102, out a3_108, out s5, out mstatus);
			}
			struct Eq_273905 * a5_99 = (word32) *((word32) s0_177 + 9);
			*((word32) s0_177 + 0x0A) = (byte) a5_99;
			word32 s1_365;
			ra_119 = bt_l2cap_encrypt_change(ra, (word32) *s1_102, a3_108, a5_99, s5, mstatus, dwArg18, out s1_365, out mstatus_118);
			a1_138.u0 = 0x00;
		}
		Eq_2 a3_186;
		Eq_2 a4_187;
		word32 s1_362;
		word32 a0_363;
		word32 s2_364;
		bt_conn_security_changed(ra_119, s0_177, a1_138, dwArg08, dwArg18, out s1_362, out a0_363, out a3_186, out a4_187, out s2_364);
		word32 a3_366;
		word32 a4_367;
		word32 a5_368;
		bt_conn_unref(s0_177, a3_186, a4_187, mstatus_118, out a3_366, out a4_367, out a5_368);
	}
	else
	{
		word32 s1_343;
		word32 a0_344;
		word32 a1_345;
		word32 a2_346;
		word32 a3_347;
		word32 a4_348;
		word32 a5_349;
		word32 a7_350;
		word32 s2_351;
		word32 s3_352;
		word32 s4_353;
		word32 s5_354;
		word32 s6_355;
		word32 s7_356;
		word32 s8_357;
		word32 s9_358;
		word32 s10_359;
		word32 s11_360;
		word32 t4_361;
		printf(ra, &g_t230BB3B4, a3_108, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_343, out a0_344, out a1_345, out a2_346, out a3_347, out a4_348, out a5_349, out a7_350, out s2_351, out s3_352, out s4_353, out s5_354, out s6_355, out s7_356, out s8_357, out s9_358, out s10_359, out s11_360, out t4_361);
	}
}

// 2304E2FC: void hci_encrypt_change(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void hci_encrypt_change(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	Eq_2 a1_14 = (word32) *((word32) s1 + 2) << 8 | (word32) (*((word32) s1 + 1));
	Eq_2 a0_19;
	Eq_2 s2_24;
	Eq_2 s3_25;
	Eq_2 a3_31;
	word32 s4_398;
	word32 a4_397;
	Eq_2 s1_110;
	bt_conn_lookup_handle(a1_14, a3, mstatus, out s1_110, out a0_19, out a3_31, out a4_397, out s2_24, out s3_25, out s4_398);
	if (a0_19 != 0x00)
	{
		ptr32 mstatus_126;
		Eq_2 a1_146;
		Eq_2 ra_127;
		Eq_2 s0_105 = a0_19;
		if ((word32) *s1_110 != 0x00)
		{
			struct Eq_273905 * a5_147 = (word32) *((word32) a0_19 + 9);
			*((word32) a0_19 + 0x0A) = (byte) a5_147;
			byte * s1_160;
			ra_127 = bt_l2cap_encrypt_change(ra, (word32) *s1_110, a3_31, a5_147, s5, mstatus, dwArg18, out s1_160, out mstatus_126);
			struct Eq_274217 * a4_178 = (word32) *s1_160;
			a1_146.u0 = 0x08;
			if (a4_178 <= (struct Eq_274217 *) 41)
				a1_146 = (word32) a4_178->b230BAF58;
		}
		else
		{
			word32 a5_36 = (word32) *((word32) s1_110 + 3);
			Eq_2 a3_116 = (word32) *((word32) a0_19 + 2);
			*((word32) a0_19 + 11) = (byte) a5_36;
			if (a3_116 == 0x01)
			{
				Eq_2 ra_47;
				ra_47 = ra;
				if (a5_36 != 0x00)
					ra_47 = bt_smp_update_keys(ra, a0_19, s1_110, a0_19, a3_116, s2_24, s3_25, mstatus, dwLoc1C, dwLoc18, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg58, dwArg5C, a1_14, s1, ra, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_105, out a3_116, out mstatus);
				ra = update_sec_level(ra_47, s0_105, s0_105, a3_116, mstatus, dwLoc20, dwLoc1C, dwLoc18, s0, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg58, dwArg5C, a1_14, s1, ra, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_105, out s1_110, out a3_116, out s5, out mstatus);
			}
			struct Eq_273905 * a5_107 = (word32) *((word32) s0_105 + 9);
			*((word32) s0_105 + 0x0A) = (byte) a5_107;
			word32 s1_421;
			ra_127 = bt_l2cap_encrypt_change(ra, (word32) *s1_110, a3_116, a5_107, s5, mstatus, dwArg18, out s1_421, out mstatus_126);
			a1_146.u0 = 0x00;
		}
		Eq_2 a3_194;
		Eq_2 a4_195;
		word32 s1_418;
		word32 a0_419;
		word32 s2_420;
		bt_conn_security_changed(ra_127, s0_105, a1_146, dwArg08, dwArg18, out s1_418, out a0_419, out a3_194, out a4_195, out s2_420);
		word32 a3_422;
		word32 a4_423;
		word32 a5_424;
		bt_conn_unref(s0_105, a3_194, a4_195, mstatus_126, out a3_422, out a4_423, out a5_424);
	}
	else
	{
		word32 s2_407;
		word32 a7_406;
		word32 a5_405;
		word32 a4_404;
		word32 a3_403;
		word32 a2_402;
		word32 a1_401;
		word32 a0_400;
		word32 s1_399;
		word32 s3_408;
		word32 s4_409;
		word32 s5_410;
		word32 s6_411;
		word32 s7_412;
		word32 s8_413;
		word32 s9_414;
		word32 s10_415;
		word32 s11_416;
		word32 t4_417;
		printf(ra, &g_t230BB3B4, a3_31, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_399, out a0_400, out a1_401, out a2_402, out a3_403, out a4_404, out a5_405, out a7_406, out s2_407, out s3_408, out s4_409, out s5_410, out s6_411, out s7_412, out s8_413, out s9_414, out s10_415, out s11_416, out t4_417);
	}
}

