pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304E3AE: Register word32 find_pending_connect(Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_274297) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      enh_conn_complete
word32 find_pending_connect(Eq_2 a0, Eq_2 a3, ptr32 mstatus, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & a4Out, struct Eq_274297 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 a0_13;
	Eq_2 a3_16;
	ptr32 a4_17;
	word32 s1_21;
	struct Eq_274297 * s2_22;
	ptr32 s3_23;
	ptr32 s4_24;
	word32 a5_76;
	word32 s8_77;
	Eq_2 s0_20 = bt_conn_lookup_state_le(a0, 0x03, a3, mstatus, out s1_21, out a0_13, out a3_16, out a4_17, out a5_76, out s2_22, out s3_23, out s4_24, out s8_77);
	if (a0_13 != 0x00)
	{
		a0Out = a0_13;
		a3Out = a3_16;
		a4Out = a4_17;
		s2Out = s2_22;
		s3Out = s3_23;
		s4Out = s4_24;
		return s1_21;
	}
	else
	{
		ptr32 a0_36;
		Eq_2 a3_39;
		ptr32 a4_40;
		word32 s1_44;
		struct Eq_274297 * s2_45;
		ptr32 s3_46;
		ptr32 s4_47;
		word32 a5_78;
		word32 s8_79;
		bt_conn_lookup_state_le(s0_20, 0x02, a3_16, mstatus, out s1_44, out a0_36, out a3_39, out a4_40, out a5_78, out s2_45, out s3_46, out s4_47, out s8_79);
		a0Out = a0_36;
		a3Out = a3_39;
		a4Out = a4_40;
		s2Out = s2_45;
		s3Out = s3_46;
		s4Out = s4_47;
		return s1_44;
	}
}

// 2304E3D4: void hci_vendor_event(Register word32 ra, Register word32 a0, Register word32 a4, Register (ptr32 code) a5)
void hci_vendor_event(word32 ra, word32 a0, word32 a4, <anonymous> * a5)
{
	if (a5 != null)
	{
		word32 s2_34;
		word32 s4_36;
		struct Eq_274353 * a0_37;
		a5();
		struct Eq_274354 * s0_43 = a0_37->ptr0010;
		*((char *) (a0_37 + (word32) ((word16) s2_34) / 20) + 8) = (struct Eq_274353 *) s0_43;
		s0_43->w000C = (word16) s4_36;
	}
}

// 2304E426: Register Eq_2 handle_event(Register Eq_2 ra, Register (ptr32 Eq_274369) a0, Register Eq_2 a1, Register Eq_2 a2, Register ui32 a3, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out (ptr32 Eq_274369) s0Out, Register out ptr32 s1Out, Register out ptr32 a1Out, Register out ptr32 a4Out)
// Called from:
//      hci_le_meta_event
//      bt_recv
//      bt_recv_prio
Eq_2 handle_event(Eq_2 ra, struct Eq_274369 * a0, Eq_2 a1, Eq_2 a2, ui32 a3, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, struct Eq_274369 & s0Out, ptr32 & s1Out, ptr32 & a1Out, ptr32 & a4Out)
{
	Eq_2 a3_13 = (word32) a2 + (a3 << 3);
	do
	{
		if ((word32) *a2 == a0)
		{
			up32 a1_21 = (word32) *((word32) a1 + 0x0C);
			if (a1_21 >= (word32) (*((word32) a2 + 1)))
			{
				ptr32 a4_116;
				struct Eq_274369 * s0_32;
				Eq_2 ra_33;
				ptr32 a1_36;
				word32 t1_40;
				ptr32 s1_118;
				word32 a6_130;
				(*((word32) a2 + 4))();
				s0Out = s0_32;
				s1Out = s1_118;
				a1Out = a1_36;
				a4Out = a4_116;
				return ra_33;
			}
			else
			{
				ptr32 a1_50;
				ptr32 a4_53;
				ptr32 s1_56;
				word32 a0_198;
				word32 a2_199;
				word32 a3_200;
				word32 a5_201;
				word32 a7_202;
				word32 s2_203;
				word32 s3_204;
				word32 s4_205;
				word32 s5_206;
				word32 s6_207;
				word32 s7_208;
				word32 s8_209;
				word32 s9_210;
				word32 s10_211;
				word32 s11_212;
				word32 t4_213;
				Eq_2 ra_55 = printf(ra, &g_t230BB2D0, a3_13, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_56, out a0_198, out a1_50, out a2_199, out a3_200, out a4_53, out a5_201, out a7_202, out s2_203, out s3_204, out s4_205, out s5_206, out s6_207, out s7_208, out s8_209, out s9_210, out s10_211, out s11_212, out t4_213);
				s0Out = a0;
				s1Out = s1_56;
				a1Out = a1_50;
				a4Out = a4_53;
				return ra_55;
			}
		}
		a2 = (word32) a2 + 8;
	} while (a2 != a3_13);
	word32 a3_181;
	Eq_2 a0_74 = bt_hex_real(*((word32) a1 + 8), (word32) *((word32) a1 + 0x0C), out a3_181);
	ptr32 a1_93;
	ptr32 a4_96;
	ptr32 s1_99;
	word32 a0_182;
	word32 a2_183;
	word32 a3_184;
	word32 a5_185;
	word32 a7_186;
	word32 s2_187;
	word32 s3_188;
	word32 s4_189;
	word32 s5_190;
	word32 s6_191;
	word32 s7_192;
	word32 s8_193;
	word32 s9_194;
	word32 s10_195;
	word32 s11_196;
	word32 t4_197;
	Eq_2 ra_98 = printf(ra, &g_t230BB2F4, a0_74, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_99, out a0_182, out a1_93, out a2_183, out a3_184, out a4_96, out a5_185, out a7_186, out s2_187, out s3_188, out s4_189, out s5_190, out s6_191, out s7_192, out s8_193, out s9_194, out s10_195, out s11_196, out t4_197);
	s0Out = a0;
	s1Out = s1_99;
	a1Out = a1_93;
	a4Out = a4_96;
	return ra_98;
}

// 2304E494: void hci_le_meta_event(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void hci_le_meta_event(Eq_2 ra, Eq_2 a0, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 a1_58;
	word32 a4_59;
	word32 a5_60;
	struct Eq_274369 * a0_19 = (word32) *net_buf_simple_pull_mem((word32) a0 + 8, 0x01, out a1_58, out a4_59, out a5_60);
	word32 s0_61;
	word32 s1_62;
	word32 a1_63;
	word32 a4_64;
	handle_event(ra, a0_19, a0, 587969848, 0x09, dwArg00, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s0_61, out s1_62, out a1_63, out a4_64);
}

// 2304E4BE: Register Eq_2 hci_cmd_done(Register Eq_2 ra, Register Eq_2 s1, Register ui32 a0, Register ptr32 a1, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      hci_cmd_status
//      hci_cmd_complete
//      hci_tx_thread
Eq_2 hci_cmd_done(Eq_2 ra, Eq_2 s1, ui32 a0, ptr32 a1, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	ptr32 s3_21 = a1;
	Eq_2 s1_103 = a2;
	word32 a5_363;
	if (net_buf_pool_get((word32) *((word32) a2 + 6), out a5_363) == 0x4200EF20)
	{
		Eq_2 ra_149;
		ra_149 = ra;
		word32 a5_366;
		word32 a4_365;
		word32 a3_364;
		if ((word32) net_buf_id(a2, out a3_364, out a4_365, out a5_366)->w4201593A != a0)
		{
			Eq_2 a3_41;
			word32 a4_381;
			word32 a5_382;
			net_buf_id(a2, out a3_41, out a4_381, out a5_382);
			word32 a0_383;
			word32 a2_384;
			word32 a3_385;
			word32 a4_386;
			word32 a5_387;
			word32 a7_388;
			word32 s2_389;
			word32 s4_390;
			word32 s5_391;
			word32 s6_392;
			word32 s8_393;
			word32 s11_394;
			word32 t4_395;
			ra_149 = printf(ra, &g_t230BB350, a3_41, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_103, out a0_383, out a1, out a2_384, out a3_385, out a4_386, out a5_387, out a7_388, out s2_389, out s3_21, out s4_390, out s5_391, out s6_392, out s7, out s8_393, out s9, out s10, out s11_394, out t4_395);
		}
		word32 a5_77;
		word32 a3_379;
		word32 a4_380;
		net_buf_id(s1_103, out a3_379, out a4_380, out a5_77);
		if (a5_77 != 0x00 && s3_21 == 0x00)
		{
			Eq_2 a3_85;
			Eq_2 a4_86;
			struct Eq_274735 * a5_87;
			net_buf_id(s1_103, out a3_85, out a4_86, out a5_87);
			word32 a3_396;
			word32 a4_397;
			word32 a5_398;
			word32 s4_399;
			s1_103 = atomic_set_bit_to(0x4201592C, a1, (word32) a5_87->b0008, a3_85, a4_86, mstatus, out a1, out a3_396, out a4_397, out a5_398, out s4_399);
		}
		ptr32 a3_110;
		ptr32 a4_111;
		ptr32 a5_112;
		net_buf_id(s1_103, out a3_110, out a4_111, out a5_112);
		if (a5_112 == 0x00)
		{
			0x00 = (int8) dwArg0128;
			s0Out = dwArgE4;
			s1Out = s1_103;
			a1Out = a1;
			a3Out = a3_110;
			a4Out = a4_111;
			a5Out = a5_112;
			s7Out = s7;
			s9Out = s9;
			s10Out = s10;
			return ra_149;
		}
		else
		{
			word32 a3_400;
			word32 a4_401;
			word32 a5_402;
			net_buf_id(s1_103, out a3_400, out a4_401, out a5_402)->b42015938 = (byte) s3_21;
			Eq_2 a3_137;
			Eq_2 a4_138;
			Eq_2 a5_139;
			struct Eq_196252 * a0_136 = net_buf_id(s1_103, out a3_137, out a4_138, out a5_139);
			0x00 = (int8) dwArg0128;
			ptr32 a1_152;
			ptr32 a3_154;
			ptr32 a4_155;
			ptr32 a5_156;
			ptr32 s0_159;
			Eq_2 s1_160;
			ptr32 s10_175;
			ptr32 s7_177;
			ptr32 s9_178;
			word32 a0_403;
			word32 a2_404;
			word32 s2_405;
			word32 s3_406;
			word32 s4_407;
			word32 s5_408;
			word32 s6_409;
			word32 s8_410;
			word32 s11_411;
			Eq_2 ra_174 = k_sem_give(ra_149, (char *) a0_136 + 0x0C, a3_137, a4_138, a5_139, mstatus, dwArg14, dwArg18, s1, ra, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_159, out s1_160, out a0_403, out a1_152, out a2_404, out a3_154, out a4_155, out a5_156, out s2_405, out s3_406, out s4_407, out s5_408, out s6_409, out s7_177, out s8_410, out s9_178, out s10_175, out s11_411);
			s0Out = s0_159;
			s1Out = s1_160;
			a1Out = a1_152;
			a3Out = a3_154;
			a4Out = a4_155;
			a5Out = a5_156;
			s7Out = s7_177;
			s9Out = s9_178;
			s10Out = s10_175;
			return ra_174;
		}
	}
	else
	{
		word32 a5_367;
		Eq_2 a0_182 = net_buf_pool_get((word32) *((word32) a2 + 6), out a5_367);
		0x00 = (int8) dwArg0128;
		ptr32 a5_197;
		ptr32 a1_199;
		ptr32 a3_201;
		ptr32 a4_202;
		Eq_2 s1_205;
		ptr32 s10_206;
		ptr32 s7_213;
		ptr32 s9_215;
		word32 a0_368;
		word32 a7_370;
		word32 a2_369;
		word32 s2_371;
		word32 s3_372;
		word32 s4_373;
		word32 s5_374;
		word32 s6_375;
		word32 s8_376;
		word32 s11_377;
		word32 t4_378;
		Eq_2 ra_204 = printf(ra, &g_t230BB318, a0_182, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_205, out a0_368, out a1_199, out a2_369, out a3_201, out a4_202, out a5_197, out a7_370, out s2_371, out s3_372, out s4_373, out s5_374, out s6_375, out s7_213, out s8_376, out s9_215, out s10_206, out s11_377, out t4_378);
		s0Out = dwArgE4;
		s1Out = s1_205;
		a1Out = a1_199;
		a3Out = a3_201;
		a4Out = a4_202;
		a5Out = a5_197;
		s7Out = s7_213;
		s9Out = s9_215;
		s10Out = s10_206;
		return ra_204;
	}
}

// 2304E5D8: void hci_cmd_status(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void hci_cmd_status(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	word32 a1_150;
	word32 a4_151;
	word32 a5_152;
	Eq_2 a0_13 = net_buf_simple_pull_mem((word32) a0 + 8, 0x04, out a1_150, out a4_151, out a5_152);
	Eq_2 a3_28;
	Eq_2 a4_29;
	Eq_2 a5_30;
	word32 s0_31;
	word32 s1_153;
	word32 a1_154;
	word32 s7_155;
	word32 s9_156;
	word32 s10_157;
	Eq_2 ra_42 = hci_cmd_done(ra, s1, (word32) *((word32) a0_13 + 3) << 8 | (word32) (*((word32) a0_13 + 2)), (word32) *a0_13, a0, mstatus, dwLoc18, dwLoc0C, dwLoc08, dwArg08, dwArg20, dwArg24, dwArg48, dwArg50, dwArg54, dwArg68, ra, dwArg74, dwArg78, dwArg8C, dwArg9C, dwArgE8, dwArg0108, dwArg0128, dwArg0168, out s0_31, out s1_153, out a1_154, out a3_28, out a4_29, out a5_30, out s7_155, out s9_156, out s10_157);
	if (s0_31 == 0x00)
		return;
	word32 s0_158;
	word32 s1_159;
	word32 a0_160;
	word32 a1_161;
	word32 a2_162;
	word32 a3_163;
	word32 a4_164;
	word32 a5_165;
	word32 s2_166;
	word32 s3_167;
	word32 s4_168;
	word32 s5_169;
	word32 s6_170;
	word32 s7_171;
	word32 s8_172;
	word32 s9_173;
	word32 s10_174;
	word32 s11_175;
	k_sem_give(ra_42, 0x4200DDF8, a3_28, a4_29, a5_30, mstatus, dwArg14, dwArg18, dwArg60, a0, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_158, out s1_159, out a0_160, out a1_161, out a2_162, out a3_163, out a4_164, out a5_165, out s2_166, out s3_167, out s4_168, out s5_169, out s6_170, out s7_171, out s8_172, out s9_173, out s10_174, out s11_175);
}

