pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304E622: void hci_cmd_complete(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_274945) a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void hci_cmd_complete(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_274945 * a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	word32 a1_152;
	word32 a4_153;
	word32 a5_154;
	Eq_2 a0_13 = net_buf_simple_pull_mem((word32) a0 + 8, 0x03, out a1_152, out a4_153, out a5_154);
	Eq_2 a3_30;
	Eq_2 a4_31;
	Eq_2 a5_32;
	word32 s0_33;
	word32 s1_155;
	word32 a1_156;
	word32 s7_157;
	word32 s9_158;
	word32 s10_159;
	Eq_2 ra_44 = hci_cmd_done(ra, s1, (word32) *((word32) a0_13 + 2) << 8 | (word32) (*((word32) a0_13 + 1)), (word32) a3->b0000, a3->t0008, mstatus, dwLoc18, dwLoc0C, dwLoc08, dwArg08, dwArg20, dwArg24, dwArg48, dwArg50, dwArg54, dwArg68, ra, dwArg74, dwArg78, dwArg8C, dwArg9C, dwArgE8, dwArg0108, dwArg0128, dwArg0168, out s0_33, out s1_155, out a1_156, out a3_30, out a4_31, out a5_32, out s7_157, out s9_158, out s10_159);
	if (s0_33 == 0x00)
		return;
	word32 s0_160;
	word32 s1_161;
	word32 a0_162;
	word32 a1_163;
	word32 a2_164;
	word32 a3_165;
	word32 a4_166;
	word32 a5_167;
	word32 s2_168;
	word32 s3_169;
	word32 s4_170;
	word32 s5_171;
	word32 s6_172;
	word32 s7_173;
	word32 s8_174;
	word32 s9_175;
	word32 s10_176;
	word32 s11_177;
	k_sem_give(ra_44, 0x4200DDF8, a3_30, a4_31, a5_32, mstatus, dwArg14, dwArg18, dwArg60, a0, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_160, out s1_161, out a0_162, out a1_163, out a2_164, out a3_165, out a4_166, out a5_167, out s2_168, out s3_169, out s4_170, out s5_171, out s6_172, out s7_173, out s8_174, out s9_175, out s10_176, out s11_177);
}

// 2304E66E: Register word32 id_find(Register Eq_2 a0, Register out ptr32 s1Out, Register out Eq_275068 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s3Out)
// Called from:
//      id_create.isra.25
//      bt_setup_id_addr
word32 id_find(Eq_2 a0, ptr32 & s1Out, union Eq_275068 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s3Out)
{
	Eq_275068 s0_19 = 0x00;
	while (true)
	{
		Eq_275068 s2_31;
		if (s0_19 >= (word32) g_b4200DD67)
			break;
		s2_31 = s0_19;
		word32 a1_94;
		word32 a2_95;
		word32 a5_96;
		if (memcmp(a0, (word32) s0_19.u0 + 0x4200DD67, 0x07, out a1_94, out a2_95, out a3, out a4, out a5_96) == 0x00)
			goto l2304E694;
		s0_19 = (word32) s0_19.u0 + 1 & 0x00FF;
	}
	s2_31.u0 = ~0x01;
l2304E694:
	s1Out = 0x4200DD60;
	a0Out = s2_31;
	a2Out = dwArg48;
	a3Out = a3;
	a4Out = a4;
	s3Out = a0;
	return s1;
}

// 2304E6C0: Register uint32 sys_put_le64(Register Eq_275106 a0, Register Eq_275107 a1, Register Eq_2 a2)
// Called from:
//      init_work
uint32 sys_put_le64(Eq_275106 a0, Eq_275107 a1, Eq_2 a2)
{
	*((word32) a2 + 1) = (byte) ((word32) (word16) a0 >> 8);
	*a2 = (byte) a0;
	*((word32) a2 + 2) = 0x00;
	*((word32) a2 + 3) = (byte) (a0 >> 24);
	*((word32) a2 + 4) = 0x00;
	uint32 a5_11 = (word32) (word16) a1;
	*((word32) a2 + 5) = (byte) (a5_11 >> 8);
	*((word32) a2 + 6) = 0x00;
	*((word32) a2 + 7) = (byte) (a1 >> 24);
	return a5_11 >> 8;
}

// 2304E6F6: Register Eq_2 bt_hci_cmd_create(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out (ptr32 Eq_257903) s0Out, Register out Eq_2 s1Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_257908 a5Out, Register out Eq_257909 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_le_start_encryption
//      bt_conn_disconnect
//      bt_conn_le_conn_update
//      set_le_scan_enable
//      set_random_address
//      hci_id_add
//      addr_res_enable
//      set_advertise_enable
//      set_ad
//      bt_id_add
//      bt_id_del
//      bt_le_set_data_len
//      bt_le_scan_update
//      le_adv_report
//      le_ltk_request
//      le_conn_param_neg_reply
//      le_conn_param_req
//      enh_conn_complete
//      init_work
//      bt_le_adv_start
//      bt_set_tx_pwr
//      bt_dh_key_gen
Eq_2 bt_hci_cmd_create(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg94, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0108, struct Eq_257903 & s0Out, union Eq_2 & s1Out, ptr32 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_257908 & a5Out, union Eq_257909 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a0_29;
	Eq_2 a5_34;
	ptr32 mstatus_37;
	uint32 s2_41;
	ptr32 s5_44;
	ptr32 s6_45;
	word32 s0_135;
	word32 s1_136;
	word32 a1_137;
	word32 a3_138;
	word32 a4_139;
	word32 s3_140;
	word32 s4_141;
	word32 s8_142;
	Eq_2 ra_38 = net_buf_alloc_fixed(ra, ~0x00, a3, a4, a5, a1, mstatus, dwArg94, dwArgA8, dwArgE8, dwArg0108, out s0_135, out s1_136, out a0_29, out a1_137, out a3_138, out a4_139, out a5_34, out s2_41, out s3_140, out s4_141, out s5_44, out s6_45, out s8_142, out mstatus_37);
	net_buf_simple_reserve((word32 *) 0x01, a5_34);
	*((word32) a0_29 + 20) = 0x00;
	word32 a3_143;
	word32 a4_144;
	word32 a5_145;
	net_buf_id(a0_29, out a3_143, out a4_144, out a5_145)->w4201593A = (word16) s2_41;
	word32 a3_146;
	word32 a4_147;
	word32 a5_148;
	net_buf_id(a0_29, out a3_146, out a4_147, out a5_148)->dw42015940 = 0x00;
	ptr32 a3_82;
	Eq_2 a4_83;
	word32 a5_149;
	net_buf_id(a0_29, out a3_82, out a4_83, out a5_149)->dw4201593C = 0x00;
	ptr32 a1_91;
	Eq_257908 a5_92;
	Eq_2 a0_90 = net_buf_simple_add((word32) a0_29 + 8, 0x03, a4_83, out a1_91, out a5_92);
	*a0_90 = (byte) s2_41;
	*((word32) a0_90 + 1) = (byte) (s2_41 >> 0x08);
	*((word32) a0_90 + 2) = (byte) s5_44;
	s0Out = s1;
	s1Out = a0_29;
	a1Out = a1_91;
	a3Out = a3_82;
	a4Out = a4_83;
	a5Out = a5_92;
	s2Out = s2_41 >> 0x08;
	s3Out = 0x0C;
	s4Out = dwArg04;
	s5Out = s5_44;
	s6Out = s6_45;
	s8Out = s4;
	mstatusOut = mstatus_37;
	return ra_38;
}

// 2304E790: Register Eq_2 bt_hci_cmd_send_sync(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_258092) s0Out, Register out (ptr32 Eq_258093) s1Out, Register out (ptr32 Eq_258093) a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_258100 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out (ptr32 Eq_2) s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_le_start_encryption
//      bt_conn_le_conn_update
//      set_le_scan_enable
//      set_random_address
//      hci_id_add
//      addr_res_enable
//      set_advertise_enable
//      set_ad
//      bt_id_add
//      bt_id_del
//      le_adv_report
//      init_work
//      bt_le_adv_start
//      bt_set_tx_pwr
//      bt_pub_key_gen
//      bt_dh_key_gen
Eq_2 bt_hci_cmd_send_sync(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, struct Eq_258092 & s0Out, struct Eq_258093 & s1Out, struct Eq_258093 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_258100 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a1_187;
	Eq_2 ra_193;
	Eq_258100 s2_197;
	ptr32 s3_198;
	union Eq_2 * s5_200;
	ptr32 s6_201;
	struct Eq_258093 * s1_245;
	Eq_2 s0_23 = a1;
	ra_193 = ra;
	if (a1 == 0x00)
	{
		word32 s8_517;
		word32 s4_516;
		word32 s1_515;
		word32 s0_514;
		ra_193 = bt_hci_cmd_create(ra, a1, a3, a4, a5, mstatus, ra, dwArg78, dwArgB8, dwArgD8, out s0_514, out s1_515, out a1_187, out a3, out a4, out a5, out s2_197, out s3_198, out s4_516, out s5_200, out s6_201, out s8_517, out mstatus);
		s0_23 = a0;
		s1_245 = (struct Eq_258093 *) -55;
		if (a0 == 0x00)
			goto l2304E872;
	}
	word32 s3_75;
	word32 a1_520;
	word32 a0_519;
	word32 s1_518;
	word32 a3_521;
	word32 a4_522;
	word32 a5_523;
	word32 s2_524;
	word32 s4_525;
	word32 s5_526;
	word32 s6_527;
	word32 s7_528;
	word32 s8_529;
	Eq_2 ra_81 = k_sem_init(ra_193, s0_23, fp + -44, 0x00, 0x01, a3, a4, a5, mstatus, dwLoc18, dwArg30, dwArg34, s5, dwArg7C, dwArgB8, dwArgF8, out s1_518, out a0_519, out a1_520, out a3_521, out a4_522, out a5_523, out s2_524, out s3_75, out s4_525, out s5_526, out s6_527, out s7_528, out s8_529);
	word32 a3_530;
	word32 a4_531;
	word32 a5_532;
	net_buf_id(s0_23, out a3_530, out a4_531, out a5_532)->dw42015940 = s3_75;
	Eq_2 a4_104;
	word32 a3_533;
	word32 a5_534;
	net_buf_id(s0_23, out a3_533, out a4_104, out a5_534)->b42015938 = ~0x00;
	Eq_2 a3_118;
	Eq_2 a4_119;
	Eq_2 a5_120;
	word32 a0_535;
	word32 a1_536;
	word32 s2_537;
	word32 s3_538;
	word32 s4_539;
	word32 s5_540;
	word32 s6_541;
	word32 s8_542;
	net_buf_put(ra_81, s0_23, 0x4200DE08, s0_23, a4_104, net_buf_ref(s0_23), mstatus, dwArgB8, dwArgF8, dwArg0138, out a0_535, out a1_536, out a3_118, out a4_119, out a5_120, out s2_537, out s3_538, out s4_539, out s5_540, out s6_541, out s8_542);
	Eq_2 a2_141;
	Eq_2 a3_142;
	Eq_2 a4_143;
	Eq_2 a5_144;
	union Eq_2 * s3_150;
	word32 s0_543;
	word32 s1_544;
	word32 a0_545;
	word32 a1_546;
	word32 s2_547;
	word32 s4_548;
	word32 s5_549;
	word32 s6_550;
	word32 s7_551;
	word32 s8_552;
	word32 s9_553;
	word32 s10_554;
	word32 s11_555;
	Eq_2 ra_162 = k_sem_give(ra_81, 0x42026644, a3_118, a4_119, a5_120, mstatus, s0, dwLoc18, dwArg30, dwArg34, s5, ra, dwArg7C, dwArgD8, dwArg0118, dwArg0158, out s0_543, out s1_544, out a0_545, out a1_546, out a2_141, out a3_142, out a4_143, out a5_144, out s2_547, out s3_150, out s4_548, out s5_549, out s6_550, out s7_551, out s8_552, out s9_553, out s10_554, out s11_555);
	Eq_2 a3_173;
	Eq_2 a4_174;
	int32 * s3_180;
	word32 s1_556;
	word32 a0_557;
	word32 a1_558;
	word32 a5_559;
	word32 s2_560;
	word32 s4_561;
	word32 s8_562;
	Eq_2 s0_177 = k_sem_take(s3_150, 0x02000710, a2_141, a3_142, a4_143, a5_144, mstatus, s0, ra, dwArgD8, dwArg0118, out s1_556, out a0_557, out a1_558, out a3_173, out a4_174, out a5_559, out s2_560, out s3_180, out s4_561, out s8_562);
	Eq_2 s1_194;
	word32 a3_563;
	word32 a4_564;
	ra_193 = k_sem_delete(ra_162, s3_180, a3_173, a4_174, mstatus, dwLoc18, dwArg30, dwArg34, s5, dwArg7C, dwArg0118, dwArg0158, out s1_194, out a1_187, out a3_563, out a4_564, out s2_197, out s3_198, out s5_200, out s6_201, out s7, out s9, out s10, out s11);
	word32 a5_565;
	a5 = CONVERT(Mem109[net_buf_id(s0_177, out a3, out a4, out a5_565) + s2_197 + s1_194:byte], byte, word32);
	if (a5 != 0x00)
	{
		Eq_2 a4_252 = 0x09;
		Eq_2 a3_248;
		word32 a4_566;
		word32 a5_567;
		word32 a5_254 = CONVERT(Mem109[s1_194 + (net_buf_id(s0_177, out a3_248, out a4_566, out a5_567) + s2_197):byte], byte, word32);
		Eq_2 s1_255 = -61;
		if (a5_254 != 0x09)
		{
			a4_252.u0 = 0x00FF;
			s1_255.u0 = ~0x04;
			if (a5_254 == 0x00FF)
			{
				word32 s1_568;
				word32 a0_569;
				word32 a2_570;
				word32 a3_571;
				word32 a5_572;
				word32 a7_573;
				word32 s2_574;
				word32 s3_575;
				word32 s4_576;
				word32 s5_577;
				word32 s6_578;
				word32 s8_579;
				word32 t4_580;
				ra_193 = printf(ra_193, &g_t230BAFF4, a3_248, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_568, out a0_569, out a1_187, out a2_570, out a3_571, out a4_252, out a5_572, out a7_573, out s2_574, out s3_575, out s4_576, out s5_577, out s6_578, out s7, out s8_579, out s9, out s10, out s11, out t4_580);
				word32 a5_581;
				user_vAssertCalled(a4_252, mstatus, out a5_581);
				s1_255.u0 = -79;
			}
		}
		word32 s0_582;
		word32 a0_583;
		word32 a2_584;
		word32 s4_585;
		word32 s8_586;
		ra_193 = net_buf_unref(ra_193, s1_255, s0_177, a1_187, a4_252, mstatus, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_582, out s1_245, out a0_583, out a1_187, out a2_584, out a3, out a4, out a5, out s2_197, out s3_198, out s4_585, out s5_200, out s6_201, out s8_586, out mstatus);
	}
	else
	{
		if (s5_200 != null)
			*s5_200 = (union Eq_2 *) s0_177;
		else
		{
			word32 s0_587;
			word32 s1_588;
			word32 a0_589;
			word32 a2_590;
			word32 s4_591;
			word32 s8_592;
			ra_193 = net_buf_unref(ra_193, s1_194, s0_177, a1_187, a4, mstatus, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_587, out s1_588, out a0_589, out a1_187, out a2_590, out a3, out a4, out a5, out s2_197, out s3_198, out s4_591, out s5_200, out s6_201, out s8_592, out mstatus);
		}
		s1_245 = null;
	}
l2304E872:
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_245;
	a0Out = s1_245;
	a1Out = a1_187;
	a2Out = dwArg0100;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2_197;
	s3Out = s3_198;
	s4Out = dwArg78;
	s5Out = s5_200;
	s6Out = s6_201;
	s7Out = s7;
	s8Out = s5;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra_193;
}

// 2304E89A: Register Eq_2 set_le_scan_enable(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_275625) s0Out, Register out (ptr32 Eq_275626) s1Out, Register out Eq_275627 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_id_add
//      bt_id_del
//      bt_le_scan_update
//      le_adv_report
//      bt_le_scan_start
Eq_2 set_le_scan_enable(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, struct Eq_275625 & s0Out, struct Eq_275626 & s1Out, union Eq_275627 & a0Out, ptr32 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_275627 a0_198;
	ui32 s0_32;
	ptr32 s8_115;
	ptr32 s6_113;
	Eq_2 s5_112;
	ptr32 s4_111;
	ptr32 s3_110;
	ptr32 s2_109;
	struct Eq_275626 * s1_106;
	ptr32 mstatus_103;
	ptr32 a5_100;
	ptr32 a3_200;
	Eq_2 a4_201;
	ptr32 a1_199;
	Eq_2 ra_104 = bt_hci_cmd_create(ra, 0x02, a3, a4, a5, mstatus, ra, dwArg78, dwArgB8, dwArgD8, out s0_32, out s1_106, out a1_199, out a3_200, out a4_201, out a5_100, out s2_109, out s3_110, out s4_111, out s5_112, out s6_113, out s8_115, out mstatus_103);
	if (true)
	{
		word32 a1_244;
		word32 a5_245;
		Eq_2 a0_51 = net_buf_simple_add(0x02000014, 0x02, a4_201, out a1_244, out a5_245);
		if (s0_32 == 0x01)
		{
			word32 a2_246;
			*((word32) a0_51 + 1) = (byte) atomic_test_bit(0x4200DDCC, 0x0D, out a2_246);
		}
		else
			*((word32) a0_51 + 1) = 0x00;
		*a0_51 = (byte) s0_32;
		Eq_2 a3_78;
		word32 a4_247;
		word32 a5_248;
		word32 s0_249;
		word32 a2_250;
		word32 s10_251;
		ra_104 = bt_hci_cmd_send_sync(ra_104, s0_32 & 0x01, 0x0200000C, 0x0200000C, a3_78, fp + -44, &net_buf_id(0x0200000C, out a3_78, out a4_247, out a5_248)->b42015938, s5_112, mstatus_103, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, s3, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_249, out s1_106, out a0_198, out a1_199, out a2_250, out a3_200, out a4_201, out a5_100, out s2_109, out s3_110, out s4_111, out s5_112, out s6_113, out s7, out s8_115, out s9, out s10_251, out s11, out mstatus_103);
	}
	else
		a0_198.u0 = -55;
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_106;
	a0Out = a0_198;
	a1Out = a1_199;
	a3Out = a3_200;
	a4Out = a4_201;
	a5Out = a5_100;
	s2Out = s2_109;
	s3Out = s3_110;
	s4Out = s4_111;
	s5Out = s5_112;
	s6Out = s6_113;
	s7Out = s7;
	s8Out = s8_115;
	s9Out = s9;
	s11Out = s11;
	mstatusOut = mstatus_103;
	return ra_104;
}

// 2304E92C: Register Eq_2 set_random_address(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out (ptr32 Eq_275779) s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_275785) s2Out, Register out Eq_2 s3Out, Register out (ptr32 Eq_275787) s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out Eq_275793 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      le_set_private_addr.isra.19
//      bt_le_scan_update
//      le_adv_report
//      bt_le_adv_start
Eq_2 set_random_address(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, struct Eq_275779 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, struct Eq_275785 & s2Out, union Eq_2 & s3Out, struct Eq_275787 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, union Eq_275793 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	word32 a2_231;
	Eq_2 a5_128;
	Eq_2 a4_115;
	Eq_2 a3_120;
	ptr32 a1_118;
	Eq_2 a0_25 = memcmp(a0, 0x4200DD6A, 0x06, out a1_118, out a2_231, out a3_120, out a4_115, out a5_128);
	struct Eq_275779 * s1_189 = &g_b4200DD60;
	Eq_2 s3_10 = 0x4200DD6A;
	Eq_2 s0_111 = a0_25;
	if (a0_25 != 0x00)
	{
		Eq_2 s4_49;
		word32 s0_232;
		word32 s2_233;
		word32 s8_234;
		ra = bt_hci_cmd_create(ra, 0x06, a3_120, a4_115, a5_128, mstatus, dwArg74, dwArg88, dwArgC8, dwArgE8, out s0_232, out s1_189, out a1_118, out a3_120, out a4_115, out a5_128, out s2_233, out s3_10, out s4_49, out s5, out s6, out s8_234, out mstatus);
		s2 = (struct Eq_275785 *) 0x02000005;
		s0_111.u0 = -55;
		if (true)
		{
			Eq_2 a3_68;
			Eq_2 a4_69;
			Eq_2 a5_70;
			word32 a1_235;
			word32 a2_236;
			net_buf_simple_add_mem(0x0200000D, s4_49, 0x06, a4_115, out a1_235, out a2_236, out a3_68, out a4_69, out a5_70);
			Eq_2 a0_82;
			Eq_2 s4_98;
			word32 s0_237;
			word32 a2_238;
			word32 s8_239;
			ra = bt_hci_cmd_send_sync(ra, -55, (word32) s5 + 5, 0x02000005, a3_68, a4_69, a5_70, s5, mstatus, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_237, out s1_189, out a0_82, out a1_118, out a2_238, out a3_120, out a4_115, out a5_128, out s2, out s3_10, out s4_98, out s5, out s6, out s7, out s8_239, out s9, out s10, out s11, out mstatus);
			s0_111 = a0_82;
			if (a0_82 == 0x00)
			{
				word32 a2_240;
				word32 a5_241;
				word32 a6_242;
				word32 a7_243;
				memcpy(s3_10, s4_98, 0x06, out a1_118, out a2_240, out a3_120, out a4_115, out a5_241, out a6_242, out a7_243);
				s1_189->b0009 = 0x01;
				a5_128.u0 = 0x01;
			}
		}
	}
	s0Out = s1;
	s1Out = s1_189;
	a0Out = s0_111;
	a1Out = a1_118;
	a3Out = a3_120;
	a4Out = a4_115;
	a5Out = a5_128;
	s2Out = s2;
	s3Out = s3_10;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s4;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

