pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304E9A8: Register Eq_2 le_set_private_addr.isra.19(Register Eq_2 ra, Register (ptr32 Eq_64398) a2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_disconnect
//      bt_le_scan_update
Eq_2 le_set_private_addr.isra.19(Eq_2 ra, struct Eq_64398 * a2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 a0_38;
	ptr32 a1_10;
	ptr32 a3_12;
	ptr32 a4_13;
	ptr32 a5_14;
	ptr32 s4_108;
	ptr32 s8_115;
	Eq_2 s1_15 = bt_rand(fp + ~0x17, 0x06, a2, out a0_38, out a1_10, out a3_12, out a4_13, out a5_14, out s4_108, out s8_115);
	if (a0_38 == 0x00)
	{
		word32 s0_145;
		word32 s10_146;
		ra = set_random_address(ra, s1_15, fp + ~0x17, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg14, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg54, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_145, out s1_15, out a0_38, out a1_10, out a3_12, out a4_13, out a5_14, out s2, out s3, out s4_108, out s5, out s6, out s7, out s8_115, out s9, out s10_146, out s11, out mstatus);
	}
	s1Out = s1_15;
	a0Out = a0_38;
	a1Out = a1_10;
	a3Out = a3_12;
	a4Out = a4_13;
	a5Out = a5_14;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4_108;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8_115;
	s9Out = s9;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

// 2304E9CE: Register Eq_2 hci_id_add(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out Eq_276042 a0Out, Register out ptr32 a3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      keys_add_id
//      bt_id_add
Eq_2 hci_id_add(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & s0Out, union Eq_276042 & a0Out, ptr32 & a3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	ptr32 a3_29;
	Eq_2 a4_30;
	ptr32 mstatus_34;
	word32 s1_37;
	Eq_2 s3_39;
	Eq_2 s4_40;
	Eq_2 s5_41;
	word32 s0_218;
	word32 a1_219;
	word32 a5_220;
	word32 s2_221;
	word32 s6_222;
	word32 s8_223;
	Eq_2 ra_35 = bt_hci_cmd_create(ra, 39, a3, a4, a5, mstatus, dwArg74, dwArg88, dwArgC8, dwArgE8, out s0_218, out s1_37, out a1_219, out a3_29, out a4_30, out a5_220, out s2_221, out s3_39, out s4_40, out s5_41, out s6_222, out s8_223, out mstatus_34);
	if (false)
	{
		s0Out = s1;
		a0Out.u0 = -55;
		a3Out = a3_29;
		s4Out = dwArg04;
		mstatusOut = mstatus_34;
		return ra_35;
	}
	else
	{
		word32 a1_224;
		word32 a5_225;
		Eq_2 a0_62 = net_buf_simple_add(0x0200002F, 39, a4_30, out a1_224, out a5_225);
		word32 a4_226;
		word32 a5_227;
		bt_addr_le_copy(a0_62, s4_40, out a4_226, out a5_227);
		word32 a1_228;
		word32 a2_229;
		word32 a3_230;
		word32 a4_231;
		word32 a5_232;
		word32 a6_233;
		word32 a7_234;
		memcpy((word32) a0_62 + 7, s3_39, 0x10, out a1_228, out a2_229, out a3_230, out a4_231, out a5_232, out a6_233, out a7_234);
		Eq_2 a3_102;
		Eq_2 a4_103;
		Eq_2 a5_104;
		word32 t1_235;
		word32 a0_236;
		word32 a1_237;
		word32 a2_238;
		Eq_2 ra_105 = memset(ra_35, (word32) a0_62 + 23, 0x00, 0x10, out t1_235, out a0_236, out a1_237, out a2_238, out a3_102, out a4_103, out a5_104);
		Eq_276042 a0_118;
		ptr32 a3_121;
		ptr32 mstatus_126;
		Eq_2 s0_128;
		ptr32 s4_134;
		word32 s1_239;
		word32 a1_240;
		word32 a2_241;
		word32 a4_242;
		word32 a5_243;
		word32 s2_244;
		word32 s3_245;
		word32 s5_246;
		word32 s6_247;
		word32 s7_248;
		word32 s8_249;
		word32 s9_250;
		word32 s10_251;
		word32 s11_252;
		Eq_2 ra_127 = bt_hci_cmd_send_sync(ra_105, s1, s1_37 + 39, 0x02000027, a3_102, a4_103, a5_104, s5_41, mstatus_34, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg54, s1, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_128, out s1_239, out a0_118, out a1_240, out a2_241, out a3_121, out a4_242, out a5_243, out s2_244, out s3_245, out s4_134, out s5_246, out s6_247, out s7_248, out s8_249, out s9_250, out s10_251, out s11_252, out mstatus_126);
		s0Out = s0_128;
		a0Out = a0_118;
		a3Out = a3_121;
		s4Out = s4_134;
		mstatusOut = mstatus_126;
		return ra_127;
	}
}

// 2304EA4A: void keys_add_id(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void keys_add_id(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	word32 s0_65;
	word32 a0_66;
	word32 a3_67;
	word32 s4_68;
	word32 mstatus_69;
	hci_id_add(ra, s1, a3, a4, a5, mstatus, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg54, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_65, out a0_66, out a3_67, out s4_68, out mstatus_69);
}

// 2304EA54: Register Eq_2 addr_res_enable(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_276255 a0Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_id_add
//      bt_id_del
Eq_2 addr_res_enable(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_276255 & a0Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 a3_23;
	ptr32 a4_24;
	Eq_2 a5_25;
	ptr32 mstatus_28;
	ptr32 s1_31;
	Eq_2 s2_32;
	ptr32 s3_33;
	ptr32 s4_34;
	Eq_2 s5_35;
	word32 s0_169;
	word32 a1_170;
	word32 s6_171;
	word32 s8_172;
	Eq_2 ra_29 = bt_hci_cmd_create(ra, 0x01, a3, a4, a5, mstatus, dwArg84, dwArg98, dwArgD8, dwArgF8, out s0_169, out s1_31, out a1_170, out a3_23, out a4_24, out a5_25, out s2_32, out s3_33, out s4_34, out s5_35, out s6_171, out s8_172, out mstatus_28);
	if (false)
	{
		0x00 = (int8) dwArg38;
		s0Out = s0;
		s1Out = s1_31;
		a0Out.u0 = -55;
		a3Out = a3_23;
		a4Out = a4_24;
		a5Out = a5_25;
		s2Out = s2_32;
		s3Out = s3_33;
		s4Out = s4_34;
		s5Out = s5_35;
		mstatusOut = mstatus_28;
		return ra_29;
	}
	else
	{
		Eq_2 a5_55;
		Eq_2 a4_54 = net_buf_simple_add_u8(0x02000035, s2_32, a5_25, out a5_55);
		0x00 = (int8) dwArg38;
		Eq_276255 a0_63;
		Eq_2 a3_66;
		ptr32 a4_67;
		Eq_2 a5_68;
		ptr32 mstatus_71;
		Eq_2 s0_73;
		ptr32 s1_74;
		Eq_2 s2_77;
		ptr32 s3_78;
		ptr32 s4_79;
		Eq_2 s5_80;
		word32 a1_173;
		word32 a2_174;
		word32 s6_175;
		word32 s7_176;
		word32 s8_177;
		word32 s9_178;
		word32 s10_179;
		word32 s11_180;
		Eq_2 ra_72 = bt_hci_cmd_send_sync(ra_29, s0, s1_31 + 45, 0x0200002D, a3_23, a4_54, a5_55, s5_35, mstatus_28, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg54, dwArg68, ra, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_73, out s1_74, out a0_63, out a1_173, out a2_174, out a3_66, out a4_67, out a5_68, out s2_77, out s3_78, out s4_79, out s5_80, out s6_175, out s7_176, out s8_177, out s9_178, out s10_179, out s11_180, out mstatus_71);
		s0Out = s0_73;
		s1Out = s1_74;
		a0Out = a0_63;
		a3Out = a3_66;
		a4Out = a4_67;
		a5Out = a5_68;
		s2Out = s2_77;
		s3Out = s3_78;
		s4Out = s4_79;
		s5Out = s5_80;
		mstatusOut = mstatus_71;
		return ra_72;
	}
}

// 2304EA9E: Register Eq_2 set_advertise_enable(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_276377) s0Out, Register out (ptr32 Eq_276378) s1Out, Register out Eq_276379 a0Out, Register out ptr32 a3Out, Register out Eq_276381 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_276383) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_disconnect
//      hci_disconn_complete
//      bt_id_add
//      bt_id_del
//      enh_conn_complete
//      bt_set_name
//      bt_le_adv_start
Eq_2 set_advertise_enable(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, struct Eq_276377 & s0Out, struct Eq_276378 & s1Out, union Eq_276379 & a0Out, ptr32 & a3Out, union Eq_276381 & a4Out, union Eq_2 & a5Out, struct Eq_276383 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	Eq_276379 a0_179;
	word32 a1_222;
	word32 s4_223;
	word32 s8_224;
	ptr32 s6_100;
	Eq_2 s5_197;
	ptr32 s3_196;
	struct Eq_276383 * s2_195;
	struct Eq_276378 * s1_190;
	struct Eq_276377 * s0_189;
	ptr32 mstatus_187;
	Eq_2 a5_184;
	Eq_276381 a4_183;
	ptr32 a3_182;
	Eq_2 ra_188 = bt_hci_cmd_create(ra, 0x01, a3, a4, a5, mstatus, dwArg74, dwArg88, dwArgC8, dwArgE8, out s0_189, out s1_190, out a1_222, out a3_182, out a4_183, out a5_184, out s2_195, out s3_196, out s4_223, out s5_197, out s6_100, out s8_224, out mstatus_187);
	if (true)
	{
		Eq_2 a1_45 = 0x01;
		if (s1_190 == null)
			a1_45.u0 = 0x00;
		word32 a5_225;
		net_buf_simple_add_u8(0x02000012, a1_45, a5_184, out a5_225);
		Eq_2 a3_65;
		word32 a4_226;
		word32 a5_227;
		word32 a1_228;
		word32 a2_229;
		word32 s4_230;
		word32 s8_231;
		word32 s9_232;
		word32 s10_233;
		word32 s11_234;
		ra_188 = bt_hci_cmd_send_sync(ra_188, 0x0200000A, 0x0200000A, 0x0200000A, a3_65, fp + ~0x1B, &net_buf_id(0x0200000A, out a3_65, out a4_226, out a5_227)->b42015938, s5_197, mstatus_187, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_189, out s1_190, out a0_179, out a1_228, out a2_229, out a3_182, out a4_183, out a5_184, out s2_195, out s3_196, out s4_230, out s5_197, out s6_100, out s7, out s8_231, out s9_232, out s10_233, out s11_234, out mstatus_187);
	}
	else
		a0_179.u0 = -55;
	s0Out = s0_189;
	s1Out = s1_190;
	a0Out = a0_179;
	a3Out = a3_182;
	a4Out = a4_183;
	a5Out = a5_184;
	s2Out = s2_195;
	s3Out = s3_196;
	s4Out = dwArg04;
	s5Out = s5_197;
	s6Out = s6_100;
	s7Out = s7;
	mstatusOut = mstatus_187;
	return ra_188;
}

// 2304EB0A: void hci_disconn_complete(Register Eq_2 ra, Register (ptr32 Eq_276481) s1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
void hci_disconn_complete(Eq_2 ra, struct Eq_276481 * s1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	if ((word32) s1->b0000 != 0x00)
		return;
	Eq_2 a3_104;
	Eq_2 a4_105;
	Eq_2 a5_100;
	Eq_2 ra_107;
	Eq_2 s1_108;
	Eq_2 a0_20;
	Eq_2 s1_24;
	Eq_2 a4_30;
	Eq_2 a3_32;
	word32 s2_340;
	word32 s3_341;
	word32 s4_342;
	bt_conn_lookup_handle((word32) s1->b0002 << 8 | (word32) s1->b0001, a3, mstatus, out s1_24, out a0_20, out a3_32, out a4_30, out s2_340, out s3_341, out s4_342);
	if (a0_20 == 0x00)
	{
		word32 a0_352;
		word32 a1_353;
		word32 a2_354;
		word32 a7_355;
		word32 s2_356;
		word32 s3_357;
		word32 s4_358;
		word32 s5_359;
		word32 s6_360;
		word32 s7_361;
		word32 s8_362;
		word32 s9_363;
		word32 s10_364;
		word32 s11_365;
		word32 t4_366;
		ra_107 = printf(ra, &g_t230BB3B4, a3_32, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_108, out a0_352, out a1_353, out a2_354, out a3_104, out a4_105, out a5_100, out a7_355, out s2_356, out s3_357, out s4_358, out s5_359, out s6_360, out s7_361, out s8_362, out s9_363, out s10_364, out s11_365, out t4_366);
	}
	else
	{
		*((word32) a0_20 + 0x0C) = (byte) (word32) *((word32) s1_24 + 3);
		Eq_2 a3_42;
		Eq_2 s0_64;
		word32 s1_343;
		word32 a4_344;
		word32 a5_345;
		word32 s2_346;
		word32 s3_347;
		word32 s4_348;
		word32 s5_349;
		word32 s6_350;
		word32 s8_351;
		ra_107 = bt_conn_set_state(ra, s1_24, a0_20, 0x00, a3_32, a4_30, mstatus, dwLoc18, dwLoc10, dwLoc0C, dwArg04, dwArg08, dwArg18, dwArg78, dwArg88, dwArg9C, dwArgB8, dwArgF8, out s0_64, out s1_343, out a3_42, out a4_344, out a5_345, out s2_346, out s3_347, out s4_348, out s5_349, out s6_350, out s8_351, out mstatus);
		Eq_2 a4_68 = (word32) *((word32) s0_64 + 2);
		*s0_64 = 0x00;
		if (a4_68 != 0x01)
		{
			word32 a3_382;
			word32 a4_383;
			word32 a5_384;
			bt_conn_unref(s0_64, a3_42, a4_68, mstatus, out a3_382, out a4_383, out a5_384);
			return;
		}
		Eq_2 a3_74;
		Eq_2 a4_75;
		word32 a5_381;
		s1_108 = bt_conn_unref(s0_64, a3_42, a4_68, mstatus, out a3_74, out a4_75, out a5_381);
		a3_104 = atomic_clear(s1_108, a3_74, a4_75, mstatus, out a4_105, out a5_100);
	}
	word32 a2_385;
	if (atomic_test_bit(0x4200DDCC, 0x09, out a2_385) == 0x00)
		return;
	word32 a2_367;
	if (atomic_test_bit(0x4200DDCC, 0x06, out a2_367) != 0x00)
		return;
	word32 s0_368;
	word32 s1_369;
	word32 a0_370;
	word32 a3_371;
	word32 a4_372;
	word32 a5_373;
	word32 s2_374;
	word32 s3_375;
	word32 s4_376;
	word32 s5_377;
	word32 s6_378;
	word32 s7_379;
	word32 mstatus_380;
	set_advertise_enable(ra_107, s1_108, a3_104, a4_105, a5_100, mstatus, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg54, dwArg58, dwArg5C, dwArg74, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_368, out s1_369, out a0_370, out a3_371, out a4_372, out a5_373, out s2_374, out s3_375, out s4_376, out s5_377, out s6_378, out s7_379, out mstatus_380);
}

