pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304EBAC: Register Eq_2 set_ad(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_276739 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_276742 a5Out, Register out Eq_276743 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      le_adv_update
//      bt_set_name
Eq_2 set_ad(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_276739 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_276742 & a5Out, union Eq_276743 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_276739 a0_213;
	word32 s8_545;
	word32 a1_543;
	word32 s4_544;
	union Eq_2 * s0_227;
	ptr32 s6_207;
	Eq_2 s5_138;
	Eq_2 s3_204;
	Eq_276743 s2_203;
	ptr32 s1_200;
	ptr32 mstatus_172;
	Eq_276742 a5_192;
	Eq_2 a4_197;
	ptr32 a3_196;
	Eq_2 ra_199 = bt_hci_cmd_create(ra, 32, a3, a4, a5, mstatus, ra, dwArg78, dwArgB8, dwArgD8, out s0_227, out s1_200, out a1_543, out a3_196, out a4_197, out a5_192, out s2_203, out s3_204, out s4_544, out s5_138, out s6_207, out s8_545, out mstatus_172);
	if (a0 == 0x00)
	{
		a0_213.u0 = -55;
l2304EC60:
		0x00 = (int8) dwArg0128;
		s0Out = s4;
		s1Out = s1_200;
		a0Out = a0_213;
		a3Out = a3_196;
		a4Out = a4_197;
		a5Out = a5_192;
		s2Out = s2_203;
		s3Out = s3_204;
		s4Out = dwArg78;
		s6Out = s6_207;
		s7Out = s7;
		s8Out = s5;
		mstatusOut = mstatus_172;
		return ra_199;
	}
	else
	{
		word32 a1_546;
		word32 a5_547;
		Eq_2 a0_65 = net_buf_simple_add((word32) a0 + 8, 32, a4_197, out a1_546, out a5_547);
		union Eq_2 * s4_72 = (char *) s0_227 + (s2_203 << 3);
		word32 t1_548;
		word32 a0_549;
		word32 a2_550;
		Eq_2 a1_125;
		Eq_2 a5_135;
		Eq_2 a4_122;
		Eq_2 a3_127;
		Eq_2 ra_79 = memset(ra_199, a0_65, 0x00, 32, out t1_548, out a0_549, out a1_125, out a2_550, out a3_127, out a4_122, out a5_135);
		while (s0_227 != s4_72)
		{
			s5_138 = *s0_227;
			Eq_2 s7_137 = 0x00;
			while (true)
			{
				word32 s0_91 = *((word32) a5_135 + 4);
				if (s7_137 >= a5_135)
					break;
				Eq_2 a2_100 = (word32) *((word32) s5_138 + 1);
				int32 a5_96 = (word32) *a0_65;
				Eq_2 a4_102 = (word32) *s5_138;
				if ((word32) a2_100 + a5_96 > 0x1D)
				{
					a2_100 = 0x1D - a5_96;
					if (a4_102 != 0x09 || a2_100 == 0x00)
					{
						Eq_2 a3_167;
						word32 t4_578;
						word32 s9_575;
						word32 s10_576;
						word32 s11_577;
						word32 s4_572;
						word32 s5_573;
						word32 s8_574;
						word32 a1_569;
						word32 a2_570;
						word32 a7_571;
						word32 s6_566;
						word32 s8_567;
						word32 a0_568;
						word32 s3_563;
						word32 s4_564;
						word32 s5_565;
						word32 a4_560;
						word32 a5_561;
						word32 s2_562;
						word32 a0_557;
						word32 a1_558;
						word32 a2_559;
						word32 s0_555;
						word32 s1_556;
						ra_199 = printf(net_buf_unref(ra_79, a0_65, a0, a1_125, a4_102, mstatus_172, dwLoc30, s8, s6, dwLoc08, dwArg48, s7, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_555, out s1_556, out a0_557, out a1_558, out a2_559, out a3_167, out a4_560, out a5_561, out s2_562, out s3_563, out s4_564, out s5_565, out s6_566, out s8_567, out mstatus_172), &g_t230BB5C8, a3_167, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_200, out a0_568, out a1_569, out a2_570, out a3_196, out a4_197, out a5_192, out a7_571, out s2_203, out s3_204, out s4_572, out s5_573, out s6_207, out s7, out s8_574, out s9_575, out s10_576, out s11_577, out t4_578);
						a0_213.u0 = ~0x15;
						goto l2304EC60;
					}
					a4_102.u0 = 0x08;
				}
				ui32 s2_104 = a2_100 & 0x00FF;
				(word32) a0_65 + a5_96 + 1 = (ptr32) (byte) (s2_104 + 1);
				ui32 a0_112 = a5_96 + 2 & 0x00FF;
				*a0_65 = (byte) a0_112;
				(word32) a0_65 + (a5_96 + 0x01 & 0x00FF) + 1 = (ui32) (byte) a4_102;
				word32 a7_554;
				word32 a2_551;
				word32 a5_552;
				word32 a6_553;
				memcpy((word32) a0_65 + (a0_112 + 0x01), *((word32) s5_138 + 4), a2_100, out a1_125, out a2_551, out a3_127, out a4_122, out a5_552, out a6_553, out a7_554);
				a5_135 = (word32) *a0_65;
				*a0_65 = (byte) ((word32) a5_135 + s2_104);
				s7_137 = (word32) s7_137 + 1;
				s5_138 = (word32) s5_138 + 8;
			}
			s0_227 = s0_91 + 0x08;
		}
		0x00 = (int8) dwArg0128;
		Eq_276739 a0_251;
		ptr32 a3_254;
		Eq_2 a4_255;
		Eq_276742 a5_256;
		ptr32 mstatus_259;
		Eq_2 s0_261;
		ptr32 s1_262;
		Eq_276743 s2_265;
		Eq_2 s3_266;
		Eq_2 s4_267;
		ptr32 s6_269;
		Eq_2 s7_270;
		ptr32 s8_271;
		word32 s11_584;
		word32 s5_581;
		word32 s9_582;
		word32 s10_583;
		word32 a1_579;
		word32 a2_580;
		Eq_2 ra_260 = bt_hci_cmd_send_sync(ra_79, s4, s3_204, a0, a3_127, a4_122, a5_135, s5_138, mstatus_172, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, s7, dwArg68, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_261, out s1_262, out a0_251, out a1_579, out a2_580, out a3_254, out a4_255, out a5_256, out s2_265, out s3_266, out s4_267, out s5_581, out s6_269, out s7_270, out s8_271, out s9_582, out s10_583, out s11_584, out mstatus_259);
		s0Out = s0_261;
		s1Out = s1_262;
		a0Out = a0_251;
		a3Out = a3_254;
		a4Out = a4_255;
		a5Out = a5_256;
		s2Out = s2_265;
		s3Out = s3_266;
		s4Out = s4_267;
		s6Out = s6_269;
		s7Out = s7_270;
		s8Out = s8_271;
		mstatusOut = mstatus_259;
		return ra_260;
	}
}

// 2304ECC6: Register Eq_2 le_adv_update(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack ptr32 dwArg01B4, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_le_adv_start
Eq_2 le_adv_update(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, ptr32 dwArg01B4, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	ptr32 a0_35;
	Eq_582986 s1_46[];
	word32 s2_47;
	Eq_2 s4_49;
	Eq_2 s6_51;
	Eq_2 s8_52;
	Eq_2 s7_62;
	word32 s3_407;
	word32 s0_406;
	ptr32 mstatus_152;
	Eq_2 a4_140;
	Eq_2 a5_104;
	Eq_2 a3_142;
	Eq_2 ra_153 = set_ad(ra, 0x02000008, a3, a4, a5, s4, s6, s7, s8, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_406, out s1_46, out a0_35, out a3_142, out a4_140, out a5_104, out s2_47, out s3_407, out s4_49, out s6_51, out s7_62, out s8_52, out mstatus_152);
	ptr32 s0_105 = a0_35;
	if (a0_35 != 0x00)
	{
l2304ED40:
		a0Out = s0_105;
		a3Out = a3_142;
		a4Out = a4_140;
		a5Out = a5_104;
		mstatusOut = mstatus_152;
		return ra_153;
	}
	else
	{
		if (a5_104 != 0x00)
		{
			if (s1_46 != null)
			{
				Eq_2 a2_69 = 0x00;
				a4_140.u0 = 0x01;
				while (a2_69 != a3_142)
				{
					a5_104 = (word32) s1_46[a2_69].b0000 + ~0x07 & 0x00FF;
					if (a5_104 <= 0x01)
					{
						s0_105 = ~0x15;
						goto l2304ED40;
					}
					a2_69 = (word32) a2_69 + 1;
				}
			}
			word32 a1_408;
			word32 a5_410;
			word32 a2_409;
			strlen(1107353112, out a1_408, out a2_409, out a3_142, out a4_140, out a5_410);
			a5_104.u0 = 0x01;
			dwArg4C.u0 = 1107353112;
		}
		0x00 = dwArg01B4;
		if (a5_104 == 0x00)
		{
			s0_105 = dwArg01B4;
			if (a5_104 == 0x00 && s2_47 == 0x00)
				goto l2304ED40;
		}
		ptr32 a0_144;
		word32 s0_411;
		word32 s2_413;
		word32 s3_414;
		word32 s1_412;
		word32 s6_416;
		word32 s7_417;
		word32 s4_415;
		word32 s8_418;
		ra_153 = set_ad(ra_153, 0x02000009, a3_142, a4_140, a5_104, s4_49, s6_51, s7_62, s8_52, mstatus_152, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_411, out s1_412, out a0_144, out a3_142, out a4_140, out a5_104, out s2_413, out s3_414, out s4_415, out s6_416, out s7_417, out s8_418, out mstatus_152);
		s0_105 = a0_144;
		goto l2304ED40;
	}
}

// 2304ED6A: Register Eq_2 bt_lookup_id_addr(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_261119) s2Out, Register out (ptr32 Eq_261120) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      bt_conn_create_le
//      le_adv_report
//      le_legacy_conn_complete
Eq_2 bt_lookup_id_addr(Eq_2 ra, Eq_2 a0, Eq_2 a1, ptr32 & s1Out, ptr32 & a0Out, struct Eq_261119 & s2Out, struct Eq_261120 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	word32 a0_11;
	ptr32 s1_17;
	struct Eq_261119 * s2_18;
	ptr32 s4_19;
	ptr32 s8_20;
	struct Eq_261120 * s3_27;
	ptr32 s5_28;
	ptr32 s0_16;
	Eq_2 ra_26 = bt_keys_find_irk(ra, a0, a1, out s0_16, out s1_17, out a0_11, out s2_18, out s3_27, out s4_19, out s5_28, out s8_20);
	if (a0_11 != 0x00)
		s0_16 = a0_11 + 1;
	s1Out = s1_17;
	a0Out = s0_16;
	s2Out = s2_18;
	s3Out = s3_27;
	s4Out = s4_19;
	s5Out = s5_28;
	s8Out = s8_20;
	return ra_26;
}

// 2304ED86: Register (ptr32 Eq_257738) bt_le_conn_params_valid(Register (ptr32 Eq_257738) a0, Register out Eq_257755 a3Out, Register out Eq_257756 a4Out, Register out (ptr32 Eq_257738) a5Out)
// Called from:
//      le_param_req
//      bt_conn_create_le
struct Eq_257738 * bt_le_conn_params_valid(struct Eq_257738 * a0, union Eq_257755 & a3Out, union Eq_257756 & a4Out, struct Eq_257738 & a5Out)
{
	Eq_257756 a4_11 = (word32) a0->t0000;
	Eq_257756 a1_6 = (word32) a0->w0002;
	struct Eq_257738 * a5_22 = null;
	if (a1_6 >= a4_11)
	{
		a3.u0 = 0x05;
		a5_22 = null;
		if (a4_11 > 0x05)
		{
			a4_11.u0 = 0x00FFFC80;
			if (a1_6 <= 0x00FFFC80)
			{
				a4_11 = (word32) a0->w0004;
				a3.u0 = 499;
				if (a4_11 <= 499)
				{
					a3 = (word32) a0->w0006;
					if ((word32) (word16) ((word32) a3 - 0x0A) <= 0x00FFFC76)
					{
						a3 <<= 2;
						a5_22 = (word32) ((word32) a1_6 + ((word32) a4_11 + 1) < a3 << 2);
					}
				}
			}
		}
	}
	a3Out = a3;
	a4Out = a4_11;
	a5Out = a5_22;
	return a5_22;
}

// 2304EDD8: Register Eq_2 bt_unpair(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_keys_get_addr
//      ble_unpair
Eq_2 bt_unpair(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, Eq_2 a1, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg64, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	if (a0 != 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x15;
		a3Out = a3;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 ra_120;
	Eq_2 s0_118;
	Eq_2 s1_101;
	Eq_2 s2_115;
	Eq_2 s3_123;
	byte bLoc11_278 = SLICE(s0, byte, 24);
	if (a1 == 0x00)
	{
l2304EDE8:
		ra_120 = bt_keys_clear_all(bt_conn_disconnect_all(ra, a1, s4, s2, dwArg08, out s3_123), s2, out s0_118, out s1_101, out s2_115);
		goto l2304EDF4;
	}
	Eq_2 dwLoc14_279 = SEQ(bLoc11_278, 0x00, 0x00);
	word32 a1_483;
	word32 a2_484;
	word32 a4_485;
	word32 a5_486;
	if (memcmp(a1, fp + ~0x17, 0x07, out a1_483, out a2_484, out a3, out a4_485, out a5_486) == 0x00)
		goto l2304EDE8;
	Eq_2 a0_31;
	Eq_2 a3_46;
	word32 s8_490;
	word32 s2_489;
	word32 a4_488;
	word32 a2_487;
	Eq_2 s4_125;
	bt_conn_lookup_addr_le(0x00, a1, mstatus, out s1_101, out a0_31, out a2_487, out a3_46, out a4_488, out s2_489, out s3_123, out s4_125, out s5, out s8_490);
	s0_118 = a0_31;
	ra_120 = ra;
	if (a0_31 != 0x00)
	{
		Eq_2 s2_50 = 0x00;
		if ((word32) *((word32) a0_31 + 2) == 0x01)
		{
			s2_50 = *((word32) a0_31 + 0x009C);
			((word32) a0_31 + 0x009C)->u0 = 0x00;
		}
		Eq_2 a4_66;
		Eq_2 a3_76;
		word32 s1_496;
		word32 a0_497;
		word32 a5_498;
		ra_120 = bt_conn_disconnect(ra, a0_31, s1_101, a0_31, 0x13, a3_46, s2_50, s3_123, mstatus, dwLoc20, 0x00, s2, dwLoc14_279, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg54, dwArg58, dwArg5C, dwArg64, s1, ra, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_118, out s1_496, out a0_497, out a3_76, out a4_66, out a5_498, out s2_115, out s3_123, out s4_125, out s5, out mstatus);
		word32 a4_499;
		word32 a5_500;
		s1_101 = bt_conn_unref(s0_118, a3_76, a4_66, mstatus, out a3, out a4_499, out a5_500);
		if (s2_115 != 0x00)
		{
l2304EE30:
			word32 a4_495;
			ra_120 = bt_keys_clear(ra_120, s0_118, s1_101, s2_115, a3, s2_115, s3_123, s4_125, mstatus, dwLoc20, 0x00, s2, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg44, dwArg48, dwArg58, s1, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out a3, out a4_495);
l2304EDF4:
			s0Out = s0_118;
			s1Out = s1_101;
			a0Out = 0x00;
			a3Out = a3;
			s2Out = s2_115;
			s3Out = s3_123;
			s4Out = dwArg04;
			s5Out = s5;
			mstatusOut = mstatus;
			return ra_120;
		}
	}
	word32 a2_491;
	word32 a4_492;
	word32 a5_493;
	Eq_2 a0_106;
	word32 s2_494;
	s1_101 = bt_keys_find_addr(0x00, s1_101, dwArg18, out a0_106, out a2_491, out a3, out a4_492, out a5_493, out s2_494);
	s2_115 = a0_106;
	if (a0_106 == 0x00)
		goto l2304EDF4;
	goto l2304EE30;
}

