pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304EE64: Register Eq_2 bt_id_add(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_277535) s0Out, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out Eq_2 s3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      update_pending_id
//      smp_ident_addr_info
Eq_2 bt_id_add(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, struct Eq_277535 & s0Out, union Eq_2 & s1Out, union Eq_2 & a3Out, union Eq_2 & s3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	up32 a4_18 = (word32) g_b4200DDF0;
	up32 a5_20 = (word32) g_b4200DDF1;
	if (a4_18 == 0x00 || a4_18 < a5_20)
	{
		g_b4200DDF1 = (byte) (a5_20 + 0x01);
		goto l2304EE92;
	}
	word32 a0_27;
	word32 s2_990;
	word32 s3_991;
	word32 s4_992;
	word32 s8_993;
	Eq_2 a5_32;
	Eq_2 a4_100;
	Eq_2 s1_107;
	Eq_2 a3_133;
	Eq_2 s0_106 = bt_conn_lookup_state_le(0x00, 0x03, a3, mstatus, out s1_107, out a0_27, out a3_133, out a4_100, out a5_32, out s2_990, out s3_991, out s4_992, out s8_993);
	s3.u0 = 0x4200DDCC;
	if (a0_27 != 0x00)
	{
		Eq_2 a3_523;
		Eq_2 a4_524;
		word32 a0_995;
		word32 a2_997;
		word32 a1_996;
		word32 a5_998;
		word32 s4_999;
		word32 s8_1000;
		Eq_2 s1_526 = atomic_or(s0_106, 0x00020000, a3_133, a4_100, mstatus, out a0_995, out a1_996, out a2_997, out a3_523, out a4_524, out a5_998, out s4_999, out s8_1000);
		*((word32) s1_526 + 9) = (byte) ((word32) *((word32) s1_526 + 9) | 4);
		word32 a4_1001;
		word32 a5_1002;
		s1 = bt_conn_unref(s0_106, a3_523, a4_524, mstatus, out a3, out a4_1001, out a5_1002);
		goto l2304EE92;
	}
	Eq_2 ra_105;
	ra_105 = ra;
	word32 a2_994;
	if (atomic_test_bit(0x4200DDCC, 0x06, out a2_994) != 0x00)
	{
		word32 s5_1007;
		word32 s7_1009;
		word32 s6_1008;
		word32 a0_1004;
		word32 s2_1005;
		word32 s4_1006;
		ra_105 = set_advertise_enable(ra, s1_107, a3_133, a4_100, a5_32, mstatus, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg44, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_106, out s1_107, out a0_1004, out a3_133, out a4_100, out a5_32, out s2_1005, out s3, out s4_1006, out s5_1007, out s6_1008, out s7_1009, out mstatus);
	}
	word32 a2_1003;
	Eq_2 a0_84 = atomic_test_bit(s3, 0x0A, out a2_1003);
	if (a0_84 != 0x00)
	{
		word32 s11_1021;
		word32 s5_1016;
		word32 s6_1017;
		word32 s9_1020;
		word32 s8_1019;
		word32 s7_1018;
		word32 a1_1011;
		word32 a5_1012;
		word32 s4_1015;
		word32 s3_1014;
		word32 s2_1013;
		word32 a0_1010;
		ra_105 = set_le_scan_enable(ra_105, a3_133, a4_100, a5_32, a0_84, mstatus, dwLoc30, dwLoc2C, s2, s0, dwLoc18, dwLoc0C, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_106, out s1_107, out a0_1010, out a1_1011, out a3_133, out a4_100, out a5_1012, out s2_1013, out s3_1014, out s4_1015, out s5_1016, out s6_1017, out s7_1018, out s8_1019, out s9_1020, out s11_1021, out mstatus);
	}
	Eq_2 a4_281;
	Eq_2 a5_282;
	struct Eq_274 * a0_307;
	Eq_2 a5_128 = (word32) *((word32) s0_106 + 0x0091);
	if (a5_128 != 0x00)
	{
		word32 a0_135;
		word32 s4_1026;
		word32 s5_1027;
		word32 a4_1022;
		word32 s3_1025;
		word32 s2_1024;
		word32 a5_1023;
		ra_105 = addr_res_enable(ra_105, s0_106, a3_133, a4_100, a5_128, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg48, dwArg4C, dwArg54, dwArg58, s3, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_106, out s1_107, out a0_135, out a3_133, out a4_1022, out a5_1023, out s2_1024, out s3_1025, out s4_1026, out s5_1027, out mstatus);
		if (a0_135 != 0x00)
		{
			a0_307 = (struct Eq_274 *) &g_t230BB01C;
			goto l2304EF16;
		}
	}
	Eq_2 a4_166 = (word32) *((word32) s0_106 + 0x0091);
	Eq_2 a5_167 = (word32) *((word32) s0_106 + 144);
	if (a4_166 == a5_167)
	{
		Eq_2 a5_315;
		Eq_2 a3_319;
		Eq_2 a4_320;
		Eq_2 s5_329;
		word32 a0_340;
		word32 s11_1059;
		word32 s8_1056;
		word32 s9_1057;
		word32 s10_1058;
		word32 s5_1053;
		word32 s6_1054;
		word32 s7_1055;
		word32 s2_1050;
		word32 s3_1051;
		word32 s4_1052;
		word32 a1_1047;
		word32 a2_1048;
		word32 a5_1049;
		word32 s11_1044;
		word32 t4_1045;
		word32 s1_1046;
		word32 s8_1041;
		word32 s9_1042;
		word32 s10_1043;
		word32 s2_1036;
		word32 s3_1037;
		word32 s7_1040;
		word32 s6_1039;
		word32 s4_1038;
		word32 s1_1031;
		word32 a0_1032;
		word32 a7_1035;
		word32 a2_1034;
		word32 a1_1033;
		ra_105 = bt_hci_cmd_send_sync(printf(ra_105, &g_t230BB044, a3_133, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_1031, out a0_1032, out a1_1033, out a2_1034, out a3_319, out a4_320, out a5_315, out a7_1035, out s2_1036, out s3_1037, out s4_1038, out s5_329, out s6_1039, out s7_1040, out s8_1041, out s9_1042, out s10_1043, out s11_1044, out t4_1045), s0_106, 0x02000029, 0x00, a3_319, a4_320, a5_315, s5_329, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, s3, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_106, out s1_1046, out a0_340, out a1_1047, out a2_1048, out a3_133, out a4_281, out a5_1049, out s2_1050, out s3_1051, out s4_1052, out s5_1053, out s6_1054, out s7_1055, out s8_1056, out s9_1057, out s10_1058, out s11_1059, out mstatus);
		if (a0_340 == 0x00)
		{
			word32 a5_369 = (word32) *((word32) s0_106 + 0x0091);
			*((word32) s0_106 + 0x0091) = (byte) (a5_369 + 0x01);
			a5_282 = a5_369 + 0x01;
			goto l2304EF58;
		}
		a0_307 = (struct Eq_274 *) &g_t230BB078;
	}
	else
	{
		word32 a0_178;
		Eq_2 s4_192;
		ra_105 = hci_id_add(ra_105, s1_107, a3_133, a4_166, a5_167, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg44, dwArg48, dwArg4C, dwArg58, s3, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_106, out a0_178, out a3_133, out s4_192, out mstatus);
		if (a0_178 != 0x00)
			a0_307 = (struct Eq_274 *) &g_t230BB09C;
		else
		{
			*((word32) s0_106 + 0x0091) = (byte) ((word32) *((word32) s0_106 + 0x0091) + 0x01);
			if (((word32) *((word32) s0_106 + 71) & 0x04) == 0x00)
				a0_307 = (struct Eq_274 *) &g_t230BB0C0;
			else
			{
				Eq_2 a4_217;
				Eq_2 a4_235;
				word32 s1_242;
				Eq_2 s5_246;
				word32 s6_1092;
				word32 s8_1093;
				word32 s2_1089;
				word32 s3_1090;
				word32 s4_1091;
				word32 s0_1086;
				word32 a1_1087;
				word32 a5_1088;
				word32 a5_1085;
				ra_105 = bt_hci_cmd_create(ra_105, 0x08, bt_addr_le_copy(fp + -40, s4_192, out a4_217, out a5_1085), a4_217, 0x01, mstatus, ra, dwArg78, dwArgB8, dwArgD8, out s0_1086, out s1_242, out a1_1087, out a3_133, out a4_235, out a5_1088, out s2_1089, out s3_1090, out s4_1091, out s5_246, out s6_1092, out s8_1093, out mstatus);
				s0_106.u0 = 0x0200004E;
				if (true)
				{
					Eq_2 a3_263;
					Eq_2 a4_264;
					Eq_2 a5_265;
					word32 a1_1102;
					word32 a2_1103;
					net_buf_simple_add_mem(0x02000056, fp + -40, 0x08, a4_235, out a1_1102, out a2_1103, out a3_263, out a4_264, out a5_265);
					word32 a0_277;
					word32 s10_1115;
					word32 s11_1116;
					word32 s6_1111;
					word32 s7_1112;
					word32 s9_1114;
					word32 s8_1113;
					word32 s3_1108;
					word32 s4_1109;
					word32 s5_1110;
					word32 s1_1104;
					word32 a1_1105;
					word32 s2_1107;
					word32 a2_1106;
					ra_105 = bt_hci_cmd_send_sync(ra_105, 0x0200004E, s1_242 + 78, 0x0200004E, a3_263, a4_264, a5_265, s5_246, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, s3, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_106, out s1_1104, out a0_277, out a1_1105, out a2_1106, out a3_133, out a4_281, out a5_282, out s2_1107, out s3_1108, out s4_1109, out s5_1110, out s6_1111, out s7_1112, out s8_1113, out s9_1114, out s10_1115, out s11_1116, out mstatus);
					if (a0_277 == 0x00)
					{
l2304EF58:
						word32 s4_1030;
						word32 a0_1029;
						word32 s0_1028;
						word32 s2_431;
						Eq_2 a5_425;
						Eq_2 a4_424;
						ra = addr_res_enable(ra_105, s0_106, a3_133, a4_281, a5_282, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg48, dwArg4C, dwArg54, dwArg58, s3, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_1028, out s1, out a0_1029, out a3, out a4_424, out a5_425, out s2_431, out s3, out s4_1030, out s5, out mstatus);
						if (s3 != 0x00)
						{
							word32 s9_1083;
							word32 s11_1084;
							word32 s6_1080;
							word32 s7_1081;
							word32 s8_1082;
							word32 a0_1077;
							word32 a1_1078;
							word32 s4_1079;
							word32 s0_1076;
							ra = set_le_scan_enable(ra, a3, a4_424, a5_425, s3, mstatus, dwLoc30, dwLoc2C, s2, s0, dwLoc18, dwLoc0C, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_1076, out s1, out a0_1077, out a1_1078, out a3, out a4_424, out a5_425, out s2_431, out s3, out s4_1079, out s5, out s6_1080, out s7_1081, out s8_1082, out s9_1083, out s11_1084, out mstatus);
						}
						if (s2_431 != 0x00)
						{
							word32 s7_1101;
							word32 s2_1098;
							word32 s4_1099;
							word32 s6_1100;
							word32 a0_1095;
							word32 a4_1096;
							word32 a5_1097;
							word32 s0_1094;
							ra = set_advertise_enable(ra, s1, a3, a4_424, a5_425, mstatus, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg44, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_1094, out s1, out a0_1095, out a3, out a4_1096, out a5_1097, out s2_1098, out s3, out s4_1099, out s5, out s6_1100, out s7_1101, out mstatus);
						}
l2304EE92:
						0x00 = (int8) dwArg0128;
						s0Out = dwArgE4;
						s1Out = s1;
						a3Out = a3;
						s3Out = s3;
						s5Out = s5;
						mstatusOut = mstatus;
						return ra;
					}
				}
				a0_307 = (struct Eq_274 *) &g_t230BB0EC;
			}
		}
	}
l2304EF16:
	word32 s11_1074;
	word32 t4_1075;
	word32 s8_1071;
	word32 s9_1072;
	word32 s10_1073;
	word32 s5_1068;
	word32 s6_1069;
	word32 s7_1070;
	word32 s2_1065;
	word32 s3_1066;
	word32 s4_1067;
	word32 a1_1062;
	word32 a2_1063;
	word32 a7_1064;
	word32 s1_1060;
	word32 a0_1061;
	ra_105 = printf(ra_105, a0_307, a3_133, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_1060, out a0_1061, out a1_1062, out a2_1063, out a3_133, out a4_281, out a5_282, out a7_1064, out s2_1065, out s3_1066, out s4_1067, out s5_1068, out s6_1069, out s7_1070, out s8_1071, out s9_1072, out s10_1073, out s11_1074, out t4_1075);
	goto l2304EF58;
}

// 2304EFEC: Register Eq_2 bt_id_del(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out)
// Called from:
//      update_pending_id
//      bt_keys_clear
Eq_2 bt_id_del(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out)
{
	word32 a4_20 = (word32) g_b4200DDF0;
	int32 a5_22 = (word32) g_b4200DDF1;
	if (a4_20 != 0x00 && a4_20 + 0x01 >= a5_22)
	{
		word32 a0_30;
		Eq_2 s1_38;
		word32 s2_867;
		word32 s3_868;
		word32 s4_869;
		word32 s8_870;
		Eq_2 a5_105;
		Eq_2 a4_104;
		Eq_2 a3_103;
		Eq_2 s0_110 = bt_conn_lookup_state_le(0x00, 0x03, a3, mstatus, out s1_38, out a0_30, out a3_103, out a4_104, out a5_105, out s2_867, out s3_868, out s4_869, out s8_870);
		Eq_2 s4_47 = 0x4200DDCC;
		if (a0_30 != 0x00)
		{
			Eq_2 a3_456;
			Eq_2 a4_457;
			word32 a0_872;
			word32 a1_873;
			word32 a2_874;
			word32 a5_875;
			word32 s4_876;
			word32 s8_877;
			Eq_2 s1_459 = atomic_or(s0_110, 0x00020000, a3_103, a4_104, mstatus, out a0_872, out a1_873, out a2_874, out a3_456, out a4_457, out a5_875, out s4_876, out s8_877);
			*((word32) s1_459 + 9) = (byte) ((word32) *((word32) s1_459 + 9) | 8);
			word32 a3_878;
			word32 a4_879;
			word32 a5_880;
			bt_conn_unref(s1, a3_456, a4_457, mstatus, out a3_878, out a4_879, out a5_880);
			s0Out = s1;
			return ra;
		}
		Eq_2 ra_109;
		word32 a2_871;
		Eq_2 a0_50 = atomic_test_bit(0x4200DDCC, 0x06, out a2_871);
		Eq_2 s3_53 = a0_50;
		ra_109 = ra;
		if (a0_50 != 0x00)
		{
			word32 s7_887;
			word32 s6_886;
			word32 s1_882;
			word32 a0_883;
			word32 s2_884;
			word32 s5_885;
			ra_109 = set_advertise_enable(ra, s1_38, a3_103, a4_104, a5_105, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg14, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg54, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_110, out s1_882, out a0_883, out a3_103, out a4_104, out a5_105, out s2_884, out s3_53, out s4_47, out s5_885, out s6_886, out s7_887, out mstatus);
		}
		word32 a2_881;
		if (atomic_test_bit(s4_47, 0x0A, out a2_881) != 0x00)
		{
			word32 s11_904;
			word32 s9_903;
			word32 s8_902;
			word32 s7_901;
			word32 s6_900;
			word32 s5_899;
			word32 s4_898;
			word32 s2_896;
			word32 s3_897;
			word32 a0_894;
			word32 a1_895;
			word32 s1_893;
			ra_109 = set_le_scan_enable(ra_109, a3_103, a4_104, a5_105, s3_53, mstatus, dwLoc20, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_110, out s1_893, out a0_894, out a1_895, out a3_103, out a4_104, out a5_105, out s2_896, out s3_897, out s4_898, out s5_899, out s6_900, out s7_901, out s8_902, out s9_903, out s11_904, out mstatus);
		}
		Eq_2 a4_170;
		Eq_2 s1_184;
		word32 s4_187;
		word32 a0_139;
		struct Eq_278248 * s1_149;
		word32 s4_891;
		word32 s5_892;
		word32 a5_889;
		word32 s2_890;
		word32 a4_888;
		Eq_2 s0_163;
		Eq_2 s3_151;
		ptr32 mstatus_147;
		Eq_2 a3_142;
		Eq_2 ra_148 = addr_res_enable(ra_109, s0_110, a3_103, a4_104, a5_105, mstatus, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg58, dwArg5C, s3, s1, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_163, out s1_149, out a0_139, out a3_142, out a4_888, out a5_889, out s2_890, out s3_151, out s4_891, out s5_892, out mstatus_147);
		if (a0_139 != 0x00)
		{
			word32 t4_918;
			word32 s10_916;
			word32 s11_917;
			word32 s8_914;
			word32 s9_915;
			word32 s6_912;
			word32 s7_913;
			word32 s5_911;
			word32 a7_909;
			word32 s2_910;
			word32 a2_907;
			word32 a5_908;
			word32 a1_906;
			word32 a0_905;
			ra = printf(ra_148, &g_t230BB13C, a3_142, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_184, out a0_905, out a1_906, out a2_907, out a3_142, out a4_170, out a5_908, out a7_909, out s2_910, out s3_151, out s4_187, out s5_911, out s6_912, out s7_913, out s8_914, out s9_915, out s10_916, out s11_917, out t4_918);
		}
		else
		{
			Eq_2 a5_169 = (word32) *((word32) s0_163 + 0x0091);
			a4_170 = (word32) *((word32) s0_163 + 144);
			if (a4_170 < a5_169)
			{
				*((word32) s0_163 + 0x0091) = (byte) ((word32) a5_169 - 1);
				s1_149->w000A = (word16) ((word32) s1_149->w000A & ~0x02);
				word32 s2_928;
				ra = bt_keys_foreach(ra_148, 0x02, &g_t2304EA4A, 0x00, dwLoc20, s4, dwArg08, out s0_163, out s1_184, out s2_928, out s4_187);
			}
			else
			{
				Eq_2 s5_188;
				word32 s8_927;
				word32 s6_926;
				word32 a5_924;
				word32 s2_925;
				word32 a1_923;
				ra = bt_hci_cmd_create(ra_148, 0x07, a3_142, a4_170, a5_169, mstatus_147, dwArg74, dwArg88, dwArgC8, dwArgE8, out s0_163, out s1_184, out a1_923, out a3_142, out a4_170, out a5_924, out s2_925, out s3_151, out s4_187, out s5_188, out s6_926, out s8_927, out mstatus_147);
				if (true)
				{
					Eq_2 a4_208;
					Eq_2 a5_209;
					word32 a0_221;
					word32 s9_950;
					word32 s8_949;
					word32 s7_948;
					word32 s6_947;
					word32 s5_946;
					word32 s2_945;
					word32 a5_944;
					word32 a2_943;
					word32 a1_942;
					word32 a5_941;
					word32 a1_940;
					word32 s10_951;
					word32 s11_952;
					ra = bt_hci_cmd_send_sync(ra, s0_163, (word32) s5_188 + 40, 0x02000028, bt_addr_le_copy(net_buf_simple_add(0x02000030, 0x07, a4_170, out a1_940, out a5_941), (word32) s1_184 + 1, out a4_208, out a5_209), a4_208, a5_209, s5_188, mstatus_147, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_163, out s1_184, out a0_221, out a1_942, out a2_943, out a3_142, out a4_170, out a5_944, out s2_945, out s3_151, out s4_187, out s5_946, out s6_947, out s7_948, out s8_949, out s9_950, out s10_951, out s11_952, out mstatus_147);
					if (a0_221 != 0x00)
					{
						word32 a0_953;
						word32 a1_954;
						word32 a2_955;
						word32 a5_956;
						word32 a7_957;
						word32 s2_958;
						word32 s5_959;
						word32 s6_960;
						word32 s7_961;
						word32 s8_962;
						word32 s9_963;
						word32 s10_964;
						word32 s11_965;
						word32 t4_966;
						ra = printf(ra, &g_t230BB16C, a3_142, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_184, out a0_953, out a1_954, out a2_955, out a3_142, out a4_170, out a5_956, out a7_957, out s2_958, out s3_151, out s4_187, out s5_959, out s6_960, out s7_961, out s8_962, out s9_963, out s10_964, out s11_965, out t4_966);
					}
					else
						*((word32) s0_163 + 0x0091) = (byte) ((word32) *((word32) s0_163 + 0x0091) + ~0x00);
				}
			}
		}
		Eq_2 a5_325 = (word32) *((word32) s0_163 + 0x0091);
		if (a5_325 != 0x00)
		{
			word32 s5_922;
			word32 s2_921;
			word32 a0_920;
			word32 s0_919;
			ra = addr_res_enable(ra, s0_163, a3_142, a4_170, a5_325, mstatus_147, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg58, dwArg5C, s3, s1, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_919, out s1_184, out a0_920, out a3_142, out a4_170, out a5_325, out s2_921, out s3_151, out s4_187, out s5_922, out mstatus_147);
		}
		if (s4_187 != 0x00)
		{
			word32 s11_939;
			word32 s9_938;
			word32 s8_937;
			word32 s7_936;
			word32 s6_935;
			word32 s5_934;
			word32 s4_933;
			word32 s2_932;
			word32 a1_931;
			word32 a0_930;
			word32 s0_929;
			ra = set_le_scan_enable(ra, a3_142, a4_170, a5_325, s3_151, mstatus_147, dwLoc20, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_929, out s1_184, out a0_930, out a1_931, out a3_142, out a4_170, out a5_325, out s2_932, out s3_151, out s4_933, out s5_934, out s6_935, out s7_936, out s8_937, out s9_938, out s11_939, out mstatus_147);
		}
		if (s3_151 != 0x00)
		{
			Eq_2 s0_432;
			word32 s1_967;
			word32 a0_968;
			word32 a3_969;
			word32 a4_970;
			word32 a5_971;
			word32 s2_972;
			word32 s3_973;
			word32 s4_974;
			word32 s5_975;
			word32 s6_976;
			word32 s7_977;
			word32 mstatus_978;
			Eq_2 ra_431 = set_advertise_enable(ra, s1_184, a3_142, a4_170, a5_325, mstatus_147, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg54, dwArg58, dwArg5C, dwArg74, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_432, out s1_967, out a0_968, out a3_969, out a4_970, out a5_971, out s2_972, out s3_973, out s4_974, out s5_975, out s6_976, out s7_977, out mstatus_978);
			s0Out = s0_432;
			return ra_431;
		}
	}
	else
		g_b4200DDF1 = (byte) (a5_22 + ~0x00);
	s0Out = s1;
	return ra;
}

