pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304F158: void update_pending_id(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_278604) a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
void update_pending_id(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_278604 * a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	ui32 a5_5 = (word32) a0->b0009;
	if ((a5_5 & 4) == 0x00)
	{
		if ((a5_5 & 8) == 0x00)
			return;
		a0->b0009 = (byte) (a5_5 & ~0x08);
		word32 s0_171;
		bt_id_del(ra, s1, a5_5 & 8, s2, s3, s4, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg74, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_171);
	}
	else
	{
		a0->b0009 = (byte) (a5_5 & ~0x04);
		word32 s0_165;
		word32 s1_166;
		word32 a3_167;
		word32 s3_168;
		word32 s5_169;
		word32 mstatus_170;
		bt_id_add(ra, s0, a5_5 & 4, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg54, dwArg58, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_165, out s1_166, out a3_167, out s3_168, out s5_169, out mstatus_170);
	}
}

// 2304F17E: Register Eq_2 bt_data_parse(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 code) a1, Register ptr32 a2, Register Eq_2 a3, Stack word32 dwArg0128, Register out Eq_2 s2Out)
// Called from:
//      device_found
Eq_2 bt_data_parse(Eq_2 ra, Eq_2 a0, <anonymous> * a1, ptr32 a2, Eq_2 a3, word32 dwArg0128, union Eq_2 & s2Out)
{
	struct Eq_278702 * sp_3 = fp + -48;
	Eq_2 s0_17 = a0;
	<anonymous> * s3_19 = a1;
	ptr32 s4_21 = a2;
	Eq_2 s2_143 = 0x01;
	while (true)
	{
		Eq_2 a5_25 = (word32) *((word32) s0_17 + 4);
		if (s2_143 >= a5_25)
			break;
		word32 a2_184;
		word32 a5_185;
		word32 a1_183;
		Eq_2 a0_28 = net_buf_simple_pull_u8(a5_25, out a1_183, out a2_184, out a5_185);
		if (a0_28 == 0x00)
			break;
		Eq_2 a5_35 = (word32) (word16) a0_28;
		if ((word32) *((word32) s0_17 + 4) < a5_35)
		{
			word32 a4_192;
			word32 a5_193;
			word32 a2_190;
			word32 a3_191;
			word32 a0_188;
			word32 a1_189;
			word32 s1_187;
			word32 a7_194;
			word32 s3_195;
			word32 s4_196;
			word32 s5_197;
			word32 s6_198;
			word32 s7_199;
			word32 s8_200;
			word32 s9_201;
			word32 s10_202;
			word32 s11_203;
			word32 t4_204;
			ra = printf(ra, &g_t230BAF84, a3, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_187, out a0_188, out a1_189, out a2_190, out a3_191, out a4_192, out a5_193, out a7_194, out s2_143, out s3_195, out s4_196, out s5_197, out s6_198, out s7_199, out s8_200, out s9_201, out s10_202, out s11_203, out t4_204);
			break;
		}
		word32 a2_39;
		word32 * a5_40;
		word32 a1_186;
		Eq_2 a0_37 = net_buf_simple_pull_u8(a5_35, out a1_186, out a2_39, out a5_40);
		word32 s0_41 = *a5_40;
		sp_3->t0008 = (byte) a0_37;
		sp_3->b0009 = (byte) ((word32) a0_28 - 1);
		sp_3->ptr0084 = a5_40;
		Eq_2 s1_58;
		word32 a0_59;
		word32 a4_63;
		word32 a7_113;
		word32 s10_114;
		word32 s11_115;
		word32 s5_116;
		word32 s6_117;
		word32 s7_118;
		word32 s9_119;
		word32 t0_120;
		word32 t4_121;
		s3_19();
		if (a0_59 == 0x00)
			break;
		word32 a1_205;
		word32 a5_206;
		net_buf_simple_pull(s0_17, s1_58, out a1_205, out a5_206);
	}
	0x00 = dwArg0128;
	s2Out = s2_143;
	return ra;
}

// 2304F1F6: void bt_addr_le_create_static(Register (ptr32 Eq_278841) a0, Register (ptr32 Eq_64398) a2)
// Called from:
//      id_create.isra.25
void bt_addr_le_create_static(struct Eq_278841 * a0, struct Eq_64398 * a2)
{
	a0->b0000 = 0x01;
	word32 a0_15;
	word32 s8_54;
	word32 s4_53;
	word32 a5_52;
	word32 a4_51;
	word32 a3_50;
	word32 a1_49;
	bt_rand(&a0->b0000 + 1, 0x06, a2, out a0_15, out a1_49, out a3_50, out a4_51, out a5_52, out s4_53, out s8_54);
	if (a0_15 == 0x00)
		a0->b0006 = (byte) ((word32) a0->b0006 | -64);
}

// 2304F222: void id_create.isra.25(Register word32 a0, Register Eq_2 a1, Register (ptr32 Eq_64398) a2)
// Called from:
//      bt_setup_id_addr
void id_create.isra.25(word32 a0, Eq_2 a1, struct Eq_64398 * a2)
{
	Eq_2 a0_75;
	Eq_2 a1_74;
	if (a1 != 0x00)
	{
		word32 a1_152;
		word32 a3_153;
		word32 a4_154;
		word32 a5_155;
		if (memcmp(a1, fp + ~0x1F, 0x07, out a1_152, out a2, out a3_153, out a4_154, out a5_155) != 0x00)
		{
			a1_74 = a1;
			a0_75 = a0 + 0x4200DD67;
			goto l2304F258;
		}
	}
	do
	{
		bt_addr_le_create_static(fp + ~0x17, a2);
		int32 a0_45;
		Eq_2 s1_53;
		word32 a3_149;
		word32 a4_150;
		word32 s3_151;
		Eq_2 s0_52 = id_find(fp + ~0x17, out s1_53, out a0_45, out a2, out a3_149, out a4_150, out s3_151);
	} while (a0_45 >= 0x00);
	word32 a4_156;
	word32 a5_157;
	bt_addr_le_copy(s0_52, fp + ~0x17, out a4_156, out a5_157);
	if (s1_53 == 0x00)
		return;
	a1_74 = s0_52;
	a0_75 = s1_53;
l2304F258:
	word32 a4_158;
	word32 a5_159;
	bt_addr_le_copy(a0_75, a1_74, out a4_158, out a5_159);
}

// 2304F286: Register word32 bt_send()
// Called from:
//      send_frag
//      bt_le_set_data_len
//      hci_tx_thread
word32 bt_send()
{
	struct Eq_278945 * a5_5 = g_ptr4200DE14;
	word32 a5_8;
	a5_5->ptr0010();
	return a5_8;
}

// 2304F294: Register Eq_2 bt_hci_cmd_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_260708 a5Out, Register out Eq_2 s2Out, Register out Eq_260710 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_disconnect
//      conn_update_timeout
//      bt_le_set_data_len
//      bt_le_scan_update
//      le_ltk_request
//      le_conn_param_neg_reply
//      le_conn_param_req
//      enh_conn_complete
Eq_2 bt_hci_cmd_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_260708 & a5Out, union Eq_2 & s2Out, union Eq_260710 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_260708 a5_145;
	Eq_2 ra_105;
	Eq_2 s1_110;
	Eq_2 s2_13 = a0;
	Eq_2 s0_15 = a1;
	ra_105 = ra;
	if (a1 == 0x00)
	{
		word32 s0_316;
		word32 s1_317;
		word32 a1_318;
		word32 s6_319;
		word32 s8_320;
		ra_105 = bt_hci_cmd_create(ra, a1, a3, a4, a5, mstatus, dwArg84, dwArg98, dwArgD8, dwArgF8, out s0_316, out s1_317, out a1_318, out a3, out a4, out a5_145, out s2_13, out s3, out s4, out s5, out s6_319, out s8_320, out mstatus);
		s0_15 = a0;
		s1_110.u0 = -55;
		if (a0 == 0x00)
			goto l2304F2D8;
	}
	a5_145.u0 = 0x00FFFC35;
	if (s2_13 == 0x00FFFC35)
	{
		bt_send();
		s1_110 = s0_15;
		if (s0_15 != 0x00)
		{
			Eq_2 a1_120;
			Eq_2 a4_123;
			Eq_2 s1_126;
			word32 a0_321;
			word32 a2_322;
			word32 a3_323;
			word32 a5_324;
			word32 a7_325;
			word32 s2_326;
			word32 s3_327;
			word32 s4_328;
			word32 s5_329;
			word32 s6_330;
			word32 s7_331;
			word32 s8_332;
			word32 s9_333;
			word32 s10_334;
			word32 s11_335;
			word32 t4_336;
			word32 s0_337;
			word32 a0_338;
			word32 a1_339;
			word32 a2_340;
			word32 s6_341;
			word32 s8_342;
			ra_105 = net_buf_unref(printf(ra_105, &g_t230BACB4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_126, out a0_321, out a1_120, out a2_322, out a3_323, out a4_123, out a5_324, out a7_325, out s2_326, out s3_327, out s4_328, out s5_329, out s6_330, out s7_331, out s8_332, out s9_333, out s10_334, out s11_335, out t4_336), s1_126, s0_15, a1_120, a4_123, mstatus, s2, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_337, out s1_110, out a0_338, out a1_339, out a2_340, out a3, out a4, out a5_145, out s2_13, out s3, out s4, out s5, out s6_341, out s8_342, out mstatus);
		}
	}
	else
	{
		Eq_2 a3_61;
		Eq_2 a4_62;
		Eq_2 a5_63;
		word32 a0_343;
		word32 a1_344;
		word32 s2_345;
		word32 s3_346;
		word32 s4_347;
		word32 s5_348;
		word32 s6_349;
		word32 s8_350;
		net_buf_put(ra_105, s0_15, 0x4200DE08, s0_15, a4, 0x00FFFC35, mstatus, dwArgD8, dwArg0118, dwArg0158, out a0_343, out a1_344, out a3_61, out a4_62, out a5_63, out s2_345, out s3_346, out s4_347, out s5_348, out s6_349, out s8_350);
		word32 s0_351;
		word32 s1_352;
		word32 a0_353;
		word32 a1_354;
		word32 a2_355;
		word32 s6_356;
		word32 s7_357;
		word32 s8_358;
		word32 s9_359;
		word32 s10_360;
		word32 s11_361;
		ra_105 = k_sem_give(ra_105, 0x42026644, a3_61, a4_62, a5_63, mstatus, dwArg04, dwArg08, dwArg50, dwArg54, dwArg78, dwArg84, dwArg9C, dwArgF8, dwArg0138, dwArg0178, out s0_351, out s1_352, out a0_353, out a1_354, out a2_355, out a3, out a4, out a5_145, out s2_13, out s3, out s4, out s5, out s6_356, out s7_357, out s8_358, out s9_359, out s10_360, out s11_361);
		s1_110.u0 = 0x00;
	}
l2304F2D8:
	0x00 = (int8) dwArg38;
	s1Out = s1_110;
	a0Out = s1_110;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_145;
	s2Out = s2_13;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	mstatusOut = mstatus;
	return ra_105;
}

// 2304F304: Register Eq_2 bt_le_set_data_len(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_279154 a0Out, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      ble_set_data_len
//      ble_tp_connected
//      blsync_connected
Eq_2 bt_le_set_data_len(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_279154 & a0Out, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a3_31;
	Eq_2 a4_32;
	ptr32 mstatus_36;
	uint32 s0_38;
	uint32 s1_39;
	word32 s3_41;
	uint16 * s4_42;
	word32 a1_209;
	word32 a5_210;
	word32 s2_211;
	word32 s5_212;
	word32 s6_213;
	word32 s8_214;
	Eq_2 ra_37 = bt_hci_cmd_create(ra, 0x06, a3, a4, a5, mstatus, dwArg74, dwArg88, dwArgC8, dwArgE8, out s0_38, out s1_39, out a1_209, out a3_31, out a4_32, out a5_210, out s2_211, out s3_41, out s4_42, out s5_212, out s6_213, out s8_214, out mstatus_36);
	if (false)
	{
		ptr32 a3_60;
		word32 s1_215;
		word32 a0_216;
		word32 a1_217;
		word32 a2_218;
		word32 a4_219;
		word32 a5_220;
		word32 a7_221;
		word32 s2_222;
		word32 s3_223;
		word32 s4_224;
		word32 s5_225;
		word32 s6_226;
		word32 s7_227;
		word32 s8_228;
		word32 s9_229;
		word32 s10_230;
		word32 s11_231;
		word32 t4_232;
		Eq_2 ra_63 = printf(ra_37, &g_t230BB194, a3_31, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_215, out a0_216, out a1_217, out a2_218, out a3_60, out a4_219, out a5_220, out a7_221, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_227, out s8_228, out s9_229, out s10_230, out s11_231, out t4_232);
		s0Out.u0 = <invalid>;
		a0Out.u0 = -55;
		a3Out = a3_60;
		mstatusOut = mstatus_36;
		return ra_63;
	}
	else
	{
		word32 a1_233;
		word32 a5_234;
		Eq_2 a0_88 = net_buf_simple_add(0x0200002A, 0x06, a4_32, out a1_233, out a5_234);
		uint32 a5_91 = (word32) *s4_42;
		*((word32) a0_88 + 2) = (byte) s1_39;
		*((word32) a0_88 + 4) = (byte) s0_38;
		*a0_88 = (byte) a5_91;
		*((word32) a0_88 + 1) = (byte) (a5_91 >> 8);
		*((word32) a0_88 + 3) = (byte) (s1_39 >> 8);
		*((word32) a0_88 + 5) = (byte) (s0_38 >> 8);
		Eq_279154 a0_110;
		ptr32 a3_113;
		ptr32 mstatus_137;
		word32 s1_235;
		word32 a4_236;
		word32 a5_237;
		word32 s2_238;
		word32 s3_239;
		word32 s4_240;
		word32 s5_241;
		Eq_2 ra_118 = bt_hci_cmd_send(ra_37, s1, s3_41 + 0x0022, 0x02000022, a3_31, a4_32, a5_91 >> 8, 0x02000022, mstatus_36, dwArg04, dwArg08, dwArg18, dwArg38, dwArg50, dwArg54, dwArg60, s3, s1, dwArg78, dwArg84, dwArg88, dwArg94, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, out s1_235, out a0_110, out a3_113, out a4_236, out a5_237, out s2_238, out s3_239, out s4_240, out s5_241, out mstatus_137);
		s0Out.u0 = <invalid>;
		a0Out = a0_110;
		a3Out = a3_113;
		mstatusOut = mstatus_137;
		return ra_118;
	}
}

