pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304F38A: Register Eq_2 start_le_scan(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_279306 a1, Register Eq_2 a2, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_le_scan_update
//      bt_le_scan_start
Eq_2 start_le_scan(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_279306 a1, Eq_2 a2, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 a1_102;
	Eq_2 a4_105;
	Eq_2 a5_106;
	Eq_2 s1_107;
	Eq_2 s2_119;
	ptr32 s4_108;
	ptr32 s3_120;
	ptr32 s6_122;
	ptr32 s5_121;
	Eq_2 s0_100;
	word32 a4_479;
	word32 a5_480;
	word32 a1_477;
	word32 a2_478;
	word32 a0_476;
	word32 t1_475;
	Eq_2 a3_104;
	Eq_2 ra_115 = memset(ra, fp + -40, 0x00, 0x07, out t1_475, out a0_476, out a1_477, out a2_478, out a3_104, out a4_479, out a5_480);
	word32 a2_481;
	atomic_test_bit(0x4200DDCC, 0x0E, out a2_481);
	byte bLoc23_282 = (byte) (word32) g_b4200DD60;
	Eq_2 dwLoc28_333 = SEQ((byte) a2, (byte) (a1 >> 0x08), (byte) a1, (byte) a0);
	if (a0 == 0x01)
	{
		struct Eq_64398 * a2_59;
		if (atomic_test_bit(0x4200DDCC, 0x06, out a2_59) == 0x00)
		{
			Eq_2 a0_101;
			word32 s8_482;
			ra_115 = le_set_private_addr.isra.19(ra_115, a2_59, mstatus, dwLoc30, dwLoc2C, dwLoc28_333, s0, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg24, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s1_107, out a0_101, out a1_102, out a3_104, out a4_105, out a5_106, out s2_119, out s3_120, out s4_108, out s5_121, out s6_122, out s7, out s8_482, out s9, out s11, out mstatus);
			s0_100 = a0_101;
			if (a0_101 != 0x00)
				goto l2304F466;
			goto l2304F40C;
		}
	}
	a4_105 = (word32) bLoc23_282;
	a5_106.u0 = 0x01;
	if (a4_105 == 0x01)
	{
		Eq_2 a0_84;
		word32 s10_497;
		word32 s8_496;
		word32 s0_495;
		ra_115 = set_random_address(ra_115, a0, 0x4200DD61, mstatus, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg44, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_495, out s1_107, out a0_84, out a1_102, out a3_104, out a4_105, out a5_106, out s2_119, out s3_120, out s4_108, out s5_121, out s6_122, out s7, out s8_496, out s9, out s10_497, out s11, out mstatus);
		s0_100 = a0_84;
		if (a0_84 != 0x00)
		{
l2304F466:
			0x00 = (int8) dwArg0128;
			s0Out = dwArgE4;
			s1Out = s1_107;
			a0Out = s0_100;
			a1Out = a1_102;
			a3Out = a3_104;
			a4Out = a4_105;
			a5Out = a5_106;
			s2Out = s2_119;
			s3Out = s3_120;
			s4Out = s4_108;
			s5Out = s5_121;
			s6Out = s6_122;
			s7Out = s7;
			s8Out = dwArg58;
			s9Out = s9;
			s11Out = s11;
			mstatusOut = mstatus;
			return ra_115;
		}
	}
l2304F40C:
	word32 s3_484;
	word32 s8_485;
	word32 s0_483;
	ra_115 = bt_hci_cmd_create(ra_115, 0x07, a3_104, a4_105, a5_106, mstatus, ra, dwArg78, dwArgB8, dwArgD8, out s0_483, out s1_107, out a1_102, out a3_104, out a4_105, out a5_106, out s2_119, out s3_484, out s4_108, out s5_121, out s6_122, out s8_485, out mstatus);
	s3_120 = 0x0200000B;
	s0_100.u0 = -55;
	if (true)
	{
		Eq_2 a3_175;
		Eq_2 a4_176;
		Eq_2 a5_177;
		word32 a2_487;
		word32 a1_486;
		net_buf_simple_add_mem(0x02000013, fp + -40, 0x07, a4_105, out a1_486, out a2_487, out a3_175, out a4_176, out a5_177);
		Eq_2 a3_191;
		Eq_2 a4_192;
		Eq_2 a5_193;
		Eq_2 s3_201;
		ptr32 mstatus_215;
		Eq_2 a0_217;
		word32 s0_493;
		word32 s8_494;
		word32 s5_492;
		word32 s4_491;
		word32 s2_490;
		word32 s1_488;
		word32 a0_489;
		ra_115 = set_le_scan_enable(bt_hci_cmd_send(ra_115, -55, s4_108 + 11, 0x0200000B, a3_175, a4_176, a5_177, s2_119, mstatus, dwLoc2C, dwLoc28_333, dwLoc18, dwArg08, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg48, dwArg54, dwArg58, ra, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s1_488, out a0_489, out a3_191, out a4_192, out a5_193, out s2_490, out s3_201, out s4_491, out s5_492, out mstatus_215), a3_191, a4_192, a5_193, s3_201, mstatus_215, dwLoc30, dwLoc2C, s2, s0, dwLoc18, dwLoc0C, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_493, out s1_107, out a0_217, out a1_102, out a3_104, out a4_105, out a5_106, out s2_119, out s3_120, out s4_108, out s5_121, out s6_122, out s7, out s8_494, out s9, out s11, out mstatus);
		s0_100 = a0_217;
		if (a0_217 == 0x00)
			s1_107 = atomic_set_bit_to(a0_217, 0x0C, (word32) (s1_107 < -2), a3_104, a4_105, mstatus, out a1_102, out a3_104, out a4_105, out a5_106, out s4_108);
	}
	goto l2304F466;
}

// 2304F478: Register Eq_2 bt_le_scan_update(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_260497 s4Out, Register out ptr32 s5Out, Register out Eq_260499 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_disconnect
//      bt_conn_create_le
//      le_adv_report
//      enh_conn_complete
//      bt_finalize_init
//      bt_le_scan_stop
Eq_2 bt_le_scan_update(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_260497 & s4Out, ptr32 & s5Out, union Eq_260499 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a0_174;
	Eq_2 s2_349 = a0;
	word32 a2_427;
	if (atomic_test_bit(0x4200DDCC, 11, out a2_427) == 0x00)
	{
		word32 a2_428;
		if (atomic_test_bit(0x4200DDCC, 0x0A, out a2_428) != 0x00)
		{
			word32 s0_429;
			word32 a1_430;
			word32 s11_431;
			ra = set_le_scan_enable(ra, a3, a4, a5, s3, mstatus, s2, s0, dwArg00, dwArg04, dwArg08, dwArg14, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_429, out s1, out a0_174, out a1_430, out a3, out a4, out a5, out s2_349, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s11_431, out mstatus);
			if (a0_174 != 0x00)
			{
l2304F4F2:
				0x00 = (int8) dwArg38;
				s0Out = s0;
				s1Out = s1;
				a0Out = a0_174;
				a3Out = a3;
				a4Out = a4;
				a5Out = a5;
				s2Out = s2_349;
				s3Out = s3;
				s4Out = s4;
				s5Out = s5;
				s6Out = s6;
				s7Out = s7;
				s8Out = s8;
				s9Out = s9;
				mstatusOut = mstatus;
				return ra;
			}
		}
		Eq_2 a0_66;
		Eq_2 a3_69;
		Eq_2 a4_70;
		word32 s1_432;
		word32 a5_433;
		Eq_2 s0_73 = bt_conn_lookup_state_le(0x00, 0x03, a3, mstatus, out s1_432, out a0_66, out a3_69, out a4_70, out a5_433, out s2_349, out s3, out s4, out s8);
		if (a0_66 == 0x00)
		{
			Eq_2 a0_89;
			word32 s1_434;
			Eq_2 s0_96 = bt_conn_lookup_state_le(a0_66, 0x01, a3_69, mstatus, out s1_434, out a0_89, out a3, out a4, out a5, out s2_349, out s3, out s4, out s8);
			s1 = a0_89;
			if (a0_89 != 0x00)
			{
				Eq_279306 a1_127;
				Eq_2 a3_111;
				Eq_2 a4_112;
				word32 a0_435;
				word32 a1_436;
				word32 a2_437;
				word32 a5_438;
				word32 s4_439;
				word32 s8_440;
				atomic_and(s0_96, ~0x02000000, a3, a4, mstatus, out a0_435, out a1_436, out a2_437, out a3_111, out a4_112, out a5_438, out s4_439, out s8_440);
				word32 a3_441;
				word32 a4_442;
				word32 a5_443;
				bt_conn_unref(s0_96, a3_111, a4_112, mstatus, out a3_441, out a4_442, out a5_443);
				if (s2_349 == 0x00)
					a1_127.u0 = 0x00FFF800;
				else
					a1_127.u0 = 96;
				0x00 = (int8) dwArg38;
				ptr32 a0_145;
				Eq_2 a3_148;
				Eq_2 a4_149;
				Eq_2 a5_150;
				ptr32 mstatus_153;
				Eq_2 s0_155;
				Eq_2 s1_156;
				Eq_2 s2_157;
				Eq_2 s3_158;
				Eq_260497 s4_159;
				ptr32 s5_160;
				Eq_260499 s6_161;
				ptr32 s8_162;
				ptr32 s7_172;
				ptr32 s9_173;
				word32 a1_444;
				word32 s11_445;
				Eq_2 ra_154 = start_le_scan(ra, s0, 0x00, a1_127, dwArg10, s2_349, mstatus, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg44, dwArg48, dwArg54, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s0_155, out s1_156, out a0_145, out a1_444, out a3_148, out a4_149, out a5_150, out s2_157, out s3_158, out s4_159, out s5_160, out s6_161, out s7_172, out s8_162, out s9_173, out s11_445, out mstatus_153);
				s0Out = s0_155;
				s1Out = s1_156;
				a0Out = a0_145;
				a3Out = a3_148;
				a4Out = a4_149;
				a5Out = a5_150;
				s2Out = s2_157;
				s3Out = s3_158;
				s4Out = s4_159;
				s5Out = s5_160;
				s6Out = s6_161;
				s7Out = s7_172;
				s8Out = s8_162;
				s9Out = s9_173;
				mstatusOut = mstatus_153;
				return ra_154;
			}
		}
		else
			s1 = bt_conn_unref(s0_73, a3_69, a4_70, mstatus, out a3, out a4, out a5);
	}
	a0_174 = 0x00;
	goto l2304F4F2;
}

