pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304F50E: void le_adv_report(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg6C, Stack word32 dwArg010C)
void le_adv_report(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg6C, word32 dwArg010C)
{
	Eq_2 s5_131 = (word32) a0 + 8;
	Eq_2 s3_13 = a0;
	Eq_2 s1_148 = 0x4200DD60;
	word32 a1_937;
	word32 a5_939;
	word32 a2_938;
	Eq_2 s4_149 = net_buf_simple_pull_u8(a5, out a1_937, out a2_938, out a5_939);
	ui32 s6_151 = 0x0FFFFFFF;
	Eq_2 s8_152 = 0x4200DDCC;
	while (true)
	{
		struct Eq_279987 * sp_156 = fp - 80;
		if (s4_149 == 0x00)
			break;
		Eq_2 dwLoc48_782 = SEQ(nLoc47, bLoc48);
		if ((word32) *((word32) s3_13 + 0x0C) <= 0x08)
		{
			word32 t4_961;
			word32 s3_952;
			word32 s4_953;
			word32 s5_954;
			word32 s10_959;
			word32 s11_960;
			word32 s7_956;
			word32 s8_957;
			word32 s9_958;
			word32 s6_955;
			word32 s1_943;
			word32 a0_944;
			word32 a1_945;
			word32 a7_950;
			word32 s2_951;
			word32 a3_947;
			word32 a4_948;
			word32 a5_949;
			word32 a2_946;
			printf(ra, &g_t230BB4BC, a3, dwLoc48_782, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_943, out a0_944, out a1_945, out a2_946, out a3_947, out a4_948, out a5_949, out a7_950, out s2_951, out s3_952, out s4_953, out s5_954, out s6_955, out s7_956, out s8_957, out s9_958, out s10_959, out s11_960, out t4_961);
			break;
		}
		word32 a5_942;
		word32 a1_940;
		word32 a4_941;
		Eq_2 a0_53 = net_buf_simple_pull_mem(s5_131, 0x09, out a1_940, out a4_941, out a5_942);
		Eq_2 s11_170 = (word32) a0_53 + 1;
		word32 s0_61 = (word32) ((word32) a0_53 + (word32) (*((word32) a0_53 + 8)) + 9);
		Eq_2 s2_134 = a0_53;
		if (((word32) *((word32) a0_53 + 1) + ~0x01 & 0x00FF) <= 0x01)
		{
			word32 a5_965;
			word32 a4_964;
			a3 = bt_addr_le_copy(fp - 72, (word32) a0_53 + 1, out a4_964, out a5_965);
			bLoc48 = (byte) ((word32) bLoc48 + ~0x01);
		}
		else
		{
			Eq_2 a0_70;
			ra = bt_lookup_id_addr(ra, (word32) *((word32) s1_148 + 8), (word32) a0_53 + 1, out s1_148, out a0_70, out s2_134, out s3_13, out s4_149, out s5_131, out s8_152);
			word32 a4_962;
			word32 a5_963;
			a3 = bt_addr_le_copy(fp - 72, a0_70, out a4_962, out a5_963);
		}
		Eq_2 a4_130 = g_t4200F484;
		if (a4_130 != 0x00)
		{
			Eq_2 a0_133 = net_buf_simple_headroom(a4_130);
			word32 s9_137 = (word32) *((word32) s3_13 + 0x0C);
			Eq_2 a5_138 = g_t4200F484;
			((word32) s3_13 + 0x0C)->u2 = (word16) (word32) *((word32) s2_134 + 8);
			ui32 s7_167;
			word32 s9_168;
			word32 a4_172;
			word32 a7_180;
			word32 gp_181;
			word32 t1_182;
			word32 t2_183;
			word32 t4_184;
			word32 t5_185;
			word32 t6_186;
			a5_138();
			int32 a0_187 = *((word32) s3_13 + 16);
			((word32) s3_13 + 0x0C)->u2 = (word16) s9_168;
			*((word32) s3_13 + 8) = a0_187 + (s7_167 & s6_151);
		}
		up32 s0_197 = (word32) *s2_134;
		word32 a2_966;
		if (atomic_test_bit(s8_152, 11, out a2_966) == 0x00 && s0_197 <= 0x01)
		{
			Eq_2 a0_210;
			Eq_2 a4_214;
			Eq_2 a5_215;
			bt_conn_lookup_state_le(&sp_156->t0008, 0x01, a3, mstatus, out s1_148, out a0_210, out a3, out a4_214, out a5_215, out s2_134, out s3_13, out s4_149, out s8_152);
			Eq_2 s0_225 = a0_210;
			if (a0_210 == 0x00)
				goto l2304F716;
			Eq_2 a3_236;
			Eq_2 a4_237;
			word32 a2_969;
			if (atomic_test_bit(s8_152, 0x0A, out a2_969) == 0x00)
			{
l2304F632:
				Eq_2 s7_263 = (word32) s0_225 + 0x007E;
				word32 a4_980;
				word32 a5_981;
				a3_236 = bt_addr_le_copy(s7_263, s11_170, out a4_980, out a5_981);
				word32 s11_282 = (word32) *((word32) s0_225 + 8);
				a4_237 = (word32) *((word32) s1_148 + (s11_282 + 0x07));
				if (a4_237 == 0x01)
				{
					word32 a0_307;
					word32 s9_997;
					word32 s10_998;
					word32 a1_989;
					word32 a5_990;
					word32 s6_995;
					word32 s8_996;
					word32 s3_992;
					word32 s4_993;
					word32 s5_994;
					word32 s2_991;
					ra = set_random_address(ra, s1_148, (word32) s1_148 + (s11_282 + 0x08), mstatus, sp_156->t0010, sp_156->t0014, sp_156->t0020, sp_156->t0024, sp_156->t0028, sp_156->t0034, sp_156->t0048, sp_156->t0054, sp_156->t0058, sp_156->t005C, sp_156->t0074, sp_156->t0088, sp_156->t0098, sp_156->t00A8, sp_156->t00B8, sp_156->t00C8, sp_156->t00D8, sp_156->t00E8, sp_156->t00F8, sp_156->t0108, sp_156->t0118, sp_156->t0128, sp_156->t0138, out s0_225, out s1_148, out a0_307, out a1_989, out a3_236, out a4_237, out a5_990, out s2_991, out s3_992, out s4_993, out s5_994, out s6_995, out s7_263, out s8_996, out s9_997, out s10_998, out s11_282, out mstatus);
					if (a0_307 == 0x00)
						goto l2304F662;
					goto l2304F746;
				}
l2304F662:
				word32 s11_332 = (word32) *((word32) s1_148 + (s11_282 + 0x07));
				Eq_2 s5_352;
				word32 s8_988;
				word32 s4_986;
				word32 s6_987;
				word32 a5_983;
				word32 s2_984;
				word32 s3_985;
				word32 a1_982;
				ra = bt_hci_cmd_create(ra, 0x19, a3_236, a4_237, 0x07, mstatus, sp_156->t0094, sp_156->t00A8, sp_156->t00E8, sp_156->t0108, out s0_225, out s1_148, out a1_982, out a3_236, out a4_237, out a5_983, out s2_984, out s3_985, out s4_986, out s5_352, out s6_987, out s8_988, out mstatus);
				if (false)
					goto l2304F746;
				word32 a1_1011;
				word32 a5_1012;
				Eq_2 a0_365 = net_buf_simple_add(0x02000015, 0x19, a4_237, out a1_1011, out a5_1012);
				word32 a1_1015;
				word32 a2_1016;
				word32 a3_1017;
				word32 a5_1019;
				word32 a4_1018;
				word32 t1_1013;
				word32 a0_1014;
				Eq_2 ra_377 = memset(ra, a0_365, 0x00, 0x19, out t1_1013, out a0_1014, out a1_1015, out a2_1016, out a3_1017, out a4_1018, out a5_1019);
				*a0_365 = 0x60;
				*((word32) a0_365 + 1) = 0x00;
				*((word32) a0_365 + 2) = 0x60;
				*((word32) a0_365 + 3) = 0x00;
				up32 a4_385 = (word32) *((word32) s1_148 + 144);
				if (a4_385 != 0x00 && a4_385 >= (word32) (*((word32) s1_148 + 0x0091)))
					s7_263 = (word32) s0_225 + 112;
				Eq_2 a5_397;
				word32 a4_1020;
				Eq_2 a3_395 = bt_addr_le_copy((word32) a0_365 + 5, s7_263, out a4_1020, out a5_397);
				*((word32) a0_365 + 0x0C) = (byte) s11_332;
				uint32 a4_409 = (word32) *((word32) s0_225 + 0x0088);
				*((word32) a0_365 + 0x0D) = (byte) a4_409;
				*((word32) a0_365 + 0x0E) = (byte) (a4_409 >> 8);
				uint32 a4_415 = (word32) *((word32) s0_225 + 0x008A);
				*((word32) a0_365 + 0x0F) = (byte) a4_415;
				*((word32) a0_365 + 16) = (byte) (a4_415 >> 8);
				uint32 a4_422 = (word32) *((word32) s0_225 + 0x008C);
				*((word32) a0_365 + 0x0011) = (byte) a4_422;
				*((word32) a0_365 + 18) = (byte) (a4_422 >> 8);
				uint32 a4_426 = (word32) *((word32) s0_225 + 0x008E);
				*((word32) a0_365 + 19) = (byte) a4_426;
				*((word32) a0_365 + 20) = (byte) (a4_426 >> 8);
				word32 a0_434;
				word32 s11_1033;
				word32 s2_1024;
				word32 s3_1025;
				word32 s4_1026;
				word32 s9_1031;
				word32 s10_1032;
				word32 s6_1028;
				word32 s7_1029;
				word32 s8_1030;
				word32 s5_1027;
				word32 a2_1022;
				word32 a5_1023;
				word32 a1_1021;
				ra = bt_hci_cmd_send_sync(ra_377, s0_225, 0x0200000D, 0x0200000D, a3_395, a4_426 >> 8, a5_397, s5_352, mstatus, sp_156->t0030, sp_156->t0034, sp_156->t0040, sp_156->t0044, sp_156->t0048, sp_156->t0054, sp_156->t0068, sp_156->t0074, sp_156->t0078, sp_156->t007C, sp_156->t0088, sp_156->t008C, sp_156->t00A8, sp_156->t00B8, sp_156->t00C8, sp_156->t00D8, sp_156->t00E8, sp_156->t00F8, sp_156->t0108, sp_156->t0118, sp_156->t0128, sp_156->t0138, sp_156->t0148, sp_156->t0158, out s0_225, out s1_148, out a0_434, out a1_1021, out a2_1022, out a3_236, out a4_237, out a5_1023, out s2_1024, out s3_1025, out s4_1026, out s5_1027, out s6_1028, out s7_1029, out s8_1030, out s9_1031, out s10_1032, out s11_1033, out mstatus);
				if (a0_434 != 0x00)
					goto l2304F746;
				Eq_2 a3_546;
				Eq_2 a4_547;
				Eq_2 s0_568;
				word32 s1_1034;
				word32 a5_1035;
				ra = bt_conn_set_state(ra, s1_148, s0_225, 0x03, a3_236, a4_237, mstatus, sp_156->t0008, sp_156->t0010, sp_156->t0014, sp_156->t0024, sp_156->t0028, sp_156->t0038, sp_156->t0098, sp_156->t00A8, sp_156->t00BC, sp_156->t00D8, sp_156->t0118, out s0_568, out s1_1034, out a3_546, out a4_547, out a5_1035, out s2_134, out s3_13, out s4_149, out s5_131, out s6_151, out s8_152, out mstatus);
				word32 a5_1037;
				word32 a4_1036;
				s1_148 = bt_conn_unref(s0_568, a3_546, a4_547, mstatus, out a3, out a4_1036, out a5_1037);
				goto l2304F716;
			}
			word32 a0_233;
			word32 s9_979;
			word32 a1_970;
			word32 a5_971;
			word32 s2_972;
			word32 s7_977;
			word32 s8_978;
			word32 s4_974;
			word32 s5_975;
			word32 s6_976;
			word32 s3_973;
			ra = set_le_scan_enable(ra, a3, a4_214, a5_215, s3_13, mstatus, sp_156->t0000, sp_156->t0004, sp_156->t0010, sp_156->t0014, sp_156->t0018, sp_156->t0024, sp_156->t0038, sp_156->t0044, sp_156->t0048, sp_156->t004C, sp_156->t0058, sp_156->t0078, sp_156->t0088, sp_156->t0098, sp_156->t00A8, sp_156->t00B8, sp_156->t00C8, sp_156->t00D8, sp_156->t00E8, sp_156->t00F8, sp_156->t0108, sp_156->t0118, sp_156->t0128, out s0_225, out s1_148, out a0_233, out a1_970, out a3_236, out a4_237, out a5_971, out s2_972, out s3_973, out s4_974, out s5_975, out s6_976, out s7_977, out s8_978, out s9_979, out s11_170, out mstatus);
			if (a0_233 == 0x00)
				goto l2304F632;
l2304F746:
			*((word32) s0_225 + 0x0C) = 0x1F;
			Eq_2 a3_477;
			Eq_2 a4_478;
			Eq_2 s2_485;
			Eq_2 s3_486;
			ptr32 mstatus_498;
			Eq_2 s0_499;
			word32 s1_999;
			word32 s8_1004;
			word32 s4_1001;
			word32 s5_1002;
			word32 s6_1003;
			word32 a5_1000;
			Eq_2 ra_481 = bt_conn_set_state(ra, s1_148, s0_225, 0x00, a3_236, a4_237, mstatus, sp_156->t0008, sp_156->t0010, sp_156->t0014, sp_156->t0024, sp_156->t0028, sp_156->t0038, sp_156->t0098, sp_156->t00A8, sp_156->t00BC, sp_156->t00D8, sp_156->t0118, out s0_499, out s1_999, out a3_477, out a4_478, out a5_1000, out s2_485, out s3_486, out s4_1001, out s5_1002, out s6_1003, out s8_1004, out mstatus_498);
			Eq_2 a3_506;
			Eq_2 a4_507;
			Eq_2 a5_508;
			bt_conn_unref(s0_499, a3_477, a4_478, mstatus_498, out a3_506, out a4_507, out a5_508);
			word32 a0_1006;
			word32 a4_1007;
			word32 a5_1008;
			word32 s9_1010;
			word32 s7_1009;
			word32 s0_1005;
			ra = bt_le_scan_update(ra_481, s0_499, a3_506, a4_507, a5_508, s2_485, s3_486, mstatus_498, sp_156->t0000, sp_156->t0004, sp_156->t0008, sp_156->t000C, sp_156->t0010, sp_156->t0014, sp_156->t0018, sp_156->t001C, sp_156->t0020, sp_156->t0024, sp_156->t0028, sp_156->t002C, sp_156->t0030, sp_156->t0034, sp_156->t0038, sp_156->t003C, sp_156->t0044, sp_156->t0048, sp_156->t0054, sp_156->t0058, sp_156->t0068, sp_156->t006C, sp_156->t0078, sp_156->t007C, sp_156->t0088, sp_156->t0098, sp_156->t00A8, sp_156->t00B8, sp_156->t00C8, sp_156->t00D8, sp_156->t00E8, sp_156->t00F8, sp_156->t0108, sp_156->t0118, sp_156->t0128, sp_156->t0138, sp_156->t0148, out s0_1005, out s1_148, out a0_1006, out a3, out a4_1007, out a5_1008, out s2_134, out s3_13, out s4_149, out s5_131, out s6_151, out s7_1009, out s8_152, out s9_1010, out mstatus);
		}
l2304F716:
		word32 a5_968;
		word32 a1_967;
		net_buf_simple_pull(s5_131, (word32) *((word32) s2_134 + 8) + 0x01, out a1_967, out a5_968);
		s4_149 = (word32) s4_149 - 1 & 0x00FF;
	}
	0x00 = dwArg010C;
}

