pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304F762: void le_ltk_request(Register Eq_2 ra, Register (ptr32 Eq_280799) s1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void le_ltk_request(Eq_2 ra, struct Eq_280799 * s1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	Eq_2 a0_22;
	struct Eq_280836 * s1_26;
	Eq_2 a3_34;
	word32 s3_448;
	word32 s2_447;
	word32 a4_446;
	word32 s4_449;
	bt_conn_lookup_handle((word32) s1->b0001 << 8 | (word32) s1->b0000, a3, mstatus, out s1_26, out a0_22, out a3_34, out a4_446, out s2_447, out s3_448, out s4_449);
	if (a0_22 == 0x00)
	{
		word32 s1_450;
		word32 a0_451;
		word32 a1_452;
		word32 a2_453;
		word32 a3_454;
		word32 a4_455;
		word32 a5_456;
		word32 a7_457;
		word32 s2_458;
		word32 s3_459;
		word32 s4_460;
		word32 s5_461;
		word32 s6_462;
		word32 s7_463;
		word32 s8_464;
		word32 s9_465;
		word32 s10_466;
		word32 s11_467;
		word32 t4_468;
		printf(ra, &g_t230BB510, a3_34, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_450, out a0_451, out a1_452, out a2_453, out a3_454, out a4_455, out a5_456, out a7_457, out s2_458, out s3_459, out s4_460, out s5_461, out s6_462, out s7_463, out s8_464, out s9_465, out s10_466, out s11_467, out t4_468);
		goto l2304F792;
	}
	Eq_2 a3_196;
	Eq_2 a4_197;
	ptr32 mstatus_100;
	Eq_2 s0_102;
	Eq_2 a3_133;
	Eq_2 ra_101;
	Eq_2 a4_167;
	Eq_2 a5_122;
	Eq_2 a1_126;
	Eq_2 a0_127;
	Eq_2 s2_104;
	word32 a0_62;
	Eq_2 a3_65;
	Eq_2 a4_66;
	Eq_2 a5_67;
	Eq_2 ra_69 = bt_smp_request_ltk(ra, a0_22, (word32) s1_26->b000B << 8 | (word32) s1_26->b000A, mstatus, dwLoc28, dwArg00, dwArg04, dwArg28, dwArg38, dwArg48, dwArg4C, dwArg78, dwArg84, dwArgB8, dwArgF8, out a0_62, out a3_65, out a4_66, out a5_67);
	if (a0_62 != 0x00)
	{
		Eq_2 a4_134;
		word32 s3_143;
		word32 s1_476;
		word32 a1_477;
		word32 a5_478;
		word32 s4_479;
		word32 s5_480;
		word32 s6_481;
		word32 s8_482;
		ra_101 = bt_hci_cmd_create(ra_69, 0x12, a3_65, a4_66, a5_67, mstatus, ra, dwArg78, dwArgB8, dwArgD8, out s0_102, out s1_476, out a1_477, out a3_133, out a4_134, out a5_478, out s2_104, out s3_143, out s4_479, out s5_480, out s6_481, out s8_482, out mstatus_100);
		if (false)
		{
l2304F806:
			word32 s1_489;
			word32 a0_490;
			word32 a1_491;
			word32 a2_492;
			word32 a5_493;
			word32 a7_494;
			word32 s2_495;
			word32 s3_496;
			word32 s4_497;
			word32 s5_498;
			word32 s6_499;
			word32 s7_500;
			word32 s8_501;
			word32 s9_502;
			word32 s10_503;
			word32 s11_504;
			word32 t4_505;
			printf(ra_101, &g_t230BB4F4, a3_133, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_489, out a0_490, out a1_491, out a2_492, out a3_196, out a4_197, out a5_493, out a7_494, out s2_495, out s3_496, out s4_497, out s5_498, out s6_499, out s7_500, out s8_501, out s9_502, out s10_503, out s11_504, out t4_505);
			goto l2304F812;
		}
		word32 a1_483;
		word32 a5_484;
		Eq_2 a0_158 = net_buf_simple_add(0x02000022, 0x12, a4_134, out a1_483, out a5_484);
		*a0_158 = (byte) s0_102;
		*((word32) a0_158 + 1) = (byte) (s0_102 >> 8);
		word32 a1_485;
		word32 a2_486;
		word32 a6_487;
		word32 a7_488;
		memcpy((word32) a0_158 + 2, fp + -48, 0x10, out a1_485, out a2_486, out a3_133, out a4_167, out a5_122, out a6_487, out a7_488);
		s0_102 >>= 8;
		a1_126.u0 = 0x0200001A;
		a0_127 = s3_143 + 26;
	}
	else
	{
		word32 s3_105;
		word32 s1_469;
		word32 a1_470;
		word32 a5_471;
		word32 s4_472;
		word32 s5_473;
		word32 s6_474;
		word32 s8_475;
		ra_101 = bt_hci_cmd_create(ra_69, 0x02, a3_65, a4_66, a5_67, mstatus, ra, dwArg78, dwArgB8, dwArgD8, out s0_102, out s1_469, out a1_470, out a3_133, out a4_167, out a5_471, out s2_104, out s3_105, out s4_472, out s5_473, out s6_474, out s8_475, out mstatus_100);
		if (false)
			goto l2304F806;
		word32 a1_506;
		Eq_2 a0_120 = net_buf_simple_add(0x02000023, 0x02, a4_167, out a1_506, out a5_122);
		*a0_120 = (byte) s0_102;
		*((word32) a0_120 + 1) = (byte) (s0_102 >> 8);
		s0_102 >>= 8;
		a1_126.u0 = 0x0200001B;
		a0_127 = s3_105 + 27;
	}
	word32 s1_507;
	word32 a0_508;
	word32 a5_509;
	word32 s2_510;
	word32 s3_511;
	word32 s4_512;
	word32 s5_513;
	bt_hci_cmd_send(ra_101, s0_102, a0_127, a1_126, a3_133, a4_167, a5_122, s2_104, mstatus_100, dwLoc2C, dwLoc28, dwLoc18, dwArg08, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg48, dwArg54, dwArg58, ra, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s1_507, out a0_508, out a3_196, out a4_197, out a5_509, out s2_510, out s3_511, out s4_512, out s5_513, out mstatus_100);
l2304F812:
	word32 a3_514;
	word32 a4_515;
	word32 a5_516;
	bt_conn_unref(s0_102, a3_196, a4_197, mstatus_100, out a3_514, out a4_515, out a5_516);
l2304F792:
	0x00 = (int8) dwArg0128;
}

// 2304F86C: Register uint32 le_conn_param_neg_reply(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      le_conn_param_req
uint32 le_conn_param_neg_reply(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & a3Out, ptr32 & a4Out, ptr32 & mstatusOut)
{
	Eq_2 a3_27;
	Eq_2 a4_28;
	ptr32 mstatus_32;
	uint32 s0_34;
	Eq_2 s2_36;
	word32 s3_37;
	word32 s1_197;
	word32 a1_198;
	word32 a5_199;
	word32 s4_200;
	word32 s5_201;
	word32 s6_202;
	word32 s8_203;
	Eq_2 ra_33 = bt_hci_cmd_create(ra, 0x03, a3, a4, a5, mstatus, dwArg74, dwArg88, dwArgC8, dwArgE8, out s0_34, out s1_197, out a1_198, out a3_27, out a4_28, out a5_199, out s2_36, out s3_37, out s4_200, out s5_201, out s6_202, out s8_203, out mstatus_32);
	if (true)
	{
		Eq_2 a5_54;
		word32 a1_204;
		Eq_2 a0_52 = net_buf_simple_add(0x02000029, 0x03, a4_28, out a1_204, out a5_54);
		*a0_52 = (byte) s0_34;
		*((word32) a0_52 + 1) = (byte) (s0_34 >> 8);
		*((word32) a0_52 + 2) = (byte) s3_37;
		ptr32 a3_70;
		ptr32 a4_71;
		ptr32 mstatus_94;
		word32 s1_222;
		word32 a0_223;
		word32 a5_224;
		word32 s2_225;
		word32 s3_226;
		word32 s4_227;
		word32 s5_228;
		bt_hci_cmd_send(ra_33, s0_34 >> 8, (word32) s2_36 + 33, 0x02000021, a3_27, a4_28, a5_54, s2_36, mstatus_32, dwArg04, dwArg08, dwArg18, dwArg38, dwArg50, dwArg54, dwArg60, s3, s1, dwArg78, dwArg84, dwArg88, dwArg94, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, out s1_222, out a0_223, out a3_70, out a4_71, out a5_224, out s2_225, out s3_226, out s4_227, out s5_228, out mstatus_94);
		a3Out = a3_70;
		a4Out = a4_71;
		mstatusOut = mstatus_94;
		return s0_34 >> 8;
	}
	else
	{
		ptr32 a3_108;
		ptr32 a4_109;
		word32 s1_205;
		word32 a0_206;
		word32 a1_207;
		word32 a2_208;
		word32 a5_209;
		word32 a7_210;
		word32 s2_211;
		word32 s3_212;
		word32 s4_213;
		word32 s5_214;
		word32 s6_215;
		word32 s7_216;
		word32 s8_217;
		word32 s9_218;
		word32 s10_219;
		word32 s11_220;
		word32 t4_221;
		printf(ra_33, &g_t230BB4D8, a3_27, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_205, out a0_206, out a1_207, out a2_208, out a3_108, out a4_109, out a5_209, out a7_210, out s2_211, out s3_212, out s4_213, out s5_214, out s6_215, out s7_216, out s8_217, out s9_218, out s10_219, out s11_220, out t4_221);
		a3Out = a3_108;
		a4Out = a4_109;
		mstatusOut = mstatus_32;
		return s0_34;
	}
}

// 2304F8D0: void le_conn_param_req(Register Eq_2 ra, Register (ptr32 Eq_281311) a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void le_conn_param_req(Eq_2 ra, struct Eq_281311 * a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	Eq_2 dwLoc28_308;
	Eq_2 a3_34 = (word32) a5->b0006;
	word16 wLoc28_285 = (word16) ((word32) a5->b0003 << 8 | (word32) a5->b0002);
	word16 wLoc24_287 = (word16) ((word32) a5->b0007 << 8 | a3_34);
	word16 wLoc26_286 = (word16) ((word32) a5->b0005 << 8 | (word32) a5->b0004);
	word16 wLoc22_288 = (word16) ((word32) a5->b0009 << 8 | (word32) a5->b0008);
	ptr32 a0_44;
	Eq_2 a3_56;
	word32 s1_385;
	word32 a4_386;
	word32 s2_387;
	word32 s3_388;
	word32 s4_389;
	bt_conn_lookup_handle((word32) a5->b0001 << 8 | (word32) a5->b0000, a3_34, mstatus, out s1_385, out a0_44, out a3_56, out a4_386, out s2_387, out s3_388, out s4_389);
	byte bLoc28_292 = (byte) wLoc28_285;
	byte bLoc27_293 = SLICE(wLoc28_285, byte, 8);
	byte bLoc24_294 = (byte) wLoc24_287;
	byte bLoc23_295 = SLICE(wLoc24_287, byte, 8);
	if (a0_44 == 0x00)
	{
		Eq_2 a5_217;
		Eq_2 a3_221;
		Eq_2 a4_222;
		Eq_2 s1_225;
		Eq_2 s3_229;
		word32 a0_390;
		word32 a1_391;
		word32 a2_392;
		word32 a7_393;
		word32 s2_394;
		word32 s4_395;
		word32 s5_396;
		word32 s6_397;
		word32 s7_398;
		word32 s8_399;
		word32 s9_400;
		word32 s10_401;
		word32 s11_402;
		word32 t4_403;
		word32 a3_404;
		word32 a4_405;
		word32 mstatus_406;
		le_conn_param_neg_reply(printf(ra, &g_t230BB510, a3_56, dwLoc28_308, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_225, out a0_390, out a1_391, out a2_392, out a3_221, out a4_222, out a5_217, out a7_393, out s2_394, out s3_229, out s4_395, out s5_396, out s6_397, out s7_398, out s8_399, out s9_400, out s10_401, out s11_402, out t4_403), s1_225, a3_221, a4_222, a5_217, s3_229, mstatus, dwLoc2C, dwLoc28_308, dwLoc18, dwLoc08, dwArg08, dwArg20, dwArg24, dwArg30, dwArg40, dwArg44, dwArg48, dwArg54, dwArg58, ra, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out a3_404, out a4_405, out mstatus_406);
	}
	else
	{
		Eq_2 a3_144;
		Eq_2 a4_145;
		ptr32 mstatus_168;
		Eq_2 s0_121;
		Eq_2 a3_62;
		Eq_2 a4_63;
		Eq_2 a5_64;
		Eq_2 s1_67;
		Eq_2 s3_69;
		word32 a0_73;
		Eq_2 ra_74 = le_param_req(ra, a0_44, fp + -40, out s1_67, out a0_73, out a3_62, out a4_63, out a5_64, out s3_69);
		if (a0_73 == 0x00)
			s0_121 = le_conn_param_neg_reply(ra_74, s1_67, a3_62, a4_63, a5_64, s3_69, mstatus, dwLoc2C, dwLoc28_308, dwLoc18, dwLoc08, dwArg08, dwArg20, dwArg24, dwArg30, dwArg40, dwArg44, dwArg48, dwArg54, dwArg58, ra, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out a3_144, out a4_145, out mstatus_168);
		else
		{
			word32 s4_91;
			word32 s1_407;
			word32 a1_408;
			word32 a5_409;
			word32 s2_410;
			word32 s3_411;
			word32 s5_412;
			word32 s6_413;
			word32 s8_414;
			Eq_2 ra_86 = bt_hci_cmd_create(ra_74, 0x0E, a3_62, a4_63, a5_64, mstatus, ra, dwArg78, dwArgB8, dwArgD8, out s0_121, out s1_407, out a1_408, out a3_144, out a4_145, out a5_409, out s2_410, out s3_411, out s4_91, out s5_412, out s6_413, out s8_414, out mstatus_168);
			if (true)
			{
				word32 a1_418;
				word32 a5_419;
				Eq_2 a0_105 = net_buf_simple_add(0x02000028, 0x0E, a4_145, out a1_418, out a5_419);
				Eq_2 a3_114;
				Eq_2 a4_115;
				word32 t1_420;
				word32 a0_421;
				word32 a1_422;
				word32 a2_423;
				word32 a5_424;
				Eq_2 ra_117 = memset(ra_86, a0_105, 0x00, 0x0E, out t1_420, out a0_421, out a1_422, out a2_423, out a3_114, out a4_115, out a5_424);
				*a0_105 = (byte) s0_121;
				*((word32) a0_105 + 1) = (byte) (s0_121 >> 8);
				*((word32) a0_105 + 2) = (byte) (word32) bLoc28_292;
				*((word32) a0_105 + 3) = (byte) (word32) bLoc27_293;
				uint32 a5_129 = (word32) wLoc26_286;
				*((word32) a0_105 + 4) = (byte) a5_129;
				*((word32) a0_105 + 5) = (byte) (a5_129 >> 8);
				*((word32) a0_105 + 6) = (byte) (word32) bLoc24_294;
				*((word32) a0_105 + 7) = (byte) (word32) bLoc23_295;
				uint32 a5_137 = (word32) wLoc22_288;
				*((word32) a0_105 + 8) = (byte) a5_137;
				*((word32) a0_105 + 9) = (byte) (a5_137 >> 8);
				dwLoc28_308 = SEQ(wLoc26_286, bLoc27_293, bLoc28_292);
				word32 s1_425;
				word32 a0_426;
				word32 a5_427;
				word32 s2_428;
				word32 s3_429;
				word32 s4_430;
				word32 s5_431;
				bt_hci_cmd_send(ra_117, s0_121 >> 8, s4_91 + 32, 0x02000020, a3_114, a4_115, a5_137 >> 8, 0x02000020, mstatus_168, dwLoc2C, dwLoc28_308, dwLoc18, dwArg08, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg48, dwArg54, dwArg58, ra, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s1_425, out a0_426, out a3_144, out a4_145, out a5_427, out s2_428, out s3_429, out s4_430, out s5_431, out mstatus_168);
				s0_121 >>= 8;
			}
		}
		word32 a3_415;
		word32 a4_416;
		word32 a5_417;
		bt_conn_unref(s0_121, a3_144, a4_145, mstatus_168, out a3_415, out a4_416, out a5_417);
	}
	0x00 = (int8) dwArg0128;
}

