pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304F9E8: void enh_conn_complete(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
// Called from:
//      le_enh_conn_complete
//      le_legacy_conn_complete
void enh_conn_complete(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	word24 nLoc2F_1242 = SLICE(dwLoc30, word24, 8);
	Eq_2 ra_159;
	ui32 a0_32;
	Eq_2 a3_35;
	word32 a2_1478;
	word32 a1_1477;
	word32 a4_1479;
	word32 a5_1480;
	word32 s4_1481;
	word32 s8_1482;
	Eq_2 s1_38 = atomic_and(s0, ~0x20000000, a3, a4, mstatus, out a0_32, out a1_1477, out a2_1478, out a3_35, out a4_1479, out a5_1480, out s4_1481, out s8_1482);
	ra_159 = ra;
	if (a0_32 << 0x0E < 0x00)
	{
		word32 s0_1483;
		word32 s2_1484;
		word32 s4_1485;
		ra_159 = bt_keys_foreach(ra, 0x02, &g_t2304F158, 0x00, dwLoc30, dwLoc2C, dwLoc08, out s0_1483, out s1_38, out s2_1484, out s4_1485);
	}
	Eq_2 s3_433;
	Eq_2 ra_428;
	Eq_2 s2_432;
	Eq_2 a3_424;
	Eq_2 a4_450;
	ptr32 mstatus_445;
	Eq_2 s0_446;
	Eq_2 dwLoc28_942;
	if ((word32) *s1_38 != 0x00)
	{
		Eq_2 a0_590;
		word32 s3_1489;
		word32 s4_1490;
		word32 s2_1488;
		Eq_2 a4_594;
		Eq_2 a3_593;
		Eq_2 s1_597 = find_pending_connect(0x00, a3_35, mstatus, out a0_590, out a3_593, out a4_594, out s2_1488, out s3_1489, out s4_1490);
		if (a0_590 == 0x00)
			goto l2304FA9C;
		int32 a1_606 = (word32) *s1_597;
		*((word32) a0_590 + 0x0C) = (byte) a1_606;
		if (a1_606 == 60)
		{
			word32 a1_1492;
			word32 s4_1495;
			word32 s8_1496;
			word32 a5_1494;
			word32 a2_1493;
			word32 a0_1491;
			s1_597 = atomic_and(a0_590, -65, a3_593, a4_594, mstatus, out a0_1491, out a1_1492, out a2_1493, out a3_593, out a4_594, out a5_1494, out s4_1495, out s8_1496);
		}
		else if (a1_606 != 0x02)
		{
			Eq_2 a3_617;
			Eq_2 a4_618;
			word32 t4_1528;
			word32 a5_1516;
			word32 s10_1526;
			word32 s11_1527;
			word32 s3_1519;
			word32 s5_1521;
			word32 s6_1522;
			word32 s8_1524;
			word32 s9_1525;
			word32 s7_1523;
			word32 s4_1520;
			word32 s2_1518;
			word32 a7_1517;
			word32 a1_1514;
			word32 a2_1515;
			word32 s1_1512;
			word32 a0_1513;
			printf(ra_159, &g_t230BB28C, a3_593, dwLoc28_942, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_1512, out a0_1513, out a1_1514, out a2_1515, out a3_617, out a4_618, out a5_1516, out a7_1517, out s2_1518, out s3_1519, out s4_1520, out s5_1521, out s6_1522, out s7_1523, out s8_1524, out s9_1525, out s10_1526, out s11_1527, out t4_1528);
			word32 a5_1531;
			word32 a4_1530;
			word32 a3_1529;
			bt_conn_unref(a0_590, a3_617, a4_618, mstatus, out a3_1529, out a4_1530, out a5_1531);
			goto l2304FA9C;
		}
		word32 s8_1537;
		word32 s5_1535;
		word32 s6_1536;
		word32 s4_1534;
		word32 a5_1533;
		word32 s1_1532;
		ra_428 = bt_conn_set_state(ra_159, s1_597, a0_590, 0x00, a3_593, a4_594, mstatus, dwLoc28_942, s2, s0, dwLoc0C, dwLoc08, dwArg08, dwArg68, dwArg78, dwArg8C, dwArgA8, dwArgE8, out s0_446, out s1_1532, out a3_424, out a4_450, out a5_1533, out s2_432, out s3_433, out s4_1534, out s5_1535, out s6_1536, out s8_1537, out mstatus_445);
l2304FA72:
		Eq_2 a3_702;
		Eq_2 a4_703;
		Eq_2 a5_704;
		bt_conn_unref(s0_446, a3_424, a4_450, mstatus_445, out a3_702, out a4_703, out a5_704);
		word32 s4_1596;
		word32 s6_1598;
		word32 s7_1599;
		word32 s9_1601;
		word32 mstatus_1602;
		word32 s8_1600;
		word32 s5_1597;
		word32 s3_1595;
		word32 s2_1594;
		word32 a4_1592;
		word32 a5_1593;
		word32 s1_1589;
		word32 a3_1591;
		word32 a0_1590;
		word32 s0_1588;
		bt_le_scan_update(ra_428, s0_446, a3_702, a4_703, a5_704, s2_432, s3_433, mstatus_445, dwLoc30, dwLoc2C, dwLoc28_942, s4, s2, s0, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg48, dwArg4C, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_1588, out s1_1589, out a0_1590, out a3_1591, out a4_1592, out a5_1593, out s2_1594, out s3_1595, out s4_1596, out s5_1597, out s6_1598, out s7_1599, out s8_1600, out s9_1601, out mstatus_1602);
l2304FA9C:
		0x00 = (int8) dwArg0128;
		return;
	}
	Eq_2 a3_111;
	Eq_2 s0_66 = (word32) s1_38 + 4;
	word32 a4_1486;
	word32 a5_1487;
	bt_addr_le_copy(fp + -40, s0_66, out a4_1486, out a5_1487);
	uint32 a5_86 = (word32) bLoc28 + ~0x01 & 0x00FF;
	if (a5_86 <= 0x01)
	{
		word32 a7_1504;
		word32 a5_1502;
		word32 a6_1503;
		word32 a2_1500;
		word32 a4_1501;
		word32 a1_1499;
		memcpy(fp + -47, (word32) s1_38 + 0x0011, 0x06, out a1_1499, out a2_1500, out a3_111, out a4_1501, out a5_1502, out a6_1503, out a7_1504);
		dwLoc28_942 = SEQ(nLoc27, (byte) a5_86);
		dwLoc30 = SEQ(nLoc2F_1242, 0x01);
	}
	else
	{
		word32 a4_1497;
		word32 a5_1498;
		a3_111 = bt_addr_le_copy(fp + -48, s0_66, out a4_1497, out a5_1498);
	}
	Eq_2 a0_125;
	word32 a4_1617;
	word32 s4_135;
	Eq_2 s3_134;
	struct Eq_281903 * s2_133;
	Eq_2 a3_128;
	Eq_2 s1_132 = find_pending_connect(fp + -40, a3_111, mstatus, out a0_125, out a3_128, out a4_1617, out s2_133, out s3_134, out s4_135);
	Eq_2 a4_141 = (word32) *((word32) s1_132 + 3);
	Eq_2 s0_143 = a0_125;
	if (a4_141 == 0x01)
	{
		word32 a2_1507;
		word32 a5_1509;
		word32 s8_1510;
		word32 a4_1508;
		word32 a1_1506;
		word32 a0_1505;
		s1_132 = atomic_and(a0_125, -65, a3_128, a4_141, mstatus, out a0_1505, out a1_1506, out a2_1507, out a3_128, out a4_1508, out a5_1509, out s4_135, out s8_1510);
		if (a0_125 == 0x00)
		{
			Eq_2 a0_160;
			word32 a4_1511;
			ra_159 = bt_conn_add_le(ra_159, mstatus, dwArg44, dwArg78, dwArg98, dwArgD8, out s1_132, out a0_160, out a3_128, out a4_1511, out s2_133, out s3_134, out s4_135);
			s0_143 = a0_160;
		}
	}
	if ((word32) *((word32) s1_132 + 3) == 0x00)
	{
		if (s0_143 != 0x00)
		{
l2304FB38:
			*s0_143 = (word16) s4_135;
			word32 a5_1539;
			word32 a4_1538;
			Eq_2 a3_229 = bt_addr_le_copy((word32) s0_143 + 112, fp + -40, out a4_1538, out a5_1539);
			((word32) s0_143 + 0x0086)->u2 = (word16) ((word32) *((word32) s1_132 + 24) << 8 | (word32) (*((word32) s1_132 + 23)));
			*((word32) s0_143 + 0x008C) = (word16) ((word32) *((word32) s1_132 + 26) << 8 | (word32) (*((word32) s1_132 + 25)));
			((word32) s0_143 + 0x008E)->u2 = (word16) ((word32) *((word32) s1_132 + 28) << 8 | (word32) (*((word32) s1_132 + 27)));
			word32 a5_257 = (word32) *((word32) s1_132 + 3);
			*((word32) s0_143 + 0x0C) = 0x00;
			*((word32) s0_143 + 3) = (byte) a5_257;
			Eq_2 a4_258 = 0x01;
			if (a5_257 == 0x01)
			{
				word32 a5_1542;
				word32 a4_1541;
				bt_addr_le_copy((word32) s0_143 + 0x0077, fp + -48, out a4_1541, out a5_1542);
				word32 a5_1543;
				a3_229 = bt_addr_le_copy((word32) s0_143 + 0x007E, s2_133 + ((word32) (*((word32) s0_143 + 8)) + 0x07) / 0x0080, out a4_258, out a5_1543);
				word32 a2_1544;
				if (atomic_test_bit(s3_134, 0x09, out a2_1544) != 0x00)
				{
					int32 a5_305 = s2_133->dw007C;
					if ((a5_305 & 64) != 0x00)
					{
						word32 a0_1545;
						word32 s4_1547;
						word32 s5_1548;
						word32 s7_1550;
						word32 s6_1549;
						word32 a5_1546;
						ra_159 = set_advertise_enable(ra_159, s1_132, a3_229, a4_258, a5_305 & 64, mstatus, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg44, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_143, out s1_132, out a0_1545, out a3_229, out a4_258, out a5_1546, out s2_133, out s3_134, out s4_1547, out s5_1548, out s6_1549, out s7_1550, out mstatus);
					}
				}
			}
			if ((word32) *((word32) s0_143 + 3) == 0x00)
			{
				word32 a2_1576;
				if (atomic_test_bit(s3_134, 0x0F, out a2_1576) != 0x00)
				{
					*((word32) s0_143 + 8) = 0x00;
					word32 a2_1582;
					word32 a5_1585;
					word32 s8_1587;
					word32 s4_1586;
					word32 a4_1584;
					word32 a3_1583;
					word32 a0_1580;
					word32 a1_1581;
					s1_132 = atomic_and(s0_143, ~0x08000000, a3_229, a4_258, mstatus, out a0_1580, out a1_1581, out a2_1582, out a3_1583, out a4_1584, out a5_1585, out s4_1586, out s8_1587);
				}
				word32 a5_1578;
				word32 a4_1577;
				bt_addr_le_copy((word32) s0_143 + 0x007E, fp + -48, out a4_1577, out a5_1578);
				word32 a5_1579;
				a3_229 = bt_addr_le_copy((word32) s0_143 + 0x0077, s2_133 + ((word32) (*((word32) s0_143 + 8)) + 0x07) / 0x0080, out a4_258, out a5_1579);
			}
			struct Eq_282181 * s1_429;
			word32 a4_1570;
			word32 s5_1573;
			word32 s8_1575;
			word32 s6_1574;
			word32 s4_1572;
			word32 a5_1571;
			ra_428 = bt_conn_set_state(ra_159, s1_132, s0_143, 0x04, a3_229, a4_258, mstatus, dwLoc28_942, s2, s0, dwLoc0C, dwLoc08, dwArg08, dwArg68, dwArg78, dwArg8C, dwArgA8, dwArgE8, out s0_446, out s1_429, out a3_424, out a4_1570, out a5_1571, out s2_432, out s3_433, out s4_1572, out s5_1573, out s6_1574, out s8_1575, out mstatus_445);
			a4_450 = (word32) *((word32) s0_446 + 0x0D);
			if (a4_450 != 0x04)
				goto l2304FA72;
			Eq_2 a5_452 = (word32) s1_429->b0003;
			if (a5_452 != 0x00)
			{
				ui32 a5_453 = (word32) *((word32) s2_432 + 112);
				a5_452 = a5_453 & 0x08;
				if ((a5_453 & 0x08) == 0x00)
				{
l2304FC4E:
					a4_450 = (word32) *((word32) s0_446 + 3);
					if (a4_450 == 0x01)
						s0_446 = slave_update_conn_param(s0_446, a3_424, a4_450, mstatus_445, dwLoc2C, dwLoc28_942, dwLoc0C, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out a3_424, out a4_450, out s2_432, out s3_433);
					goto l2304FA72;
				}
			}
			Eq_2 a4_468;
			word32 s5_1607;
			word32 s8_1609;
			word32 s6_1608;
			word32 a5_1605;
			word32 s4_1606;
			word32 s1_1603;
			word32 a1_1604;
			ra_428 = bt_hci_cmd_create(ra_428, 0x02, a3_424, a4_450, a5_452, mstatus_445, ra, dwArg78, dwArgB8, dwArgD8, out s0_446, out s1_1603, out a1_1604, out a3_424, out a4_468, out a5_1605, out s2_432, out s3_433, out s4_1606, out s5_1607, out s6_1608, out s8_1609, out mstatus_445);
			if (true)
			{
				word32 a1_1610;
				word32 a5_1611;
				Eq_2 a0_523 = net_buf_simple_add(0x0200001E, 0x02, a4_468, out a1_1610, out a5_1611);
				uint32 a5_526 = (word32) *s0_446;
				*a0_523 = (byte) a5_526;
				*((word32) a0_523 + 1) = (byte) (a5_526 >> 8);
				word32 s5_1616;
				word32 a0_1613;
				word32 s4_1615;
				word32 a5_1614;
				word32 s1_1612;
				ra_428 = bt_hci_cmd_send(ra_428, s0_446, (word32) s2_432 + 22, 0x02000016, a3_424, a4_468, a5_526 >> 8, s2_432, mstatus_445, dwLoc2C, dwLoc28_942, dwLoc18, dwArg08, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg48, dwArg54, s5, ra, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s1_1612, out a0_1613, out a3_424, out a4_450, out a5_1614, out s2_432, out s3_433, out s4_1615, out s5_1616, out mstatus_445);
				goto l2304FA72;
			}
			goto l2304FC4E;
		}
		Eq_2 a0_193;
		word32 a4_1540;
		ra_159 = bt_conn_add_le(ra_159, mstatus, dwArg44, dwArg78, dwArg98, dwArgD8, out s1_132, out a0_193, out a3_128, out a4_1540, out s2_133, out s3_134, out s4_135);
		s0_143 = a0_193;
	}
	if (s0_143 == 0x00)
	{
		word32 a7_1558;
		word32 s11_1568;
		word32 t4_1569;
		word32 s4_1561;
		word32 s6_1563;
		word32 s7_1564;
		word32 s9_1566;
		word32 s10_1567;
		word32 s8_1565;
		word32 s5_1562;
		word32 s3_1560;
		word32 s2_1559;
		word32 a3_1555;
		word32 a5_1557;
		word32 a4_1556;
		word32 a2_1554;
		word32 a0_1552;
		word32 a1_1553;
		word32 s1_1551;
		printf(ra_159, &g_t230BB2A8, a3_128, dwLoc28_942, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_1551, out a0_1552, out a1_1553, out a2_1554, out a3_1555, out a4_1556, out a5_1557, out a7_1558, out s2_1559, out s3_1560, out s4_1561, out s5_1562, out s6_1563, out s7_1564, out s8_1565, out s9_1566, out s10_1567, out s11_1568, out t4_1569);
		goto l2304FA9C;
	}
	goto l2304FB38;
}

// 2304FC60: void le_enh_conn_complete(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void le_enh_conn_complete(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	enh_conn_complete(ra, s0, a3, a4, s2, s4, s5, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg54, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148);
}

// 2304FC66: void le_legacy_conn_complete(Register Eq_2 ra, Register (ptr32 Eq_282470) s0, Register Eq_2 s1, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void le_legacy_conn_complete(Eq_2 ra, struct Eq_282470 * s0, Eq_2 s1, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	word16 wLoc32_335 = SLICE(dwLoc34, word16, 16);
	uint32 a5_28 = (word32) s0->b000C << 8 | (word32) s0->b000B;
	uint32 a5_35 = (word32) s0->b000E << 8 | (word32) s0->b000D;
	uint32 a5_42 = (word32) s0->b0010 << 8 | (word32) s0->b000F;
	byte bLoc13_226 = (byte) (word32) s0->b0011;
	word32 a5_361;
	word32 a4_360;
	bt_addr_le_copy(fp + -44, &s0->b0003 + 1, out a4_360, out a5_361);
	word32 a7_368;
	word32 a5_366;
	word32 a6_367;
	word32 a3_364;
	word32 a4_365;
	word32 a1_362;
	word32 a2_363;
	memcpy(fp + -37, fp + -64, 0x06, out a1_362, out a2_363, out a3_364, out a4_365, out a5_366, out a6_367, out a7_368);
	Eq_2 a0_82 = 0x00;
	Eq_2 dwLoc18_250 = SEQ((byte) a5_42, (byte) (a5_35 >> 8), (byte) a5_35, (byte) (a5_28 >> 8));
	Eq_2 dwLoc14_263 = SEQ(wLoc12, bLoc13_226, (byte) (a5_42 >> 8));
	Eq_2 dwLoc3C_229 = SEQ(wLoc3A, 0x00);
	Eq_2 dwLoc1C_283 = SEQ((byte) a5_28, nLoc1C);
	if ((word32) s0->b0003 == 0x01)
		a0_82 = (word32) g_b4200DD68;
	Eq_2 a3_124;
	Eq_2 a4_119;
	Eq_2 dwLoc2C_340;
	Eq_2 a0_88;
	Eq_2 s1_98;
	Eq_2 s2_99;
	Eq_2 s4_101;
	Eq_2 s5_102;
	word32 s8_370;
	word32 s3_369;
	Eq_2 ra_97 = bt_lookup_id_addr(ra, a0_82, fp + -44, out s1_98, out a0_88, out s2_99, out s3_369, out s4_101, out s5_102, out s8_370);
	if (a0_88 != s1_98)
	{
		word32 a6_381;
		word32 a7_382;
		word32 a4_379;
		word32 a5_380;
		word32 a2_377;
		word32 a3_378;
		word32 a1_376;
		memcpy(fp + -31, fp + -43, 0x06, out a1_376, out a2_377, out a3_378, out a4_379, out a5_380, out a6_381, out a7_382);
		word32 a5_383;
		a3_124 = bt_addr_le_copy(s1_98, a0_88, out a4_119, out a5_383);
		dwLoc2C_340 = SEQ(nLoc2B, (byte) ((word32) bLoc2C + 0x02));
	}
	else
	{
		word32 a7_375;
		word32 a6_374;
		word32 a2_372;
		word32 a5_373;
		word32 a1_371;
		memcpy(fp + -31, fp + -56, 0x06, out a1_371, out a2_372, out a3_124, out a4_119, out a5_373, out a6_374, out a7_375);
		dwLoc3C_229.u0 = 0x00;
		dwLoc34 = SEQ(wLoc32_335, 0x00);
	}
	enh_conn_complete(ra_97, a0_88, a3_124, a4_119, s2_99, s4_101, s5_102, mstatus, 0x00, dwLoc3C_229, dwLoc38, dwLoc34, dwLoc2C_340, dwLoc28, dwLoc20, dwLoc1C_283, dwLoc18_250, dwLoc14_263, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg48, dwArg4C, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108);
}

