pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304FD62: void hci_tx_thread(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack word32 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void hci_tx_thread(Eq_2 ra, Eq_2 s0, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, word32 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	ui32 s4_148 = ~0x0F000000;
	Eq_2 s7_151 = 0x4200DE4C;
	ra_125 = ra;
	s2_109 = s2;
	s3_113 = s3;
	while (true)
	{
		Eq_2 s3_113;
		Eq_2 s2_109;
		Eq_2 ra_125;
		Eq_2 s1_38 = *((byte) a5.u0 + 0x0C);
		(a5 & s4_148)->t000C = s1_38;
		Eq_2 a4_53;
		Eq_282782 a5_54;
		Eq_2 s0_56;
		Eq_2 s1_57;
		ptr32 mstatus_64;
		word32 a0_82;
		Eq_2 s1_126;
		Eq_2 a3_128;
		Eq_2 s8_152;
		Eq_2 s0_142;
		Eq_2 a4_122;
		ra_125 = k_poll(bt_conn_prepare_events(ra_125, s1_38, s7_151, s2_109, s3_113, mstatus, s6, s0, dwLoc18, dwArg08, dwArg10, dwArg14, dwArg18, dwArg28, dwArg44, dwArg48, s5, s3, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_56, out s1_57, out a4_53, out a5_54, out mstatus_64), s0_56, s1_57, ~0x00, a4_53, a5_54, mstatus_64, dwArgA8, dwArgAC, dwArgE8, dwArgF8, out s0_142, out s1_126, out a0_82, out a3_128, out a4_122, out a5, out s3_113, out s4_148, out s7_151, out s8_152);
		if (a0_82 != 0x00)
			user_vAssertCalled(a4_122, mstatus_64, out a5);
		s2_109 = s1_126;
		Eq_2 s5_110 = 0x4200DDF8;
		word32 s9_111 = 0x230BB000;
		Eq_2 s6_112 = 0x4201592C;
		mstatus = mstatus_64;
		while (s3_113 != 0x00)
		{
			a5.u0 = 0x02;
			ui32 a1_119 = *((word32) s2_109 + 0x0C) >> 0x0C & 0x0F;
			if (a1_119 != 0x02)
			{
				a5.u0 = 0x04;
				if (a1_119 != 0x04)
				{
					if (a1_119 != 0x00)
					{
						word32 a1_848;
						word32 s10_851;
						word32 a0_847;
						word32 s11_852;
						word32 t4_853;
						word32 a7_850;
						word32 a2_849;
						ra_125 = printf(ra_125, &g_t230BB438, a3_128, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_126, out a0_847, out a1_848, out a2_849, out a3_128, out a4_122, out a5, out a7_850, out s2_109, out s3_113, out s4_148, out s5_110, out s6_112, out s7_151, out s8_152, out s9_111, out s10_851, out s11_852, out t4_853);
					}
				}
				else
				{
					a5 = (word32) *((word32) s2_109 + 0x0C);
					if (a5 == 0x00)
					{
						Eq_2 a0_166;
						Eq_2 a3_169;
						Eq_2 a4_170;
						word32 s3_856;
						word32 s2_855;
						word32 s8_858;
						word32 s4_857;
						word32 a1_854;
						Eq_2 a5_171;
						Eq_2 a2_168;
						net_buf_get(ra_125, s0_142, s8_152, 0x00, a3_128, a4_122, mstatus, dwArg08, dwArgB8, dwArgF8, out a0_166, out a1_854, out a2_168, out a3_169, out a4_170, out a5_171, out s2_855, out s3_856, out s4_857, out s8_858);
						Eq_2 s10_186 = a0_166;
						if (a0_166 == 0x00)
							a2_168 = user_vAssertCalled(a4_170, mstatus, out a5_171);
						word32 a1_860;
						word32 a0_859;
						word32 a5_861;
						s0_142 = k_sem_take((word32) s0_142 + 0x0098, ~0x00, a2_168, a3_169, a4_170, a5_171, mstatus, s0, ra, dwArgD8, dwArg0118, out s1_126, out a0_859, out a1_860, out a3_128, out a4_122, out a5_861, out s2_109, out s3_113, out s4_148, out s8_152);
						if (*((word32) s0_142 + 0x00A4) != 0x00)
						{
							Eq_2 a1_221;
							Eq_2 a4_224;
							Eq_2 s1_227;
							word32 a1_876;
							word32 a0_875;
							word32 s6_871;
							word32 s2_867;
							word32 a2_863;
							word32 a5_878;
							word32 a2_877;
							word32 t4_874;
							word32 s8_872;
							word32 s11_873;
							word32 s5_870;
							word32 s3_868;
							word32 s4_869;
							word32 a7_866;
							word32 a3_864;
							word32 a5_865;
							word32 a0_862;
							ra_125 = net_buf_unref(printf(ra_125, &g_t230BB418, a3_128, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_227, out a0_862, out a1_221, out a2_863, out a3_864, out a4_224, out a5_865, out a7_866, out s2_867, out s3_868, out s4_869, out s5_870, out s6_871, out s7_151, out s8_872, out s9_111, out s10_186, out s11_873, out t4_874), s1_227, *((word32) s0_142 + 0x00A4), a1_221, a4_224, mstatus, s10, s8, s6, dwLoc08, dwArg48, s7, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_142, out s1_126, out a0_875, out a1_876, out a2_877, out a3_128, out a4_122, out a5_878, out s2_109, out s3_113, out s4_148, out s5_110, out s6_112, out s8_152, out mstatus);
							*((word32) s0_142 + 0x00A4) = 0x00;
						}
						net_buf_ref(s10_186);
						*((word32) s0_142 + 0x00A4) = s10_186;
						a5 = bt_send();
						if (s10_186 != 0x00)
						{
							word32 a0_914;
							word32 a4_910;
							Eq_2 a5_285;
							Eq_2 a3_289;
							Eq_2 a4_290;
							Eq_2 s5_299;
							Eq_2 s1_317;
							int32 s6_322;
							Eq_2 s10_332;
							Eq_2 a4_350;
							struct Eq_283047 * s0_352;
							Eq_2 s1_353;
							Eq_2 a1_360;
							Eq_2 s10_364;
							Eq_2 a1_377;
							Eq_2 a4_380;
							ptr32 mstatus_384;
							struct Eq_283054 * s0_386;
							Eq_2 s1_387;
							word32 s2_918;
							word32 s0_894;
							word32 s5_921;
							word32 a5_917;
							word32 a5_913;
							word32 a3_909;
							word32 s7_905;
							word32 s2_901;
							word32 a2_897;
							word32 t4_893;
							word32 s6_887;
							word32 a7_883;
							word32 s1_879;
							word32 s6_922;
							word32 s8_923;
							word32 s4_920;
							word32 s3_919;
							word32 a3_916;
							word32 a2_915;
							word32 a3_912;
							word32 a5_911;
							word32 s11_908;
							word32 s8_906;
							word32 s9_907;
							word32 s5_904;
							word32 s3_902;
							word32 s4_903;
							word32 a5_900;
							word32 a3_898;
							word32 a4_899;
							word32 a1_896;
							word32 a0_895;
							word32 s11_892;
							word32 s7_888;
							word32 s8_889;
							word32 s9_890;
							word32 s10_891;
							word32 s4_886;
							word32 s2_884;
							word32 s3_885;
							word32 a2_882;
							word32 a0_880;
							word32 a1_881;
							Eq_2 ra_385 = net_buf_unref(hci_cmd_done(k_sem_give(printf(ra_125, s9_111 + -844, a3_128, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_879, out a0_880, out a1_881, out a2_882, out a3_289, out a4_290, out a5_285, out a7_883, out s2_884, out s3_885, out s4_886, out s5_299, out s6_887, out s7_888, out s8_889, out s9_890, out s10_891, out s11_892, out t4_893), s5_299, a3_289, a4_290, a5_285, mstatus, s0, dwLoc18, dwArg30, dwArg34, s5, ra, dwArg7C, dwArgD8, dwArg0118, dwArg0158, out s0_894, out s1_317, out a0_895, out a1_896, out a2_897, out a3_898, out a4_899, out a5_900, out s2_901, out s3_902, out s4_903, out s5_904, out s6_322, out s7_905, out s8_906, out s9_907, out s10_332, out s11_908), s1_317, (word32) ((char *) net_buf_id(s10_332, out a3_909, out a4_910, out a5_911) + 0x0C + s6_322)[2], 0x1F, 0x00, mstatus, s6, s0, dwLoc18, dwLoc08, dwArg10, dwArg14, dwArg38, dwArg40, dwArg44, s5, s3, ra, dwArg68, dwArg7C, dwArg8C, dwArgD8, dwArgF8, dwArg0118, dwArg0158, out s0_352, out s1_353, out a1_360, out a3_912, out a4_350, out a5_913, out s7_151, out s9_111, out s10_364), s1_353, s0_352->t00A4, a1_360, a4_350, mstatus, s10, s8, s6, dwLoc08, dwArg48, s7, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_386, out s1_387, out a0_914, out a1_377, out a2_915, out a3_916, out a4_380, out a5_917, out s2_918, out s3_919, out s4_920, out s5_921, out s6_922, out s8_923, out mstatus_384);
							s0_386->dw00A4 = 0x00;
							word32 a1_925;
							word32 a2_926;
							word32 a0_924;
							ra_125 = net_buf_unref(ra_385, s1_387, s10_364, a1_377, a4_380, mstatus_384, s10, s8, s6, dwLoc08, dwArg48, s7, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_142, out s1_126, out a0_924, out a1_925, out a2_926, out a3_128, out a4_122, out a5, out s2_109, out s3_113, out s4_148, out s5_110, out s6_112, out s8_152, out mstatus);
						}
					}
					else
					{
						a4_122.u0 = 0x01;
						if (a5 == 0x01)
							ra_125 = bt_conn_process_tx(ra_125, s1_126, (word32) *((word32) s2_109 + 16) - 52, a3_128, 0x01, s2_109, s3_113, s5_110, s6_112, mstatus, s10, s8, s6, s2, s0, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg48, dwArg4C, s7, s5, ra, dwArg68, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s0_142, out s1_126, out a3_128, out a4_122, out a5, out s2_109, out s3_113, out s4_148, out s5_110, out s6_112, out s7_151, out s8_152, out s9_111, out mstatus);
					}
				}
			}
			s2_109 = (word32) s2_109 + 20;
			s3_113 = (word32) s3_113 - 1;
		}
		k_yield();
	}
}

