pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2304FEA6: Register Eq_2 bt_recv(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      recv_thread
Eq_2 bt_recv(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, union Eq_2 & s0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & mstatusOut)
{
	ptr32 a4_108;
	ptr32 a3_107;
	Eq_2 s0_114;
	Eq_2 ra_113;
	ptr32 mstatus_112;
	Eq_2 a4_226;
	Eq_2 a1_223;
	Eq_2 s1_229;
	Eq_2 ra_228;
	up32 a1_13 = (word32) *((word32) a0 + 20);
	Eq_2 s0_15 = a0;
	if (a1_13 != 0x01)
	{
		if (a1_13 != 0x03)
		{
			Eq_2 a1_84;
			Eq_2 a4_87;
			Eq_2 s1_90;
			word32 s8_546;
			word32 s6_545;
			word32 s5_544;
			word32 s4_543;
			word32 s3_542;
			word32 s2_541;
			word32 a5_540;
			word32 a2_539;
			word32 a1_538;
			word32 a0_537;
			word32 s1_536;
			word32 t4_535;
			word32 s11_534;
			word32 s10_533;
			word32 s9_532;
			word32 s8_531;
			word32 s7_530;
			word32 s6_529;
			word32 s5_528;
			word32 s4_527;
			word32 s3_526;
			word32 s2_525;
			word32 a7_524;
			word32 a5_523;
			word32 a3_522;
			word32 a2_521;
			word32 a0_520;
			ra_113 = net_buf_unref(printf(ra, &g_t230BB274, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_90, out a0_520, out a1_84, out a2_521, out a3_522, out a4_87, out a5_523, out a7_524, out s2_525, out s3_526, out s4_527, out s5_528, out s6_529, out s7_530, out s8_531, out s9_532, out s10_533, out s11_534, out t4_535), s1_90, a0, a1_84, a4_87, mstatus, dwLoc20, dwLoc1C, s2, dwArg08, dwArg58, dwArg64, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_114, out s1_536, out a0_537, out a1_538, out a2_539, out a3_107, out a4_108, out a5_540, out s2_541, out s3_542, out s4_543, out s5_544, out s6_545, out s8_546, out mstatus_112);
			goto l2304FF52;
		}
		if (a1_13 >= (word32) (*((word32) a0 + 0x0C)))
		{
			word32 a5_550;
			user_vAssertCalled(a4, mstatus, out a5_550);
		}
		word32 a5_549;
		word32 a4_548;
		word32 a1_547;
		Eq_2 a0_136 = net_buf_simple_pull_mem((word32) a0 + 8, 0x04, out a1_547, out a4_548, out a5_549);
		ui32 a2_145 = (word32) *((word32) a0_136 + 3) << 8 | (word32) (*((word32) a0_136 + 2));
		ui32 a1_148 = (word32) *((word32) a0 + 0x0C);
		Eq_2 a0_151 = (word32) (word12) ((word32) *((word32) a0_136 + 1) << 8 | (word32) (*a0_136));
		*((word32) a0 + 22) = (word16) a0_151;
		((word32) a0 + 21)->u0 = ~0x00;
		if (a2_145 != a1_148)
		{
			word32 a2_560;
			word32 a7_563;
			word32 a5_562;
			word32 s3_565;
			word32 s2_564;
			word32 s5_567;
			word32 s4_566;
			word32 s7_569;
			word32 s6_568;
			word32 s8_570;
			word32 a3_561;
			word32 a0_559;
			word32 s9_571;
			word32 s10_572;
			word32 s11_573;
			word32 t4_574;
			ra_228 = printf(ra, &g_t230BB228, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_229, out a0_559, out a1_223, out a2_560, out a3_561, out a4_226, out a5_562, out a7_563, out s2_564, out s3_565, out s4_566, out s5_567, out s6_568, out s7_569, out s8_570, out s9_571, out s10_572, out s11_573, out t4_574);
		}
		else
		{
			Eq_2 a0_157;
			Eq_2 s1_161;
			Eq_2 a4_167;
			Eq_2 a3_169;
			word32 s4_558;
			word32 s2_556;
			word32 s3_557;
			s0_15 = bt_conn_lookup_handle(a0_151, a3, mstatus, out s1_161, out a0_157, out a3_169, out a4_167, out s2_556, out s3_557, out s4_558);
			if (a0_157 != 0x00)
			{
				*((word32) s0_15 + 21) = (byte) bt_conn_index(a0_157);
				Eq_2 a3_183;
				Eq_2 a4_184;
				ra_113 = bt_conn_recv(ra, s1_161, a0_157, s0_15, s1_161 >> 0x0C, a3_169, a4_167, a0_157, mstatus, dwLoc20, dwLoc1C, s2, dwLoc10, dwLoc0C, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg30, dwArg34, dwArg38, dwArg40, dwArg54, dwArg58, dwArg64, s1, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out s0_114, out a3_183, out a4_184, out mstatus_112);
				word32 a5_575;
				bt_conn_unref(s0_114, a3_183, a4_184, mstatus_112, out a3_107, out a4_108, out a5_575);
				goto l2304FF50;
			}
			word32 a0_576;
			word32 a2_577;
			word32 a3_578;
			word32 a5_579;
			word32 a7_580;
			word32 s2_581;
			word32 s3_582;
			word32 s4_583;
			word32 s5_584;
			word32 s6_585;
			word32 s7_586;
			word32 s8_587;
			word32 s9_588;
			word32 s10_589;
			word32 s11_590;
			word32 t4_591;
			ra_228 = printf(ra, &g_t230BB250, a3_169, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_229, out a0_576, out a1_223, out a2_577, out a3_578, out a4_226, out a5_579, out a7_580, out s2_581, out s3_582, out s4_583, out s5_584, out s6_585, out s7_586, out s8_587, out s9_588, out s10_589, out s11_590, out t4_591);
		}
	}
	else
	{
		if (a1_13 >= (word32) (*((word32) a0 + 0x0C)))
		{
			word32 a5_554;
			user_vAssertCalled(a4, mstatus, out a5_554);
		}
		word32 a5_553;
		word32 a4_552;
		word32 a1_551;
		Eq_2 a0_24 = net_buf_simple_pull_mem((word32) a0 + 8, 0x02, out a1_551, out a4_552, out a5_553);
		up32 a4_29 = (word32) *a0_24;
		if (a4_29 <= 0x1A && (0x01 << a4_29 & 0x0408C000) != 0x00)
		{
			word32 a5_555;
			user_vAssertCalled(0x0408C000, mstatus, out a5_555);
			dwArg64 = a0_24;
		}
		ra_228 = handle_event(ra, (word32) *a0_24, a0, 0x230BB580, 0x05, dwLoc20, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s0_15, out s1_229, out a1_223, out a4_226);
	}
	word32 s1_592;
	word32 a0_593;
	word32 a1_594;
	word32 a2_595;
	word32 a5_596;
	word32 s2_597;
	word32 s3_598;
	word32 s4_599;
	word32 s5_600;
	word32 s6_601;
	word32 s8_602;
	ra_113 = net_buf_unref(ra_228, s1_229, s0_15, a1_223, a4_226, mstatus, dwLoc20, dwLoc1C, s2, dwArg08, dwArg58, dwArg64, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_114, out s1_592, out a0_593, out a1_594, out a2_595, out a3_107, out a4_108, out a5_596, out s2_597, out s3_598, out s4_599, out s5_600, out s6_601, out s8_602, out mstatus_112);
l2304FF52:
	s0Out = s0_114;
	a3Out = a3_107;
	a4Out = a4_108;
	mstatusOut = mstatus_112;
	return ra_113;
}

// 2304FFC0: void bt_recv_prio(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void bt_recv_prio(Eq_2 ra, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	Eq_2 a4_9 = (word32) *((word32) a0 + 20);
	if (a4_9 != 0x01)
	{
		word32 a5_223;
		user_vAssertCalled(a4_9, mstatus, out a5_223);
	}
	Eq_2 a4_17 = (word32) *((word32) a0 + 0x0C);
	if (a4_17 <= 0x01)
	{
		word32 a5_227;
		user_vAssertCalled(a4_17, mstatus, out a5_227);
	}
	word32 a4_225;
	word32 a5_226;
	word32 a1_224;
	Eq_2 a0_25 = net_buf_simple_pull_mem((word32) a0 + 8, 0x02, out a1_224, out a4_225, out a5_226);
	Eq_2 a4_30 = (word32) *a0_25;
	if (a4_30 <= 0x1A)
	{
		a4_30.u0 = 0x0408C000;
		if ((0x01 << a4_30 & 0x0408C000) != 0x00)
		{
l2305000E:
			Eq_2 a1_62;
			Eq_2 a4_65;
			Eq_2 s0_70;
			Eq_2 s1_71;
			word32 mstatus_243;
			word32 s4_239;
			word32 s6_241;
			word32 s8_242;
			word32 s5_240;
			word32 a4_235;
			word32 s2_237;
			word32 s3_238;
			word32 a5_236;
			word32 a0_231;
			word32 a2_233;
			word32 a3_234;
			word32 a1_232;
			word32 s0_229;
			word32 s1_230;
			net_buf_unref(handle_event(ra, (word32) *a0_25, a0, 587969960, 0x04, dwLoc20, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s0_70, out s1_71, out a1_62, out a4_65), s1_71, s0_70, a1_62, a4_65, mstatus, dwLoc20, dwLoc1C, dwLoc18, dwArg08, dwArg58, dwArg64, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_229, out s1_230, out a0_231, out a1_232, out a2_233, out a3_234, out a4_235, out a5_236, out s2_237, out s3_238, out s4_239, out s5_240, out s6_241, out s8_242, out mstatus_243);
			return;
		}
	}
	word32 a5_228;
	user_vAssertCalled(a4_30, mstatus, out a5_228);
	dwArg64 = a0_25;
	goto l2305000E;
}

// 23050032: Register word32 bt_hci_driver_register(Register Eq_2 a3)
// Called from:
//      hci_driver_init
word32 bt_hci_driver_register(Eq_2 a3)
{
	if (g_ptr4200DE14 == null && a3 != 0x00)
	{
		struct Eq_278945 * a0_11 = *((word32) a3 + 16);
		if (a3 != 0x00)
			g_ptr4200DE14 = a0_11;
	}
	return 0x4200DD60;
}

// 2305005A: Register Eq_2 bt_finalize_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_283744 s0Out, Register out (ptr32 Eq_283745) s1Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      init_work
Eq_2 bt_finalize_init(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_283744 & s0Out, struct Eq_283745 & s1Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 a3_16;
	Eq_2 a4_17;
	Eq_2 a5_18;
	word32 a0_100;
	word32 a1_101;
	word32 a2_102;
	word32 s4_103;
	word32 s8_104;
	atomic_or(s0, 0x02, a3, a4, mstatus, out a0_100, out a1_101, out a2_102, out a3_16, out a4_17, out a5_18, out s4_103, out s8_104);
	ptr32 mstatus_36;
	struct Eq_283745 * s1_38;
	ptr32 s2_41;
	ptr32 s5_44;
	Eq_283744 s0_56;
	word32 a0_105;
	word32 a3_106;
	word32 a4_107;
	word32 a5_108;
	word32 s3_109;
	word32 s4_110;
	word32 s6_111;
	word32 s7_112;
	word32 s8_113;
	word32 s9_114;
	Eq_2 ra_37 = bt_le_scan_update(ra, s0, a3_16, a4_17, a5_18, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg54, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s0_56, out s1_38, out a0_105, out a3_106, out a4_107, out a5_108, out s2_41, out s3_109, out s4_110, out s5_44, out s6_111, out s7_112, out s8_113, out s9_114, out mstatus_36);
	s0Out = s0_56;
	s1Out = s1_38;
	s2Out = s2_41;
	s5Out = s5_44;
	mstatusOut = mstatus_36;
	return ra_37;
}

// 23050076: Register Eq_2 bt_delete_queue(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_disable
Eq_2 bt_delete_queue(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 s0_11 = a0;
	ra_12 = ra;
	while (true)
	{
		Eq_2 ra_12;
		Eq_2 a0_20;
		Eq_2 a1_21;
		Eq_2 a3_23;
		Eq_2 a4_24;
		Eq_2 a5_25;
		word32 a2_170;
		word32 s2_171;
		word32 s3_172;
		word32 s4_173;
		word32 s8_174;
		Eq_2 s1_28 = net_buf_get(ra_12, s0_11, a0, 0x00, a3, a4, mstatus, dwArg28, dwArgD8, dwArg0118, out a0_20, out a1_21, out a2_170, out a3_23, out a4_24, out a5_25, out s2_171, out s3_172, out s4_173, out s8_174);
		if (a0_20 == 0x00)
			break;
		word32 s8_160;
		word32 s6_159;
		word32 s5_158;
		word32 s4_157;
		word32 s3_156;
		word32 s2_155;
		word32 a5_154;
		word32 a2_153;
		word32 a1_152;
		word32 a0_151;
		word32 s1_150;
		ra_12 = net_buf_unref(ra_12, s1_28, a0_20, a1_21, a4_24, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_11, out s1_150, out a0_151, out a1_152, out a2_153, out a3, out a4, out a5_154, out s2_155, out s3_156, out s4_157, out s5_158, out s6_159, out s8_160, out mstatus);
		a0 = s0_11;
	}
	ptr32 a3_74;
	ptr32 a4_75;
	ptr32 a5_76;
	word32 s3_163;
	word32 s2_162;
	word32 s1_161;
	word32 s9_169;
	word32 s8_168;
	word32 s7_167;
	word32 s6_166;
	word32 s5_165;
	word32 s4_164;
	Eq_2 ra_78 = k_queue_free(ra_12, s0_11, a3_23, a4_24, a5_25, mstatus, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, dwArg0148, dwArg0188, out s1_161, out a3_74, out a4_75, out a5_76, out s2_162, out s3_163, out s4_164, out s5_165, out s6_166, out s7_167, out s8_168, out s9_169);
	a3Out = a3_74;
	a4Out = a4_75;
	a5Out = a5_76;
	mstatusOut = mstatus;
	return ra_78;
}

// 2305009C: Register Eq_2 bt_disable_action(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      bt_disable
Eq_2 bt_disable_action(Eq_2 ra, Eq_2 s0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & a0Out, ptr32 & a3Out)
{
	Eq_2 a3_14;
	Eq_2 a4_15;
	Eq_2 a5_16;
	Eq_2 a2_37;
	Eq_2 a3_38;
	Eq_2 a4_39;
	Eq_2 a5_40;
	Eq_2 a2_62;
	Eq_2 a3_63;
	Eq_2 a4_64;
	Eq_2 a5_65;
	Eq_2 a3_88;
	Eq_2 a4_89;
	Eq_2 a3_113;
	Eq_2 a4_114;
	ptr32 mstatus_118;
	Eq_2 a3_144;
	Eq_2 a4_145;
	ptr32 mstatus_149;
	Eq_2 a3_174;
	Eq_2 a4_175;
	Eq_2 a5_176;
	ptr32 mstatus_179;
	Eq_2 a3_204;
	Eq_2 a4_205;
	Eq_2 a3_229;
	Eq_2 a4_230;
	Eq_2 a3_255;
	Eq_2 a4_256;
	Eq_2 a3_281;
	Eq_2 a4_282;
	Eq_2 a3_306;
	word32 a2_431;
	word32 a5_432;
	word32 a5_433;
	word32 a5_434;
	word32 s1_435;
	word32 a5_436;
	word32 s2_437;
	word32 s3_438;
	word32 s4_439;
	word32 s5_440;
	word32 s6_441;
	word32 s7_442;
	word32 s8_443;
	word32 s9_444;
	word32 s1_445;
	word32 a1_446;
	word32 s2_447;
	word32 s3_448;
	word32 s5_449;
	word32 s6_450;
	word32 s7_451;
	word32 s9_452;
	word32 s10_453;
	word32 s11_454;
	word32 s1_455;
	word32 a1_456;
	word32 s2_457;
	word32 s3_458;
	word32 s5_459;
	word32 s6_460;
	word32 s7_461;
	word32 s9_462;
	word32 s10_463;
	word32 s11_464;
	word32 s1_465;
	word32 a1_466;
	word32 s2_467;
	word32 s3_468;
	word32 s5_469;
	word32 s6_470;
	word32 s7_471;
	word32 s9_472;
	word32 s10_473;
	word32 s11_474;
	word32 s1_475;
	word32 a1_476;
	word32 a4_477;
	word32 s2_478;
	word32 s3_479;
	word32 s5_480;
	word32 s6_481;
	word32 s7_482;
	word32 s9_483;
	word32 s10_484;
	word32 s11_485;
	Eq_2 ra_310 = k_sem_delete(k_sem_delete(k_sem_delete(k_sem_delete(k_queue_free(bt_delete_queue(bt_delete_queue(bt_delete_queue(k_thread_delete(k_thread_delete(k_thread_delete(ra, 0x4200F488, bt_gatt_deinit(a4, a5, mstatus, dwArg24, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a3_14, out a4_15, out a5_16), a3_14, a4_15, a5_16, mstatus, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, dwArg0108, dwArg0118, dwArg0148, dwArg0158, out a2_37, out a3_38, out a4_39, out a5_40), 0x4202660C, a2_37, a3_38, a4_39, a5_40, mstatus, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, dwArg0108, dwArg0118, dwArg0148, dwArg0158, out a2_62, out a3_63, out a4_64, out a5_65), 0x420265B4, a2_62, a3_63, a4_64, a5_65, mstatus, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, dwArg0108, dwArg0118, dwArg0148, dwArg0158, out a2_431, out a3_88, out a4_89, out a5_432), s0, 0x4200EEB4, a3_88, a4_89, mstatus, dwLoc08, dwArg08, dwArg18, dwArg58, dwArg60, dwArg78, dwArg84, dwArg88, dwArg98, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a3_113, out a4_114, out a5_433, out mstatus_118), 0x4200E000, 0x420265A8, a3_113, a4_114, mstatus_118, dwLoc08, dwArg08, dwArg18, dwArg58, dwArg60, dwArg78, dwArg84, dwArg88, dwArg98, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a3_144, out a4_145, out a5_434, out mstatus_149), 0x4200DD60, 0x4200DE08, a3_144, a4_145, mstatus_149, dwLoc08, dwArg08, dwArg18, dwArg58, dwArg60, dwArg78, dwArg84, dwArg88, dwArg98, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a3_174, out a4_175, out a5_176, out mstatus_179), 0x4200EEC0, a3_174, a4_175, a5_176, mstatus_179, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, dwArg0138, dwArg0178, out s1_435, out a3_204, out a4_205, out a5_436, out s2_437, out s3_438, out s4_439, out s5_440, out s6_441, out s7_442, out s8_443, out s9_444), &g_dw4200DDF8, a3_204, a4_205, mstatus_179, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, dwArg0138, dwArg0178, out s1_445, out a1_446, out a3_229, out a4_230, out s2_447, out s3_448, out s5_449, out s6_450, out s7_451, out s9_452, out s10_453, out s11_454), &g_dw42026644, a3_229, a4_230, mstatus_179, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, dwArg0138, dwArg0178, out s1_455, out a1_456, out a3_255, out a4_256, out s2_457, out s3_458, out s5_459, out s6_460, out s7_461, out s9_462, out s10_463, out s11_464), &g_dw42026614, a3_255, a4_256, mstatus_179, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, dwArg0138, dwArg0178, out s1_465, out a1_466, out a3_281, out a4_282, out s2_467, out s3_468, out s5_469, out s6_470, out s7_471, out s9_472, out s10_473, out s11_474), &g_t4200DDE4, a3_281, a4_282, mstatus_179, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, dwArg0138, dwArg0178, out s1_475, out a1_476, out a3_306, out a4_477, out s2_478, out s3_479, out s5_480, out s6_481, out s7_482, out s9_483, out s10_484, out s11_485);
	g_b4200F47C = 0x01;
	Eq_2 a3_335;
	Eq_2 a4_336;
	word32 a0_486;
	word32 a1_487;
	word32 a2_488;
	word32 a5_489;
	word32 s4_490;
	word32 s8_491;
	atomic_and(0x4200DD60, ~0x01, a3_306, 0x01, mstatus_179, out a0_486, out a1_487, out a2_488, out a3_335, out a4_336, out a5_489, out s4_490, out s8_491);
	Eq_2 a3_345;
	Eq_2 a4_346;
	word32 s1_351;
	Eq_2 s5_357;
	ble_controller_deinit(bl_onchiphci_interface_deinit(ra_310, 0x4200DD60, a3_335, a4_336, mstatus_179, dwLoc08, dwArg18, dwArg60, dwArg88, dwArgAC, dwArgD8, dwArg0118, dwArg0138, dwArg0178, out s1_351, out a3_345, out a4_346, out s5_357), 0x4200DD60, s1_351, a3_345, a4_346, s5_357, mstatus_179, s0, ra, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, dwArg0148, dwArg0168);
	a0Out = 0x00;
	a3Out = a3_372;
	return ra_378;
}

