pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2305014C: Register Eq_2 bt_disable(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      ble_disable
Eq_2 bt_disable(Eq_2 ra, Eq_2 s0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & a0Out, ptr32 & a3Out)
{
	Eq_2 a5_10;
	if (le_check_valid_conn(out a5_10) == 0x00)
	{
		word32 a2_175;
		if (atomic_test_bit(0x4200DDCC, 11, out a2_175) == 0x00)
		{
			word32 a2_176;
			if (atomic_test_bit(0x4200DDCC, 0x06, out a2_176) == 0x00)
			{
				ptr32 a0_34;
				ptr32 a3_37;
				Eq_2 ra_43 = bt_disable_action(ra, s0, a4, a5_10, mstatus, dwArg08, dwArg18, dwArg24, dwArg50, dwArg54, dwArg58, dwArg60, dwArg64, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, out a0_34, out a3_37);
				a0Out = a0_34;
				a3Out = a3_37;
				return ra_43;
			}
		}
	}
	a0Out = ~0x00;
	a3Out = a3;
	return ra;
}

// 23050188: Register Eq_2 bt_set_name(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      cmd_stack_ble
//      ble_set_device_name
Eq_2 bt_set_name(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	ptr32 a0_171;
	Eq_2 s1_13 = a0;
	word32 a1_299;
	word32 a2_300;
	word32 a4_301;
	word32 a5_302;
	Eq_2 a3_145;
	if (strlen(a0, out a1_299, out a2_300, out a3_145, out a4_301, out a5_302) <= 0x1D)
	{
		s0.u0 = 0x4200DD60;
		word32 a1_303;
		word32 a2_304;
		word32 a4_305;
		word32 a5_306;
		if (strcmp(1107353112, a0, out a1_303, out a2_304, out a3_145, out a4_305, out a5_306) != 0x00)
		{
			word32 a2_307;
			word32 a4_308;
			word32 a5_309;
			strncpy(1107353112, a0, 0x1E, out a2_307, out a3_145, out a4_308, out a5_309);
			s0.u0 = 0x4200DDCC;
			word32 a2_310;
			if (atomic_test_bit(0x4200DDCC, 0x07, out a2_310) != 0x00)
			{
				Eq_2 a3_58;
				Eq_2 a4_59;
				word32 a1_311;
				word32 a2_312;
				word32 a5_313;
				strlen(a0, out a1_311, out a2_312, out a3_58, out a4_59, out a5_313);
				Eq_2 a4_81;
				Eq_2 a5_82;
				word32 a0_314;
				word32 s2_315;
				word32 s4_316;
				word32 s6_317;
				word32 s7_318;
				word32 s8_319;
				ra = set_ad(ra, 0x02000009, a3_58, a4_59, 0x01, s4, s6, s7, s8, mstatus, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg48, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0, out s1_13, out a0_314, out a3_145, out a4_81, out a5_82, out s2_315, out s3, out s4_316, out s6_317, out s7_318, out s8_319, out mstatus);
				word32 a2_320;
				if (atomic_test_bit(s0, 0x06, out a2_320) != 0x00)
				{
					Eq_2 a3_115;
					Eq_2 a4_116;
					Eq_2 a5_117;
					ptr32 mstatus_120;
					Eq_2 s1_123;
					word32 s0_321;
					word32 a0_322;
					word32 s2_323;
					word32 s3_324;
					word32 s4_325;
					word32 s5_326;
					word32 s6_327;
					word32 s7_328;
					word32 a0_329;
					word32 a4_330;
					word32 a5_331;
					word32 s2_332;
					word32 s4_333;
					word32 s5_334;
					word32 s6_335;
					word32 s7_336;
					ra = set_advertise_enable(set_advertise_enable(ra, s1_13, a3_145, a4_81, a5_82, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg14, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg54, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_321, out s1_123, out a0_322, out a3_115, out a4_116, out a5_117, out s2_323, out s3_324, out s4_325, out s5_326, out s6_327, out s7_328, out mstatus_120), s1_123, a3_115, a4_116, a5_117, mstatus_120, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg14, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg54, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0, out s1_13, out a0_329, out a3_145, out a4_330, out a5_331, out s2_332, out s3, out s4_333, out s5_334, out s6_335, out s7_336, out mstatus);
				}
			}
		}
		a0_171 = 0x00;
	}
	else
		a0_171 = ~0x0B;
	s0Out = s0;
	s1Out = s1_13;
	a0Out = a0_171;
	a3Out = a3_145;
	s3Out = s3;
	mstatusOut = mstatus;
	return ra;
}

