pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0004.c
// 2305021A: void bt_enable(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
// Called from:
//      cmd_stack_ble
void bt_enable(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	if (g_ptr4200DE14 == null)
	{
		word32 s2_496;
		word32 a7_495;
		word32 a5_494;
		word32 a4_493;
		word32 a3_492;
		word32 a2_491;
		word32 a1_490;
		word32 s1_488;
		word32 a0_489;
		word32 s3_497;
		word32 s4_498;
		word32 s5_499;
		word32 s6_500;
		word32 s7_501;
		word32 s8_502;
		word32 s9_503;
		word32 s10_504;
		word32 s11_505;
		word32 t4_506;
		printf(ra, &g_t230BAF98, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_488, out a0_489, out a1_490, out a2_491, out a3_492, out a4_493, out a5_494, out a7_495, out s2_496, out s3_497, out s4_498, out s5_499, out s6_500, out s7_501, out s8_502, out s9_503, out s10_504, out s11_505, out t4_506);
	}
	else
	{
		ui32 a0_25;
		Eq_2 a3_28;
		Eq_2 a4_29;
		word32 a1_507;
		word32 a2_508;
		word32 a5_509;
		word32 s4_510;
		word32 s8_511;
		atomic_or(0x4200DD60, 0x01, a3, a4, mstatus, out a0_25, out a1_507, out a2_508, out a3_28, out a4_29, out a5_509, out s4_510, out s8_511);
		if ((a0_25 & 0x01) == 0x00)
		{
			Eq_2 a3_43;
			Eq_2 a4_44;
			word32 a5_512;
			k_work_init(0x4200DDC0, a3_28, a4_29, mstatus, out a3_43, out a4_44, out a5_512);
			Eq_2 a3_54;
			Eq_2 a4_55;
			Eq_2 a5_56;
			Eq_2 a3_77;
			Eq_2 a4_78;
			Eq_2 a5_79;
			word32 s1_513;
			word32 a0_514;
			word32 a1_515;
			word32 s2_516;
			word32 s3_517;
			word32 s4_518;
			word32 s5_519;
			word32 s6_520;
			word32 s7_521;
			word32 s8_522;
			Eq_2 ra_89 = k_sem_init(k_work_q_start(ra, a3_43, a4_44, mstatus, dwLoc20, dwLoc1C, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out a3_54, out a4_55, out a5_56), 0x4200DD60, 0x4200DDF8, 0x01, 0x01, a3_54, a4_55, a5_56, mstatus, dwLoc08, dwArg40, dwArg44, s1, dwArg8C, dwArgC8, dwArg0108, out s1_513, out a0_514, out a1_515, out a3_77, out a4_78, out a5_79, out s2_516, out s3_517, out s4_518, out s5_519, out s6_520, out s7_521, out s8_522);
			word32 a5_523;
			word32 s2_524;
			word32 s3_525;
			Eq_2 a4_104;
			Eq_2 a3_103;
			k_queue_init(ra_89, 0x14, a3_77, a4_78, a5_79, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out a3_103, out a4_104, out a5_523, out s2_524, out s3_525);
			Eq_2 a5_115 = (word32) g_b4200F47C;
			if (a5_115 == 0x00)
			{
				Eq_2 a3_123;
				Eq_2 a4_124;
				Eq_2 a5_125;
				word32 s2_526;
				word32 s3_527;
				k_queue_init(ra_89, 0x02, a3_103, a4_104, a5_115, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out a3_123, out a4_124, out a5_125, out s2_526, out s3_527);
				word32 s2_528;
				word32 s3_529;
				k_queue_init(ra_89, 0x0A, a3_123, a4_124, a5_125, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out a3_103, out a4_104, out a5_115, out s2_528, out s3_529);
			}
			Eq_2 s1_170;
			Eq_2 s4_173;
			Eq_2 s8_174;
			Eq_2 s6_182;
			Eq_2 s7_183;
			Eq_2 s1_196;
			ptr32 mstatus_201;
			struct Eq_284644 * s0_203;
			Eq_2 s3_207;
			word32 a0_530;
			word32 a1_531;
			word32 a3_532;
			word32 a4_533;
			word32 a5_534;
			word32 s2_535;
			word32 s3_536;
			word32 s5_537;
			word32 a0_538;
			word32 a3_539;
			Eq_2 ra_202 = bt_set_name(k_sem_init(ra_89, 0x4200DD60, 0x42026644, 0x00, 0x01, a3_103, a4_104, a5_115, mstatus, dwLoc08, dwArg40, dwArg44, s1, dwArg8C, dwArgC8, dwArg0108, out s1_170, out a0_530, out a1_531, out a3_532, out a4_533, out a5_534, out s2_535, out s3_536, out s4_173, out s5_537, out s6_182, out s7_183, out s8_174), s1_170, 587968436, s4_173, s6_182, s7_183, s8_174, mstatus, dwLoc20, dwLoc1C, s2, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_203, out s1_196, out a0_538, out a3_539, out s3_207, out mstatus_201);
			g_t4200F480 = s3_207;
			word32 a0_229;
			word32 a3_232;
			word32 a4_233;
			word32 s1_237;
			word32 s2_238;
			word32 s3_239;
			word32 a5_540;
			Eq_2 ra_236 = k_thread_create(ra_202, s1_196, 0x4200F488, 0x0600, 0x1D, s3_207, mstatus_201, dwLoc20, dwLoc1C, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_237, out a0_229, out a3_232, out a4_233, out a5_540, out s2_238, out s3_239);
			<anonymous> * a5_250 = s0_203->ptr00B4->ptr000C;
			struct Eq_284715 * sp_251;
			Eq_2 ra_253;
			word32 s2_255;
			word32 a0_258;
			Eq_2 a3_265;
			Eq_2 a4_266;
			ptr32 mstatus_267;
			word32 tp_268;
			word32 s5_269;
			word32 s6_270;
			word32 s7_271;
			word32 t0_272;
			word32 t1_273;
			word32 a7_274;
			word32 s10_275;
			word32 s11_276;
			word32 s9_277;
			word32 t4_278;
			word32 t2_279;
			word32 t5_280;
			word32 t6_281;
			a5_250();
			if (a0_258 != 0x00)
			{
				word32 s1_541;
				word32 a0_542;
				word32 a1_543;
				word32 a2_544;
				word32 a3_545;
				word32 a4_546;
				word32 a5_547;
				word32 a7_548;
				word32 s2_549;
				word32 s3_550;
				word32 s4_551;
				word32 s5_552;
				word32 s6_553;
				word32 s7_554;
				word32 s8_555;
				word32 s9_556;
				word32 s10_557;
				word32 s11_558;
				word32 t4_559;
				printf(ra_253, &g_t230BAFD4, a3_265, sp_251->t0008, sp_251->t0028, sp_251->t0070, sp_251->t0074, sp_251->t0098, sp_251->t00BC, out s1_541, out a0_542, out a1_543, out a2_544, out a3_545, out a4_546, out a5_547, out a7_548, out s2_549, out s3_550, out s4_551, out s5_552, out s6_553, out s7_554, out s8_555, out s9_556, out s10_557, out s11_558, out t4_559);
			}
			else
			{
				word32 s1_560;
				word32 a0_561;
				word32 a1_562;
				word32 a3_563;
				word32 a4_564;
				word32 a5_565;
				word32 s2_566;
				word32 s3_567;
				word32 s4_568;
				word32 s5_569;
				word32 s6_570;
				word32 s8_571;
				k_work_submit(s2_255 + -576, a3_265, a4_266, mstatus_267, sp_251->t0004, sp_251->t0084, sp_251->t00F8, sp_251->t0138, sp_251->t0178, out s1_560, out a0_561, out a1_562, out a3_563, out a4_564, out a5_565, out s2_566, out s3_567, out s4_568, out s5_569, out s6_570, out s8_571);
			}
		}
	}
}

